{"id":10101,"date":"2013-02-18T19:54:49","date_gmt":"2013-02-18T19:54:49","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=10101"},"modified":"2021-11-12T09:02:00","modified_gmt":"2021-11-12T17:02:00","slug":"stir-up-your-database","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/stir-up-your-database\/","title":{"rendered":"Four Ways to Stir Up Your Database and Find Opportunities"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-10362\" style=\"margin: 10px 0px; border: black 10px solid;\" title=\"Spark\" src=\"\/wp-content\/uploads\/2013\/02\/Spark2-225x300.jpg\" alt=\"\" width=\"225\" height=\"300\" \/>Leads, leads, leads. They’re probably always on your mind. Where to find new leads, how to respond to them quickly, and what it takes to convert them into clients.<\/p>\n<p>While you may spend plenty of time focusing on the best way to find new leads, have you thought about the valuable, qualified leads that may already be in your existing database? Why not spend some time working those leads? Consider these four best practices for stirring up your database and finding new opportunities.<\/p>\n<ul style=\"list-style-type: disc;\">\n<li><strong>Research and reach out<\/strong><br \/>\nSpend some time discovering the types of leads that are sitting in your database. Even better? Segment those leads so you have a better handle on the best strategies for reaching out to a specific group. Your database likely includes dormant leads, newer or active leads, past customers, and referrals. Market Leader research has shown that 90% of buyers would use the same real estate agent or recommend him or her to their friends and family. All it takes is one well-timed communication reminding existing leads that you’re available.<\/li>\n<li> <strong>Work in your database every day<\/strong><br \/>\nThe first step in working in your database every day is making sure it’s up to date. Dedicate a few hours to updating information, deleting old contacts, and segmenting. Once your database is updated, make working in it a daily habit, even if it’s just for a few minutes. When you do a bit of maintenance every day, not only is it a less daunting task overall, but you’ve also eliminated the time-consuming barrier of updating your whole database prior to sending out a campaign. Instead, it’s always primed to send appropriate, timely, and relevant communications.<\/li>\n<li> <strong>Set up ongoing campaigns<\/strong><br \/>\nNow that your database is cleaned up and organized, take the time to set your most promising leads up on a yearlong drip campaign. Start now, so that when the peak spring and summer buying season gets here, you’re already top-of-mind, having established yourself as a valuable resource and increased your name recognition.<\/li>\n<li> <strong>Always communicate with relevance and value<\/strong><br \/>\nWhile any communication you send out is better than nothing, always take the time to make sure you’re sending something that’s relevant to your audience and that demonstrates your value as a real estate professional. Show leads that you’re an expert they can trust by taking the time to send useful information like MLS listings, demographics, facts about interest rates, and market trends.<\/li>\n<\/ul>\n<p>By spending some time giving your existing database a little bit of attention, you’re increasing the possibility that as soon as one of those leads is ready to buy or sell, you’ll be the first agent they call. The average real estate client only spends one day interviewing agents and only interviews one agent overall—make that agent you!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Leads, leads, leads. They’re probably always on your mind. Where to find new leads, how to respond to them quickly, and what it takes to convert them into clients. While you may spend plenty of time focusing on the best way to find new leads, have you thought about the valuable, qualified leads that may [&hellip;]<\/p>\n","protected":false},"author":33,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[34],"tags":[],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/10101"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/33"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=10101"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/10101\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=10101"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=10101"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=10101"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}