{"id":10601,"date":"2013-04-12T17:05:43","date_gmt":"2013-04-12T17:05:43","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=10601"},"modified":"2016-02-05T09:31:59","modified_gmt":"2016-02-05T17:31:59","slug":"how-to-boost-referrals","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/how-to-boost-referrals\/","title":{"rendered":"How to Boost Referrals"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-10631\" title=\"Real Estate Leads - How to Boost Referrals\" src=\"\/wp-content\/uploads\/2013\/03\/Fotolia_41922915_XS-300x214.jpg\" alt=\"Real estate agents can increase referrals by getting creative with marketing campaigns\" width=\"300\" height=\"214\" \/>It’s been years, but I still remember my landlord &#8211; a real estate agent &#8211; calling me and asking if I knew anyone who wanted to buy or sell a home. At the time, I didn’t, but I still remember the call. More than that, I remember that I truly wanted to help him and felt bad that I couldn’t. I genuinely liked the man, and believe me, the next day I kept my ears open for real estate chatter.<\/p>\n<p>Step one toward getting new referrals is to be a nice person. Step two? Ask for referrals. Ask everyone, even if you don’t think they will turn into a client. Your sphere of influence then connects to their sphere, and each person you contact broadens your possible referral base exponentially.<\/p>\n<p>But that just covers the basics. There is so much more that agents can do to get more referrals.<\/p>\n<h2>What’s in Your Plan?<\/h2>\n<p>Before embarking on new ways to drum up referrals, it’s a good idea to take a look at what’s in your current marketing campaign – precisely, what image are you projecting?<\/p>\n<p>Are your tactics a turnoff? Real estate trainer Denise Lones of Bellingham, Wash. says one of the main reasons you aren’t getting referrals is if “your <a href=\"http:\/\/activerain.com\/blogsview\/777572\/how-to-get-referrals-never-ask-for-them-\">marketing campaign<\/a> is ego-based (meaning it’s all about you and your next transaction),” she writes on her ActiveRain blog. “This creates the image of a shark-like predator in people’s minds, and they will avoid you just as they would a Great White.”<\/p>\n<h2>The Bedrock: Relationship Marketing<\/h2>\n<p>Relationship marketing emphasizes customer satisfaction and retention, with an eye toward building longtime profitable relationships, according to <a href=\"http:\/\/www.marismith.com\/tenets-of-relationship-marketing-effectiveness\/\">author Mari Smith<\/a>.<\/p>\n<p>It differs from other forms of marketing by focusing more on the customer relationship and its value over the long term, rather than relying on more intrusive promotional and sales messages. Its key principle is customer retention.<\/p>\n<p>The good news for the real estate agent is that relationship marketing is less expensive in the long run than other forms of marketing – especially in competitive markets, according to Philip Kotler, co-author of “Principles of Marketing.”<\/p>\n<p>“In markets with increasing competition,” he says, “it may cost five times more to attract new customers than it would to retain current customers.”<\/p>\n<h2>Who’s in Your Database?<\/h2>\n<p>If your database is populated with only former clients, you’re missing out on a huge chunk of new business. You should have every single person you know in your customer relationship management (CRM) platform – from your hairdresser to your aunt Martha. If they’re breathing, they should be in there.<\/p>\n<p>Here’s why this is important: The relationship marketing approach also focuses on customization of your marketing efforts, according to Jim Novo, author of “Drilling Down.”<\/p>\n<p>“Customize programs for individual consumer groups and the stage of the process they are going through,” says Novo, “as opposed to some forms of database marketing where everybody would get virtually the same promotions,” he concludes.<\/p>\n<p>Marketing whiz Seth Godin, in his book “Purple Cow: Transform Your Business by Being Remarkable,” agrees. Godin insists that you should: “… differentiate your customers. Find the group that&#8217;s most profitable. Find the group that&#8217;s most likely to influence other customers. Figure out how to develop for, advertise to, or reward either group … cater to the customers you would choose if you could choose your customers.”<\/p>\n<p>A basic, no-brainer example of this would be compartmentalizing your database population into potential buyers and potential sellers. A more focused approach would involve drilling down deeper into the database, customizing your marketing approach to an ever more concentrated population.<\/p>\n<p>As they say here at Market Leader: “Send the right message, to the right person, at the right time.”<\/p>\n<h2>How’s That CRM Working for You?<\/h2>\n<p>Back in the dinosaur days of real estate, a simple database, populated with the people in an agent’s sphere, ruled the day in most real estate businesses. As technology advanced, however, agents demanded more bells and whistles, which resulted in today’s sophisticated CRM platforms.<\/p>\n<p>The best software tracks the agent’s sales pipeline and streamlines relationship management. Both Market Leader Professional and Market Leader Business Suite, for instance, offer tools that maximize the information in your database to your benefit, by streamlining ongoing customer communications (with property blasts, listing alerts, newsletters, etc.), separated into the categories that work for you (buyers from browsers, for instance).<\/p>\n<p>Finally, the busy agent should consider mobile CRM access so that all that valuable information is consistently at his or her fingertips.<\/p>\n<p>With the right CRM software, this categorization is a snap &#8211; true targeted marketing at its finest.<\/p>\n<p>So, now that we know the “who, what and how,” let’s take a look at additional ways to drum up referrals.<\/p>\n<h2>Drip Campaigns<\/h2>\n<p>One of the best ways to grow your farm and stay top of mind with your network is by reaching out to each person, consistently, over time.<\/p>\n<p>Many agents swear by drip email campaigns, where automated emails go out to selected contacts in their CRM database. How frequently you contact these people, however, sits on a fine line between reaching out and spamming.<\/p>\n<p>Some experts claim that dripping on these folks once a week is going to eventually get your emails tossed in the trash or blocked from delivery to your contacts entirely – especially if they don’t plan on moving for a year or so. A monthly email is more appropriate – even longer is fine. Just making the contact without annoying people is what’s most important.<\/p>\n<p>I live in a city that is home to a certain local home-oriented magazine. The first time I received one of the glossy publications I read it cover to cover only to learn that it is completely void of relevant content and full of advertising. Now, every time I receive one it goes directly into the trash.<\/p>\n<p>You have one chance to lure your email recipients into actually reading your drip campaign, and that occurs with your first email.<\/p>\n<p>Depending on how large your database is, you may have to create several focused email campaigns. Some of the categories to think about include quick (the operative word here) information for:<\/p>\n<ul>\n<li>Homebuyers.<\/li>\n<li>Sellers.<\/li>\n<li>Investors.<\/li>\n<li>Short sale or distressed property sellers and buyers.<\/li>\n<li>Condo buyers.<\/li>\n<\/ul>\n<p>To stay top of mind with past clients, think about sending information on their interests:<\/p>\n<ul>\n<li>Gardening.<\/li>\n<li>Interior decorating.<\/li>\n<li>Green living.<\/li>\n<li>Food.<\/li>\n<li>Birthday, anniversary, new baby and other greetings.<\/li>\n<\/ul>\n<p>Whatever you choose to send, make it count. Wow them – make the recipients look forward to the next one.<\/p>\n<h2>Face-to-Face Contact<\/h2>\n<p>While email drip campaigns are an efficient, inexpensive way to keep in touch with people, sometimes a face-to-face encounter is called for. Many successful agents plan client-appreciation events periodically throughout the year or one splashy annual event.<\/p>\n<p>One California agent classifies her clients according to how big <em>their<\/em> sphere of influence is. Those with a huge network of contacts she calls her “A” group, and those are the ones she tends to go a bit above and beyond to maintain relationships with. Her preferred method is to never miss a birthday by issuing a lunch invitation for birthday week. Pricey? Perhaps, but memorable and tax deductible as well.<\/p>\n<p>Zephyr Realty San Francisco’s Wes Freas holds an annual event that his former clients never miss: a holiday wreath decorating party. This is a highly planned event that he begins preparing for weeks in advance. Held in his oversized garage, there is food, a bar and tons of baskets, laden with various decorating tidbits. Oh, and wreaths to decorate, of course.<\/p>\n<p>When Kathy Broock Ballard with Max Broock Realtors® in North Oakland County, Mich. found out that the local women’s shelter was in dire need of bras for their residents, she came up with an idea to mix fundraising and client retention. Named The Annual Erin Go Bra(gh) party, she invites her “A” list clients, friends and colleagues to a buffet lunch and cocktails each St. Patrick’s Day, asking only that they bring new bras or other undergarments for the women’s shelter.<\/p>\n<p>Then there’s the soirees made famous in Bethesda, Md. thrown by Steve Israel of Buyer’s Edge. He and his wife and business partner Wendy think nothing of holding a catered cocktail and dinner event for over 500 former clients. With music by the Tommy Dorsey Orchestra amidst the sophistication of a historic ballroom, it’s an event clients will not soon forget. And, best of all, guess who will be top of mind when asked about real estate agents?<\/p>\n<p>Your “A” group &#8211; and maybe even your “B” group &#8211; is who you want to maintain face-to-face contact with during the year if at all possible.<\/p>\n<h2>Follow Up With Industry Colleagues<\/h2>\n<p>Stick all those people you do business with on a regular basis into your database too. Begin building relationships with them by attending networking events or even holding your own, for title company representatives, escrow people, lenders, contractors, plumbers, home inspectors and electricians.<\/p>\n<h2>Give and Take<\/h2>\n<p>How do you repay those who give you a referral? Even a simple “thank-you” lunch is appropriate and will keep the referrals coming. Some agents offer rewards in their pitches for referrals. This can be something like, “Refer me to a friend or family member and I’ll pay to have their house staged,” or, “I’ll pay for a home warranty plan for their first year in their new house.” Incentivize the pitch. Make it attractive for them to talk about you to others.<\/p>\n<p>Client retention is business promotion at its subtlest. While letting people know you value them, you plant a seed that will hopefully blossom into a pipeline full of referrals.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>It’s been years, but I still remember my landlord &#8211; a real estate agent &#8211; calling me and asking if I knew anyone who wanted to buy or sell a home. At the time, I didn’t, but I still remember the call. More than that, I remember that I truly wanted to help him and [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[34],"tags":[101,124,144,181,126,142,87,117,182,183,127],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/10601"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=10601"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/10601\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=10601"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=10601"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=10601"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}