{"id":10841,"date":"2013-03-28T18:18:04","date_gmt":"2013-03-28T18:18:04","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=10841"},"modified":"2022-01-26T18:27:04","modified_gmt":"2022-01-27T02:27:04","slug":"tax-tips-for-real-estate-agents-part-1","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/tax-tips-for-real-estate-agents-part-1\/","title":{"rendered":"Tax Tips for Real Estate Agents – Part 1"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-10861\" title=\"Tax Tips for Real Estate Agents\" src=\"\/wp-content\/uploads\/2013\/03\/Fotolia_35986813_XS-300x198.jpg\" alt=\"Maintaining accurate records for tax deductions is vital for a real estate business\" width=\"300\" height=\"198\" \/>Have you ever received a letter or phone call from the IRS pointing out deductions that you missed on your tax return? Me either, and as nice as some of those IRS folks are, I have a feeling we shouldn’t wait for such a phone call.<\/p>\n<p>Nope, it’s completely up to your accountant to ensure you get every last deduction you’re entitled to. But accountants can’t pull the proof for these deductions out of thin air; that’s your job. And that requires a diligent adherence to that task we all hate to do: record keeping.<\/p>\n<h2>The Importance of Documentation<\/h2>\n<p>Keeping accurate records is vital to your pocketbook, according to CPA <a href=\"http:\/\/www.gailrosencpa.com\/\">Gail Rosen<\/a>. “It’s so important to recognize the power of a deduction and not to miss any,” she warns.<\/p>\n<p>“I liken it to downloading an app to your phone,” explains <a href=\"http:\/\/www.teamzumwalt.com\/\">Bill Zumwalt<\/a>, “The Tax Coach” for real estate agents, out of Tulsa, Okla. “When you download an app you get a long list of legalese called terms and conditions. Tax strategies, like the home office, are just like apps,” he continues.<\/p>\n<p>“You find one that fits, you download it, and then you read the fine print &#8211; the terms and conditions,” says Zumwalt.<\/p>\n<p style=\"text-align: center;\">&#8212;<\/p>\n<p style=\"text-align: center; font-size: 16px;\"><strong>When it comes to taxes, documentation is your friend.<\/strong><\/p>\n<p style=\"text-align: center;\">&#8212;<\/p>\n<p>He goes on to explain that the IRS has terms and conditions for deductions &#8211; things you need to do and requirements to meet to make a particular tax strategy work. “The devil is in the detail,” warns Zumwalt. <strong>“If you have documentation, it will be your friend.”<\/strong><\/p>\n<p>Let’s take a look at what the pros say are some of the most common tax deductions that agents are entitled to, and suggestions on how to document them.<\/p>\n<h2>Deduct Auto Expenses<\/h2>\n<p>Since it feels like your days are spent cooped up in a tin can, auto expenses and the purchase of a new car seem to be the best place to start any discussion of tax deductions for real estate agents.<\/p>\n<h3>How Realtors can Deduct Car Expenses<\/h3>\n<p><strong><img loading=\"lazy\" class=\"alignright  wp-image-21161\" title=\"Realtor deduct car expenses\" src=\"\/wp-content\/uploads\/2013\/03\/deduct-car-expenses-300x200.jpg\" alt=\"Real estate agents constantly use their cars for their businesses, which means they can deduct auto expenses from their tax returns\" width=\"240\" height=\"160\" \/>“For real estate agents, mileage is a huge deduction,”<\/strong> claims <a href=\"http:\/\/www.reedcocpa.com\/\">David Crumbaugh<\/a>, a CPA in central Texas. “When I deal with real estate agents, that mileage normally becomes their biggest expense,” he claims.<\/p>\n<p>To take the mileage deduction naturally requires that you keep track of your mileage. What happens if you forget or just get sloppy with your record keeping?<\/p>\n<p>“Hopefully you maintain an Outlook calendar or some sort of appointment tracking system,” Crumbaugh says.<\/p>\n<p style=\"text-align: center;\">&#8212;<\/p>\n<p style=\"text-align: center; font-size: 16px;\"><strong>Easiest way to deduct auto expenses: Deduct using a standard mileage rate.<\/strong><\/p>\n<p style=\"text-align: center;\">&#8212;<\/p>\n<p>If the thought of keeping track of not only all those miles but also how much you spend on oil changes, car washes, gas and repairs makes your eyes glaze over, consider using the <a href=\"http:\/\/www.irs.gov\/pub\/irs-drop\/rp-10-51.pdf\">standard mileage rate<\/a>: 55.5 cents per business mile driven in 2012 and <a href=\"https:\/\/www.irs.gov\/tax-professionals\/standard-mileage-rates\">56.5 cents per mile in 2013<\/a>. With this method, you don’t have to track your auto-related expenses, just your mileage. Rosen warns to go through both methods to determine which one will save you the most money.<\/p>\n<h3>Record Keeping Tips for Deducting Car Expenses<\/h3>\n<p>You don’t have to keep track of your mileage for the entire year. A three-month log is all the IRS requires, according to Zumwalt.<\/p>\n<p>He also suggests that you “make it a point to get an oil change at the first of every year. If you do that, you have a third-party document that shows your mileage,” he claims.<\/p>\n<p>If you’re considering a new car, is it better to lease or to buy? To find out, read <a href=\"\/blog\/tax-tips-for-agents-part-two\/\">“Tax Tips for Agents &#8211; Part 2”<\/a>.<\/p>\n<h2>Home Office Deduction<\/h2>\n<p><img loading=\"lazy\" class=\"size-medium wp-image-21141 alignleft\" title=\"Working from home\" src=\"\/wp-content\/uploads\/2013\/03\/home-office-tax-deduction-300x223.jpg\" alt=\"Realtors that work from home must take advantage of the home office tax deduction\" width=\"300\" height=\"223\" \/>Whether you own a home or rent one, the home office deduction is a biggie, and it’s full of stuff many agents miss, according to Crumbaugh.<\/p>\n<p>“This deduction is particularly valuable if you are a renter because it enables you to deduct a portion of your monthly rent, a sizable expense that is ordinarily not deductible,” claims Stephen Fishman, lawyer and author of “The Real Estate Agent&#8217;s Tax Deduction Guide.”<\/p>\n<p>Some of the most commonly overlooked deductions include a percentage of renter’s or homeowner’s insurance, utilities, maintenance for the home office, depreciation of home office equipment and property taxes.<\/p>\n<h3>Requirements of the Home Office Deduction<\/h3>\n<p>To deduct business-use-of-your-home expenses, the IRS requires that part of the home must be used for one of the <a href=\"https:\/\/www.irs.gov\/taxtopics\/tc509\">following<\/a>:<\/p>\n<ul>\n<li>Exclusively and regularly as your principal place of business.<\/li>\n<li>Exclusively and regularly as a place where you meet and deal with clients in the normal course of your trade or business.<\/li>\n<li>A separate structure used exclusively and regularly in connection with your trade or business that is not attached to your home.<\/li>\n<li>On a regular basis for certain storage use.<\/li>\n<\/ul>\n<p><em>A quick video to the home office tax deduction, and an explanation of what qualifies as a &#8220;home office&#8221;:<\/em><\/p>\n<p><iframe loading=\"lazy\" src=\"\/\/www.youtube.com\/embed\/iiWk-Zk1aPE\" frameborder=\"0\" width=\"560\" height=\"315\"><\/iframe><\/p>\n<p>The IRS further states that the portion of the home set aside for business use must not be used for any other purpose. For instance, if you run your real estate practice from your den, you can’t also use that den as a family room, media room, or exercise room or the deduction will be disallowed.<\/p>\n<p>Some of the additional deductible expenses not mentioned above include a percentage of:<\/p>\n<ul>\n<li>Mortgage interest.<\/li>\n<li>Casualty losses.<\/li>\n<li>Property taxes.<\/li>\n<li>Repairs.<\/li>\n<li>Depreciation.<\/li>\n<li>Maintenance.<\/li>\n<li>Condo association fees.<\/li>\n<\/ul>\n<p>Your accountant can help you determine the percentage of the expenses you can deduct, but for a rough estimate, divide the number of square feet of the home that you use for your real estate business by the total square footage of the home. Then apply this percentage to the total of each expense. If it sounds complicated, that’s only because it is, and it’s exactly why you should hire a professional to do your taxes.<\/p>\n<p>Lots of agents work from both the home office and their broker’s office. Read <a href=\"\/blog\/tax-tips-for-agents-part-two\/\">“Tax Tips for Agents &#8211; Part 2”<\/a> to learn how you still may be able to use the home office deduction.<\/p>\n<h3>Record Keeping Tips for Your Home Office Deduction<\/h3>\n<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-21151\" title=\"realtor tax record keeping\" src=\"\/wp-content\/uploads\/2013\/03\/tax-record-keeping-300x200.jpg\" alt=\"Much documentation is required to justify your home office deduction, like a calendar that tracks how it was used\" width=\"300\" height=\"200\" \/>Zumwalt recommends taking a photo of the home office at the beginning of each year. Put the date on the back and stick it in your tax folder. “It shows that you really do have a home office,” he claims. “If you get audited, you don’t want that IRS agent trying to go to your house, and that picture will stop that. It’s just a little insurance,” he explains.<\/p>\n<p>He also suggests that you keep a calendar in your home office on which you make daily notes, “such as HO, which stands for home office, and then put dash research, or HO dash paying bills &#8211; some sort of description that proves you’re really working on administrative tasks in the home office for at least 10 to 12 hours a week.”<\/p>\n<p>Did you know that you can legally save money on your self-employment taxes by hiring your younger kids (under 18) to work in your office? I’ll explain how to put money toward their braces, private school tuition, or college education and legally write off the expenses as tax deductions in the <a href=\"\/blog\/tax-tips-for-agents-part-two\/\">second installment of this column<\/a>.<\/p>\n<h2>Quick List: Commonly-Missed Tax Deductions<\/h2>\n<p>Make sure you don&#8217;t miss these oft-forgotten real estate tax deductions when you file your taxes! (Of course, you need documentation to get these deductions, so always keep your receipts!)<\/p>\n<ol>\n<li><strong>Online advertising.<\/strong> Money spent on advertising is deductible!<\/li>\n<li><strong>Car expenses.<\/strong> Besides gas and mileage, Realtors can also deduct parking fees and tolls.<\/li>\n<li><strong>Gifts and other expenses incurred while making clients happy.<\/strong><\/li>\n<li><strong>Office supplies.<\/strong> Other than the obvious major expenses of computer equipment and office supplies, Realtors can also deduct the money they spend on postage for mailings and subscriptions to trade magazines.<\/li>\n<li><strong>Utilities.<\/strong> Real estate agents who work from home can deduct the cost of some of their utility bills from their tax returns.<\/li>\n<\/ol>\n<h2>Best Tax Deductions for Realtors<\/h2>\n<p>Nolo, an organization that provides &#8220;plain-English&#8221; answers to legal and business questions, believes the following are the best tax deductions for Realtors. (Deductions listed above are omitted from this list.)<\/p>\n<ul>\n<li><strong>Office expenses<\/strong> like rent and utilities.<\/li>\n<li><strong>Office supplies<\/strong> like staples and printer paper.<\/li>\n<li><strong>Meals and entertainment<\/strong> consumed before, during or immediately after a business-specific meeting.<\/li>\n<li><strong>Insurance<\/strong> purchased specifically for your business.<\/li>\n<li><strong>Fees<\/strong> paid to accountants, attorneys and other professionals assisting you for business-specific purposes.<\/li>\n<li>Expenses incurred when you <strong>travel for business<\/strong>.<\/li>\n<li>The cost of business items lasting for more than one year can be slowly deducted through <strong>depreciation.<\/strong><\/li>\n<\/ul>\n<p><span style=\"color: #000000;\"><strong>Disclaimer: The information listed in this blog post is for general informational purposes only. Tax planning is highly dependent on your individual circumstances. We recommend that you seek the services of a qualified and licensed tax professional for advice on your specific situation.<\/strong><\/span><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Have you ever received a letter or phone call from the IRS pointing out deductions that you missed on your tax return? Me either, and as nice as some of those IRS folks are, I have a feeling we shouldn’t wait for such a phone call. Nope, it’s completely up to your accountant to ensure [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[97],"tags":[184,185,186,56,96,187,188,189],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/10841"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=10841"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/10841\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=10841"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=10841"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=10841"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}