{"id":10951,"date":"2013-04-04T08:00:39","date_gmt":"2013-04-04T08:00:39","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=10951"},"modified":"2022-08-18T15:36:55","modified_gmt":"2022-08-18T22:36:55","slug":"tax-tips-for-agents-part-two","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/tax-tips-for-agents-part-two\/","title":{"rendered":"Tax Tips for Agents – Part 2"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright wp-image-10961 size-medium\" title=\"Tax Tips for Agents\" src=\"\/wp-content\/uploads\/2013\/03\/Fotolia_49049887_XS-300x300.jpg\" alt=\"There are many real estate agent tax deductions you can take advantage of\" width=\"300\" height=\"300\" \/>This is the time of year most real estate agents dread – even more so than mid-June, September and January when quarterly tax payments are due. April’s tax return determines what those quarterly payments will be, so naturally, right now agents are wondering about ways to turn their expenses into tax deductions.<\/p>\n<p>Forty-five million Americans claim more than $1 trillion in tax deductions on their itemized tax returns. An additional 92 million taxpayers claim $700 billion using standard deductions. <a href=\"https:\/\/www.kiplinger.com\/taxes\/602075\/most-overlooked-tax-breaks-and-deductions#RPxxVUuPvKWLArXq.99\">IRS insiders<\/a>, however, believe that millions of Americans pay more in taxes than they should by not taking all of the deductions to which they are legally entitled.<\/p>\n<p>Last week we presented several tax deductions that agents often overlook when squirrelling away receipts to give to their tax preparers. This week, we’ll offer some tips that may surprise you.<\/p>\n<h2>Home Office and Broker’s Office<\/h2>\n<p>Although we discussed the deduction for the business use of your home last week, there’s more to the story.<\/p>\n<p>Real estate agents who work both from their home and from their broker’s office may still qualify for the home office deduction, as long as they meet “the principal place of business test.”<\/p>\n<p>To determine if you pass that test, the IRS will look at the <a href=\"https:\/\/www.irs.gov\/publications\/p587#en_US_2012_publink1000226302\">importance of the activities<\/a> that you perform at both places and the amount of time you spend in each location. Administrative and management activities are what the IRS considers “significant” enough to qualify you for the deduction. These include:<\/p>\n<ul>\n<li>Performing bookkeeping and recordkeeping.<\/li>\n<li>Paying bills connected to your business.<\/li>\n<li>Setting appointments (all of a sudden cold calling looks even more important!).<\/li>\n<li>Maintenance of your CRM.<\/li>\n<li>Reviewing real estate-related literature, such as publications or continuing education materials.<\/li>\n<\/ul>\n<p>As long as these activities are performed routinely at home and not your broker’s office, you qualify for the deduction.<\/p>\n<h2>Buying a New Car<\/h2>\n<p>While you can depreciate what you pay for a new car, you may get more bang for your buck if you lease a car, according to New Jersey CPA <a href=\"https:\/\/www.gailrosencpa.com\/\">Gail Rosen<\/a>. “Actually, leasing a car is usually a better tax deduction than buying – especially the more expensive it is and the more you use it for business,” Rosen explains.<\/p>\n<p>“There are luxury limits on buying a car,” she explains. “The luxury tables that compute the disallowed portion of the luxury limit are more generous for leased cars,” she concludes. In fact, Rosen leases her car, “only because it saves me more money,” she claims.<\/p>\n<p style=\"text-align: center;\">&#8211;<\/p>\n<p style=\"text-align: center;\"><strong>For some agents, it makes more financial sense to lease rather than buy their business car.<\/strong><\/p>\n<p style=\"text-align: center;\">&#8211;<\/p>\n<p>“The Tax Coach for real estate agents,” <a href=\"https:\/\/activerain.com\/profile\/teamzumwalt\">Bill Zumwalt<\/a>, disagrees, however. Leases typically have a 10,000 to 12,000 mile limit. “Above that, you have to start paying extra, like 21 or 25 cents a mile for every mile over that. It gets expensive,” he warns.<\/p>\n<p>His advice is to compare the cost of leasing versus buying before deciding on a particular car. “There are some occasions where a lease might work, but generally speaking, because a real estate agent practically lives in his car and drives it so much, owning it is much better,” he concludes.<\/p>\n<p>In a nutshell, Zumwalt says that leases are good if you “don’t drive a lot and you want to drive more car that you can afford. But if you drive 24,000 miles a year, which is not that uncommon, you’ll get killed in a lease.”<\/p>\n<h2>Hiring Your Kids<\/h2>\n<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-31501\" title=\"Child employee\" src=\"\/wp-content\/uploads\/2013\/04\/child-employee-300x200.jpg\" alt=\"Real estate agents can hire their children to do simple tasks to pay less in taxes\" width=\"300\" height=\"200\" \/>You know all those pesky little tasks that you just don’t have time for? Cleaning mud off your signs, dusting the office, filing and other small jobs are perfect for a child. How about that vacant listing? Sure would be nice to have someone mow the lawn, wouldn’t it?<\/p>\n<p>Anything that you would normally hire someone else to do is considered a job by the IRS, and it’s perfectly legal to hire your kids to do it &#8211; even young children, according to author and attorney, Stephan Fishman. “The IRS has accepted that a 7-year-old child may be an employee, but probably won’t believe that children younger than seven are performing any useful work for your business,” he says.<\/p>\n<p>Now, why would you want to put your young kids to work? Aside from the obvious benefits for the child &#8211; mastering skills, developing a work ethic and learning what it takes to make money &#8211; you get a tax break. “By paying their children reasonable wages to do legitimate work, business owners can convert their high-taxed income into tax-free or low-taxed income,” says Peter Jason Riley of <a href=\"http:\/\/www.cpa-services.com\/\">Riley &amp; Associates<\/a> in Newburyport, Mass.<\/p>\n<p style=\"text-align: center;\">&#8211;<\/p>\n<p style=\"text-align: center;\"><strong>Agents can pay less taxes by hiring their children to do small tasks for them.<\/strong><\/p>\n<p style=\"text-align: center;\">&#8211;<\/p>\n<p>There are limits to what jobs your children can perform. The Fair Labor Standards Act clearly defines child labor standards &#8211; what jobs kids are allowed to do (nothing hazardous) and at what ages. It also stipulates how many hours a day the child can work. The standards are different, however, for a child working in a family business than for unrelated employees who are under 18. Some states offer stricter guidelines, so check with an attorney or with your state’s department of labor for the details.<\/p>\n<p>Family business or not, you’ll need to “treat your child just like you would a regular employee,” Zumwalt claims. “In fact, you have to be even more careful because it is a related party.”<\/p>\n<p>Determine how much you’ll pay the child. The amount needs to be “reasonable” according to the work performed. What you can deduct on your taxes will be the child’s salary and the total of all fringe benefits, such as health insurance and medical expense reimbursements. It does get technical, which is why, once again, you need a professional CPA or tax preparer to do your taxes.<\/p>\n<p>Treating the child as an employee also means keeping track of how many hours the child works by filling out timesheets. List the date, what tasks the child performed and the amount of time she worked. To prove how much you paid the child, don’t pay him in cash and be sure to pay him on a regular schedule, just as you would any employee. Don’t forget to issue a W-2 at <a href=\"https:\/\/www.wsj.com\/articles\/SB10001424052702303365804576429842270248796\">year’s end<\/a>.<\/p>\n<p>So, how does a 7-year-old cash a check? She doesn’t. Her employer deposits it into the child’s bank account, ROTH IRA or college savings account that you control until she reaches legal age. That doesn’t mean the child can’t use the money before then. “Once that money goes in there it can be spent on summer camps or private school tuition,” or anything else that benefits her, says Zumwalt.<\/p>\n<p>Tip: You also need to treat yourself as an employer and obtain an Employer Identification Number (<a href=\"https:\/\/www.irs.gov\/businesses\/small-businesses-self-employed\/how-to-apply-for-an-ein\">EIN<\/a>) from the IRS.<\/p>\n<h2>Miscellaneous Overlooked Deductions<\/h2>\n<p>Many agents outsource some of their business tasks to freelancers, such as writers, marketing professionals, photographers, graphic artists and web designers. The fees you pay these professionals are tax deductible.<\/p>\n<p>Plus, you are legally required to report their earnings, if they total $600 or more, to the IRS. If you don’t, you may incur penalties.<\/p>\n<p>To report what you pay to independent contractors, file <a href=\"https:\/\/www.irs.gov\/pub\/irs-pdf\/f1099msc.pdf\">Form 1099-MISC<\/a>. Copy A goes to the IRS (deadline February 28). Now, not only have you fulfilled your legal obligation, but you also have proof of these expenses for your accountant.<\/p>\n<h2>2013 Changes That Affect Real Estate Agents<\/h2>\n<p>Earlier this year, the IRS announced a simpler method to deduct home office expenses for the 2013 tax year. Instead of the complicated <a href=\"https:\/\/www.irs.gov\/pub\/irs-pdf\/f8829.pdf\">IRS Form 8829<\/a>, agents who conduct business from home will have the option of taking a standard deduction of $5 per square foot of office space, up to 300 square feet (the maximum deduction is $1,500). Agents can still use Form 8829, so run the numbers on both options to determine which one saves the most money.<\/p>\n<p>Naturally there are terms and conditions on this, so consult with your tax professional about which one is best for you.<\/p>\n<p>Aside from that, and the increase in the mileage rate for business miles driven (see “<a href=\"\/blog\/tax-tips-for-real-estate-agents-part-1\/\">Tax Tips for Agents &#8211; Part 1<\/a>”), there isn’t much good news for real estate agents when it comes to 2013 taxes.<\/p>\n<p>Of course, if you watch, read or listen to the news, you understand that the tax code is an ever-evolving animal, so the best we can do is sit, watch, and wait. With fingers crossed.<\/p>\n<p><strong>Disclaimer: This information is for general informational purposes only. Tax planning is highly dependent on your individual set of facts and circumstances. We recommend that you seek the services of a qualified and licensed tax professional to get advice on your specific situation.<\/strong><\/p>\n","protected":false},"excerpt":{"rendered":"<p>This is the time of year most real estate agents dread – even more so than mid-June, September and January when quarterly tax payments are due. April’s tax return determines what those quarterly payments will be, so naturally, right now agents are wondering about ways to turn their expenses into tax deductions. Forty-five million Americans [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":31501,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[97],"tags":[190,191,185,186,56,188,192],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/10951"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=10951"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/10951\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=10951"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=10951"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=10951"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}