{"id":11301,"date":"2013-04-18T17:21:53","date_gmt":"2013-04-18T17:21:53","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=11301"},"modified":"2021-11-30T11:58:34","modified_gmt":"2021-11-30T19:58:34","slug":"how-to-keep-other-agents-from-stealing-your-leads","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/how-to-keep-other-agents-from-stealing-your-leads\/","title":{"rendered":"How to Keep Other Agents From Stealing Your Leads"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-11341\" title=\"Competing for Real Estate Leads\" src=\"\/wp-content\/uploads\/2013\/04\/Fotolia_50977577_XS-300x199.jpg\" alt=\"Some agents might try to steal real estate leads, but there are steps you can take to protect your prospects\" width=\"300\" height=\"199\" \/>It’s a common practice in real estate to try to generate leads from a competitor already doing a good volume of business. The easiest way to steal leads is to look at a competitor’s shortcomings and create a marketing plan based on their shortfalls.<\/p>\n<p>Easy Targets:<\/p>\n<ul>\n<li>Agents who don’t focus on a target market.<\/li>\n<li>Agents lacking a comprehensive website.<\/li>\n<li>Agents without a lead management system.<\/li>\n<\/ul>\n<p>Lack of drive will also cost you leads. Don’t become complacent with your marketing plan &#8211; there’s always someone around the corner creating a strategy that tries to address your inadequacies.<\/p>\n<h2>Target Market<\/h2>\n<p>Casting a large net into a sea of leads seems like a good idea. But potential leads don’t want to do business with an agent who doesn’t specialize in a specific field. Without a target market, you will look like a generic agent.<\/p>\n<p>People want to do business with agents who know who their clients are and what they want. When you look at it from the client’s perspective, it makes sense. They don’t want to waste time working with an agent who doesn’t understand their needs. Stand out from the rest by becoming an expert in your field. Dustin Russell, manager of acquisition marketing at Market Leader, offers this advice:<\/p>\n<p>“Make sure you aren&#8217;t advertising alongside other agents. A site that places you next to one, two, or three other agents doesn&#8217;t provide exclusivity. You may get a lead here and there, but you aren&#8217;t positioned as the only expert in your area.”<\/p>\n<p>Once you have set your sights on a specific demographic &#8211; families, first-time buyers, seniors, etc. &#8211; design a marketing plan that appeals to them. For example, techies looking for a new home in an urban area will do most of their research online. Create a strong presence on social media sites and develop an informative website to attract this market.<\/p>\n<h2>Comprehensive Website<\/h2>\n<p>Can an online consumer conduct research on your website? Is the information on your site easily accessible? “Today, agents need a single location that they can send their leads to, and usually that&#8217;s their branded website,” says Russell. “This website should include all the things a prospective homebuyer might want in their research process, including listings, neighborhood stats, mortgage rates, etc.,” he concludes. If an online customer can’t find the information they need or are simply directed to an MLS site, they will leave your website.<\/p>\n<h2>Website Must Haves<\/h2>\n<ul>\n<li>A landing page with your contact information.<\/li>\n<li>High-resolution property photos with information.<\/li>\n<li>A bio about the real estate agent.<\/li>\n<li>Rich content (articles and blogs showcasing your expertise in a field).<\/li>\n<li>Easy to find navigation tabs.<\/li>\n<li>Optimized website content with keywords for search engines.<\/li>\n<\/ul>\n<p>While many agents expand on this list, providing additional bells and whistles on their websites, such as videos, you must at least have the basics. Any holes in your website will send a lead running to another agent. Make sure that your website meets the needs of your target market.<\/p>\n<h2>Lead Management System<\/h2>\n<p>A lead management system helps you retain your leads before they get stolen from someone else. All the money that has gone into generating your leads (marketing, technology, etc.) will go to waste if you can’t convert the lead into a client. There are numerous lead generation systems out there for real estate agents. The most basic ones will help you organize your leads, capture your lead’s contact information, alert you when a lead is trying to contact you, send out auto-responses, and email leads with information based on their searches.<\/p>\n<p>A lead may not be ready to become a client. By using a lead management system, you are able to stay in the forefront of their mind until they are ready to buy or sell a property.<\/p>\n<p>Ways of keeping contact include newsletters, blogs, articles and emails. You can keep your leads engaged by providing them with a stream of relevant information. To prevent other agents from muscling in on your leads, continually monitor your marketing campaign and make improvements as needed.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>It’s a common practice in real estate to try to generate leads from a competitor already doing a good volume of business. The easiest way to steal leads is to look at a competitor’s shortcomings and create a marketing plan based on their shortfalls. Easy Targets: Agents who don’t focus on a target market. Agents [&hellip;]<\/p>\n","protected":false},"author":25,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[34],"tags":[193,141,126,142,167,87,118,169,136],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/11301"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/25"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=11301"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/11301\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=11301"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=11301"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=11301"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}