{"id":12291,"date":"2013-04-25T17:42:29","date_gmt":"2013-04-25T17:42:29","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=12291"},"modified":"2022-01-26T18:26:28","modified_gmt":"2022-01-27T02:26:28","slug":"are-you-ready-for-social-medias-visual-revolution","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/are-you-ready-for-social-medias-visual-revolution\/","title":{"rendered":"Are You Ready for Social Media’s Visual Revolution?"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-12331\" title=\"Visual Social Media and Real Estate Marketing\" src=\"\/wp-content\/uploads\/2013\/04\/Fotolia_46388945_XS-300x198.jpg\" alt=\"Social media sites like Pinterest can be useful marketing tools for real estate agents\" width=\"300\" height=\"198\" \/>Just when you get the hang of Facebook, Twitter and the rest of the current crop of social media sites, technology up and changes again. While we’ve known for some time that YouTube is enormously popular, other forms of so-called “visual social media” are about to catch up, according to the REDominance blog. Pinterest, a photo-sharing site launched in 2010, is growing at a faster rate than any social media site.<\/p>\n<p>According to <a href=\"https:\/\/mashable.com\/archive\/pinterest-traffic-study\">Mashable’s<\/a> Zoe Fox, “Most of the other social networks only achieved year-over-year growth between 10 percent and 80 percent, while growth of top-ranked Facebook actually declined 4 percent over the past year.”<\/p>\n<p>Fox goes on to quote the following statistics:<\/p>\n<ul>\n<li>Pinterest access from mobile Web increased by 4,225 percent over the past year.<\/li>\n<\/ul>\n<ul>\n<li>During that same time period, the pool of U.S. users grew by 1,698 percent.<\/li>\n<\/ul>\n<ul>\n<li>The amount of time that users spend on the site grew by 6,056 percent since last year.<\/li>\n<\/ul>\n<ul>\n<li>Most significantly, Fox says that 28.1 percent of Pinterest users have an annual household income of $100,000, according to UltraLinx.<\/li>\n<\/ul>\n<p>Agent Stew Keene, with EXP Realty in Scottsdale, Ariz. can attest to Pinterest’s rising popularity. “My Pinterest followers, pins and shares &#8211; just in the last month &#8211; have erupted. I mean, it’s gone insane. I’ve never seen a social media apparatus that – in just 30 days &#8211; took off like this,” Keene said.<\/p>\n<p>This meteoric rise in popularity makes perfect sense when you think about it. If every picture truly does tell a story, and a picture is worth a thousand words, the question remains: Is traditional blogging doomed in the age of visual social media?<\/p>\n<h2>Who Uses Pinterest?<\/h2>\n<p>The typical Pinterest user is female and between the ages of 24 and 44, according to MDG Advertising. EnvisionMedia 360 breaks these figures down even more: Twenty-nine percent of the women are in the 25 to 34 age bracket while 27 percent are aged 35 to 44. About half of them have children, according to <a href=\"https:\/\/www.mediabistro.com\/\">MediaBistro.com<\/a>.<\/p>\n<p>Some of the most visited Pinterest boards deal with interior decorating and design. “My followers are looking at the interior and exterior design ideas I have,” says Keene. “Those things are getting tons of shares.”<\/p>\n<h2>How Agents Use Pinterest<\/h2>\n<p>If you aren’t using Pinterest, consider this: “Pinterest drives more traffic to blogs and websites than Google+, YouTube and LinkedIn combined,” according to Fox. That’s an impressive statistic and one any blogging agent should pay attention to.<\/p>\n<p>Another way that agents use Pinterest is as a platform to position themselves as the community expert. Nobody does this as well as Orange County, Calif. real estate agent <a href=\"https:\/\/www.pinterest.com\/rajqsar\/_saved\/\">Raj Qsar<\/a>. Whether someone is looking for the best cheeseburger, food truck or winery in Orange County, Qsar has a Pinterest board to help them out.<\/p>\n<p>If you’re looking for inspiration for your Pinterest boards, check out the following:<\/p>\n<ul>\n<li><a href=\"https:\/\/www.pinterest.com\/stylehouse\/_saved\/\">Style House Real Estate Group<\/a> caters to the design-addicted with yummy photos of all things decorating and design.<\/li>\n<\/ul>\n<ul>\n<li>Minnesota broker associate <a href=\"https:\/\/www.pinterest.com\/teamkruse\/_created\/\">Todd Kruse<\/a> positions himself as the Woodbury expert.<\/li>\n<\/ul>\n<ul>\n<li><a href=\"https:\/\/www.pinterest.com\/mivyleague\/_saved\/\">Michelle Ivy<\/a>, an agent in Guelph, Ontario uses Pinterest to help people get to know her personally, and it works. Notice there’s only one Pinterest board that mentions real estate and there are no listings on it. The only complaint I have with Michelle’s Pinterest home page is that she doesn’t directly link to her website, but to a photo of it.<\/li>\n<\/ul>\n<ul>\n<li>The National Association of Realtors® posts a list of <a href=\"https:\/\/realtor.overdrive.com\/media\/B630A003-032E-46C2-98AE-7FCA0D399BE4\">ideas and tips for Pinterest users<\/a>.<\/li>\n<\/ul>\n<h2>How to Get Started on Pinterest<\/h2>\n<p>Rather than walk you through a boring list of how to set up your Pinterest page, check out this excellent collection of <a href=\"https:\/\/help.pinterest.com\/en\/guide\/all-about-pinterest\">tutorials<\/a>, produced by the folks at Pinterest.<\/p>\n<p>Three important Pinterest user tips to remember:<\/p>\n<ul>\n<li>It’s not a place to promote your listings or fish for clients. That’s not to say you shouldn’t post about real estate &#8211; sparingly &#8211; or make it clear that you’re an agent (a great spot for that is in your profile).<\/li>\n<\/ul>\n<ul>\n<li>It is a place to interact with others and to share more about your personal side.<\/li>\n<\/ul>\n<ul>\n<li>Make sure you link your Pinterest profile back to your blog, website or Facebook page.<\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>Just when you get the hang of Facebook, Twitter and the rest of the current crop of social media sites, technology up and changes again. While we’ve known for some time that YouTube is enormously popular, other forms of so-called “visual social media” are about to catch up, according to the REDominance blog. Pinterest, a [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[104],"tags":[145,87,102,171,117,146,197,103,198],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/12291"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=12291"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/12291\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=12291"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=12291"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=12291"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}