{"id":12441,"date":"2013-05-03T18:02:42","date_gmt":"2013-05-03T18:02:42","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=12441"},"modified":"2017-08-10T13:09:50","modified_gmt":"2017-08-10T20:09:50","slug":"how-to-build-your-real-estate-business-after-relocating","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/how-to-build-your-real-estate-business-after-relocating\/","title":{"rendered":"How to Build Your Real Estate Business After Relocating"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-12461\" title=\"Building Your Real Estate Business After Relocating\" src=\"\/wp-content\/uploads\/2013\/05\/Fotolia_35275726_XS-300x204.jpg\" alt=\"Generating leads after moving your real estate business requires planning\" width=\"300\" height=\"204\" \/>The lifeline of any real estate practice is its pipeline. That concept is drilled into every new agent, with the admonition that the agent begins filling it with friends and family.<\/p>\n<p>What happens, then, when an established agent moves to a new city or state with no friends and no family in the area to shove into the pipeline? How will you set up shop when you don’t know a soul?<\/p>\n<p>Established agents understand that it takes a concerted effort to build a practice, whether as a rookie or an old-timer. That effort starts with a plan.<\/p>\n<h2>Get a Warm Start<\/h2>\n<p>Warm calls are so much easier to make than cold calls. Before you leave your present home, call former clients and ask if they know anyone in the new town you’ll be moving to. This tactic worked well for agent Mike Riley when he decided to make the move from Cincinnati to Sarasota, Fla.<\/p>\n<h2>Back to Basics<\/h2>\n<p>Think back to your rookie days for a minute. Is there one lead generation method that worked – even a little? Nobody likes door-knocking, but if it helped fill your pipeline once, chances are good it will again. Cold calling is painful, but if it worked before, put it in your plan. Several relocated agents said that floor time and open houses helped them get their first clients.<\/p>\n<p>Yes, it sounds like drudgery. Just remember, it won’t be an ongoing chore, but something required just long enough to get your new practice up and running.<\/p>\n<h2>Build Your Brand<\/h2>\n<p>When the rancher wants to differentiate her cattle from those of other ranchers, she’ll apply a hot branding iron to the cow’s hide. While you don’t need to burn your butt to stand out, you should study the other agents in town and get to know how they choose to brand themselves. Then, make the decision to package yourself differently.<\/p>\n<p>If you have a niche, such as the luxury home market, getting established is a lot easier, and it will take less time to dominate that market. Generalists will have to do a little more work.<strong><\/strong><\/p>\n<p>If you don’t understand what personal branding entails, let alone how to do it, and you are serious about your real estate business, hire a professional marketing and branding strategist.<\/p>\n<h2>Your Website<\/h2>\n<p>Early on in the game, make sure your website is up-to-date. Get rid of the old city information and begin building content about your new town. Update your social media profiles and make sure everyone who follows you is aware of the move.<\/p>\n<p>Extend an invitation to everyone you meet to join you on Facebook, Twitter and any other social media platforms you use. This means everyone – from the clerk at the grocery store you chat with to the guy who does your oil change. Get in the habit of asking folks if they’re on Facebook.<\/p>\n<p>To hit the ground running requires that you quickly begin building relationships with residents of your new town.<\/p>\n<h2>Get to Know Your New City<\/h2>\n<p>There is no way you’ll be viewed as the neighborhood expert when you’re new in town. So get up to speed by spending the downtime playing tourist. Get to know the neighborhoods and, most especially, the homes within the neighborhoods. Tour properties so you have a better understanding of market value in the area.<\/p>\n<p>Take your camera with you to take photos of neighborhoods that you like. Blog about the area and post the photos.<\/p>\n<p>This is also the ideal way to help you decide on a farm area. Speaking of which, Marilyn Schwartz &#8211; real estate agent, manager and trainer &#8211; suggests that to make farming pay off you should choose a neighborhood or area with a minimum of 500 homes that have a turnover rate of 7 percent over the past three years.<\/p>\n<hr \/>\n<p>\n<a href=\"http:\/\/www.marketleader.com\/products\/real-estate-leads\/\"><img class=\"alignleft size-medium wp-image-44201\" src=\"http:\/\/www.marketleader.com\/wp-content\/uploads\/2016\/02\/Blog-CTA-arrows-2.png\" alt=\"Learn how Market Leader can generate more buyer and seller leads for you\"><\/a><strong><em>NEED MORE LEADS? Market Leader can generate a guaranteed number of exclusive buyer and seller leads for you each month. <\/em><a href=\"http:\/\/www.marketleader.com\/products\/real-estate-leads\/\">LEARN MORE &gt;&gt;<\/a><\/strong><\/p>\n<hr \/>\n<h2>Get Involved<\/h2>\n<p>One of the best ways to meet people and make friends when you move to a new town is to get involved in community organizations. Think about what, outside of real estate, moves you. Some of the community organizations agents choose to get involved with include:<\/p>\n<ul>\n<li>Animal rights and animal rescue.<\/li>\n<li>Homeless services.<\/li>\n<li>Disease research funding, such as AIDS and breast cancer.<\/li>\n<li>Education and local schools.<\/li>\n<li>Children, such as at-risk youth, recreation and education.<\/li>\n<li>Civic clubs, such as Kiwanis, Lions Club and the Rotary Club.<\/li>\n<\/ul>\n<p>There are a couple of ways to meet other business owners in town. You can do it formally, by attending Chamber of Commerce mixers or joining the Rotary Club or something similar. Or you can make plans to stop by a different business every working day. Take some business cards with you, and if the owner isn’t there, jot a note on the back of the card saying you’re new in town, don’t know anyone and you’d like to take the person out for coffee.<\/p>\n<p>Don’t forget to follow up. Owners of smaller “mom and pop” stores may even be amenable to letting you leave some business cards on the counter.<\/p>\n<h2>Buy Leads<\/h2>\n<p>A number of companies sell leads to real estate agents, <a href=\"http:\/\/www.marketleader.com\/products\/real-estate-leads\/\">including Market Leader<\/a>.<\/p>\n<p>As a former agent I know for a fact that we’re a stingy group. I don’t think I’ve met a real estate agent yet who likes to pay for anything connected to her practice. If you’re new in town, though, this might just be the ideal way to jumpstart your business. Get a few deals under your belt and build from there.<\/p>\n<p>Do Internet leads work? The consensus is that as long as agents work Internet leads, they do.<\/p>\n<p>Jun Choo, Market Leader’s general manager of advertising, claims that agents need to work online leads the same way they do other types of leads.<\/p>\n<p>“Once you have these leads,” Choo says, “don’t expect them to magically move through the funnel, and don’t expect them to move through it on your timetable. If you concentrate on converting them, you’ll most likely have more than one eventually come through, and, for each of those, you’re in the money,” he claims.<\/p>\n<h2>Adjust Your Expectations<\/h2>\n<p>If you’re moving from a more expensive area to a less expensive one, you’ll need to adjust to the fact that you probably won’t be making the same amount of commission per transaction. <strong><\/strong><\/p>\n<p>Go easy on yourself when you become impatient. Since it takes a rookie six months to a year to get up and running, give yourself that much time too. Just remember to watch your budget so that you don’t become desperate. Potential clients can smell desperation a mile away.<\/p>\n<p>When it’s all said and done, and you finally become a local in your new hometown, you may be surprised to find yourself with a heftier client list than the one you left back home.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The lifeline of any real estate practice is its pipeline. That concept is drilled into every new agent, with the admonition that the agent begins filling it with friends and family. What happens, then, when an established agent moves to a new city or state with no friends and no family in the area to [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[34],"tags":[99,126,87,199,200],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/12441"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=12441"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/12441\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=12441"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=12441"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=12441"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}