{"id":12671,"date":"2013-05-10T08:00:11","date_gmt":"2013-05-10T08:00:11","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=12671"},"modified":"2021-12-07T11:38:33","modified_gmt":"2021-12-07T19:38:33","slug":"how-to-provide-great-customer-service","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/how-to-provide-great-customer-service\/","title":{"rendered":"How to Provide Great Customer Service"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-12701\" title=\"How to Provide Great Customer Service to Real Estate Consumers\" src=\"\/wp-content\/uploads\/2013\/05\/Fotolia_45930901_XS-300x300.jpg\" alt=\"Providing customer service is an important aspect of building a referral pipeline for real estate agents\" width=\"300\" height=\"300\" \/>Have you ever noticed that most of the people who advise real estate agents to <em>give<\/em> great customer service fail to explain <em>how<\/em> to do so? It’s easy to understand what constitutes great customer service in a restaurant or a department store. It’s easy to get the concept when you’re on the receiving end of it.<\/p>\n<p>Why all the evasion, then, when it comes to giving solid advice as to how to actually <em>give<\/em> great customer service to real estate clients? It is, after all, one of the most important aspects of your business – if you hope to remain in business.<\/p>\n<p>Agents who provide great customer service build bonds with their clients that lead to long-term relationships. Therefore, the service you provide lies at the heart of your referral pipeline.<\/p>\n<h2>Learning From the Negative<\/h2>\n<p>If you ever want to know what people like about a situation, ask them what they <em>don’t<\/em> like about it. By removing the negatives you can get really close to the positives.<\/p>\n<p>It didn’t take me long to find out what consumers <em>don’t<\/em> consider good service:<\/p>\n<ul>\n<li>“This agent won’t even call you back!!”<\/li>\n<\/ul>\n<ul>\n<li>“Not once during the three month period of my short sale did he contact me to update me on anything. I had to call him, and when I did, he never had an answer for me.”<\/li>\n<\/ul>\n<ul>\n<li>“They shouldn’t tell people they’re an expert at something if they aren’t. Do they really think it won’t come out that they don’t know what they’re doing?”<\/li>\n<\/ul>\n<ul>\n<li>“She doesn’t return any of my calls.”<\/li>\n<\/ul>\n<ul>\n<li>“I requested a list of properties from a Realtor® with a few specific needs (i.e., granite countertops and two-car garage). So she sends me a list of properties and tells me, &#8220;Oh, there is no option to search for granite countertops, so just let me know if you want to look at any of these?”<\/li>\n<\/ul>\n<p>For an even bigger eye-opener, attend a Hear it Direct event, or watch some of the videos they post online. In case you aren’t familiar with Hear it Direct, it’s a company that holds all-day consumer conferences in different parts of the country, interviewing actual real estate consumers.<\/p>\n<p>Let’s take a closer look at some of these negatives that seem to be a common lament of many real estate consumers, and turn them into positives.<\/p>\n<h2>Responsiveness<\/h2>\n<p>Are you ready for yet another “Real Estate Agents Suck Because” remark from a real estate consumer?<\/p>\n<p>“I hate when I call and get an automated system or voicemail and not a real person.”<\/p>\n<p>According to the California Association of Realtors®’ 2012 Survey of California Homebuyers, when deciding which agent to hire to help them purchase a home, most buyers went with the agent who was the “most responsive.” An additional 17 percent of those surveyed chose the agent who was the first to respond.<\/p>\n<p>Once the consumer becomes a client, most expect the agent to respond immediately, while many are willing to wait 30 minutes and still consider the response time adequate. Wait any longer than that, however, and you’ll be an example of poor customer service.<\/p>\n<p>Only a handful of buyers claim that their agent met their response time expectations, and even worse, only 3 percent of agents exceeded the expectations.<\/p>\n<p>It seems it isn’t enough, however, to respond quickly. Most homebuyers expect their agents to use their preferred method of contact. For instance, CAR’s study on the subject showed that 32 percent of the buyers surveyed expressed a preference for text messaging with the agent. Sadly, only 5 percent of them had agents who respected that preference. Of those that eschew telephone contact – only 14 percent wanted the agent to communicate by phone – 44 percent of their agents ignored that and responded by telephone.<\/p>\n<p>The takeaway from CAR’s survey is that agents need to respond as quickly as possible to a client, using their preferred method of contact. That is a big component of great customer service, according to real estate consumers.<\/p>\n<h2>Stay in Touch<\/h2>\n<p>Remember the consumer quoted above who was upset that his agent didn’t keep in touch with him during the short sale process?<\/p>\n<p>Set up one early evening a week to reach out to your current clients &#8211; by phone, email or text. Even if nothing is happening, the fact that you took the time to contact them will be noticed. At the end of the transaction, a happy client is the client who is most likely to to spread the word about your excellent customer service.<\/p>\n<h2>Educate Your Client<\/h2>\n<p>In both the CAR survey and other recent studies, real estate consumers bemoaned the fact that either their agents didn’t have a great deal of knowledge of the real estate transaction or they didn’t adequately share that knowledge.<\/p>\n<p>Unless they are serial buyers or sellers (investors), most real estate consumers don’t have a clue about what lies ahead in their transaction. It’s important to spend time with them at the very beginning, giving them a course on Selling 101 or Buying 101. Tell them everything:<\/p>\n<p><strong>Your commission split <\/strong>&#8211; Most consumers have no idea that you split your commission with another agent and that your broker takes another cut. Let them know how it works, and if the client is a seller, how you’ll spend what’s left of your share to market the home. Every last detail of what goes on behind-the-scenes that makes you worth your share of the commission should be shared. This accomplishes two things. First, it removes that built-in resentment that so many clients have when they assume you’re making a ton of money off of them. Second, it shows your client that your level of honesty is such that you’ll even share how much you earn.<\/p>\n<p><strong>Be a glossary<\/strong> &#8211; As you walk them through the process, step by step, clarify any terms that they may not be familiar with. Terms such as agency, escrow, earnest money, contingencies, title and all the other words you use every day that may sound like Greek to your client.<\/p>\n<p><strong>Paperwork<\/strong> &#8211; Show them the contracts before they’re shoved in front of them to sign. Point out the different areas that are important to think about before signing. Let them know which forms they can expect to be asked to sign and at what point in the transaction.<\/p>\n<p><strong>Introduce them<\/strong> &#8211; Let them know that there may be upwards of 10 to 20 people involved in their transaction &#8211; including you, your staff, lenders, underwriters, escrow officer, inspectors, title representatives and the agent representing the other party. Not only does this give them a better picture of just how complex the process is, but it subtly lets them know that if something does go wrong, it isn’t necessarily your fault.<\/p>\n<h2>Listen to Your Client<\/h2>\n<p>There are few things more frustrating than speaking to someone and knowing they aren’t really listening. Even worse is when they appear to be listening but events down the road show that they weren’t.<\/p>\n<p>No matter how busy you are it is vital to stop the chatter in your head, relax, and listen to the person sitting in front of you. Allow your client to relax as well, whether it’s in his decision of how much to ask for his home or his desire to look at homes without feeling pressured to make a commitment, give him space.<\/p>\n<p>So, now that you have a few tips on how to provide excellent customer service during the transaction, don’t forget that it should extend beyond the sale as well, if you hope to retain the client and everyone in her sphere of influence. Check back in with your client a few weeks after the transaction to see how everything is going.<\/p>\n<p>Henry Ford said, “A business absolutely devoted to service will have only one worry about profits. They will be embarrassingly large.”<\/p>\n<p>Here’s hoping the few tips you’ve just read will bring you huge profits that will embarrass the you-know-what out of you!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Have you ever noticed that most of the people who advise real estate agents to give great customer service fail to explain how to do so? It’s easy to understand what constitutes great customer service in a restaurant or a department store. It’s easy to get the concept when you’re on the receiving end of [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[97],"tags":[124,201,165,144,199,202],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/12671"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=12671"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/12671\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=12671"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=12671"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=12671"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}