{"id":13431,"date":"2013-05-30T17:18:28","date_gmt":"2013-05-30T17:18:28","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=13431"},"modified":"2016-02-04T00:36:01","modified_gmt":"2016-02-04T00:36:01","slug":"how-to-nurture-a-sales-opportunity","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/how-to-nurture-a-sales-opportunity\/","title":{"rendered":"How to Nurture a Sales Opportunity"},"content":{"rendered":"<p>Look closely. Right there, between lead generation and lead conversion, is the step that most agents trip over: lead nurturing. Since it’s nearly impossible to get from the first to the third step without spending some time on the second, let’s look at some ways you can spread some nurturing love among your leads.<\/p>\n<h2>Don’t Quit<\/h2>\n<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-13451\" title=\"How to Nurture a Sales Opportunity\" src=\"\/wp-content\/uploads\/2013\/05\/Fotolia_39487139_XS-249x300.jpg\" alt=\"Nurturing relationships with potential clients can help real estate agents convert leads\" width=\"249\" height=\"300\" \/>It’s a common saying in recovery circles: “Don’t quit before the miracle happens.” Although perhaps a bit overly dramatic in a discussion of real estate leads, that “miracle” is the moment when a lead is converted into a client. It’s that moment when “not now” becomes “let’s do it.”<\/p>\n<p>To arrive at that moment requires first an understanding that a large percentage of your leads will end up buying or selling a house – with you or another agent – but it may not be right away. To be their agent of choice, when the time comes, requires establishing a relationship and nurturing it until they decide to pull the trigger. If you do this consistently, you will get their business when they’re ready.<\/p>\n<h2>Choosing the Best Strategies<\/h2>\n<p>To make the most of every lead you get requires a two-pronged approach: processing incoming leads and then the ongoing process of nurturing those leads.<\/p>\n<p>There are a number of ways to classify incoming leads. Bob Corcoran, with Corcoran Consulting &amp; Coaching, suggests you make it a no-brainer and classify them as A, B, or C, according to how soon you think the lead will be ready to act, with A being the most recent. Cold, warm and hot is another easy way to classify new leads.<\/p>\n<p>“A” leads should be contacted immediately. Leave a message if you don’t make contact, and then keep calling – at least four to five more times – before they go into the drip system.<\/p>\n<p>The “B” and “C” leads go into your contact management system, set up to ensure that you consistently stay in touch with them, providing them with relevant content. Drip campaigns are ideal here.<\/p>\n<p>“Relevant” content is the operative word here and applies to:<\/p>\n<ul>\n<li>New listing alerts, based on the lead’s criteria.<\/li>\n<li>Newsletters.<\/li>\n<li>Market updates.<\/li>\n<li>Neighborhood data, based on those neighborhoods under consideration by the lead.<\/li>\n<\/ul>\n<h2>Acceleration<\/h2>\n<p>Agents with souped-up contact management solutions that allow them to monitor client visits to their websites and that offer campaign reports can take lead nurturing to a third level: acceleration.<\/p>\n<p>A lead who forwards a drip campaign email or clicks on a link within it is most likely becoming warmer. When a lead visits your website and saves properties or visits a property repeatedly, it’s time to move the lead into the “A” position and accelerate the process.<\/p>\n<p>A phone call is of course in order, but don’t dump the drip campaign – laser focus it to their specific hot buttons.<\/p>\n<p>One of my favorite real estate blogs, Real Estate Tomato, claims that an Internet lead takes between six and 18 months to “incubate,” and that your blog can help accelerate this period.<\/p>\n<p>How? Being more personal and providing more information than you can in a dripped email allows potential clients to get to know you on a more personal level, thus building trust.<\/p>\n<p>Consider a blog email blast for these simmering leads. If the content is compelling, they will visit, and if it’s relevant and engaging, they will come back.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Look closely. Right there, between lead generation and lead conversion, is the step that most agents trip over: lead nurturing. Since it’s nearly impossible to get from the first to the third step without spending some time on the second, let’s look at some ways you can spread some nurturing love among your leads. Don’t [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[34],"tags":[124,213,214,215,141,126,142,105,118],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/13431"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=13431"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/13431\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=13431"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=13431"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=13431"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}