{"id":13561,"date":"2013-06-05T20:55:30","date_gmt":"2013-06-05T20:55:30","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=13561"},"modified":"2022-01-26T18:25:01","modified_gmt":"2022-01-27T02:25:01","slug":"reverse-lead-calculator","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/reverse-lead-calculator\/","title":{"rendered":"Reverse Lead Calculator &#8211; Determine Your Lead Generation Needs"},"content":{"rendered":"<h2>A New Kind of Lead Calculator<\/h2>\n<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-13741\" title=\"Lead Calculator\" src=\"\/wp-content\/uploads\/2013\/06\/Money-Calculator-300x300.jpg\" alt=\"Increase your gross commission income with Market Leader's Reverse Lead Generator\" width=\"300\" height=\"300\" \/>Virtually every real estate professional has some idea of how much commission income they would like to earn annually. Unfortunately, few Realtors® know exactly how many leads they need to generate in order to actually attain their desired income levels.<\/p>\n<p>Market Leader has developed the <a href=\"http:\/\/www.marketleader.com\/landing\/lead_calculator?lsr=leadcalculator-MLBlog\">Reverse Lead Calculator<\/a> to help real estate professionals determine their lead generation needs. By using insights from a 2012 Hebert Research study, this lead calculator can tell you exactly what mix of online leads you need to generate every month &#8211; from sources as diverse as Craigslist and social media &#8211; to earn your desired commission income.<\/p>\n<p>The Reverse Lead Calculator does more than spit out numbers. Unlike other lead calculators, it shows real estate professionals how far they are from their income goals and then gives marching orders on how many leads they need to generate, by type, to reach those goals. No malarkey &#8211; just instantaneous, easy to understand advice on how to run your business!<\/p>\n<h2>How to Use the Reverse Lead Calculator<\/h2>\n<p>Market Leader’s <a href=\"http:\/\/www.marketleader.com\/landing\/lead_calculator?lsr=leadcalculator-MLBlog\">Reverse Lead Calculator<\/a> requires real estate professionals to enter six numbers representing everything from the amount of leads they generate every month to their average lead close rate. This section will walk you through each of these numbers.<\/p>\n<p style=\"text-align: left;\"><a href=\"http:\/\/www.marketleader.com\/landing\/lead_calculator?lsr=leadcalculator-MLBlog\"><img loading=\"lazy\" class=\"aligncenter  wp-image-13581\" title=\"Reverse Lead Calculator\" src=\"\/wp-content\/uploads\/2013\/06\/Image1.png\" alt=\"Determine how many leads you need to generate by using Market Leader's Reverse Lead Calculator\" width=\"600\" height=\"224\" \/><\/a>The first and arguably most important number you will enter into the Reverse Lead Calculator is <strong>the amount of money you want to make in commissions every year<\/strong>. The average U.S. real estate agent earns between $34,000 and $45,000 annually, but web-savvy Realtors® can reasonably expect to earn much more.<\/p>\n<p><strong>Enter the amount of leads you currently generate into the second textbox.<\/strong> This number provides the calculator with information on how far you are from your commission income goal. The Reverse Lead Calculator will give you lead generation recommendations based on this figure, so be as accurate as possible!<\/p>\n<p>Next, <strong>enter the number of leads you are nurturing and have stored in your database<\/strong>. If you do not know how many leads you have in your database, or do not have a lead database at all, please note that even agents who want to earn modest incomes need to generate dozens of leads every month. Without a proper database or relationship management software, it is next to impossible to track all the leads that come your way.<\/p>\n<p>The higher the price of homes in your area, the more commission income you will earn per transaction. A real estate professional only needs to sell four million-dollar homes to earn $100,000 a year! <strong>Enter your area’s average home price into the calculator’s fourth textbox.<\/p>\n<p style=\"text-align: left;\"><a href=\"http:\/\/www.marketleader.com\/landing\/lead_calculator?lsr=leadcalculator-MLBlog\"><img loading=\"lazy\" class=\"aligncenter  wp-image-13591\" title=\"Real estate lead calculator\" src=\"\/wp-content\/uploads\/2013\/06\/Image2.png\" alt=\"Real estate professionals can use this lead calculator to determine how many leads they need per month to attain their desired income\" width=\"600\" height=\"239\" \/><\/a>The fifth number found on the lead calculator is the <strong>average commission percentage you earn for every transaction you close<\/strong>. Most agents earn a 3 percent commission for every home they sell.<\/p>\n<p>The final textbox addresses the <strong>rate at which you are able to close deals with the leads you generate<\/strong>. Regardless of how accurate you find the default close rate, the implications of this low percentage remain the same: You will not be able to close the vast majority of leads you generate! This fact underscores the importance of maintaining a healthy pipeline of leads; the more leads you are nurturing, the more likely you will meet your gross commission income goals.<\/p>\n<p>Once you have entered these six numbers, click on the blue “Calculate” button and your results will appear below it.<\/p>\n<p><a href=\"http:\/\/www.marketleader.com\/landing\/lead_calculator?lsr=leadcalculator-MLBlog\"><img loading=\"lazy\" class=\"aligncenter size-full wp-image-13601\" title=\"Real estate lead generation\" src=\"\/wp-content\/uploads\/2013\/06\/Image3.png\" alt=\"Determine how many Craigslist, referral, social media and paid leads you need to generate each month\" width=\"561\" height=\"230\" \/><\/a>Don’t be alarmed by the volume of leads you need to generate in order to meet your gross commission income goal. Thanks to the rising popularity of the Internet and recovering U.S. housing market, online lead generation opportunities abound. If you would like to learn how you can generate the additional leads you need to meet your income goal, fill out the blue box on the right hand side of the Reverse Lead Calculator page. Clicking on “Check Availability” will send your information to a Market Leader account representative who can teach you how to generate leads online or sign you up for one of our many educational webinars on this subject.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>A New Kind of Lead Calculator Virtually every real estate professional has some idea of how much commission income they would like to earn annually. Unfortunately, few Realtors® know exactly how many leads they need to generate in order to actually attain their desired income levels. Market Leader has developed the Reverse Lead Calculator to [&hellip;]<\/p>\n","protected":false},"author":28,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[34],"tags":[216,217,54,56,218,187],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/13561"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/28"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=13561"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/13561\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=13561"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=13561"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=13561"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}