{"id":13781,"date":"2013-06-07T20:58:52","date_gmt":"2013-06-07T20:58:52","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=13781"},"modified":"2021-11-19T11:39:25","modified_gmt":"2021-11-19T19:39:25","slug":"fha-becomes-far-less-friendly","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/fha-becomes-far-less-friendly\/","title":{"rendered":"FHA Becomes Far Less Friendly"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-13811\" title=\"FHA Loan Changes\" src=\"\/wp-content\/uploads\/2013\/06\/Fotolia_50303374_XS-272x300.jpg\" alt=\"The new FHA loan changes could turn off homebuyers\" width=\"272\" height=\"300\" \/>Just think: Someday in the not too distant future you may actually catch yourself reminiscing about what an incredible loan the FHA loan was &#8211; before they screwed it up.<\/p>\n<p>Use caution the next time one of your clients asks you about the FHA loan. If you haven’t been following the news for the past couple of months, you’ve missed the <a href=\"http:\/\/www.washingtonpost.com\/business\/economy\/new-fha-premium-rules-mean-higher-monthly-payments-for-homeowners\/2013\/06\/05\/926cd722-cde1-11e2-8845-d970ccb04497_story.html\">FHA changes<\/a> that, as Envoy Mortgage’s Nate Raich says, “have all but removed the loan from the marketplace.”<\/p>\n<h2>Credit-Impaired Homebuyers<\/h2>\n<p>It was always so comforting to know that even if one of your clients didn’t have the best credit score &#8211; maybe had a few blemishes on her credit record &#8211; FHA was always there to guarantee a loan.<\/p>\n<p>After being burned by this high-risk buyer pool in the housing crash, FHA decided to move away from them. Now, folks with credit scores in the sub-620 range and debt-to-income ratios of 42 percent or higher are automatically flagged for a manual review. No, this doesn’t signal an automatic rejection, but the rigorous review weeds out a lot of people who, in the past, would have qualified for a loan guarantee.<\/p>\n<p>Counsel your clients to work on their credit scores before seeing a lender if they need an FHA-backed mortgage. After you fill them in on the rest of the changes, however, they may just decide to opt for a conventional loan.<\/p>\n<h2>It’s About the PMI<\/h2>\n<p>Remember the days when a homeowner could diligently pay on his FHA loan and then cancel the PMI when he hit that magic 78 percent balance? That enticement is now gone &#8211; as of June 3, 2013.<\/p>\n<p>After being burned by the high-risk buyer pool &#8211; those with low FICO scores who lacked a down payment &#8211; paying out far more insurance claims than it had expected, FHA found its reserves fund drying up. To be compliant with its congressional mandate, FHA must have on reserve an amount equal to at least 2 percent of all mortgages insured. As of its 2012 audit, the reserve funds were in the negative. Unfortunately, this means new borrowers must pay for the sins of previous borrowers.<\/p>\n<p>Now, borrowers (both purchases and some refis) who had a starting loan balance higher than 90 percent of the appraised value must continue to pay PMI for the life of the loan. Those with starting balances lower than 90 percent must pay the insurance premiums for 11 years.<\/p>\n<p>To have beaten the June 3 deadline to retain the ability to cancel PMI, borrowers needed to have an FHA case number issued. I asked Raich if he noticed an uptick of buyers trying to get that case number.<\/p>\n<p>“Yes, we saw many first-time buyers with a house picked out, trying to get a case number created. Unfortunately, not many agents were aware of the upcoming changes, so a lot of buyers lost out,” he claims.<\/p>\n<p>This move, along with the raise in PMI premiums by 10 basis points annually, announced in April, significantly increases the long-term costs of the FHA loan, making it far less attractive for those who also qualify for conventional loans.<\/p>\n<h2>FHA vs. Conventional Loan<\/h2>\n<p>The bottom line for any consumer looking for a mortgage is cost – upfront and long-term. As of the date of the latest FHA changes, here’s how it stacks up to a conventional loan:<\/p>\n<ul>\n<li>Upfront fees: FHA loans require a large upfront fee, conventional loans don’t.<\/li>\n<\/ul>\n<ul>\n<li>Payments: Because of FHA’s higher rates, the monthly payments are larger than those on a conventional loan.<\/li>\n<\/ul>\n<ul>\n<li>Insurance: To avoid paying insurance on an FHA 30-year loan, the borrower will need to come up with 22 percent of the loan amount as a down payment – 2 percent more than that required with a conventional loan.<\/li>\n<\/ul>\n<ul>\n<li>Additionally, there is now no way to cancel the insurance on an FHA loan when the down payment is less than 10 percent. With a conventional loan, PMI is typically canceled automatically as soon as the paid equity reaches 22 percent.<\/li>\n<\/ul>\n<p>Raich has already seen a decrease in FHA applications at Envoy Mortgage, which he attributes to the increased costs of the government-backed loans.<\/p>\n<p>“In the end, the consumer has to absorb the higher costs of the FHA product change. The loan was at one time a cost-effective, first-time homebuyer tool.  It has removed itself from the market, in my opinion.”<\/p>\n<p>Counsel your clients to ask their mortgage broker or loan offers to run a detailed comparison of the monthly payment estimate of the FHA loan and the conventional loan, including the upfront fees and mortgage insurance costs. They may find it more cost-effective to go with a conventional loan, if they qualify.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Just think: Someday in the not too distant future you may actually catch yourself reminiscing about what an incredible loan the FHA loan was &#8211; before they screwed it up. Use caution the next time one of your clients asks you about the FHA loan. If you haven’t been following the news for the past [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[83],"tags":[219,220,221,222,223,224],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/13781"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=13781"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/13781\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=13781"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=13781"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=13781"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}