{"id":14591,"date":"2013-06-14T19:14:54","date_gmt":"2013-06-14T19:14:54","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=14591"},"modified":"2021-11-19T10:46:59","modified_gmt":"2021-11-19T18:46:59","slug":"soaring-to-new-heights-with-dave-liniger","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/soaring-to-new-heights-with-dave-liniger\/","title":{"rendered":"Soaring to New Heights With Dave Liniger"},"content":{"rendered":"<p>You may not think you have much in common with Dave Liniger, co-founder of RE\/MAX, but let me assure you: You do.<img loading=\"lazy\" class=\"alignright\" style=\"margin: 15px 10px;\" src=\"\/wp-content\/uploads\/2013\/06\/Helicopter_nickanddave.jpeg\" alt=\"\" width=\"300\" height=\"225\" \/><\/p>\n<p>Real estate agents have been through a lot of adversity over the last few years, what with all the significant changes to the real estate market. Trying to adjust to market conditions has been pure hell for a lot of folks.<\/p>\n<p>If you look at statistics, 30 to 35 percent of all Realtors® in the United States stepped out of the business in a three-year period of time, during the housing mess. Those that stuck with it are much stronger for having done so. Tenacity, courage, devotion and confidence are all qualities that you share with Liniger.<\/p>\n<p>How did you get through that? How did you stay focused? How did you readjust based on circumstances around you?<\/p>\n<p>If this is something you struggled with, or maybe still do, come learn from one of the leaders in the industry – and someone who knows adversity, intimately.<\/p>\n<p>Liniger is a testament to meeting challenges head-on, from what he faced when he first started RE\/MAX, to going through both the very best real estate market in the history of our country and the very worst market.<\/p>\n<p>Add in the horrendous personal calamities he faced, and when you realize Liniger never wavered, you’ll be amazed. I think you’ll agree that this tenacity is what’s made him successful, even at a time when people are scrutinizing his business, scrutinizing his model and questioning their relevancy, based on market conditions.<\/p>\n<p>Another key to Liniger’s and RE\/MAX’s success is that they know who they are, they know who their customer is, and they know how to make an agent more successful tomorrow than they are today. That rock-solid confidence that he is known for is what has brought him through personal and professional adversities and has created such great success.<\/p>\n<p>ActiveRain’s Bob Stewart is hosting a webinar with Liniger on ActiveRain University this Tuesday, June 18 at10 a.m. Mountain time. It promises to be filled with inspiration, both personal and professional. Sure, Liniger will talk about real estate, but he’ll also tell us about his miraculous recovery from a near-death encounter – a revelation into the resiliency of the human spirit.<\/p>\n<p>If you haven’t read Liniger’s new book, “My Next Step: An Extraordinary Journey of Healing and Hope,” you must tune in to the webinar. I heard him speak at the RE\/MAX R4 convention this past February, and I’m sure he’ll go into detail about what happened to him &#8211; how he thought he just had back pain and ended up in the hospital in intensive care with his organs completely shutting down. He was in intensive care, out of consciousness, for two and a half months. His journey to recovery is a pretty inspiring story.<\/p>\n<p>Most of all, listen in to learn how his experience, leadership, inspiration and motivation correlates to being an agent today. As I said at the outset, you have a lot in common with my friend Dave Liniger. Come learn for yourself.<\/p>\n<p style=\"text-align: center;\"><img loading=\"lazy\" class=\"aligncenter\" style=\"margin-top: 15px; margin-bottom: 15px;\" src=\"\/wp-content\/uploads\/2013\/06\/nickanddave-edited.jpg\" alt=\"\" width=\"384\" height=\"335\" \/><\/p>\n<p><em>In a previous life, Nick Bailey, vice president of business strategy for Market Leader, was employed in a powerhouse 12-year career with RE\/MAX. A licensed real estate agent, he started with the company as a management consultant and quickly moved up to vice president of regional operations for Ohio and Pennsylvania. From there, he added vice president duties for Florida and the eastern U.S. <\/em><\/p>\n<p><em>Bailey worked closely with RE\/MAX co-founder Dave Liniger and the two remain friends to this day. If anyone has insight into what you can expect to hear from Liniger during the ActiveRain webinar, it’s Bailey.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>You may not think you have much in common with Dave Liniger, co-founder of RE\/MAX, but let me assure you: You do. Real estate agents have been through a lot of adversity over the last few years, what with all the significant changes to the real estate market. Trying to adjust to market conditions has [&hellip;]<\/p>\n","protected":false},"author":30,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[27],"tags":[228,23,229,230,231,187],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/14591"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/30"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=14591"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/14591\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=14591"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=14591"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=14591"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}