{"id":14991,"date":"2013-06-19T17:03:51","date_gmt":"2013-06-19T17:03:51","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=14991"},"modified":"2021-11-29T15:57:09","modified_gmt":"2021-11-29T23:57:09","slug":"how-to-use-client-testimonials","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/how-to-use-client-testimonials\/","title":{"rendered":"How Real Estate Agents Can Use Client Testimonials"},"content":{"rendered":"<p>Client testimonials are worth their weight in gold. First, they’re free, and what real estate agent doesn’t love that word? Next, they may just be the number one way to build your credibility with prospective clients. Finally, testimonials allow you to toot your own horn, without appearing pushy.<\/p>\n<h2>Testimonials as Reviews<\/h2>\n<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-15011\" title=\"How to Use Client Testimonials\" src=\"\/wp-content\/uploads\/2013\/06\/Fotolia_49968844_XS-300x200.jpg\" alt=\"Client testimonials can help real estate agents establish credibility and stand out from other agents\" width=\"300\" height=\"200\" \/>The popularity of sites such as Yelp, Urbanspoon, Angie’s List and Glassdoor attest to the American consumer’s thirst for knowledge of companies, products and services before they spend money on them.<\/p>\n<p>Consumers just happen to now be clamoring for real estate agent reviews and, sadly, not finding them. Or at least not finding reviews that they can trust. When all the agent reviews on a real estate portal are positive, it can make consumers feel like they’re trying to pick the proverbial needle out of a haystack when searching for agent assistance.<\/p>\n<p>Agents who use testimonials in their marketing efforts don’t necessarily use the words of clients who had a bad experience, and consumers don’t expect them to. Depending on how agents use testimonials, however, they can be a powerful yet subliminal cred builder.<\/p>\n<p>Tip: Although you shouldn’t use the word “review” when soliciting feedback, it’s a great keyword to use on your website.<\/p>\n<h2>Create a System<\/h2>\n<p>Whether you are building your testimonial program from scratch or revamping an old one, creating a system will help you become organized and keep you focused on the most effective way to use these gold nuggets.<\/p>\n<p>Three things to consider when creating your feedback system include:<\/p>\n<ul>\n<li><strong>Soliciting feedback &#8211; <\/strong>When to seek it and how to enable clients to provide it.<\/li>\n<\/ul>\n<ul>\n<li><strong>Feedback format &#8211;<\/strong> Will you use plain text, include photos or use video? Will you use several formats, depending on the marketing medium?<\/li>\n<\/ul>\n<ul>\n<li><strong>Using testimonials to maximize effectiveness &#8211;<\/strong> Will you use them just on the website &#8211; and where on the site &#8211; or include them in other marketing materials?<\/li>\n<\/ul>\n<h2>When to Ask for Feedback<\/h2>\n<p>Robert B. Cialdini, in his book, “<a href=\"https:\/\/www.amazon.com\/Influence-Psychology-Persuasion-Business-Essentials\/dp\/006124189X\">Influence: The Psychology of Persuasion<\/a>,” talks about the fascinating findings of a Canadian study of people’s behavior at the racetrack.<\/p>\n<p>The researchers found that the bettor’s confidence level was higher just after placing a wager than it was immediately before placing it. Even though the odds were the same before and after making the wager, the bettor was more confident of the horse’s prospects once he’d committed his money.<\/p>\n<p>Cialdini claims that this puzzling change in attitude is the result of “our nearly obsessive desire to be (and to appear) consistent with what we have already done.” A very powerful “weapon of influence,” as Cialdini calls it, and one that hints at the ideal time to approach the client for feedback.<\/p>\n<p>Once your client has committed to the sale or the purchase of a home &#8211; immediately after the close of escrow &#8211; get your testimonial.<\/p>\n<h2>Enabling Your Clients to Provide Awesome Testimonials<\/h2>\n<p>Left to their own devices, clients typically don’t provide the type of content required to make a testimonial awesome.<\/p>\n<p>This means that it’s up to you to guide them into providing comprehensive, impressive content. You can accomplish this by determining what aspects of your business or service you want to promote and then crafting questions to elicit the proper responses. Get them to describe the experience of working with you &#8211; what benefits they derived from using you instead of Joe-the-agent-across-town.<\/p>\n<p>When you request feedback from clients, call it that, or call it a survey, but avoid using the words “testimonial” or “review” when asking for them. Those two words are commitment-laden and, after everything they’ve just been through, clients are often a little commitment-phobic.<\/p>\n<p><strong>Some questions to consider asking:<\/strong><\/p>\n<ul>\n<li>Did you have any qualms about hiring a real estate agent before we began working together?<\/li>\n<\/ul>\n<ul>\n<li>What brought you to our agency?<\/li>\n<\/ul>\n<ul>\n<li>How do you feel about the process of buying\/selling your house?<\/li>\n<\/ul>\n<ul>\n<li>How impressed were you with…?<\/li>\n<\/ul>\n<ul>\n<li>Explain how we met your need for…<\/li>\n<\/ul>\n<ul>\n<li>Please tell us more about (a challenge the client had) and how we were able to help you overcome that.<\/li>\n<\/ul>\n<ul>\n<li>Would you recommend working with us to your friends, neighbors, family and colleagues? If so, what would you tell them about us?<\/li>\n<\/ul>\n<p>These are just a few questions to get you started; be creative and gently lead the client to the desired result.<\/p>\n<h2>Deciding on a Format<\/h2>\n<p>Some agents are going all out with Hollywood-feel videos, while others are opting for a more natural effect. Some add video and text. Check out Irvine, California’s Fitzpatrick + Prince Real Estate for an example of how effective this can be.<\/p>\n<p>Fisher Real Estate Services in Fort Worth, Texas blends community and agent images with incredible client testimonials that make Greg Fischer someone I’d want to work with. <a href=\"https:\/\/www.youtube.com\/watch?v=_sW5dJQqlAw\">Alyssa Hellman<\/a> of Long &amp; Foster in Washington, D.C. uses the same technique quite effectively.<\/p>\n<p>Then there are those agents who aren’t using video at all but just slapping up a bunch of text and calling it a day.<\/p>\n<p>If you decide to do a plain text list of quotes, please reconsider. Psychologists with Victoria University in New Zealand released the results of a 2012 <a href=\"https:\/\/pubmed.ncbi.nlm.nih.gov\/22869334\/\">study<\/a>: “Nonprobative Photographs (or words) Inflate Truthiness,” the latter a word they picked up from Stephen Colbert.<\/p>\n<p>“When people evaluate claims, they often rely on …&#8221;truthiness,&#8221; or “subjective feelings of truth,” the authors claim. In other words, a lot of people will, consciously or subconsciously, not believe your testimonials unless you help them believe them.<\/p>\n<p>They showed the test subjects a number of celebrity names &#8211; both famous and not-so-famous &#8211; and asked them to answer “true or false” whether the celebrity was alive or dead. Some of the names were accompanied by a photo, others weren’t. The researchers found that, when it came to the unfamiliar celebrity names, photos “increased the likelihood that subjects would judge the claim to be true.”<\/p>\n<p>Consider at least adding a photo of the client. This humanizes the words and lends them veracity. It also prevents one testimonial from blurring into the next on the page. If you want to really get creative, add a headline to each testimonial as well as a photo.<\/p>\n<h2>Where Will You Put Them?<\/h2>\n<p>Since establishing trust and credibility is job one when it comes to converting prospects, testimonials should be considered the heart of your website’s content.<\/p>\n<p>Many agents choose to place their testimonials on a dedicated webpage, leaving it up to the prospect to navigate to them.<\/p>\n<p>Testimonials, however, should be the first thing someone sees upon landing on your website. Even if you just use snippets that link to the testimonial page, get that content in front of prospects immediately.<\/p>\n<p>Use them in newsletters, brochures and other marketing pieces, and don’t forget to share them on social media every once in a while.<\/p>\n<p>The power and effectiveness of client reviews can’t be overstated.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Client testimonials are worth their weight in gold. First, they’re free, and what real estate agent doesn’t love that word? Next, they may just be the number one way to build your credibility with prospective clients. Finally, testimonials allow you to toot your own horn, without appearing pushy. Testimonials as Reviews The popularity of sites [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[35],"tags":[163,232,165,233,87,234,235,127,236,237],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/14991"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=14991"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/14991\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=14991"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=14991"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=14991"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}