{"id":15121,"date":"2013-06-21T17:24:09","date_gmt":"2013-06-21T17:24:09","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=15121"},"modified":"2021-11-29T15:23:41","modified_gmt":"2021-11-29T23:23:41","slug":"how-to-sell-a-luxury-listing","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/how-to-sell-a-luxury-listing\/","title":{"rendered":"How to Sell a Luxury Listing"},"content":{"rendered":"<p>You’ve just taken your first million-dollar-plus listing. After celebrating your victory over the area’s top luxury agent, reality will no doubt begin to set in. If you don’t know the first thing about marketing high-end properties, you may wonder what you’ve gotten yourself into.<\/p>\n<p>You may panic.<\/p>\n<p>But, you’re a pro and you’ll do what all pros do &#8211; lots and lots of research.<\/p>\n<h2>Unique Challenges<\/h2>\n<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-15151\" title=\"How to Sell a Luxury Listing\" src=\"\/wp-content\/uploads\/2013\/06\/Fotolia_42979781_XS-300x193.jpg\" alt=\"Selling a luxury home involves unique challenges for real estate agents\" width=\"300\" height=\"193\" \/>Many established luxury agents recommend that the newbie get his or her feet wet by working under a top-producing agent who deals with high-end properties. The unique challenges of pricing, marketing and dealing with the parties are many and varied &#8211; not something one should tackle without experience.<\/p>\n<p>If you’ve already taken the listing, you may want to consider cutting your office’s luxury home specialist in on the deal so you can learn as you go.<\/p>\n<p>Let’s take a look at some of the unique challenges you’ll face with your first luxury home listing.<\/p>\n<h2>Pricing Luxury Homes<\/h2>\n<p>Luxury homes are not tract homes. They aren’t mass-produced by a single developer. They are typically architecture-designed and custom built.<\/p>\n<p>How will you price this type of property? The typical agent CMA is useless when determining the price of a luxury home mainly because there are few (or zero) comparables. Plus, the more custom amenities included in the home, the smaller the pool of comparables.<\/p>\n<p>Then there are the intangibles, such as view, ocean or beach access, privacy and history. How do these intangibles factor into the pricing decision?<\/p>\n<p>The most important thing you can do is to get to know the neighborhood intimately, according to luxury specialist <a href=\"http:\/\/www.davidkean.com\/\">David Kean<\/a> of Teles Properties in Beverly Hills.<\/p>\n<p>New luxury agents “need to do their research,” Kean suggests. “I go through every house that comes on the market so that I’m not just looking at comps on paper,” he continues. “I have actually been through each house and I know the layout; I know if there’s a telephone pole blocking the view,” he concludes.<\/p>\n<p>Nancy Allen, a broker with Pacific Union GMAC Real Estate in San Francisco, starts with the basics, such as square footage (of both the house and the lot). “After that, you need to factor in the amenities,” she told Forbes.<\/p>\n<p>Finally, <a href=\"https:\/\/www.luxuryhomemarketing.com\/\">Laurie Moore-Moore<\/a>, founder of the Institute for Luxury Home Marketing, suggests that you pay attention to your words when working with the affluent. Many times, she claims, homeowners will argue with you over the homes you call “comparables,” claiming that the homes aren’t really comparable. “So, instead of referring to them as comparables, call them relevant properties,” she suggests.<\/p>\n<p>“This small change in terminology acknowledges that these homes may be very different than the subject property, but are still the homes which are most relevant when doing a market analysis,” Moore concludes.<\/p>\n<hr \/>\n<p>\n<a href=\"\/products\/real-estate-leads\/\"><img class=\"alignleft size-medium wp-image-44201\" src=\"https:\/\/www.marketleader.com\/wp-content\/uploads\/2016\/02\/Blog-CTA-arrows-2.png\" alt=\"Learn more about HouseValues seller leads\"><\/a><strong><em>NEED SELLER LEADS? You don&#8217;t need to manage your own marketing campaigns to find qualified sellers. HouseValues can deliver a guaranteed number of exclusive seller leads each month. <\/em><a href=\"\/products\/real-estate-leads\/\">LEARN MORE &gt;&gt;<\/a><\/strong><\/p>\n<hr \/>\n<h2>Marketing Luxury Homes<\/h2>\n<p>Marketing a luxury home requires a strong Internet presence, according to Kean. “Newspaper and print are fairly archaic,” he claims. “They’re glossy and impressive, but they don’t produce buyers.”<\/p>\n<p>Kean also warns that the luxury agent needs a large network of contacts, such as other luxury agents, attorneys, past celebrity clients and high-end public relations people. “Get to know writers and reporters so you can create a buzz,” he recommended.<\/p>\n<p>Kean listed actor Steve McQueen’s ranch a few years back and credits the buzz he was able to create to his good relationships with the press. “I got the ranch into 40 newspapers,” he said.<\/p>\n<p>Marketing to the affluent also requires paying close attention to and highlighting branded features of the home in all of your marketing materials.<\/p>\n<p>Certain brands, such as Philippe Starck, Miele, Crestron, Wolf and Downsview have an association with style and therefore appeal to the high-end homebuyer. These brands “lend credibility, endorsement and identification, in that the buyer is identifying with a certain lifestyle and taste,” claims <a href=\"https:\/\/www.cnbc.com\/id\/49638752\">John Hitchcox<\/a> of the international development firm Yoo.<\/p>\n<p>If you aren’t familiar with the lifestyle of the affluent, marketing their homes will be challenging, according to <a href=\"https:\/\/www.senadaadzem.com\/\">Senada Adzem<\/a>, Director of Luxury Sales for Douglas Elliman in Florida.<\/p>\n<p>She advises that the new luxury agent find a mentor. “They need to offer to work for someone who is already working in that industry,” she explains. “They’ll learn everything from the inside out.” Adzem says that to be successful with luxury sales an agent needs to immerse himself in the environment and in the peer group.<\/p>\n<p>Be nice to other agents as well as your clients,” Kean suggests. “If you create a bad reputation in the luxury market, it will be very difficult for you to survive.”<\/p>\n","protected":false},"excerpt":{"rendered":"<p>You’ve just taken your first million-dollar-plus listing. After celebrating your victory over the area’s top luxury agent, reality will no doubt begin to set in. If you don’t know the first thing about marketing high-end properties, you may wonder what you’ve gotten yourself into. You may panic. But, you’re a pro and you’ll do what [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[35],"tags":[238,239,240,241,242,87],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/15121"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=15121"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/15121\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=15121"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=15121"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=15121"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}