{"id":15201,"date":"2013-06-25T20:26:44","date_gmt":"2013-06-25T20:26:44","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=15201"},"modified":"2021-12-07T11:31:08","modified_gmt":"2021-12-07T19:31:08","slug":"4-ways-to-help-your-buyer-find-a-home-when-inventory-is-tight","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/4-ways-to-help-your-buyer-find-a-home-when-inventory-is-tight\/","title":{"rendered":"4 Ways to Help Your Buyer Find a Home When Inventory Is Tight"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-15261\" title=\"How to Find a Home When Inventory is Low\" src=\"\/wp-content\/uploads\/2013\/06\/Fotolia_50157577_XS-300x211.jpg\" alt=\"Real estate agents might need to think outside the box in order to find a home for buyers when housing inventory is low\" width=\"300\" height=\"211\" \/>It’s interesting how the media &#8211; an industry that prides itself on presenting breaking news &#8211; lags so far behind our industry when it comes to reporting on housing trends. The almost nationwide shortage of homes for sale is one of those trends that they seemed to have missed completely &#8211; at a time when we really could have used their help. Big news about rising home prices was good, but there’s nothing like the words “seller’s market” to get homeowners off the sidelines and into the market.<\/p>\n<p>We are now sitting on a nationwide average of 5.1 months’ worth of <a href=\"https:\/\/www.nar.realtor\/videos\/april-existing-home-sales-up-but-constrained\">inventory supply<\/a>, down from April’s number and a little over 10 percent below what we saw one year ago, according to the National Association of Realtors®. In fact, NAR Chief Economist Lawrence Yun says to expect this current inventory to be the peak during 2013, and that about a five-month inventory figure will be the norm for the rest of the year.<\/p>\n<p>Of course, this is all preaching to the choir. It’s the real estate agent boots on the ground in markets all over the country that can attest to bidding wars, houses selling for over list price, and clients being outbid by cash buyers.<\/p>\n<p>If you’re as frustrated as your clients, let’s take a look at some things you can do to help them find a house. Some of these methods include going after homes that aren’t in the MLS, giving your clients a breather from the multiple-offer battle.<\/p>\n<h2>Old Listing Presentations<\/h2>\n<p>Remember all those listing presentations that didn’t pan out? In desperate need for homes for her buyers, St. Paul, Minn. agent Teresa Boardman went through her database to find all the listing presentations she had done over the past three years and didn’t get the listing. If the home didn’t sell with another agent, she contacted them. It’s working out well for her. Although her current clients didn’t buy the homes, she listed one and had another strong possibility.<\/p>\n<h2>Expireds and Withdrawns<\/h2>\n<p>While a listing that expires can be pretty confidently chalked up to a pricing issue, there are various reasons a homeowner withdraws a listing from the market. Both of these types of homeowners are worth pursuing for a client who just can’t seem to win in the current market.<\/p>\n<p>Start with any listings you had that expired or were pulled from the market. Since you already have an established relationship with the homeowners, these will be the easiest calls to make.<\/p>\n<p>As you mine the MLS for more expireds and withdrawns, you’ll need to double check to ensure they didn’t sell later. It’s time-consuming, but well worth it if something comes up that matches your clients’ wish list.<\/p>\n<p>If you have never pursued expired listings, you’re in for a bit of a shock. Many of the homeowners are angry. Despite the fact that the reason the house didn’t sell typically lies with them, they blame the agent. Since you’re an agent, be prepared to take on their wrath.<\/p>\n<p>It will help to remember &#8211; and to remind the homeowners &#8211; that you aren’t seeking to list the home. You merely want the opportunity to show it to your client, if they are still amenable to selling.<\/p>\n<p>Benefits for the homeowner with an expired or withdrawn listing include:<\/p>\n<ul>\n<li>No massive house cleaning, no staging and no yelling at the kids to pick up after themselves while the house is traditionally marketed.<\/li>\n<\/ul>\n<ul>\n<li>They only need to show the home once, instead of dealing with multiple agents and tons of their clients traipsing through the house for weeks.<\/li>\n<\/ul>\n<ul>\n<li>Your client is fully preapproved for a mortgage and ready to buy (right?).<\/li>\n<\/ul>\n<p>As an added incentive, offer to drop your commission a percent or two. If it helps get the house for your clients, why not? Plus, 4 percent of something is better than 6 percent of nothing.<\/p>\n<h2>FSBO<\/h2>\n<p>Homes being sold “for sale by owner” scare a lot of agents, especially new ones. That stems from the fact that these homeowners get beat up daily by agents calling, wanting to list the house. They have most likely already heard an agent claiming to have a buyer for their house – one method agents use to get their feet in the door.<\/p>\n<p>If the home is absolutely suited for your client, take a deep breath, pick up the phone and risk sounding like a sneaky agent.<\/p>\n<p>One of the best places to find FSBOs is Craigslist.org. Click on “Real Estate for Sale,” under the “Housing” heading. Toward the top of the page you’ll see a link that allows you to narrow the search to houses being sold “By Owner.”<\/p>\n<h2>Use Social Media<\/h2>\n<p>Blog about the frustration of finding homes, and post on Facebook about how hot the market is and how quickly homeowners are selling their homes. Sam DeBord, with Coldwell Banker Danforth in Seattle, found great luck with this technique.<\/p>\n<p>After posting blogs all over the Internet, he got a call from a one-time acquaintance who read one of his posts. “He was surprised that the market had changed so much,” DeBord says. He took the listing.<\/p>\n<p>While you’re doing all this work to locate a home for your clients, don’t neglect counseling them on how to present the best offer in a seller’s market. They need to be low-maintenance, presenting the cleanest offer with the fewest contingencies possible.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>It’s interesting how the media &#8211; an industry that prides itself on presenting breaking news &#8211; lags so far behind our industry when it comes to reporting on housing trends. The almost nationwide shortage of homes for sale is one of those trends that they seemed to have missed completely &#8211; at a time when [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[83],"tags":[37,243,244,245,167,57],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/15201"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=15201"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/15201\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=15201"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=15201"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=15201"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}