{"id":15341,"date":"2013-06-28T20:01:37","date_gmt":"2013-06-28T20:01:37","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=15341"},"modified":"2016-02-05T09:28:52","modified_gmt":"2016-02-05T17:28:52","slug":"3-ways-an-hoa-can-kill-a-deal","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/3-ways-an-hoa-can-kill-a-deal\/","title":{"rendered":"3 Ways an HOA Can Kill a Deal"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-15361\" title=\"3 Ways an HOA can Kill a Deal\" src=\"\/wp-content\/uploads\/2013\/06\/Fotolia_5923782_XS-300x199.jpg\" alt=\"Homeowners associations can pose problems for buyers, so real estate agents need to know what to watch for when dealing with an HOA\" width=\"300\" height=\"199\" \/>If you have ever taken a listing or represented a buyer for a home in a common interest development, you understand how much more work is involved simply because of the homeowners association.<\/p>\n<p>The HOA docs alone can cause steam to flow from your ears: CC&amp;Rs, the budget, meeting minutes and all the rest of the documents that make up the huge stack supplied by the HOA. Getting your buyer client to read and understand these documents is even more challenging.<\/p>\n<p>Even with the most thorough due diligence, however, HOAs have a way of killing some deals, both directly and indirectly.<\/p>\n<h2>Liens<\/h2>\n<p>There are a number of reasons an HOA will levy fines against a homeowner. These reasons vary by state but typically include:<\/p>\n<ul>\n<li>Failure to pay condo fees or HOA dues.<\/li>\n<li>Failure to perform necessary maintenance and repairs.<\/li>\n<li>Legal fees.<\/li>\n<li>Insurance deductibles owed for damage caused to common elements.<\/li>\n<\/ul>\n<p>Collection attempts also vary according to state laws and the effectiveness of the HOA. Many lack the financial resources to continue trying to collect these debts over time. Enter the HOA lien.<\/p>\n<p>Most homeowners associations have the power and the right to attach a lien against a property it governs. In some areas, the lien is recorded to act as public notice of its existence, but not always.<\/p>\n<p>The lien creates a cloud on the title, something all lenders want cleared before agreeing to loan on the property. It may take a bit of sleuthing to learn about liens and other clouds on the title before you make an offer for your client and have access to the HOA docs.<\/p>\n<h2>Litigation<\/h2>\n<p>Whether it’s against the developer, a homeowner or the HOA, litigation is a common problem in common interest developments. Litigation may arise from:<\/p>\n<ul>\n<li>Construction defects.<\/li>\n<li>Personal injury claims.<\/li>\n<li>Discrimination claims.<\/li>\n<li>Negligence.<\/li>\n<\/ul>\n<p>The most common of these involves construction defects, something that will catch the lender’s eye, bringing the entire transaction to a halt. Lenders typically won’t lend until construction defect litigation is concluded, especially if it involves foundation, soil, and other major defects.<\/p>\n<p>Unfortunately, there is no surefire way to determine if the HOA is going through litigation until you read about it in the HOA docs.<\/p>\n<h2>Loan Denied<\/h2>\n<p>The mortgage loan process is probably one of the most intimidating aspects of purchasing a home. Many buyers take the underwriter’s decision &#8211; whether positive or negative &#8211; personally, almost as a validation of their worth as a person.<\/p>\n<p>When it comes to purchasing a home in a common interest development, it’s even worse. “Some lenders can make <a href=\"http:\/\/www.marketwatch.com\/story\/condo-loan-denied-blame-the-building-2012-12-07?mod=wsj_share_tweet\">condo buyers<\/a> with pristine credit feel like rejects,” says AnnaMaria Andriotis on MarketWatch.<\/p>\n<p>Condos are risky business for lenders, for a number of reasons, so they take the time to scrutinize the HOA’s financials. They’re looking at the ratio of owner-occupied to tenant-occupied units, the number of units for sale, and the amount of cash on reserve. How much litigation has the HOA been subjected to and how many cases has it lost? How many homeowners are delinquent on their dues? The latter is of special interest to the lender.<\/p>\n<p>According to Andriotis, no matter how sterling the buyer’s credit and financials, if more than 15 percent of the homeowners in a common interest development are behind on their association fees, it will be “almost impossible” for that client to get a mortgage.<\/p>\n<p>You can count on anything that bears on the capitalization of the HOA being scrutinized when determining whether or not to loan money on a home.<\/p>\n<p>Decades ago, the only things standing between a buyer and the condo of her dreams were the down payment and whether or not the complex was HUD-approved. Obviously, that has all changed.<\/p>\n<p>As a buyer’s agent it’s important to get your hands on the HOA docs as early in the process as possible. Listing agents need to have a detailed discussion with the homeowner before putting the home on the market and fix any issues that may derail a deal.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>If you have ever taken a listing or represented a buyer for a home in a common interest development, you understand how much more work is involved simply because of the homeowners association. The HOA docs alone can cause steam to flow from your ears: CC&amp;Rs, the budget, meeting minutes and all the rest of [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[83],"tags":[246,247,248,249,250,251,252,222],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/15341"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=15341"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/15341\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=15341"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=15341"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=15341"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}