{"id":15421,"date":"2013-07-03T22:54:59","date_gmt":"2013-07-03T22:54:59","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=15421"},"modified":"2021-11-29T15:37:31","modified_gmt":"2021-11-29T23:37:31","slug":"what-are-homebuyers-really-looking-for","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/what-are-homebuyers-really-looking-for\/","title":{"rendered":"What Are Homebuyers Really Looking For?"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-15441\" title=\"What are Homebuyers Looking For?\" src=\"\/wp-content\/uploads\/2013\/07\/Fotolia_53547925_XS-300x225.jpg\" alt=\"Homebuyers may want different things in a home depending on their age, location and other factors\" width=\"300\" height=\"225\" \/>Anyone who has ever worked with even one homebuyer knows what they want:<\/p>\n<ul>\n<li>A decent price &#8211; the lower the better.<\/li>\n<li>A home in move-in condition.<\/li>\n<li>A home in a desirable area.<\/li>\n<li>Assurances that the home’s value will increase.<\/li>\n<\/ul>\n<p>Those are the rudimentary desires of most buyers. Aside from the basics, though, just what are today’s buyers looking for in a home? That depends on several factors, including the region in which the buyer is shopping.<\/p>\n<p>One way to look at what the home shopping public wants is according to demographics.<\/p>\n<p>According to <a href=\"https:\/\/thesocietypages.org\/graphicsociology\/2011\/10\/04\/who-is-the-millennial-generation-pew-research\/\">Pew Research<\/a>, we are broken down into several demographics, depending on the year we were born: millennial, Gen X, baby boomers and the silent generation.<\/p>\n<h2>Millennial Homebuyers<\/h2>\n<p>Millennials, also known as Gen Y, are those Americans born from 1980 to 2003, according to Pew Research. The oldest millennials have hit their 30s, and as boomer offspring, they want to buy houses. They are often lumped together with their older Gen X siblings.<\/p>\n<p>In fact, a recent <a href=\"https:\/\/www.bhgre.com\/\">survey<\/a> conducted by Better Homes &amp; Garden Real Estate says that both of these generations have the same thing at the top of their home shopping list: a smart home, with all the technological bells and whistles possible.<\/p>\n<p>The Better Homes &amp; Garden survey came up with some other results that may surprise you:<\/p>\n<ul>\n<li>Nearly 30 percent of the millennials surveyed said they prefer a “fixer-upper” to a house that requires only a few repairs.<\/li>\n<\/ul>\n<ul>\n<li>Seventy-seven percent of the survey’s respondents said that they prefer a home that is customized to their lifestyle and less “cookie cutter.”<\/li>\n<\/ul>\n<ul>\n<li>A nightmare for future resale value, 43 percent of survey respondents said that they wouldn’t mind transforming their living room into a home theater.<\/li>\n<\/ul>\n<ul>\n<li>More than half of the millennials surveyed place more importance on home technology capability than curb appeal. In fact, 64 percent of them say that they wouldn’t purchase a home if it didn’t offer modern technology capabilities. In order of importance, these include an energy-efficient washer and dryer, a security system and a smart thermostat.<\/li>\n<\/ul>\n<p>When a millennial reaches out to you about one of your listings, understand that he’s been to your website, he has also most likely used a mortgage calculator to determine how much home he can afford, and he has studied the neighborhood. Deal with this generation as savvy, aware individuals and you’ll earn their respect.<\/p>\n<h2>Gen X Buyers<\/h2>\n<p>While there is disagreement over exactly what years encompass the birthdates of Generation X babies, most agree those years are roughly between 1965 and 1979. Children of the baby boomers, this is the generation that is now raising children.<\/p>\n<p>Gen X homebuyers are more likely to purchase a home in the suburbs, according to Pew Research. In fact, according to a study by <a href=\"https:\/\/magid.com\/\">Frank N. Magid Associates<\/a>, Gen Xers consider the suburbs the “ideal place to live.”<\/p>\n<p>A majority of Gen Xers are also looking for larger homes, with room for growing families, according to a study conducted by the <a href=\"https:\/\/www.builderconcepthome2012.com\/\">National Association of Home Builders<\/a>. Other findings from the study include:<\/p>\n<ul>\n<li>Seventy percent of survey respondents said that they would pay up to $5,000 over the value for a green home.<\/li>\n<\/ul>\n<ul>\n<li>Gen Xers want dark wood cabinetry in the kitchen.<\/li>\n<\/ul>\n<ul>\n<li>Survey respondents said they would pay more for a home with a separate tub and shower.<\/li>\n<\/ul>\n<ul>\n<li>Most Gen X homebuyers claimed a preference for a great room over more formal spaces.<\/li>\n<\/ul>\n<p>Finally, the majority of buyers in this generation are looking for a home on a large lot in a suburban development, while only 21 percent of them are seeking a “walkable” neighborhood.<\/p>\n<h2>Baby Boomers<\/h2>\n<p>Between 1946 and 1964, the United States saw the birth of over 76 million babies. In fact, <a href=\"https:\/\/www.history.com\/topics\/world-war-ii\/baby-boomers-video\">historians<\/a> place the exact date of the beginning of this baby boom at nine months after the end of World War II.<\/p>\n<p>The baby boomer generation is so large that marketers typically break it down into two categories: younger boomers, who are now between the ages of 49 to 57, and the so-called “leading-edge” boomers, aged 58 to 67.<\/p>\n<p>A recent <a href=\"https:\/\/www.allstate.com\/tr.aspx\">survey of real estate agents<\/a> who work with boomers found that:<\/p>\n<ul>\n<li>Younger baby boomers prefer a single-family home, and over half of them want to downsize.<\/li>\n<\/ul>\n<ul>\n<li>Leading-edge boomers also want to downsize but are equally split in their desire for a single-family home or a condo or townhouse.<\/li>\n<\/ul>\n<ul>\n<li>Only 25 percent of leading-edge boomers prefer a home in an active adult community.<\/li>\n<\/ul>\n<ul>\n<li>Over three-fourths of the agents surveyed say that their boomer clients either already own or are going to purchase an investment property.<\/li>\n<\/ul>\n<ul>\n<li>All boomers showed a preference for a neighborhood within close proximity to shops and restaurants, healthcare facilities and family.<\/li>\n<\/ul>\n<p>To earn the respect of your boomer client, never talk down to her and avoid typecasting and ageism. This is a vibrant, active group of Americans. Some are still raising families, and most of them intend to continue working past the time their parents retired.<\/p>\n<h2>The Silent Generation<\/h2>\n<p>Born between 1925 and 1945, the members of the silent generation are the group considered “senior citizens.” These are the folks who are now selling their homes to either downsize or move on to assisted living facilities.<\/p>\n<p>RE\/MAX agent Adrian Reed tells the <a href=\"https:\/\/www.csbj.com\/premier\/businessnews\/silent-boom-baby-boomers-and-silent-generation-selling-same-types-of-homes-but-for-different\/article_4ced3908-8493-5ad7-92b1-3d7df57dca16.html\">Colorado Springs Business Journal<\/a> that the silent generation and boomers are selling the same types of homes, but for different reasons.<\/p>\n<p>Between 68 and 88 years old, the silent generation members she counts among her clients are “typically older women who have lost their spouses,” Reed said. Their reasons for selling include:<\/p>\n<ul>\n<li>The house is too large and too difficult to maintain.<\/li>\n<li>Without the spouse’s social security income, the house is too expensive.<\/li>\n<li>Medical reasons.<\/li>\n<\/ul>\n<p>Working with silent generation clients requires patience. They grew up during the Great Depression and World War II and often find it difficult to let go of items, be it something as simple as tchotchkes or as emotionally charged as the home in which they raised their families.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Anyone who has ever worked with even one homebuyer knows what they want: A decent price &#8211; the lower the better. A home in move-in condition. A home in a desirable area. Assurances that the home’s value will increase. Those are the rudimentary desires of most buyers. Aside from the basics, though, just what are [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[83],"tags":[253,254,255,256,257],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/15421"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=15421"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/15421\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=15421"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=15421"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=15421"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}