{"id":16381,"date":"2013-07-11T22:39:48","date_gmt":"2013-07-11T22:39:48","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=16381"},"modified":"2021-11-29T15:30:21","modified_gmt":"2021-11-29T23:30:21","slug":"working-with-international-clients","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/working-with-international-clients\/","title":{"rendered":"Working With International Clients"},"content":{"rendered":"<p>Real estate is local – how many times have we heard that one? Real estate buyers however – especially in certain parts of the country – are increasingly global, and many real estate agents are turning the international real estate client niche into a lucrative living.<\/p>\n<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-16401\" title=\"Working With International Real Estate Buyers\" src=\"\/wp-content\/uploads\/2013\/07\/Fotolia_36500295_XS-300x300.jpg\" alt=\"International real estate buyers can provide lucrative business for real estate agents\" width=\"300\" height=\"300\" \/>Consider this: Foreign buyers spent more than $82 billion dollars on U.S. residential real estate in 2011 and 2012, according to Hispanic Business.<\/p>\n<p>The dollar volume of purchases has declined slightly in the 12 months ending in March of this year, but it’s still a healthy market: $ 68.2 billion, according to the National Association of Realtors® <a href=\"https:\/\/www.nar.realtor\/sites\/default\/files\/2013-profile-of-international-home-buying-activity-2013-06.pdf\">2013 Profile of International Home Buying Activity<\/a>.<\/p>\n<p>Where is all this money coming from? It depends on, again, local markets. NAR claims that most of it is coming from China, Canada, India, the UK and Mexico. Ask a Miami agent, however, and he’ll be shocked that Brazil isn’t on the list.<\/p>\n<p>Speaking of Miami, despite the fact that South Americans are flocking to the city’s luxury condo market, NAR says that most international purchases are for single-family residences. The study also says that the most preferred cities for the foreign buyer are in Florida, California, Arizona, Texas, and New York.<\/p>\n<p>So, how does an agent get her fingers in the international real estate pie? Like most niches, it takes time and requires a system.<\/p>\n<h2>How to Break In<\/h2>\n<p>Choose an area of specialization. “Because of the wide variation in customs, language, geopolitical and procedural considerations involved in serving international customers and clients, international specialists usually specialize in one or two countries, either related by language or belonging to the same global region,” says Coco Waldenmayer, managing broker of  Engel &amp; Völkers in Naples, Fla.<\/p>\n<p>To select a region in the world that you are best suited to serve, Waldenmayer suggests asking yourself the following questions:<\/p>\n<ul>\n<li>Are you attracted to one continent over others?<\/li>\n<\/ul>\n<ul>\n<li>What is your familiarity with one or more other cultures?<\/li>\n<\/ul>\n<ul>\n<li>Does your sphere of influence already include individuals from a certain country?<\/li>\n<\/ul>\n<ul>\n<li>Have you travelled to the region?<\/li>\n<\/ul>\n<ul>\n<li>Do you speak the language?<\/li>\n<\/ul>\n<p>If you don’t speak a foreign language, keep in mind that many international clients come from English-speaking countries. Aside from the United States, the countries with the highest percentage (not number) of English speaking residents are:<\/p>\n<ul>\n<li>Australia<\/li>\n<li>United Kingdom<\/li>\n<li>Ireland<\/li>\n<li>Philippines<\/li>\n<li>Canada<\/li>\n<li>Germany<\/li>\n<\/ul>\n<p>Once you’ve decided on an international farm area, consider obtaining the <a href=\"https:\/\/www.nar.realtor\/education\/designations-and-certifications\/cips-designation\">Certified International Property Specialist<\/a> designation and the <a href=\"https:\/\/cl-qa.nar.realtor\/cipshome.nsf\/pages\/trc\">Trans National Referral Certificate<\/a>, both of which offer exceptional networking opportunities.<\/p>\n<p>Then, get busy with some strategic local networking. Join an ethnic organization, such as the Hispanic Chamber of Commerce or the National Association of Asian American Professionals, provided there is a chapter in your area. Canadian broker Tina Mak, who works with clients from Taiwan and mainland China, tells <a href=\"https:\/\/www.inman.com\/2012\/09\/10\/cashing-in-global-real-estate-clients\/\">Inman News<\/a> that she got her start by becoming active in Asian organizations.<\/p>\n<p>Boca Raton’s Senada Adzem, Director of Luxury Sales with Douglas Elliman, keeps an eye on who is buying what in her city. She tells the story of taking a listing in a building that was popular with Brazilian nationals. To sell it, she reached out to the top agents in Brazil and found an international buyer. She’s also willing to travel to find clients.<\/p>\n<p>“I had a building where three or four people from the Netherlands bought. I thought, ‘the Dutch like this building,’ so I went to Amsterdam,” she laughed.<\/p>\n<h2>Build a Team<\/h2>\n<p>International real estate clients count on you, as a native, to help them navigate the foreign waters of the American real estate process. To provide the best service possible, take the time to build an advisory team that includes key players in international real estate transactions, such as lenders, attorneys and accountants. Ask other agents who specialize in the global real estate market for referrals to the people they use.<\/p>\n<p>Then build your service team. The most important member of this team may be your assistant. If you don’t speak your potential client’s language, hire an assistant who does. Add a handyman, contractors, inspector and any other service providers your client may need to make the transaction as smooth as possible.<\/p>\n<h2>Language and Culture<\/h2>\n<p>“When compared to other investment vehicles, there is a general preference for real estate investment amongst Chinese clients,” Jonathan Cooper tells Inman News. Cooper calls this a “<a href=\"https:\/\/www.inman.com\/2013\/05\/15\/want-chinese-clients-hire-chinese-speaking-agents\/#sthash.ZJLlpTFc.dpuf\">cultural predisposition<\/a>” and goes on to explain some of the reasons behind it.<\/p>\n<p>Are you aware of the cultural predispositions of your international client? It is important to understand the geopolitical drivers behind your client’s desire to purchase properties in the United States as well as what is driving his decision-making process.<\/p>\n<p>To help you, Waldenmayer recommends reading “<a href=\"https:\/\/www.simonandschuster.com\/books\/Kiss-Bow-Or-Shake-Hands\/Terri-Morrison\/Kiss-Bow-or-Shake-Hands\/9781593373689\">Kiss, Bow, or Shake Hands<\/a> (The Bestselling Guide to Doing Business in More than 60 Countries)” by Terri Morrison and Wayne A. Conaway.<\/p>\n<p>She also suggests keeping abreast of issues affecting your clients in their home country by reading one or two magazines and newspapers, covering global affairs and the global economy, weekly.<\/p>\n<p>If you are an agent involved in international real estate, we’d love to hear about your experiences and any wisdom you’d like to share.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Real estate is local – how many times have we heard that one? Real estate buyers however – especially in certain parts of the country – are increasingly global, and many real estate agents are turning the international real estate client niche into a lucrative living. Consider this: Foreign buyers spent more than $82 billion [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[83],"tags":[254,124,258,259,117],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/16381"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=16381"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/16381\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=16381"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=16381"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=16381"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}