{"id":16491,"date":"2013-07-16T18:28:07","date_gmt":"2013-07-16T18:28:07","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=16491"},"modified":"2017-08-10T13:09:11","modified_gmt":"2017-08-10T20:09:11","slug":"what-do-sellers-expect-in-an-agent","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/what-do-sellers-expect-in-an-agent\/","title":{"rendered":"What Do Sellers Expect in an Agent?"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-16531\" title=\"What do Sellers Expect in an Agent?\" src=\"\/wp-content\/uploads\/2013\/07\/Fotolia_50350006_XS-300x300.jpg\" alt=\"Home sellers are looking for specific services from a real estate agent\" width=\"300\" height=\"300\" \/>Aside from selling their houses in the least amount of time for the most money, what do sellers expect from their listing agent? The truth is, many first-time sellers don’t know what to expect, as evidenced by the many queries on real estate portal websites.<\/p>\n<p>The <a href=\"http:\/\/www.realtor.org\/sites\/default\/files\/Highlights-NAR-2012-HBS-2012-11-12.pdf\">National Association of Realtors<\/a>®, however, got to the bottom of the mystery by asking real estate consumers exactly what they want from their agent. Thankfully, every duty is something that agents are uniquely qualified to perform.<\/p>\n<p>Sellers expect their listing agent to:<\/p>\n<ul>\n<li>Sell the home within the seller’s time frame.<\/li>\n<li>Help them market the home.<\/li>\n<li>Secure a buyer for the home.<\/li>\n<li>Assist in the pricing of the home.<\/li>\n<\/ul>\n<h2>Timing<\/h2>\n<p>In 2011, selling the home within a specific time frame was third in importance to sellers. In 2012, it jumped to the number one spot. This may be attributable to another switch in the study: In 2011 the major selling pool came from the baby boomer generation, and in 2012 it was Generation X.<\/p>\n<p>Since members of the younger generation are typically the ones to relocate for a job, and employers typically need the applicant as soon as possible, the need for speed in selling is apparent.<\/p>\n<p>This presents a delicate situation for the agent since, as we all know, the timing of a sale is largely dependent on price. You’ll need to come up with a system of communicating this, in plain English, to your clients.<\/p>\n<p>Sometimes, one simple question will prove to sellers that they need to make a choice when determining a price for their home: “Do you want to sell quickly or for the most money possible?”<\/p>\n<h2>Marketing<\/h2>\n<p>Marketing the home was the top expectation of sellers queried by the NAR in 2011, falling to second place in importance in 2012.<\/p>\n<p>This may be a factor of the improving housing market for sellers, with homes selling a bit quicker than in years past. Whatever the reason, it is still an important requirement when it comes time for homeowners to choose an agent.<\/p>\n<p>The depth and breadth of the marketing expected depends on your client’s experience with selling. More savvy sellers expect a heftier marketing plan. Less experienced sellers won&#8217;t know how the process works and will appreciate you explaining the various elements of your marketing plan to them.<\/p>\n<p>Ensure that the marketing plan you provide at the listing presentation not only covers the basics, but also discusses the type of people who are likely buyers and how you plan on reaching out to those specific people.<\/p>\n<hr \/>\n<p>\n<a href=\"http:\/\/www.marketleader.com\/products\/real-estate-leads\/#HouseValues\"><img class=\"alignleft size-medium wp-image-44201\" src=\"http:\/\/www.marketleader.com\/wp-content\/uploads\/2016\/02\/Blog-CTA-arrows-2.png\" alt=\"Learn more about HouseValues seller leads\"><\/a><strong><em>NEED SELLER LEADS? You don&#8217;t need to manage your own marketing campaigns to find qualified sellers. HouseValues can deliver a guaranteed number of exclusive seller leads each month. <\/em><a href=\"http:\/\/www.marketleader.com\/products\/real-estate-leads\/#HouseValues\">LEARN MORE &gt;&gt;<\/a><\/strong><\/p>\n<hr \/>\n<h2>Find Me a Buyer<\/h2>\n<p>Sure, <em>we<\/em> know that the selling agent is the one who finds the buyer, but try telling that to a first-time homeowner sitting in front of you with big expectations.<\/p>\n<p>It makes no sense to them that your job is to market their home to other agents – they think it should be marketed to the public. In a way, that’s true, but it will typically be another agent who will bring in the buyer.<\/p>\n<p>Beef up your marketing plan to include all the bells and whistles, host a killer broker’s open and network, network, network with other agents.<\/p>\n<h2>Pricing the Home<\/h2>\n<p>The most challenging part of the listing presentation has to be when you tell a homeowner what you think the house is worth on the market. Whether you specify a suggested list price or a price range, the awful feeling that this number will make or break your chance at getting the listing is somewhat universal among new agents. But it’s also something that sellers expect from their agent.<\/p>\n<p>One of the best ways to get around this situation is by finding out how much the seller expects to get for the home. Determining your seller&#8217;s expectation about what his or her home will sell for before you do your pricing research can simplify the process of coming to an agreement with the seller about the best list price.<\/p>\n<p>“As I begin my comparable research, is there a particular property sale you&#8217;d like me to pay special attention to?&#8221; This is the question you should ask, according to Laurie Moore-Moore, author of “Rich Buyer, Rich Seller.” “Chances are they have heard about a neighborhood sale, which they are using as a benchmark for the value of their home,” she continues. Of course, they believe their home is worth much more!”<\/p>\n<p>Knowing what the seller’s benchmark is, whether it is valid or not, helps you in your research. You can now determine the home’s actual market value (which may be different than what the seller thinks it is), decide if the benchmark home is indeed a valid comp, and, if it isn’t, determine a strategy to show the seller why it isn’t. “This allows you to overcome what may otherwise be a silent objection to your suggested list price,” explains Moore-Moore.<\/p>\n<h2>What Else Do They Want?<\/h2>\n<p>Finally, the NAR has determined that sellers expect their agent to have a good reputation, be honest and trustworthy, and have in-depth knowledge of their neighborhood.<\/p>\n<p>Knowing what a seller expects, meeting those expectations, and then following through is the best way to build trust and gain respect &#8211; and also the best way to snag referrals.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Aside from selling their houses in the least amount of time for the most money, what do sellers expect from their listing agent? The truth is, many first-time sellers don’t know what to expect, as evidenced by the many queries on real estate portal websites. The National Association of Realtors®, however, got to the bottom [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[83],"tags":[163,260,87,261,262,263],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/16491"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=16491"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/16491\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=16491"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=16491"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=16491"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}