{"id":16631,"date":"2022-07-19T16:55:34","date_gmt":"2022-07-19T23:55:34","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=16631"},"modified":"2022-11-03T06:41:44","modified_gmt":"2022-11-03T13:41:44","slug":"real-estate-direct-mail","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/real-estate-direct-mail\/","title":{"rendered":"Real Estate Direct Mail: The How-To Guide"},"content":{"rendered":"<p>You can call it physical mail, print mail, snail mail, admail, or direct mail. But whatever you do, don’t call it obsolete.<\/p>\n<p>Real estate direct mail can still be an effective lead generation method. It’s true. Even if it is slow, “old school,” and relatively costly (compared to email).<\/p>\n<p>If you do it the right way, it’s well worth the time, money, and effort it takes to implement a direct mail campaign as part of your <a href=\"https:\/\/www.marketleader.com\/blog\/real-estate-marketing-plan\/\">real estate marketing plan<\/a>.<\/p>\n<h2 class=\"BlogH2\">How Effective Is Direct Mail Marketing In Real Estate?<\/h2>\n<p>As you may have guessed, it depends. Like all other real estate marketing strategies, there’s a bit of skill and know-how involved.<\/p>\n<p>Effectiveness depends on how well an agent can leverage direct mail to generate leads. More specifically, it depends on what you’re mailing to homeowners and whether it targets their needs.<\/p>\n<p>When they’re done poorly, direct mail pieces from agents aren’t “direct” at all. They’re just pieces of junk mail.<\/p>\n<p>But as many top-performing agents would say, with a solid strategy and <a href=\"https:\/\/www.marketleader.com\/solutions\/marketing-automation\/\">the best marketing tool<\/a>, real estate direct mail pieces can certainly yield positive results year after year.<\/p>\n<p>Here’s why.<\/p>\n<h3 class=\"BlogH3\">Direct Mail Gets Noticed<\/h3>\n<p>In other words, the reach of real estate direct mail tends to be highly focused because it simply has less to compete with than other mediums, such as email.<\/p>\n<p>For example, a <a href=\"https:\/\/www.usps.com\/business\/promotions\/direct-mail-brochure.pdf\">recent report<\/a> indicated that the average household receives about 150 emails per day, whereas that same household might receive only about two pieces of direct mail per day. And you’ll never have to worry about your mail getting silenced by spam filters.<\/p>\n<h3 class=\"BlogH3\">Direct Mail Has Staying Power<\/h3>\n<p>Your messages won’t be stuffed somewhere in their email inbox. Instead, they’re often left out in the open on countertops, fridges, or coffee tables where more people than just the intended recipient can notice them. That’s perhaps especially true for marketing pieces like postcards and <a href=\"https:\/\/www.marketleader.com\/blog\/real-estate-newsletter-marketing-tips\/\">real estate newsletters<\/a>.<\/p>\n<h3 class=\"BlogH3\">Direct Mail Can Be… Direct!<\/h3>\n<p>That’s the whole point, right?<\/p>\n<p>Whenever recipients respond to a direct mail piece, it’s most likely because the piece was laser-focused. It spoke directly to some aspect of their life.<\/p>\n<p>Like a postcard from a car dealership, for example, offering a maintenance special for the owner of a Nissan Sentra with over 125,000 miles to people who just so happen to own that very car with that many miles. The recipient is much more likely to respond than someone in the general population because the sender took the time to identify their audience and tailor a message specifically to them.<\/p>\n<h2 class=\"BlogH2\">What to Mail<\/h2>\n<p>There are five main types of real estate direct mail pieces that agents use to <a href=\"https:\/\/www.marketleader.com\/products\/real-estate-leads\/\">generate seller leads<\/a>.<\/p>\n<ul>\n<li>Newsletters<\/li>\n<li>Flyers<\/li>\n<li>Postcards<\/li>\n<li>Handwritten notes<\/li>\n<li>Informational brochures<\/li>\n<\/ul>\n<p>But it isn’t enough to deliver these kinds of pieces blindly and hope for the best. You have to know how to do it in way that will yield positive results.<\/p>\n<h2 class=\"BlogH2\">How To Get the Results You Want From Direct Mail<\/h2>\n<h3 class=\"BlogH3\">Develop a Plan<\/h3>\n<p>Be intentional. Each type of seller requires a different approach. Even if you plan on including all of them in your campaign, you’ll need to start with just one.<\/p>\n<p>Start by asking yourself a series of questions that will help you determine who you’ll target. This is the most important step in planning your direct mail campaigns.<\/p>\n<p>For example:<\/p>\n<ul>\n<li>Who (exactly) am I trying to reach?<\/li>\n<li>Why do I want to reach that particular segment?<\/li>\n<li>What needs do they have?<\/li>\n<li>What is it that only I can offer them?<\/li>\n<li>What kind of mail piece would they actually read?<\/li>\n<li>How will my mail piece benefit them?<\/li>\n<\/ul>\n<p>As you think through these kinds of questions, go deep and try to be as specific as you can.<\/p>\n<p>Once you’ve identified your target audience and thought through the specific angles you could take, you’re ready for the goal-setting stage. Be sure to set S.M.A.R.T. goals – the kind that are specific, measurable, attainable, relevant, and time-bound.<\/p>\n<p>Setting goals allows you to gauge your success so you can refine and iterate as you go. Over time, you’ll learn what works best for your specific audience. And exclusive data like that gives you a significant advantage over your competitors.<\/p>\n<h3 class=\"BlogH3\">Personalize Your Message<\/h3>\n<p>Let’s be honest. If you were in their shoes and you received a generic ad from a real estate agent you didn’t know, you’d probably toss it in the trash with the rest of the day’s junk mail.<\/p>\n<p>It doesn’t have to be that way. You can stand out.<\/p>\n<p>Again, this is one of the main advantages of direct mail. It allows you to tailor your message in a way that’s perfectly suited for the prospect or lead and their situation.<\/p>\n<p>Let’s say, for example, you decided to go after expired listings. Make a list of the problems and needs of this seller pool.<\/p>\n<p>You know they had to be motivated to sell the home at some point. What happened? Why did the listing expire, and why didn’t they try again? You might come up with reasons like the following:<\/p>\n<ul>\n<li>The price was too high for the current market.<\/li>\n<li>The agent didn’t market the listing.<\/li>\n<li>They’re tired and discouraged.<\/li>\n<li>The house has problems.<\/li>\n<\/ul>\n<p>With these ideas in mind, it’ll be much easier to decide a) what format to use for your direct mail piece, and b) how you need to craft the marketing copy and content to speak directly to their needs.<\/p>\n<p>Here are a few tips.<\/p>\n<ul>\n<li><strong>Mention their specific problem, desire, or need as soon as possible.<\/strong><br \/>\nRemember the car dealership example from earlier? The marketing department anticipated that the owner of a Nissan Sentra with over 125,000 miles on the odometer would most likely be concerned with maintenance. So what about FSBOs, for instance? What are some of the problems they face? Are absentee owners curious about the local real estate market and how their investment is doing? Keep asking these kinds of questions and choose something relevant as your starting point to get them to read on.<\/li>\n<li><strong>Let them know there’s a solution to the problem and that you can provide it.<\/strong><br \/>\nBut be careful. This part requires a bit of finesse or else you’ll sound too pushy. Think less about “selling yourself” and more about drawing attention to the simple fact that you have what they’re looking for.<\/li>\n<li><strong>Provide a call to action and your contact information.<\/strong> Entice them with a “no obligation” offer if they call you within a certain time limit. Maybe that’s a free market analysis, a probate report, or some other piece of content that is relevant to the homeowner.<\/li>\n<\/ul>\n<p>You’ve gone through the whole process of planning, designing, and sending. Now’s not the time to give up or sit back and wait for the calls to come in. Two important steps remain.<\/p>\n<h3 class=\"BlogH3\">Monitor Your Progress<\/h3>\n<p>Be sure to track and analyze the results of each direct mail campaign. Develop a system for noting what worked well, what didn’t, and specific ways you could improve. Collecting that kind of data makes goal-setting (and goal-crushing) possible. Without it, there’s nothing to build on, which means each new campaign will start from scratch, forcing you to rely on good guesses and a bit of luck.<\/p>\n<h3 class=\"BlogH3\">Following Up Is Essential<\/h3>\n<p>Did you get any responses?<\/p>\n<p>If you didn’t get a response, don&#8217;t despair. Persistence is key. The first rule of direct mail marketing in real estate is to keep hitting your leads with mailers – you&#8217;ll stay top of mind, and therefore be the person they reach out to when they decide it&#8217;s time to buy or sell.<\/p>\n<p>If you did get a response, congratulations! Anyone who responded is now a lead, and lead nurturing is a crucial part of direct mail marketing in real estate. Whenever you get leads – whether they come from your direct mail efforts or any other channel – you must respond quickly and prove your value as soon as you can. <a href=\"https:\/\/www.marketleader.com\/blog\/10-tips-for-successfully-responding-to-real-estate-leads\/\">Here are 10 tips for successfully responding to leads of any kind.<\/a><\/p>\n<h2 class=\"BlogH2\">Real Estate Direct Mail &amp; Marketing Automation<\/h2>\n<p>While marketing is one of the most important disciplines of a successful small business, as a real estate agent your time is better spent networking, pounding the pavement, and making personal connections with leads and clients.<\/p>\n<p>That’s why having real estate marketing automation tools is a must.<\/p>\n<p>Look for software that’s both easy to use and comprehensive. It should be a system that allows you to combine campaigns so you can integrate your drip email campaign with your direct mail campaign, for example. Just like giant companies which create omni-channel brand experiences, agents can leverage combining multiple channels to increase their reach – and revenue.<\/p>\n<p>You can do it all with Market Leader’s fully integrated marketing suite. It’s like having the power of an expert real estate marketing team behind you.<\/p>\n<p><a class=\"et_pb_more_button et_pb_button blueBTN\" href=\"\/solutions\/marketing-automation\/\">Lead More<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>You can call it physical mail, print mail, snail mail, admail, or direct mail. But whatever you do, don’t call it obsolete. Real estate direct mail can still be an effective lead generation method. It’s true. Even if it is slow, “old school,” and relatively costly (compared to email). If you do it the right [&hellip;]<\/p>\n","protected":false},"author":33,"featured_media":61721,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[34,48],"tags":[101,264,265,87,143,169,266],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/16631"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/33"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=16631"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/16631\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media\/61721"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=16631"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=16631"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=16631"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}