{"id":16751,"date":"2013-07-24T20:00:05","date_gmt":"2013-07-24T20:00:05","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=16751"},"modified":"2016-01-30T01:54:29","modified_gmt":"2016-01-30T01:54:29","slug":"a-tale-of-two-agents","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/a-tale-of-two-agents\/","title":{"rendered":"A Tale of Two Agents &#8211; The Importance of Lead Generation"},"content":{"rendered":"<p>Here’s a hypothetical lead generation situation for you. At the beginning of 2013, two agents, Productive Penelope and Struggling Steve, set their annual income commission goal at $100,000. This is a lofty goal &#8211; <a href=\"http:\/\/www.realtor.org\/reports\/member-profile\">more than twice <\/a>the median gross income earned by National Association of Realtors® members in 2012 &#8211; but these two ambitious agents have their hearts and minds set on achieving it.<\/p>\n<p>As their names suggest, the two agents experienced drastically different levels of success during the first six months of the year.<br \/>\n<img loading=\"lazy\" class=\"aligncenter size-full wp-image-16781\" title=\"A_Tale_of_Two_Agents_Infographic\" src=\"\/wp-content\/uploads\/2013\/07\/A_Tale_of_Two_Agents_Infographic.jpg\" alt=\"Real estate lead generation infographic - the importance of maintaining a large lead pipeline\" width=\"600\" height=\"1413\" \/><\/p>\n<h2>The Importance of Proactive Lead Generation<\/h2>\n<p><em>The numbers found below come from Market Leader’s <\/em><a href=\"http:\/\/www.marketleader.com\/landing\/lead_calculator?lsr=leadcalculator-MLBlog\"><strong><em>Reverse Lead Calculator tool<\/em><\/strong><\/a><em>. If you are unsure about your lead generation needs or what lead mix you should pursue, take a couple of minutes to check out this tool.<\/em><\/p>\n<p><strong><img loading=\"lazy\" class=\"alignright  wp-image-16851\" title=\"Realtor lead generation\" src=\"\/wp-content\/uploads\/2013\/07\/successful-female-real-estate-agent-300x201.jpg\" alt=\"This agent is adept at generating leads from Craigslist, social media, paid sources and referrals\" width=\"270\" height=\"181\" \/>Penelope started the year by generating leads and closing deals right away.<\/strong> Over the first six months of 2013, she generated a whopping 480 leads and closed deals on 12 homes. Penelope was able to achieve this phenomenal level of success because she understands the importance of developing and maintaining a large pipeline of leads from a variety of sources (Craigslist, referral and so on). Even when she is closing deals hand over fist, she makes sure a steady stream of leads are entering her pipeline so that they eventually turn into more transactions in the average six months real estate leads require to convert.<\/p>\n<p><strong><img loading=\"lazy\" class=\" wp-image-16841 alignleft\" title=\"Struggling real estate agent\" src=\"\/wp-content\/uploads\/2013\/07\/dumb_man-300x300.jpg\" alt=\"This real estate agent has done a poor job generating leads\" width=\"202\" height=\"202\" \/>Steve, on the other hand, had a far less successful first half of the year.<\/strong> He generated a paltry 40 leads during the entire six-month stretch and only managed to sell a single home! Steve is a smart and capable agent, so he doesn’t understand why he isn’t raking in thousands of dollars from commissions. His issues ultimately stem from the low volume of leads he generated during the first half of 2013. Steve failed to realize that <em>even the best agents fail to convert the vast majority of their leads into completed transactions<\/em>, and was thus overly confident in his ability to close deals with what few he had.<\/p>\n<p>To reach her commission income goal by the end of the year, Penelope needs to sell 11 more homes and generate 74 leads each month. Steve, on the other hand, has an extremely busy six months ahead of him. He needs to sell a staggering 21 more homes and generate 140 leads every month!<\/p>\n<p>Fortunately, both agents’ lead generation requirements are attainable with the right lead mix. According to the findings of a 2012 Hebert Research study, these two ambitious agents need the following lead mix each month for the rest of 2013:<\/p>\n<p><strong>Penelope:<\/strong><\/p>\n<ul>\n<li>Craigslist: 32<\/li>\n<li>Referral: 3<\/li>\n<li>Social media: 8<\/li>\n<li>Paid: 31<\/li>\n<\/ul>\n<p><strong>Steve:<\/strong><\/p>\n<ul>\n<li>Craigslist: 60<\/li>\n<li>Referral: 6<\/li>\n<li>Social media: 16<\/li>\n<li>Paid: 58<\/li>\n<\/ul>\n<p>With hard work and savvy lead generation, both Productive Penelope and Struggling Steve will be able to reach their commission income goal!<\/p>\n<h2>Habits of Highly Effective Real Estate Agents<\/h2>\n<p><img loading=\"lazy\" class=\"wp-image-16801 alignright\" title=\"Successful real estate agent\" src=\"\/wp-content\/uploads\/2013\/07\/successful-real-estate-agent-200x300.jpg\" alt=\"These are the habits of highly successful real estate agents, those that make $100,000 or more a year\" width=\"162\" height=\"243\" \/>The question begs to be asked: What separates the <strong>successful real estate professionals <\/strong>(earning <strong>$100,000 or more<\/strong> each year) from their <strong>unsuccessful counterparts<\/strong> (earning <strong>less than $35,000<\/strong> a year)?<\/p>\n<p>The tools real estate professionals use are perhaps the biggest differentiator. Agents who have diverse lead generation methods &#8211; from paid Internet advertising to their personal IDX-enabled website &#8211; and effective ways to stay top of mind with their existing leads (e.g., email newsletters) and track their information (e.g., a customer relationship manager tool) tend to close the most transactions.<\/p>\n<p>Continue reading to learn about the tools successful real estate agents employ.<\/p>\n<h3>Customer Relationship Manager<\/h3>\n<p>Every agent needs a large pipeline of leads. Great agents know they need a customer relationship manager (CRM) to keep track of all of them. Due to the value offered by their many practical functions, the best Realtors® are <strong>87 percent more likely to use a CRM<\/strong>.<\/p>\n<h3>Internet Advertising<\/h3>\n<p>The vast majority of consumers start the homebuying or selling process online. Smart Realtors® know that one of the best ways to accumulate both homebuyer and seller leads in this Internet-dominated age is to capture them through paid Internet advertising services like Google AdWords and Bing Ads. Unsurprisingly, the most successful agents are <strong>175 percent more likely to use Internet advertising<\/strong> to keep a steady stream of leads coming into their pipeline.<\/p>\n<h3>Email Newsletters<\/h3>\n<p>There is perhaps no better way to keep your business on the tops of potential clients’ minds than through the use of email drip campaigns. This fact is not lost on the most successful real estate professionals, who are <strong>54 percent more likely to use email newsletters<\/strong> than their unsuccessful counterparts.<\/p>\n<h3>IDX-Enabled Websites<\/h3>\n<p>There are a whole slew of reasons why consumers visit agent websites, but at the end of the day, the listings they find there are the most important ones. Chad Hyams, a real estate speaker and trainer, believes that IDX listing feeds aren’t just important &#8211; they’re absolutely necessary! &#8220;If your website doesn&#8217;t have an IDX feed, it&#8217;s a bad website,” he said during a recent IMSD webinar. “Throw it away immediately.”<\/p>\n<p>The Realtors® who close the most transactions obviously agree with Chad, as they are <strong>54 percent more likely to use an IDX-enabled website<\/strong> than Realtors® who only close a few transactions.<\/p>\n<h3>Online Video<\/h3>\n<p>Sometimes conventional listing information &#8211; number of bedrooms and bathrooms, square footage and neighborhood amenities &#8211; does not satisfy the curiosity of homebuyers viewing agent websites. Consumers frequently want to learn more about homes by taking virtual tours from the comfort of their home computers. This is why successful agents are <strong>78 percent more likely to use online video<\/strong> than less successful ones.<\/p>\n<h3>Assistants<\/h3>\n<p>Real estate professionals tend to be overbooked and overworked. It’s hard to find enough time to set up appointments, manage websites, and respond to client emails when there are showings to attend and marketing campaigns to create. This is where assistants come in handy; they can complete the myriad small tasks their employers simply cannot find enough time for. The most successful Realtors® understand that extra help around the office is worth the added expense; as such, they are <strong>153 percent more likely to use an assistant<\/strong>.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Here’s a hypothetical lead generation situation for you. At the beginning of 2013, two agents, Productive Penelope and Struggling Steve, set their annual income commission goal at $100,000. This is a lofty goal &#8211; more than twice the median gross income earned by National Association of Realtors® members in 2012 &#8211; but these two ambitious [&hellip;]<\/p>\n","protected":false},"author":28,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[34],"tags":[190,154,37,267,44,268,269,54,270,56,187,136],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/16751"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/28"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=16751"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/16751\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=16751"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=16751"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=16751"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}