{"id":16941,"date":"2013-07-26T15:55:32","date_gmt":"2013-07-26T15:55:32","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=16941"},"modified":"2021-11-16T11:34:05","modified_gmt":"2021-11-16T19:34:05","slug":"am-i-going-to-meet-my-goals-for-2013","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/am-i-going-to-meet-my-goals-for-2013\/","title":{"rendered":"Am I Going to Meet My Goals for 2013?"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-16961\" title=\"Will You Meet Your Goals for 2013?\" src=\"\/wp-content\/uploads\/2013\/07\/Fotolia_51241438_XS-287x300.jpg\" alt=\"A mid-year review can help real estate agents evaluate their goals and adjust their business plans\" width=\"287\" height=\"300\" \/>We’ve passed the halfway mark of 2013 and it’s time to revisit the goals you set back at the end of 2012. Reviewing your completed deals, potential deals and your pipeline’s status at this point in the year will help you determine where you are and how to get back on track if you’ve lost your way.<\/p>\n<h2>Business Plan<\/h2>\n<p>If you didn’t create a business plan for 2013, now is the time to get it done – better late than never, right? A business plan is your road map to reaching your goals for the year. Without one, you’re lost, with no idea of the strategies and processes required to understand what you’re doing, what you need to focus on and where you need to work harder and smarter.<\/p>\n<p>Market Leader’s 2013 Real Estate Business Plan is the ideal place to start, even if it is mid-year. The worksheets that help agents pinpoint the number of transactions they’ll need this year to meet their financial goals are easily adapted to a mid-year review. Check out our <a href=\"https:\/\/www.marketleader.com\/leadcalculator\/\">Lead Calculator<\/a> to determine how many leads you’ll need to hit your goals next year.<\/p>\n<p>Whichever you choose, knowing where you want to be at the end of 2013 and where you are right now will help you determine if you’re off track.<\/p>\n<h2>Evaluation<\/h2>\n<p>Treat your mid-year business evaluation as you would evaluate a corporate employee. Leave emotions out of the equation and take a cold, hard look at the numbers.<\/p>\n<p>Looking at where you are right now, is the goal you set at the beginning of the year realistic? If not, you may want to adjust the goal to be more in line with current reality and what you can realistically accomplish during the remainder of 2013.<\/p>\n<p>Where did your clients come from? Figure that out and then ramp up your marketing efforts to focus on the area that has historically brought more clients.<\/p>\n<p>Which marketing channels have given you the most bang for the buck? Focus only on the ones that give you the largest return on your investment.<\/p>\n<p>Take a look at your website and determine if there are areas that need improvement to help attract more clients. You might want to enlist others who can provide you with a constructive evaluation of your website’s strengths and weaknesses.<\/p>\n<h2>Tools<\/h2>\n<p>Frank Lloyd Wright said, “An architect’s most useful tools are an eraser at the drafting board and a wrecking ball at the site.”<\/p>\n<p>While the wrecking ball is best saved for the end of a year in which one hasn’t met her goals, that eraser might come in real handy during this mid-year review. This is the ideal time to evaluate the tools you use in your business and erase those that just aren’t helping you get the job done.<\/p>\n<p>When evaluating each tool you use in your business, consider the following:<\/p>\n<ul>\n<li>Does it streamline your business?<\/li>\n<\/ul>\n<ul>\n<li>Does it help you reduce costs, such as for marketing?<\/li>\n<\/ul>\n<ul>\n<li>Is it time to update or upgrade?<\/li>\n<\/ul>\n<h2>Getting Back on Track<\/h2>\n<p>Getting out of the rut and back on track to meet your goals requires taking concrete steps. Here are a few things to consider implementing if they aren’t already part of your business plan:<\/p>\n<ul>\n<li>Set specific goals to get yourself back on the road to a full pipeline. Instead of the overall goals you established at the end of last year, these need to be specific, such as, “Get three new buyers or three new listings in the next month.”<\/li>\n<\/ul>\n<ul>\n<li>Work on ways to obtain those goals. Ways to get quick listings include FSBOs, expired listings and withdrawn listings. Do floor time to pick up some buyers.<\/li>\n<\/ul>\n<ul>\n<li>Think about longer-term business and how to keep filling the funnel. One way of doing this is by becoming more visible in the community by joining a local non-profit, volunteering or sponsoring local youth athletic teams. Another way is to develop a farm area and start sending a market-specific newsletter. Establish yourself as the expert in those neighborhoods.<\/li>\n<\/ul>\n<p>Figuring out you’ve fallen off the goal wagon mid-year sure beats figuring it out when it’s too late – at the end of the year. It gives you time to take a look at what has worked for you over the past few months so you can continue those activities while you get rid of anything that hasn’t proven to be effective.<\/p>\n<p>Most of all, you still have time to focus your energy on attainable goals: finding buyers and sellers who need to buy and sell right now.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>We’ve passed the halfway mark of 2013 and it’s time to revisit the goals you set back at the end of 2012. Reviewing your completed deals, potential deals and your pipeline’s status at this point in the year will help you determine where you are and how to get back on track if you’ve lost [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[97],"tags":[91,106,94,271,87,199,272,273],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/16941"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=16941"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/16941\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=16941"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=16941"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=16941"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}