{"id":17041,"date":"2013-07-30T10:00:25","date_gmt":"2013-07-30T10:00:25","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=17041"},"modified":"2016-02-02T00:22:30","modified_gmt":"2016-02-02T00:22:30","slug":"rebuilding-your-database-the-hiatus-effect","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/rebuilding-your-database-the-hiatus-effect\/","title":{"rendered":"Rebuilding Your Database &#8211; The “Hiatus” Effect"},"content":{"rendered":"<p>Sometimes, often involuntarily, we leave our real estate business for a period of time. It might be for a domestic event or childbirth, an economic downturn, a serious illness, or many other reasons. If we leave long enough, our business model goes to shambles, our carefully crafted ad campaigns lie fallow, and we wind up virtually starting over.<\/p>\n<h2>Reach Out to Prospects<\/h2>\n<p>Two things are crucial: reinvigorating your existing database into a dynamic interactive platform, and generating new leads. We all have some database, but now we need to talk to it &#8211; and have it talk back! Seek out a community you would like to have as a farm area, and set up a newsletter or postcard campaign. Send your mailers to your existing database and your new farm area (which you’ve chosen because it has good turnover and no dominance by one or two agents).<\/p>\n<h2>Get Personal With Prospective Clients<\/h2>\n<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-17061\" title=\"Real estate prospects\" src=\"\/wp-content\/uploads\/2013\/07\/networking-300x211.jpg\" alt=\"Build up your network of prospects when your lead database gets low\" width=\"300\" height=\"211\" \/>Next, send your “warm” existing database a personal note with the mailer, such as, &#8220;Hi Joyce, please keep me in mind if any of your friends have real estate questions or needs.&#8221; It takes time, but personalized mailers do elicit responses. Take the time to re-establish that relationship. There’s nothing better than a good referral of a buyer or seller, and these are often the hardest to get. Your client is aware of the referral’s needs, but may be reluctant to broach the subject unless asked. It’s up to you to emphasize that you can be of service.<\/p>\n<p>Also, make sure there’s nothing stopping your former client from referring you &#8211; perhaps you fell a bit short somewhere. Find out what you could have done better so that you can instill trust and provide better service the next time around.<\/p>\n<h2>Generate New Leads<\/h2>\n<p>The next part is harder: how to generate new leads? You’ve probably depleted your finances a bit, so it’s time to be creative. Craigslist has traditionally been a good source of leads, but is more challenging now due to so many agents posting listings. You may have to put more work into each contact you create; you will likely need five to 10 simple ads per day, and good follow-up and tracking. If you have no listings, copy a HUD listing from the MLS and advertise that. There’s a bit of work involved, but there are buyers and sellers there.<\/p>\n<h3>Flex Your Social Media Muscles<\/h3>\n<p>Another good avenue is Twitter. Concentrate on good content without personal items; just post information your reader may use or retweet. Add a link so the reader can explore the topic. Facebook has the same potential to reach a wide audience. Make sure your Twitter and Facebook accounts are linked so that your posts appear on both.<\/p>\n<h3>Update Your Website<\/h3>\n<p>Keep your website current: Change out stats as needed, add your latest newsletter, tweak your text, and just detail it a bit. Often this is the client’s first port of call, and you may sink or swim on that first impression.<\/p>\n<h3>Update or Acquire a Lead Generation System<\/h3>\n<p>Now that you’re slowly emerging from your “hiatus,” you will have to go a little further and come up with a better lead generation system. It will cost a bit of money, no avoiding that, but once you have the first sale from this, you will feel better.<\/p>\n<p>The best advice I can give is to remember who the client is, and always put his or her interests first. Then give a little bit extra. Sometimes you may be loathe to do that, but keeping a good relationship is a lot easier than establishing a new one. I’m using this as my new mantra, and it’s starting to yield some results.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Sometimes, often involuntarily, we leave our real estate business for a period of time. It might be for a domestic event or childbirth, an economic downturn, a serious illness, or many other reasons. If we leave long enough, our business model goes to shambles, our carefully crafted ad campaigns lie fallow, and we wind up [&hellip;]<\/p>\n","protected":false},"author":33,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[34],"tags":[190,181,17,126,208,56,18,136],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/17041"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/33"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=17041"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/17041\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=17041"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=17041"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=17041"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}