{"id":17181,"date":"2013-08-01T19:14:15","date_gmt":"2013-08-01T19:14:15","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=17181"},"modified":"2021-11-16T11:38:13","modified_gmt":"2021-11-16T19:38:13","slug":"how-to-impress-on-a-listing-presentation","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/how-to-impress-on-a-listing-presentation\/","title":{"rendered":"How to Impress During a Listing Presentation"},"content":{"rendered":"<p>You only have one chance to create a <a href=\"https:\/\/www.princeton.edu\/news\/2006\/08\/22\/snap-judgments-decide-faces-character-psychologist-finds?section=topstories\">good first impression<\/a>. That chance lasts 100 milliseconds, according to Princeton University researchers. In a study of 200 volunteers, psychologist Alex Todorov and Janine Willis, a student researcher, found that people judge a face to be trustworthy or not in one-tenth of a second.<\/p>\n<p>Knowing this, and knowing that homeowners typically only spend one day interviewing listing agents, puts the pressure on to make your listing presentation massively impressive.<\/p>\n<h2>Presentation Groundwork<\/h2>\n<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-17201\" title=\"How to Impress on a Listing Presentation\" src=\"\/wp-content\/uploads\/2013\/08\/Fotolia_53201895_XS-200x300.jpg\" alt=\"Real estate agents need to be prepared in order to impress homeowners during a listing presentation\" width=\"200\" height=\"300\" \/>Whether you prefer the one-step or the two-step listing presentation, the original phone call from a homeowner is the place to gather as much information as possible about the homeowner and the house.<\/p>\n<p>The National Association of Realtors® suggests you have a list of questions at the ready when a prospect calls you about the possibility of listing her house. Some of the suggested questions include:<\/p>\n<ul>\n<li>How did you hear about me\/who referred you?<\/li>\n<\/ul>\n<ul>\n<li>Why are you selling?<\/li>\n<\/ul>\n<ul>\n<li>When do you need to sell?<\/li>\n<\/ul>\n<ul>\n<li>Do you have a price in mind?<\/li>\n<\/ul>\n<ul>\n<li>What can you tell me about your home? Any renovations, additions, major repairs?<\/li>\n<\/ul>\n<ul>\n<li>What makes your home stand out from your neighbors’ homes?<\/li>\n<\/ul>\n<ul>\n<li>Would it be possible for all decision-makers to be present to meet with me?<\/li>\n<\/ul>\n<p>Your next step is to visit every home in the seller’s area that is on the market and at least do a drive-by of sold listings you’ll be using as comps. As you know, it’s difficult to include everything about a listing in the word-count-challenged template provided by the MLS. Touring the homes is the best way to ensure that you’re aware of all of the differences and similarities.<\/p>\n<p>If you work in one particular farm area, get to know it intimately before you take a listing by visiting every home that comes on the market.<\/p>\n<p>“I go through every house that comes on the market so that I’m not just looking at comps on paper,” says leading luxury agent <a href=\"http:\/\/www.davidkean.com\/index.html\">David Kean<\/a> of Teles Properties in Beverly Hills.<\/p>\n<p>“I have actually been through each house, and I know the layout; I know if there’s a telephone pole blocking the view,” he concludes.<\/p>\n<p>By this point you should have enough information to compile the CMA for your new listing.<\/p>\n<h2>The Presentation<\/h2>\n<p>There isn’t one right way to give a listing presentation, but there are a number of wrong ways. Whether you use your laptop or a bound presentation, watch out for these deal killers:<\/p>\n<ul>\n<li><strong>Inappropriate body language:<\/strong> Not maintaining eye contact, or looking down, especially while making an important point, makes you appear unsure of what you’re saying. Leaning away from the prospect makes you seem disinterested or impatient. Engage with the homeowner, ask probing questions and maintain eye contact.<\/li>\n<\/ul>\n<ul>\n<li><strong>More than one agent is overkill:<\/strong> Two agents showing up for a listing presentation is beyond overkill. It smacks of a hard sell and may overwhelm the homeowner. It’s great that you’re a member of a team, but only one of you should go on the listing presentation.<\/li>\n<\/ul>\n<ul>\n<li><strong>Not preparing:<\/strong> Unless you make listing presentations on a daily basis, rehearse what you’ll say before you arrive at the seller’s home. Real estate coach Craig Proctor suggests that a <a href=\"https:\/\/craigproctorsuccesswebsite.com\/bulletproof-listing-presentation\/\">good listing presentation<\/a> is like a good book, with a “beginning, middle and end, and like a book, your presentation should tell a story.” Engage the homeowner by asking questions, smiling, explaining and guiding.<\/li>\n<\/ul>\n<ul>\n<li><strong>Not taking notes:<\/strong> Whether you truly need to remember what the homeowner is telling you or not, asking questions and then taking notes while the homeowners answer the questions instills in them a sense of confidence that you are listening and that what they are saying is important to you.<\/li>\n<\/ul>\n<p>So many agents fall into the trap of thinking the CMA is the listing presentation. It doesn’t matter how much you dress it up, how many technical bells and whistles you add to it – if you aren’t presenting yourself impressively, you won’t get many listings.<\/p>\n<p>Many decades ago a wise real estate agent claimed that “if you list, you last.” That may be true, but it says nothing about that incredible feeling you get when you walk out of a homeowner’s house knowing you rocked that listing presentation.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>You only have one chance to create a good first impression. That chance lasts 100 milliseconds, according to Princeton University researchers. In a study of 200 volunteers, psychologist Alex Todorov and Janine Willis, a student researcher, found that people judge a face to be trustworthy or not in one-tenth of a second. Knowing this, and [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[34],"tags":[126,240,274,208],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/17181"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=17181"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/17181\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=17181"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=17181"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=17181"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}