{"id":17301,"date":"2013-08-05T16:22:21","date_gmt":"2013-08-05T16:22:21","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=17301"},"modified":"2016-02-05T09:26:05","modified_gmt":"2016-02-05T17:26:05","slug":"agent-spotlight-audrey-monson-of-salt-lake-city-utah","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/agent-spotlight-audrey-monson-of-salt-lake-city-utah\/","title":{"rendered":"Agent Spotlight: Audrey Monson of Salt Lake City, Utah"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"size-medium wp-image-17311  alignright\" title=\"Agent Spotlight - Audrey Monson\" src=\"\/wp-content\/uploads\/2013\/08\/Audrey-Monson-240x300.jpg\" alt=\"Audrey Monson is a real estate agent in Salt Lake City, Utah\" width=\"240\" height=\"300\" \/>Nobody knows an area better than a local &#8211; someone who was born and raised there. <a href=\"http:\/\/audreymonsonrealestate.com\">Audrey Monson<\/a>, with Coldwell Banker in Salt Lake City, Utah, is an area expert &#8211; both as a local and as a former real estate investor.<\/p>\n<p>Although she dreamed of becoming an actress as a child, she spent 25 years in the legal field, working her way up from legal secretary to legal administrator. What’s that, you ask? “I supervised the staff and managed the facilities,” Monson explains. “It was a big, big job.”<\/p>\n<p>At the same time, she and her husband were buying and selling properties, by-owner. “It was before flipping became a bad word,” she says. “We would buy them at auction and fix them up. They were beautiful when we were done, and we’d sell them, and we were doing pretty well at that.”<\/p>\n<p>They did so well, in fact, that the last home, out of 20 in total, sold for more than her annual salary at the law firm.<\/p>\n<p>“I remember thinking, ‘Why am I killing myself?’ I figured that if we did a couple of these a year, I could quit working.” Instead of quitting work altogether, though, she decided to get her real estate license.<\/p>\n<p>“I actually took a vacation from the law firm, and I went through all of the classes, and I got my license quite quickly,” Monson says. “I stayed at the law firm for another couple of months and then left to start my career in real estate. I’ve been an agent for nine years now.”<\/p>\n<p>I asked Monson what her biggest challenge is at this point in her career.<\/p>\n<p>“I think the biggest challenge is the way that real estate shifts so frequently,” she begins. “There are just a lot of changes all the time, and I’m discovering that the best way to manage that, for an agent, is to have good people around you,” Monson continues.<\/p>\n<p>“You have to have a good lender, you have to have good title people, you have to have a good brokerage to rely on and good tools to help you with the changes. Otherwise, you’d be lost. It would be an overwhelming job keeping up with this,” she concludes.<\/p>\n<h2>Marketing<\/h2>\n<p>Monson swears by her Market Leader website. “I love the Market Insider, I send lots of my people to that,” she explains. “In fact, I just recorded a video blog about the Market Insider. It’s an incredible tool for my past and future clients.”<\/p>\n<p>Monson also uses direct mail and &#8211; look out, dirty words coming up &#8211; cold calling.<\/p>\n<p><strong>“<\/strong>Nobody likes it,” she agrees. “If they did, everyone would cold call and then it would be less effective. I have to tell you, because everyone doesn’t do it, it makes me unique,” she says.<\/p>\n<p>“A lot of times my business doesn’t come directly from the cold calls, but it’s amazing how stuff comes from unexpected places as a result of the calls,” she explains.<\/p>\n<h2>Sellers or Buyers?<\/h2>\n<p>Monson is primarily a listing agent &#8211; except for this year. “This year’s been a little weird for me because I’ve done more buyers than I did last year. Last year, out of all my transactions, I only did about four or five buyer’s sides, but this year, so far, I’ve done about 12 buyer’s sides,” Monson explains.<\/p>\n<h2>Indispensable Tools<\/h2>\n<p>I asked Monson to tell us about the one tool that is most critical to her real estate business.<\/p>\n<p>“The contact management that Market Leader provides, absolutely,” she replies.<\/p>\n<p>Monson adopted Market Leader products when she worked with Keller Williams. “I had Top Producer and it was just too clunky and complicated,” she recalls. “It’s very feature-rich, don’t get me wrong, it’s an excellent product. It was just too hard to accomplish what I wanted,” she claims.<\/p>\n<p>“I tried several other products and then Keller Williams came out with their affiliation with Market Leader,” Monson continues. “I started looking at it and I really liked the interface, and the upgrade that I immediately purchased was everything that four or five of the other services I was paying for were. I was actually able to consolidate some of my expenses,” she concludes.<\/p>\n<h2>A Peek Into the Future<\/h2>\n<p>Life has a tendency to intervene in even the best laid plans, but taking a peek into her life a decade from now, Monson sees herself as retired.<\/p>\n<p>“I see myself doing more and more business for the next four or five years and then, honestly, retiring,” she predicts. “It will be somewhere warm.”<\/p>\n<p>To that end, Monson has a trip to Ecuador planned in the next couple of months to check it out as a retirement destination. “It’s the number-one rated international retirement community for expats,” she claims.<\/p>\n<p>So, what does this self-described tenacious real estate agent like best about her career?<\/p>\n<p>“I enjoy the people I work with,” she begins. “I’ve got to tell you, I’ve had some amazing clients during my real estate career. I’m always thrilled to bits to help them accomplish not only a financial goal but a lifestyle goal as well. It’s a lot of fun.”<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Nobody knows an area better than a local &#8211; someone who was born and raised there. Audrey Monson, with Coldwell Banker in Salt Lake City, Utah, is an area expert &#8211; both as a local and as a former real estate investor. Although she dreamed of becoming an actress as a child, she spent 25 [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[78,83],"tags":[190,106,275,56,276],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/17301"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=17301"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/17301\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=17301"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=17301"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=17301"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}