{"id":17641,"date":"2013-08-12T20:12:20","date_gmt":"2013-08-12T20:12:20","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=17641"},"modified":"2021-12-02T13:28:08","modified_gmt":"2021-12-02T21:28:08","slug":"agent-spotlight-amy-summers-of-auburn-calif","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/agent-spotlight-amy-summers-of-auburn-calif\/","title":{"rendered":"Agent Spotlight: Amy Summers of Auburn, Calif."},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-17651\" title=\"Amy Summers\" src=\"\/wp-content\/uploads\/2013\/08\/Amy-2011-small-214x300.jpg\" alt=\"Amy Summers is a real estate agent in Auburn, California\" width=\"214\" height=\"300\" \/>Some real estate agents just seem to be born to do real estate. And Amy Summers of <a href=\"http:\/\/www.auburnpropertyvalues.com\/\">Gold Country Realty<\/a> in Auburn, Calif. is one of those agents.<\/p>\n<p>I asked her to explain a little bit about her background.<\/p>\n<p>“I grew up in Northern California, in Oroville. It’s a little country town near Chico,” she began. “I moved to Sacramento when I was 20 years old. Now I’m back in the country again, in Auburn, where I’m happy,” Summers said.<\/p>\n<p>Before joining the real estate agent ranks, Summers worked in outside sales. “I sold a bunch of different products &#8211; fabrics, wall-covering, rugs, wallpaper,” she recalled.<\/p>\n<p>“I did that for about 10 years. Before that I owned a custom workroom where I made products for interior designers,” she continued. “I actually made their bedspreads and their pillows and their curtains and all that stuff.”<\/p>\n<p>While she excelled at what she did, she wasn’t fulfilled. “It wasn’t very fun; it was very stressful,” she said.<\/p>\n<p>When the sales reps came in to show their fabrics she envied them. “I’d say, ‘That looks like a fun job – how do I get to do that job?’ They told me, and I did it. I closed my workroom and hit the road,” Summers recalled.<\/p>\n<h2>A Real Estate Career is Born<\/h2>\n<p>“A friend of mine had decided he was going to change careers,” Summers explained. “He said, ‘I’m going to take the real estate test and become a real estate agent,’” she recalled. “I thought, ‘Oh, that sounds like a fun thing to do &#8211; maybe I’ll do it with you.”<\/p>\n<p>They took their test-prep classes together and tested together. Well, the first time anyway. “He took the test three times and never did pass, and I passed mine on the first try,” she said.<\/p>\n<p>This is when she realized she found real estate to be really interesting and that it could be a fun job.<\/p>\n<p>Summers went to work for a small firm, Stoneridge Realty, as one of the brokerage’s first agents. She stayed with them for four years and then decided she wanted something closer to home.<\/p>\n<p>She landed at Windermere Real Estate, where she’s still working and is, in fact, the broker of record, overseeing 20 full-time and about 10 referral agents. The “boss” who hired her is now an agent and working under her broker’s license.<\/p>\n<h2>Challenges<\/h2>\n<p>I asked Summers what her biggest challenge is right now. “Having buyers that are ready to buy but not being able to find a home for them,” she answered without hesitation. “Inventory is low, and it’s frustrating for them to watch interest rates going up and not be able to find the right thing to pull the trigger,” Summers said.<\/p>\n<p>It’s hard for Summers as an agent, as well. “I can’t really help them with that because the product is just not there,” she said.<\/p>\n<h2>Marketing<\/h2>\n<p>Summers is an all-around marketer. She’s fortunate to get a lot of referrals, but she swears by her Market Leader products.<\/p>\n<p>When it comes to listings, she pulls out all the stops in her marketing campaigns, utilizing YouTube videos, single property websites, text-capture, QR codes on her signs, virtual tours and farming around the area.<\/p>\n<h2>Those All-Important Past Clients<\/h2>\n<p>Any agent who enjoys a large base of referrals knows the value of staying in touch with past clients, and Summers is no exception. She utilizes her Market Leader drip email campaign to reach out to clients, and this year she will hold her first client appreciation party.<\/p>\n<p>Summers was an early adopter of Market Leader products, jumping on the bandwagon before it was even a bandwagon – a decade ago. In fact, the company she subscribed to was called HouseValues.com, soon to become Market Leader.<\/p>\n<p>She says that 90 percent of her non-referral business comes from Market Leader, via House Values, her drip campaigns and her website, which she calls her most valuable tool.<\/p>\n<p>“A bunch of times I’ve had people call me and say, ‘Amy, this is Mary Jane,’ or whatever, ‘Thank you for sending me the listings all these years. You know that one you sent me today at 123 Main Street?’ and I’m thinking I have no idea who you are,” she says, laughing. “The name sounds slightly familiar, but they feel like they have this close relationship with me because Market Leader has been sending them this stuff for like four years.”<\/p>\n<h2>The Best Part of the Job<\/h2>\n<p>I asked Summers to tell me about the best part of her job and she didn’t hesitate. “The people,” she says. “I enjoy meeting interesting people and there are very few of my clients that I don’t like. They’ve been great, wonderful people.”<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Some real estate agents just seem to be born to do real estate. And Amy Summers of Gold Country Realty in Auburn, Calif. is one of those agents. I asked her to explain a little bit about her background. “I grew up in Northern California, in Oroville. It’s a little country town near Chico,” she [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[78,83],"tags":[190,106,283,275],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/17641"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=17641"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/17641\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=17641"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=17641"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=17641"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}