{"id":17731,"date":"2013-08-14T18:07:03","date_gmt":"2013-08-14T18:07:03","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=17731"},"modified":"2017-08-10T13:07:42","modified_gmt":"2017-08-10T20:07:42","slug":"is-facebook-advertising-worthwhile-for-agents","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/is-facebook-advertising-worthwhile-for-agents\/","title":{"rendered":"Is Facebook Advertising Worthwhile for Agents?"},"content":{"rendered":"<p>Social media marketing – isn’t that an oxymoron? Most real estate marketing consultants caution agents not to overly market themselves and their listings, to the exclusion of social posts, and they’re probably right.<\/p>\n<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-17751\" title=\"Is Facebook Advertising Worthwhile for Real Estate Agents?\" src=\"\/wp-content\/uploads\/2013\/08\/Fotolia_46310199_XS-300x300.jpg\" alt=\"Real estate agents can get great results from Facebook ads, but only if certain strategies are used\" width=\"300\" height=\"300\" \/>Facebook advertising, however, doesn’t happen on your business page, it occurs on everyone else’s Facebook pages. Well, not everyone’s, but we’ll get to that in a minute.<\/p>\n<p>Is Facebook advertising worthwhile for agents? It depends. There are several variables that go into a winning Facebook ad. Miss even one of them and your ad won’t get traction. Nail them all, on the other hand, and you may be as happy as Joshua Hunt, owner\/broker of <a href=\"http:\/\/trelora.com\/\">Trelora<\/a> in Denver, Colo.<\/p>\n<p>“Wow! It’s impressive,” he says of Facebook’s pay-per-click (PPC) advertising platform. “Most of our actual business &#8211; 70 percent of it &#8211; is coming from pay-per-click on Facebook.”<\/p>\n<p>He went on to tell us that most of the company’s Facebook-derived clients set appointments with his agents within 48 hours of initial contact. Now that’s something worth paying attention to.<\/p>\n<h2>How it Works<\/h2>\n<p>Next time you’re on your Facebook page, look over to the right and you’ll see the ads. These ads are targeted to you according to the information in your Facebook profile. This includes:<\/p>\n<ul>\n<li>Your age.<\/li>\n<li>Where you live.<\/li>\n<li>Your level of education.<\/li>\n<li>Relationship status.<\/li>\n<li>Interests.<\/li>\n<\/ul>\n<p>Once you determine your advertising goals, you can target who sees your ad. Let’s look at an example of how this works.<\/p>\n<p>Jenny, an Iraq war veteran, is now a real estate agent in Fayetteville, N.C. She wants to attract buyers to her veteran-focused real estate practice. First, she would determine the age range of her potential clients, perhaps those aged 25 to 50.<\/p>\n<p>Then she would narrow the target range even further to those living in and around Fayetteville. From there, she can drill down to target folks who identify themselves as veterans, members of the military, and even veteran’s spouses. We’ll take a look at how this is done a little later on.<\/p>\n<p>Finally, there are two ways to pay for your Facebook ads: pay-per-click or per thousand impressions. Gabrielle Jeans, real estate trainer and coach, explains both <a href=\"http:\/\/activerain.com\/blogsview\/2377847\/how-facebook-advertising-works-in-real-estate\">payment options<\/a> in a 2011 ActiveRain post.<\/p>\n<h2>Develop Your Strategy<\/h2>\n<p>First, you’ll need to come up with your advertising strategy, and your initial step is to determine a goal with Facebook advertising. Most agents understand their current, most pressing need, be it creating brand awareness, getting visitors to their blogs, getting buyers or listings, or building the pipeline of future business.<\/p>\n<h2>Drive Traffic<\/h2>\n<p>Once you understand your goal, it’s time to figure out where to drive Facebook traffic. <a href=\"http:\/\/rebekahradice.com\/\">Rebekah Radice<\/a>, manager of industry engagement with Better Homes &amp; Gardens Real Estate suggests choosing from the following ideas:<\/p>\n<ul>\n<li>Your IDX website.<\/li>\n<li>Your blog.<\/li>\n<li>A landing or squeeze page.<\/li>\n<li>Your Facebook business page.<\/li>\n<\/ul>\n<p>Naturally, which of these is the best choice varies, depending on the social media strategist you ask. Many of them will tell you to never drive the traffic to your IDX website because the more hoops you make them jump through, the less likely you are to capture the lead. Targeted landing pages, they claim, that are clean and easy to read, are best.<\/p>\n<h2>Keywords<\/h2>\n<p>Sure, Facebook ads are tiny, and it doesn’t seem like there’s room for keywords, but there is and they’re important.<\/p>\n<p>Facebook ad keywords, however, aren’t like Google keywords. Instead of search terms, you’ll need to determine keywords that other Facebook users – the ones you are targeting – use to describe themselves and their interests.<\/p>\n<p>Let’s use Jenny, the veteran and real estate agent we met earlier, as an example.<\/p>\n<p>In the “Choose your Audience” area of Facebook’s ad creation tool, we entered “veteran” into the “Precise Interests” box. Facebook generated a list of related keywords, such as military, soldier, Vietnam veteran and Iraq Afghanistan veterans. Some of the results even listed the number of people in the keyword’s audience. “Soldier,” for instance, has an audience of 9,800,000.<\/p>\n<p>From these results, you can choose the keywords you’ll use in your ads.<\/p>\n<h2>Create Your Facebook Ad<\/h2>\n<p>Since the photo you use will bring in 85 percent of your clicks, choosing the right one for your ad is the most strategic move you can make. First, the photo reinforces what is said in the copy. More important, however, is that it draws the eye to the ad.<\/p>\n<p>Remember, folks aren’t perusing Facebook for something to purchase – they are there to interact with people they know. Choose an enticing photo to grab their attention.<\/p>\n<p>Once you’ve got their attention, get them to click with a robust call to action. “Sign up for my free newsletter” isn’t robust, by the way. A free e-book, a webinar, or, for Jenny, our veteran, it might be “How to Buy a Home with Nothing Down!”<\/p>\n<h2>Lead Capture<\/h2>\n<p>All of this work, and the payments for the clicks, will fall flat if the leads don’t land on a site that will capture them.<\/p>\n<p>Ensure that the page they land on:<\/p>\n<ul>\n<li>Shows the visitors exactly what you promised them they would see.<\/li>\n<\/ul>\n<ul>\n<li>Makes the visitor feel informed and secure.<\/li>\n<\/ul>\n<ul>\n<li>Looks clean and professional.<\/li>\n<\/ul>\n<ul>\n<li>Is optimized for user satisfaction, not SEO.<\/li>\n<\/ul>\n<ul>\n<li>Is all about the user, not you.<\/li>\n<\/ul>\n<ul>\n<li>Includes contact information, which helps build trust.<\/li>\n<\/ul>\n<p>Like any marketing effort, Facebook ads require monitoring, tracking and tweaking. With the right strategy, however, they can be a lucrative way to bring in new clients.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Social media marketing – isn’t that an oxymoron? Most real estate marketing consultants caution agents not to overly market themselves and their listings, to the exclusion of social posts, and they’re probably right. Facebook advertising, however, doesn’t happen on your business page, it occurs on everyone else’s Facebook pages. Well, not everyone’s, but we’ll get [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[104],"tags":[284,119,17,285,87,286,57],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/17731"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=17731"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/17731\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=17731"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=17731"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=17731"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}