{"id":17811,"date":"2013-08-19T16:32:56","date_gmt":"2013-08-19T16:32:56","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=17811"},"modified":"2022-08-09T19:01:06","modified_gmt":"2022-08-10T02:01:06","slug":"agent-spotlight-brian-bendily-of-monroe-la","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/agent-spotlight-brian-bendily-of-monroe-la\/","title":{"rendered":"Agent Spotlight: Brian Bendily of Monroe, La."},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-17821\" title=\"Agent Spotlight - Brian Bendily\" src=\"\/wp-content\/uploads\/2013\/08\/Brian-Bendily-240x300.jpg\" alt=\"Brian Bendily is a real estate agent with Keller Williams in Monroe, Louisiana\" width=\"240\" height=\"300\" \/>At the end of these &#8220;Agent Spotlight&#8221; interviews, I always ask the agent to give me a one-word description of themselves. I’ll tell you how Brian Bendily answered that request later on. After getting to know him myself, though, I would say there are two words: honest and enchanting.<\/p>\n<p>From his charming Southern accent to his fearless candor, Brian Bendily of Keller Williams in Monroe, La. is an enchanting man. Read on and see if you agree with me.<\/p>\n<h2>Troubles in Small-Town America<\/h2>\n<p>Bendily grew up in what he calls small-town America. “I was born and raised in the same town I still live in,” he tells us.<\/p>\n<p>Bendily comes from an upper-middle-class family that provided him with a “very loving home. I struggled in school big time, though,” he admits. “I couldn’t focus, and that was my biggest challenge. I tried to deflect and hung out with a crowd that was like me – other kids not doing good in school,” he continues.<\/p>\n<p>“At some point I started to reflect the behavior of the people that I was around. Therefore, because of that behavior, I never had teachers who believed in me,” Bendily considers.<\/p>\n<p>Although he later obtained his GED, a combination of struggles with his classes and the temptations of his peers caused him to fail the ninth grade, so he quit school. “Come to find out later, I had ADHD (attention deficit hyperactivity disorder).”<\/p>\n<p>Bendily took on various small jobs after leaving school. “I worked with a guy that did arts and crafts, and we’d travel around to shows, selling the things he made. I then washed dishes in a restaurant,” he continues. The restaurant closed down, however, and Bendily was laid off.<\/p>\n<p>He says he recalls feeling, at this time, as if he needed to fight for everything he wanted. “As I get older, I sit back and think that the battles I fought in the past were against myself. I’ve learned I don’t have to fight for everything,” he explains. “We’re always told that hard work will get us where we need to be. It’s not necessarily hard work that will get you there, it’s smart work,” he concludes.<\/p>\n<h2>Providence<\/h2>\n<p>It just so happened that one of Bendily’s neighbors did some computer work for the local Coca-Cola bottling plant and got him a job interview there. He got the job.<\/p>\n<p>“I started working graveyard for Coca-Cola, in a low position,” he says. “I was stacking trays and unloading trucks. I was able to advance into the lab where we actually made the Coke. From there I advanced into inventory control as a clerk and then to an analyst,” he explains.<\/p>\n<p>Not able to catch even a small break, Bendily’s position with the beverage bottler was eliminated. What looked like yet another disappointment however, turned out to be a blessing.<\/p>\n<p>“They gave me three months’ notice before my job was over and a three month’s severance package,” Bendily says. “It was enough time for me to explore other avenues.”<\/p>\n<p>The avenue he is thankful for exploring is real estate. A family friend explained that he was taking the real estate exam. Bendily thought working in real estate sounded appealing, so he took the real estate class. “I passed the test the first time, and on January 1, 2006, I went to work for Coldwell Banker and started selling real estate.&#8221;<\/p>\n<p>Within his first 90 days Bendily had closed his first transaction. “The beautiful thing is, that was the same month my severance package from Coca-Cola ran out,” he says, laughing.<\/p>\n<p>He went on to become Rookie of the Year his first year in real estate. In 2009, he moved to Keller Williams.<\/p>\n<h2>The Bendily Team<\/h2>\n<p>Bendily uses a virtual assistant to handle all of his marketing. “Once I got introduced to that path,” he says, “it just made everything blow up. My VA is like a machine; he is awesome at what he does,” Bendily claims. The virtual assistant works four hours a day, generating leads for the team.<\/p>\n<p>“I don’t tell him what time to work, I just tell him how many leads I want him to generate. I told him 200 leads a month is what we want, and he averages 180 to 200 every month,” Bendily says.<\/p>\n<p>The rest of the team consists of himself, wife Karla, two buyer agents, another virtual assistant and Robin, his executive assistant.<\/p>\n<p>“She helps me keep grounded and pointed in the right direction, he says. “I just recently hired a lead coordinator to help us increase our conversion ratio and our follow-up with the long-term business,” Bendily adds.<\/p>\n<h2>Lead Generation, the Bendily Way<\/h2>\n<p>Initially, Bendily was drawn to the technology aspects of real estate. So much so that he neglected the first step that most new agents take &#8211; developing his sphere.<\/p>\n<p>“Probably the weakest point of my business right now is working my sphere. I’m just being transparent with you,” he admits. “But it’s something that we’re building,” he adds.<\/p>\n<p>The tool most critical to Bendily’s success is his website. “My Market Leader website is the lead generating tool that gets me more business and keeps more money in my checking account than anything else that I’ve utilized,” Bendily claims.<\/p>\n<p>“Once we started using the Market Leader platform, we were able to drop four other services costing $250.00 monthly, while gaining 42 percent more leads in 2012 than in 2011,” he continues.<\/p>\n<p>Market Leader, he says, has provided him with “an all-in-one system that does everything for me, and it’s so easy for us to use. If you put a little bit of work into it to set things up how you want them, and you put the right people in place to help you maintain them, it runs like a well-oiled machine.”<\/p>\n<h2>Life is Great in Bendily’s World<\/h2>\n<p>In what little spare time he has, Bendily enjoys spending time with his wife, Karla. Although he doesn’t realize it now, he’ll be grateful for this last bit of time alone they have. Come October, a month before the couple’s third anniversary, they will become the parents of twin girls.<\/p>\n<p>“I have a 12-year-old daughter from a previous marriage, and I kind of thought I was through having kids,” Bendily says. “But then Karla and I got married and we decided to adopt, and now I’m 38 and have a set of newborn twins about to get in my house &#8211; and I couldn’t be more happy,” he says, chuckling.<\/p>\n<p>And his career?<\/p>\n<p>“If anybody could say that they found their dream job – boy have I found my dream job! I love everything about it,” Bendily exclaims. “I love connecting with new people. I love working with first-time homebuyers and the sense of accomplishment and achievement I feel when I hand them that key,” he concludes.<\/p>\n<p>I asked Bendily to give me a one-word description of himself and he couldn’t come up with one. So I asked him to describe how he feels about his life right now.<\/p>\n<p>“I’m happy. I’m happy. I’m happy,” he says. “I’m ecstatic about the things that are happening. I feel so blessed.”<\/p>\n","protected":false},"excerpt":{"rendered":"<p>At the end of these &#8220;Agent Spotlight&#8221; interviews, I always ask the agent to give me a one-word description of themselves. I’ll tell you how Brian Bendily answered that request later on. After getting to know him myself, though, I would say there are two words: honest and enchanting. From his charming Southern accent to [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[78,83],"tags":[190,106,275,54,56],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/17811"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=17811"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/17811\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=17811"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=17811"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=17811"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}