{"id":18011,"date":"2013-08-28T19:10:29","date_gmt":"2013-08-28T19:10:29","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=18011"},"modified":"2016-02-04T00:28:52","modified_gmt":"2016-02-04T00:28:52","slug":"communicating-with-your-sellers","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/communicating-with-your-sellers\/","title":{"rendered":"Communicating With Your Sellers"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-18031\" title=\"Communicating With Home Sellers\" src=\"\/wp-content\/uploads\/2013\/08\/Fotolia_51475353_XS-300x274.jpg\" alt=\"Real estate agents can use effective communication to build trust with home sellers and other clients\" width=\"300\" height=\"274\" \/>“My Realtor® has stopped communicating with me,” blasts the headline over at Trulia’s message boards. The author goes on to ask for advice on how to terminate his listing agreement.<\/p>\n<p>Some of the responses by agents to sellers who complain about a lack of communication include: “I generally do not call if nothing is going on.”<\/p>\n<p>With all of the studies out there about what buyers and sellers want, and with communication typically sitting at the top of the lists, why are there still agents who think a phone call isn’t necessary if  “nothing is going on”?<\/p>\n<p>Let’s dispel that notion once and for all: Clients want to hear from you whether or not anything is happening with their transaction. Communication makes them feel that you are actually working for them. It builds trust.<\/p>\n<h2>Explain the Process<\/h2>\n<p>“We didn’t know there were all these things we had to pay for,” and their agent “never brought it up,” claims one of the members on the real estate consumer panel grilled at a recent Hear it Direct event.<\/p>\n<p>Another panelist complained about an agent who didn’t explain the process. This couple is to the point where the next time they want to buy or sell a home, they won’t be using an agent. “We’ll probably just do it on our own – we kind of feel like we are already,” the wife said.<\/p>\n<p>Obviously, the initial consultation isn’t just for buyer clients; homeowners need a walk-through of the process as well. Whether you leave them with an e-book or a video that explains the selling process, or you take the time to explain it in person, the walk-through is a critical component of taking a listing.<\/p>\n<p>Sit down with the homeowners and clearly explain at least the following:<\/p>\n<ul>\n<li>What you’ll do when you leave their home – open the listing file, upload the listing to the MLS, order the signs, have an extra key made for the lockbox and whatever else you do just after taking a listing. The more they know about how much you do behind the scenes, the better.<\/li>\n<\/ul>\n<ul>\n<li>How you’ll begin to implement your marketing plan.<\/li>\n<\/ul>\n<ul>\n<li>The broker’s open, if you’ll be holding one.<\/li>\n<\/ul>\n<ul>\n<li>How the lock box works, how showings work and whatever else the seller needs to expect while the house is on the market.<\/li>\n<\/ul>\n<ul>\n<li>What happens when an offer comes in.<\/li>\n<\/ul>\n<ul>\n<li>What happens after they accept an offer &#8211; explain escrow, disclosures and any other paperwork they’ll be required to sign. Explain that the home will need to be made available to the buyer’s home inspector and the lender’s appraisal. Even if you think a concept or a step in the process is a no-brainer and they probably already understand it, explain it anyway.<\/li>\n<\/ul>\n<ul>\n<li>Explain the financial aspects of closing – many homeowners understand they will be paying the real estate commission but don’t know that it is debited from the proceeds. Some believe they need to bring that money to closing. Explain the closing process so they aren’t confused or left wondering what will happen.<\/li>\n<\/ul>\n<h2>Ask About Preferences<\/h2>\n<p>Ask your clients about their preferred method of communication. Do they want you to call, email or text? Then, ask them about their preferred frequency:<\/p>\n<ul>\n<li>Do they want you to call whether or not you have any news?<\/li>\n<li>Do they want you to check in once a week?<\/li>\n<li>Do they want you to supply buyer feedback?<\/li>\n<\/ul>\n<p>“I figure an email a week telling me how many hits I&#8217;ve gotten on the various real estate sites, calls about my property (if tracked) and general market conditions would work, but I shouldn&#8217;t have to chase my agent down to hear what&#8217;s going on,” suggests a homeowner posting on City-Data.com.<\/p>\n<h2>Communicate Valuable Information<\/h2>\n<p>When you do reach out to the homeowners, give them valuable feedback, if possible. At the very least, let them know what’s going on behind the scenes. This shows a client that, even though there isn’t much movement on her particular listing, you’re out there pounding the pavement to drum up a buyer.<\/p>\n<p>Let your client know about:<\/p>\n<ul>\n<li>The number of people that came through the home over the course of the week.<\/li>\n<\/ul>\n<ul>\n<li>Buyer and agent feedback. This is especially important if you’ll be going for a price reduction.<\/li>\n<\/ul>\n<ul>\n<li>Any market updates that may affect the listing price.<\/li>\n<\/ul>\n<ul>\n<li>Once escrow is open, keep the homeowners apprised of the progress, what step comes next, and how they should prepare for it.<\/li>\n<\/ul>\n<ul>\n<li>Closing – touch base with your clients to see if they have any questions about closing, and ask about their progress getting packed up for the move. Remind them not to leave any personal property behind that wasn’t included in the sale.<\/li>\n<\/ul>\n<p>Your goal with a listing appointment is, naturally, to take the listing. Once that’s a done deal, however, your role switches to that of consultant.<\/p>\n<p>The dictionary says that a consultant is an individual with extensive experience and knowledge in a specific field. While you may think homeowners only hire you to sell their homes, they are also hiring you for your vast knowledge. They expect you to lend this expertise to enlighten them about a process they know very little, if anything, about. The only way to do this is with effective, ongoing communication.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>“My Realtor® has stopped communicating with me,” blasts the headline over at Trulia’s message boards. The author goes on to ask for advice on how to terminate his listing agreement. Some of the responses by agents to sellers who complain about a lack of communication include: “I generally do not call if nothing is going [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[83],"tags":[124,292,201,209,293],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/18011"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=18011"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/18011\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=18011"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=18011"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=18011"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}