{"id":18091,"date":"2013-08-30T21:27:54","date_gmt":"2013-08-30T21:27:54","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=18091"},"modified":"2022-01-26T14:37:42","modified_gmt":"2022-01-26T22:37:42","slug":"organic-traffic-isnt-free-beginner-seo-tips-for-agents","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/organic-traffic-isnt-free-beginner-seo-tips-for-agents\/","title":{"rendered":"Organic Traffic Isn&#8217;t Free: Beginner SEO Tips for Agents"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-18111\" title=\"SEO Tips for Real Estate Agents\" src=\"\/wp-content\/uploads\/2013\/08\/Fotolia_44888847_XS-300x208.jpg\" alt=\"Real estate agents can use SEO to improve online marketing \" width=\"300\" height=\"208\" \/><\/a>Organic – it’s not just what’s for dinner. Like organic food, however, organic traffic to your website is obtained naturally – without paying for it or having it referred from a directory or another site.<\/p>\n<p>In fact, organic traffic is sent to your site because the search engines “think” your site is interesting or relevant to the search terms. They like you &#8211; they really like you.<\/p>\n<p>Since not every real estate agent can make it to the front page of Google, the question of the millennium is: “Why not?”<\/p>\n<h2>Why Doesn’t My Site Show Up in Google?<\/h2>\n<p>Google uses a long list of criteria – over 200 factors – to determine which pages rank for which search terms. The whole process is bundled in what is known as an algorithm, defined by Google as “&#8230; computer programs that look for clues to give you back exactly what you want.”<\/p>\n<p>When a user enters a search term, the algorithm clicks and whirs and tries to guess what the user wants to see. It does this by considering terms on the site, how fresh the content is, what region the searcher is in, and &#8220;page rank.&#8221;<\/p>\n<p>So, although just owning a website and publishing it to the Web doesn’t necessarily mean you’ll automatically rank, it is the first step.<\/p>\n<h2>Organic Traffic Isn’t “Free”<\/h2>\n<p>Earlier we defined organic traffic as being that which you don’t have to pay for. Although that makes it sound as if it’s free, don’t be fooled.<\/p>\n<p>It takes time and effort to optimize your website for search engines – to have the content and links that Bing and Google find rank-worthy.  Because your time is better spent drumming up clients, chasing after organic Web traffic can actually be quite expensive.<\/p>\n<p>Then, consider that there are no guarantees that all that work will pay off and put you above all the other agents in town when someone is searching for an agent.<\/p>\n<h2>Tips to Improve Your Ranking<\/h2>\n<p>Let’s take a look at some ways to nudge you ahead in Bing’s and Google’s rankings.<\/p>\n<h3>Compelling Content<\/h3>\n<p>Market Leader’s senior trainer, Shannon Shimabukuro, suggests beefing up your content. If you’re just starting a website, ensure that the content you use is “relevant, fresh and unique” so that it provides value for the user and positions you as the hyper-local expert.<\/p>\n<p>Don’t just promote your latest listings, but tell readers what’s so great about living in your area. Let them know about interesting restaurants, the best dog parks in the area, where to get the best cup of coffee or hamburger. Sprinkle in advice on homebuying and selling.<\/p>\n<p>This isn’t a one-time task. Content has to remain fresh, which means you’ll need to spend time (or pay someone else) to make consistent updates to your content library.<\/p>\n<h3>Use Target-Audience Keywords<\/h3>\n<p>Think of keywords as a breadcrumb trail that will lead potential clients to your website.<\/p>\n<p>The keywords can be anything that your potential clients will enter into the search box when looking for an agent or a home. These keywords need to not only show up in your content, but in your page titles and images as well.<\/p>\n<p>Shimabukuro cautions against “trying to rank for popular real estate search queries,” and recommends using hyper-local terms instead. For example, you’ll get a lot more hits using “condos in Hayes Valley” than you will for “San Francisco real estate.”<\/p>\n<p>Finally, Shimabukuro cautions against the overuse of keywords; you don’t want to risk being considered a spammer by the search engines. She recommends using three to five phrases per page.<\/p>\n<h3>Links<\/h3>\n<p>The Miss Congenialities of Google have lots of links. Google’s algorithm takes a good look at the number and veracity of the sites that link to yours. Shimabukuro likens them to votes – the more links, the more popular the site. Link to your site from your blog and your social networking pages, and be sure to use your keywords when you create the links.<\/p>\n<h2>Nothing in Life or on the Internet is Guaranteed<\/h2>\n<p>The folks at <a href=\"https:\/\/moz.com\/google-algorithm-change\">Moz.com<\/a> claim that “Google changes its search algorithm around 500 to 600 times every year.” Not all of these changes have the impact of a Panda or Penguin update, but all you need is one big one to kick you back to where you started, leaving all your hard work in the dust.<\/p>\n<p>While organic traffic is important, it’s just one aspect of a multipronged approach to Internet marketing.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Organic – it’s not just what’s for dinner. Like organic food, however, organic traffic to your website is obtained naturally – without paying for it or having it referred from a directory or another site. In fact, organic traffic is sent to your site because the search engines “think” your site is interesting or relevant [&hellip;]<\/p>\n","protected":false},"author":29,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[50],"tags":[86,145,285,87,146,294,131,295,296,297,298,134],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/18091"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/29"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=18091"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/18091\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=18091"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=18091"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=18091"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}