{"id":18151,"date":"2013-09-02T08:00:26","date_gmt":"2013-09-02T08:00:26","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=18151"},"modified":"2021-11-24T12:11:39","modified_gmt":"2021-11-24T20:11:39","slug":"agent-spotlight-laurie-weston-davis-of-pinehurst-nc","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/agent-spotlight-laurie-weston-davis-of-pinehurst-nc\/","title":{"rendered":"Agent Spotlight: Laurie Weston Davis of Pinehurst, NC"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-18171\" title=\"Laurie Weston Davis\" src=\"\/wp-content\/uploads\/2013\/09\/LaurieWestonDavis-278x300.jpg\" alt=\"Laurie Weston Davis is a real estate agent in North Carolina\" width=\"278\" height=\"300\" \/>All real estate is local. So, when an agent tells you that her favorite aspect of her career is “the travel,” it might just make you scratch your head.<\/p>\n<p>Laurie Weston Davis, of Keller Williams Realty in Pinehurst, N.C. isn’t just any real estate agent. First, she has reached that point in her career where instead of setting her boots on the ground every morning, listing and selling local homes, she dons her managerial cap and oversees her members of a 30-person team.<\/p>\n<p>Then, she’s a <a href=\"https:\/\/twitter.com\/thegeekygirls\">Geeky Girl<\/a>, “helping others discover their inner geek,” with the other half of the G.G. team, Lisa Ludlow Archer.<\/p>\n<h2>But, Wait …<\/h2>\n<p>We’re getting a bit ahead of ourselves. Davis started life as an Air Force brat, “moving around a bit,” she says, laughing. By the time she turned 10, Dad retired from the military and moved the family to Miami, from whence the family originally hailed. After seven years in the home state, however, they packed up and moved again to North Carolina, where Davis finished high school.<\/p>\n<p>Growing up, Davis dreamed of being a mom. That was only natural for a little girl being raised by a stay-at-home mom who never had a job outside of the home. “That was what I knew when I was growing up,” she recalls. “I wanted to have kids, and a family, and all that good stuff.”<\/p>\n<p>Davis did just that. She married a Navy man right out of college and found herself in that familiar milieu of moving around the country again. The couple lived in California for about 10 years, both in San Diego and in the Bay Area. “I had my first son while we were in California, and I pretty much stayed home with him,” Davis says.<\/p>\n<p>Davis has two sons; the eldest is now 26 and a lawyer. The younger son, aged 23, graduated from college one year ago and has plans to attend graduate school. “They’ve been very good children,” Davis says. “They make me happy.”<\/p>\n<h2>From Soccer Mom to Selling Homes<\/h2>\n<p>Davis’ husband is a cardiologist in Pinehurst, but he did his internship in the Navy. When he got out of the military, about 15 years ago, they decided that it would be the ideal place for hubby to start a practice since they both had family in North Carolina. It turns out it was also a great place for Laurie to do the same.<\/p>\n<p>“My oldest was going off to college &#8211; to Tulane in New Orleans for his undergraduate work &#8211; and my youngest was a junior in high school. He had his driver’s license, so he didn’t need me toting him around anymore,” she recalls.<\/p>\n<p>“Suddenly I had a lot of free time and I thought, ‘What am I going to do with myself?’”<\/p>\n<p>She echoed the sentiment to a friend who happened to suggest she join him in his real estate practice at a small, boutique firm. It just so happened that the friend had a number of developers on his client roster, so Davis began her career sitting at new developments.<\/p>\n<p>“It was a good way to get started because I had people coming to me every day, and I got experience working with buyers and showing property,” she says.<\/p>\n<h2>Motherhood Beckons<\/h2>\n<p>Something snaps in many women when the youngest child enters the last year of high school. It’s a definite signal that the work of active motherhood is almost over. It’s a time filled with “what ifs” and hopes that you did your job well.<\/p>\n<p>Davis decided that she wanted one more shot at full-time motherhood. “I decided that I really wanted to be more involved. I mean, once he was gone, he was going to be gone, so I took a sabbatical,” she recalls. Davis spent that year following her son’s sporting events – in essence, being the “soccer mom” all over again. It’s a decision she will never regret.<\/p>\n<p>“Once he went off to college I was ready to get back into it,” Davis says. This time, she decided she would look for a different broker. “At that time there was a company starting up and the agents and brokers were the type of people I wanted to be in business with,” she says. “I ended up joining that company and realized afterward that they were actually preparing to become a Keller Williams office. I’ve been with them ever since.”<\/p>\n<p>Another decision Davis doesn’t regret. In fact, she advises all rookie agents to “choose wisely.”<\/p>\n<p>“The people you surround yourself with in the beginning is critical,” she cautions. “Having people that are going to support you &#8211; and help you grow, and be positive, and be your cheerleader &#8211; is just huge. If you aren’t careful, you can end up with folks that are naysayers, and that will just drag you down,” Davis continues. “It’s a tough business. You get a lot of rejection. You kind of need that positive strength behind you.”<\/p>\n<h2>Systems, Tools and Other Geeky Stuff<\/h2>\n<p>Davis also recommends that new agents choose the right tools and systems from the beginning. “Having the website, the CRM and all of the things you’ll need in place from the start is important,” she says.<\/p>\n<p>She was introduced to Market Leader products when she joined Keller Williams. “The Pinehurst team has Professional,” she says, “and in Charlotte we use the Business Suite.”<\/p>\n<p>She used Top Producer before joining Keller Williams. “I really didn’t use it because it wasn’t user friendly as far as I was concerned,” she says. “Once I got on board with Market Leader it was very different. The contact management part of it is critical, and it all kind of fits together with the whole Keller Williams philosophy. It’s pretty simple for us to use.”<\/p>\n<p>Davis upgraded to Professional because “it made sense,” she claims. “We use it to do a lot of our lead gen, and also the Craigslist tools are awesome,” Davis explains. “We noticed that there was a fairly significant increase in the response we got from Craigslist since we started using the tools,” she continues. “For some reason the ads just seemed to be – I don’t know – more appealing, or more trustworthy; they just seem to work better.”<\/p>\n<h2>The Team<\/h2>\n<p>Davis has a partner, not only in business, but in the Geeky Girls as well. Her name is Lisa Ludlow Archer, and she runs the Raleigh team while Davis runs the Pinehurst team. They’ve been business partners for one year now.<\/p>\n<p>Their Geeky Girl partnership, on the other hand, goes back three years. “We’re both very active in social media and do a lot of social and Internet lead generation,” she explains. “The Geeky Girls speak and teach all over the country, which is one way we get referral business,” she says.<\/p>\n<p>Archer explained to me last year that the Geeky Girls aim to raise “the bar in the industry. There are so many agents stuck in their tracks that have no idea what to do next,” she said. “We consider ourselves ambassadors, or, as some people call us, ‘badassadors,’ for IMSD … Hear It Direct,” and others.<\/p>\n<p>This, by the way, is how Davis’ current travel jones is being fed. “I do travel a lot and meet a lot of people. It’s actually broadened my world significantly,” she says.<\/p>\n<p>“I live in a pretty small little village here. I travel to San Francisco, and I just got back from Chicago. I know people everywhere now. I have good friends all over the country, and even though I don’t see them all the time, I still consider them very close friends.”<\/p>\n","protected":false},"excerpt":{"rendered":"<p>All real estate is local. So, when an agent tells you that her favorite aspect of her career is “the travel,” it might just make you scratch your head. Laurie Weston Davis, of Keller Williams Realty in Pinehurst, N.C. isn’t just any real estate agent. First, she has reached that point in her career where [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[78,83],"tags":[190,106,275,56],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/18151"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=18151"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/18151\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=18151"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=18151"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=18151"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}