{"id":18221,"date":"2013-09-05T16:41:49","date_gmt":"2013-09-05T16:41:49","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=18221"},"modified":"2016-02-05T09:25:45","modified_gmt":"2016-02-05T17:25:45","slug":"linkedin-for-real-estate-pros","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/linkedin-for-real-estate-pros\/","title":{"rendered":"LinkedIn for Real Estate Pros"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-18241\" title=\"LinkedIn - Social Media Networking for Real Estate Pros\" src=\"\/wp-content\/uploads\/2013\/09\/Fotolia_38841192_XS-300x197.jpg\" alt=\"Real estate agents can take advantage of LinkedIn not only for social media networking, nurturing relationships, and getting referrals\" width=\"300\" height=\"197\" \/>Trolling for referrals is one of the more important aspects of running a real estate business. Anyone who runs a referral-based real estate practice understands that the work expended to get to that point is well worth it in the long run.<\/p>\n<p>Social media sites have become the go-to places to nurture the valuable relationships that will provide future referrals, and LinkedIn seems to be one of the best sites for this purpose.<\/p>\n<p>This is because LinkedIn, unlike Facebook, for instance, was created for business professionals as a place to meet and network. Yes, there is a difference between personal and <a href=\"http:\/\/www.forbes.com\/sites\/learnvest\/2013\/03\/04\/8-mistakes-you-should-never-make-on-linkedin\/\">professional networking<\/a>, LinkedIn’s Nicole Williams tells Forbes.<\/p>\n<h2>First, the Numbers<\/h2>\n<p>LinkedIn is the “site for 238 million people who take their jobs seriously,” according to <a href=\"http:\/\/www.forbes.com\/sites\/georgeanders\/2013\/08\/26\/linkedin-tells-noisiest-members-to-hush-and-a-ruckus-ensues\/\">George Anders<\/a>, writing for Forbes.<\/p>\n<p>The typical LinkedIn user, <a href=\"https:\/\/www.quantcast.com\/linkedin.com\">Quantcast<\/a> says, is a 45- to 54-year-old male. He is most likely Asian, attended graduate school and makes over $150,000 a year. He has no children.<\/p>\n<p>Very few of these users access the site via mobile, and most do so from a home computer. They visit LinkedIn 4.6 times per month.<\/p>\n<h2>Getting Started<\/h2>\n<p>The cornerstone of your LinkedIn experience starts with your profile. Most social network experts agree that at LinkedIn, your profile and an appropriate photograph will make or break you.<\/p>\n<p>Your profile can be more accurately described as your LinkedIn resume – more education and career history and less hobbies and favorite music.<\/p>\n<p>When you’ve filled in the blanks, you’ll have an opportunity to complete the Summary section. This is the place to “tell your brand story,” says career coach Carol Ross. She’s referring to a personal brand, but agents can use the Summary section to convey their professional brand “in a human voice, revealing what makes you unique,” Ross says.<\/p>\n<p>If you’re tempted to skimp on the Summary portion of your profile, keep in mind that LinkedIn says that a completed profile is seven times more likely to be viewed than one that is incomplete.<\/p>\n<h2>The Company Page<\/h2>\n<p>The personal profile must be completed before you can set up a company page – and you must set up a company page to get all you can out of LinkedIn.<\/p>\n<p>You’ll find the option to set up a company page by clicking on the “Companies” tab.<\/p>\n<p>This is the page where you’ll update what’s been happening in the local real estate market and with your business. From here you can link to other content, providing value to those you hope will refer you to clients.<\/p>\n<h2>LinkedIn Groups<\/h2>\n<p>LinkedIn groups are the water coolers of the site – the<strong> <\/strong>place to connect with others in the group. If you choose your groups wisely, they can turn out to be the most valuable pieces of LinkedIn real estate you can land on.<\/p>\n<p>If you’re after referrals, join the groups your past clients and those in your sphere belong to. Any group that appeals to folks who could lead to new business for you is a group you should join.<\/p>\n<p>Williams, for instance, is a new mom and joined a group devoted to all things new mommy-ish. “When I needed an accountant, it turned out there was one in my group who I ended up hiring because of the connection we made over being new moms,” she tells Forbes.<\/p>\n<p>There’s a lot to learn and to like about LinkedIn, from setting up your connections (another important task to complete so that you have access to <em>their<\/em> connections), to reaching out to past clients and colleagues.<\/p>\n<p>LinkedIn works, but <em>you<\/em> have to work it.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Trolling for referrals is one of the more important aspects of running a real estate business. Anyone who runs a referral-based real estate practice understands that the work expended to get to that point is well worth it in the long run. Social media sites have become the go-to places to nurture the valuable relationships [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[104],"tags":[299,102,171,117,262,103],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/18221"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=18221"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/18221\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=18221"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=18221"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=18221"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}