{"id":183,"date":"2009-12-16T08:33:21","date_gmt":"2009-12-16T16:33:21","guid":{"rendered":"http:\/\/blog.marketleader.com\/?p=183"},"modified":"2009-12-16T08:33:21","modified_gmt":"2009-12-16T16:33:21","slug":"tactics-for-taking-advantage-of-new-tax-credit-program","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/tactics-for-taking-advantage-of-new-tax-credit-program\/","title":{"rendered":"Tactics for taking advantage of new tax credit program"},"content":{"rendered":"<p>The new tax credit program extension (and expansion) represents a significant opportunity for real estate professionals, especially at this time of year.  When buying and selling activity traditionally slows during the holiday months, this year you can keep activity high, close more business, and set up a HUGE start to 2010 – if you use the new tax credit program to your advantage.<\/p>\n<p>Below are ten specific recommendations for taking direct advantage of the new program.  Over the next two weeks, we will also publish specific tools, email samples and more for you to directly use within your business.  In the meantime, put these ideas to work starting today!<\/p>\n<ol>\n<li><strong>Remind your past customers about it.<\/strong> Send them an email or a newsletter.  Include a link to your write-up of the program and its buyer\/seller advantages in your email signature.  Make sure every past customer knows how this can benefit them, their neighbors, and other buyers they may know<\/li>\n<li><strong>Create a referral incentive for past customers who send their friends to you for the program.<\/strong><\/li>\n<li><strong>Create, share and college tax credit referrals from other Realtors and brokers.<\/strong> Follow and participate in a network of other professionals actively leveraging the program.  Use search tools for Twitter, Facebook and ActiveRain in particular to find who else is writing about and using the program.  Get additional marketing ideas from them, and be an active networker to share (and get!) more business.<\/li>\n<li><strong>Join the Tax Credit Experts list.<\/strong> We’ve started an exclusive list of top real estate professionals promoting the Tax Credit Program. <a href=\"http:\/\/tweepml.org\/Home-Buyer-Tax-Credit-Experts\/\">Click here<\/a> to see the current list, and message us on Twitter (<a href=\"http:\/\/twitter.com\/market_leader\">@market_leader<\/a>) if you want to be included.<\/li>\n<li><strong>Write about it on your site and\/or blog.<\/strong> Search engines are hungry for relevant content about the tax credit program right now.  Search volume from interested buyers (and sellers) is high, and real estate professionals who publish strong, local content are likely to show up high on search engine pages.   Great way to get more free inbound traffic to your Web site.<\/li>\n<li><strong>Publish a list of top-ten end-of-year home-related tax savings suggestions for homeowners (and put buying a new home at the top of the list). <\/strong>This will include a variety of tips, well beyond the tax credit program, but will be a great way to get educational content into the hands of lots of your current &amp; prospective customers – all with your branding and call-to-action to contact you to learn more.<\/li>\n<li><strong>Create or republish “Tax Credit 101” content for consumers.<\/strong> Write a brief summary of the program, its highlights, and qualifications.  Make it simple, add an offer to learn more by contacting you, and\/or add a link to your top-ten list.  Use this content to educate consumers, position yourself as an expert, and drive more interest.<\/li>\n<li><strong>Partner with local accountants, financial advisers and tax prep branches. <\/strong>Give them your top-ten lists, and tell them you’re a go-to professional for their customers seeking listings to take advantage of the tax program.<\/li>\n<li><strong>Do the math.<\/strong> Show prospective buyers the specific, financial benefit of buying a home now based on the tax credit impact.  Invite prospects to contact you to “do the math” based on the home they can afford, and the tax benefit that will create for them.<\/li>\n<li><strong>Make sure local press consider you a resource and expert on the topic. <\/strong>Send a copy of your Tax Credit 101 content and top-ten lists to the local press, and invite them to contact you with any questions.  Building relationships with local press via educational content for their readers is a great way for them to consider you an expert and quotable resource for news stories.<\/li>\n<\/ol>\n<p>What are we missing?  How are you already using the expanded tax credit program in your marketing, or how have these ideas inspired you to do something totally different and unique?<\/p>\n<p>Please share your ideas with other professionals in the comments below.  We will aggregate the best new ideas, and publish a second “top ten” list of our own, giving each idea originator name, brand and link credit.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The new tax credit program extension (and expansion) represents a significant opportunity for real estate professionals, especially at this time of year. When buying and selling activity traditionally slows during the holiday months, this year you can keep activity high, close more business, and set up a HUGE start to 2010 – if you use [&hellip;]<\/p>\n","protected":false},"author":6,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[36],"tags":[],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/183"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=183"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/183\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=183"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=183"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=183"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}