{"id":18301,"date":"2013-09-11T17:00:19","date_gmt":"2013-09-11T17:00:19","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=18301"},"modified":"2021-12-02T13:40:36","modified_gmt":"2021-12-02T21:40:36","slug":"are-bing-ads-worthwhile-for-real-estate-agents","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/are-bing-ads-worthwhile-for-real-estate-agents\/","title":{"rendered":"Are Bing Ads Worthwhile for Real Estate Agents?"},"content":{"rendered":"<p>According to recent data from the National Association of Realtors®, 90 percent of homebuyers start their search online. It is thus vital for agents to have an online presence if they want to catch homebuyers when they first start searching! Online advertising is a great way to capture consumers early during the home-buying or selling process. When you think about online searching, you may just think of searches conducted through Google, the world’s preeminent search engine, which has a <a href=\"https:\/\/searchengineland.com\/google-dwarfs-bing-yahoo-as-traffic-source-for-major-news-sites-170660\">65 to 70 percent market share<\/a> of searches in the U.S. Don’t forget Bing, though! While Bing only receives about 30 percent of search engine traffic, it still receives <a href=\"https:\/\/www.comscore.com\/Insights\/Press-Releases\/2013\/2\/comScore-Releases-January-2013-US-Search-Engine-Rankings\">over 5 billion searches a month<\/a>.<\/p>\n<h2>What are Bing Ads?<\/h2>\n<p>Bing Ads are text advertisements that appear in Bing and Yahoo! search results. Bing Ads are virtually identical to Google AdWords, the text ads in Google’s search engine result pages, except they are run by Microsoft. These ads show up on the top and right-hand side of search engine results pages, and the top two to three ads often appear a second time below the search results. Here&#8217;s an example from Microsoft showing where the ads are displayed:<\/p>\n<p style=\"text-align: center;\"><a href=\"https:\/\/about.ads.microsoft.com\/en-us\/h\/a\/microsoft-advertising?tab=how&amp;s_cid=us_smb_a_product_how\"><img loading=\"lazy\" class=\" aligncenter\" title=\"Bing Ads\" src=\"\/wp-content\/uploads\/2013\/09\/Bing-Ads1.png\" alt=\"Bing Ads Example\" width=\"493\" height=\"300\" \/><\/a><\/p>\n<p>You pick the search terms you want for your ads. These are known as keywords, and can include terms like “real estate” in the example below. You can also choose to have searchers from specific regions see the ad when they use your selected keywords, a strategy known as IP targeting.<\/p>\n<p>Where your ad shows up in search engine results is determined by your bid price (the max price you are willing to pay every time your ad is clicked), quality score (relevance of your landing page and ad to the keyword you select) and how fierce the competition is with other advertisers. The bid price you enter is not necessarily the price you will actually pay per click; instead, it is the maximum amount of money that you will be charged for the click.<\/p>\n<p>All of this should sound familiar if you have worked with Google AdWords in the past. If you are running Google AdWords campaigns for real estate, the process will easily translate to Bing.<\/p>\n<h2>Easy to Set Up for Existing Google Campaigns<\/h2>\n<p>If you already have Google AdWords campaigns, Microsoft has made it easy to import them into Bing Ads. Simply click the “Campaign” button in the header, and log in to your Google Account through Bing to import all your keywords, ad text and settings directly from Google.<\/p>\n<p><strong>Two pieces of advice on Google AdWords vs. Bing Ads<\/strong><\/p>\n<ul>\n<li>While it is easy to import ads from Google AdWords, be advised that what works on Google may not work on Bing.<\/li>\n<li> Google AdWords and Bing Ads both require testing and optimization to make them work well.<\/li>\n<\/ul>\n<p><strong>Here are some best practices for importing Google AdWords into Bing:<\/strong><\/p>\n<ul>\n<li>Use the Bing and Yahoo networks only.<\/li>\n<li>Check and adjust your negative keywords (search terms that you don’t want your ad to show up on) and IP targeting (searchers’ locations you want your ad to show up on).<\/li>\n<li>Use\/update tracking codes so you can compare the performance of your Bing and Google ads in your website analytics.<\/li>\n<\/ul>\n<h2>Bing Searchers are More Likely to Be Homebuyers<\/h2>\n<p>Home searchers who are actively looking for listings and agents visit both Google and Bing. However, <a href=\"https:\/\/www.seodesignsolutions.com\/blog\/search-engine-optimization\/comparing-google-and-bing-demographics\/\">Bing users<\/a> may be more likely to be homebuyers, since they are older and more likely to have children.<\/p>\n<h2>Bing&#8217;s Cost-Per-Click (CPC) Is Less Than Google’s<\/h2>\n<p>Since Bing is still ignored by many advertisers, it is a less competitive advertising marketplace. This means that Bing has a lower CPC. Hubspot, a marketing software company, recently compared its clients’ CPC on Bing and Google and found that Bing saved them 49 to 71 percent per click.<\/p>\n<p><img src=\"\/wp-content\/uploads\/2013\/09\/Hubspot.png\" alt=\"Hubspot Lower CPC on Bing\" \/><\/p>\n<p>A case study by Bing found that a travel company achieves 50 percent lower average CPC with Bing Ads.<\/p>\n<p>These are great stats, but how do they apply to real estate? Let us share how we use Bing Ads. Market Leader has incorporated Bing Ads into our advertising mix, and we build out campaigns for each and every Leads Direct customer. Using both Bing Ads and Google AdWords has allowed us to deliver more leads to customers – at a lower overall cost per lead – than we are able to achieve using just Google.<\/p>\n<p>Market Leader has also experienced lower Bing CPCs when managing ads for its customers. Bing CPCs vary greatly by location, but Market Leader’s real estate ad campaigns have found that the cost-per-click savings on Bing are greatest in high positions. This doesn’t mean that Bing is always the better deal. The amount of traffic Bing can deliver is lower, so an ad with a low position on Google can sometimes get the same amount of traffic as a highly positioned Bing ad – for the same price. Using both Bing and Google is the way to get the most traffic at the lowest price.<\/p>\n<h2>Should You Start and Manage Your Own Bing Campaigns?<\/h2>\n<p>If you are looking to do search engine marketing (SEM) yourself, Bing would be a valuable addition to your search marketing campaigns. Both Google and Bing require a lot of work and expertise to get the most out of them. Taking the time to learn and optimize Google AdWords and Bing Ads will take time away from your core business activity – selling real estate.<\/p>\n<p>It may make the most sense for you to hire someone to create and manage your search marking campaigns for you. There are many agencies and consultants that do this type of work, but their services are expensive. They may not be willing to work with you if your budget is small. If you are interested in SEM, but have limited budget and time, Market Leader’s Leads Direct product might be the answer.<\/p>\n<p>With Leads Direct, Market Leader builds out and optimizes Google AdWords and Bing Ads campaigns for you. Instead of paying search engines for clicks, Leads Direct allows you to get homebuyers and sellers – leads – to register directly on your site. Market Leader makes life easier for its customers by setting up and managing their search engine advertising campaigns and delivering quality leads directly to them.<\/p>\n<p>Learn more about Market Leader’s <a href=\"\/products\/real-estate-leads\/\">real estate leads<\/a>.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>According to recent data from the National Association of Realtors®, 90 percent of homebuyers start their search online. It is thus vital for agents to have an online presence if they want to catch homebuyers when they first start searching! Online advertising is a great way to capture consumers early during the home-buying or selling [&hellip;]<\/p>\n","protected":false},"author":29,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[35],"tags":[300,301,119,302,303,304,87,146,286,298,305,306],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/18301"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/29"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=18301"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/18301\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=18301"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=18301"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=18301"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}