{"id":18661,"date":"2013-09-13T18:53:58","date_gmt":"2013-09-13T18:53:58","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=18661"},"modified":"2021-11-24T12:09:46","modified_gmt":"2021-11-24T20:09:46","slug":"does-your-website-capture-leads-or-let-them-get-away","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/does-your-website-capture-leads-or-let-them-get-away\/","title":{"rendered":"Does Your Website Capture Leads or Let Them Get Away?"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-18681\" title=\"Does Your Website Capture Leads or Let Them Get Away?\" src=\"\/wp-content\/uploads\/2013\/09\/Fotolia_52250682_XS-300x225.jpg\" alt=\"Just getting visitors to your real estate website is not enough to capture leads\" width=\"300\" height=\"225\" \/>Don’t let this happen to you. An agent decides to get involved with online lead generation. He creates online advertisements with Facebook, Craigslist, and Google Adwords in an attempt to direct traffic to his site. However, after spending much time and money on these ads, the agent has no leads to show for it and blames these sources for providing low-quality traffic. In reality, this agent’s lead generation woes are just as likely to be from having a website that is poorly designed for capturing leads as they are from poorly performing ad campaigns.<\/p>\n<p>Getting visitors to your site is only half the battle of online advertising. If your website does not convert even the highest quality visitors to leads, your online lead generation efforts are doomed to failure. Your website needs to both engage your visitors with the information they are looking for and ask for their contact information so you can reach out and turn them into clients.<\/p>\n<h2>Give the Visitors What They Want<\/h2>\n<p>Your website needs engaging content if you want visitors to stay and not bounce back to search engine results – or other real estate sites! Let us clue you in on what types of content consumers are apt to get engaged with. Homebuyers conducting their home search online want to look at listings, specifically listing photos. Home sellers want to find out what their home is worth and look at listings to find a new home.<\/p>\n<p>If your website does not have listings &#8211; or listing photos &#8211; you are not giving online home searchers the content they’re looking for. They do not want to spend time on your website’s home page, “About me” page, or “Contact me” page. It may be a blow to some agents’ egos, but homebuyers’ number one priority is to look at listings and listing photos – not learn about you! Give consumers what they want, and make sure your online lead generation efforts link to those pages. Direct them to any other page and you run the risk of your would-be leads bouncing back to search engine results or to other agents’ sites.<\/p>\n<h2>Ask for Their Contact Information<\/h2>\n<p>For agents who get all of their business from referrals, and whose websites are only visited by consumers they’ve already spoken with, asking visitors to “register” on their site is completely unnecessary. Very few agents fall into this category, however. If you are one of the many agents who spends much time and money driving consumers to your site, capturing visitors’ contact information is incredibly important. Consumers who visit your site are actively looking at buying or selling a home and are likely to transact with someone; if you don’t at least ask for their contact information, you will greatly diminish your ability to get in touch with them, thus making it less likely they will transact with you! Here are some important stats for you to consider:<\/p>\n<ul>\n<li>Market Leader generates hundreds of thousands of leads per month by using many online lead generation methods.<\/li>\n<li>We have myriad pages specifically optimized to get conversions – i.e., capture leads’ contact information when they arrive on these landing pages.<\/li>\n<li>Our campaigns achieve around a 10 to 12 percent conversion rate, on average, for Internet search traffic by prompting visitors to register by entering their contact information.<\/li>\n<\/ul>\n<p>If your site has a contact form that is user initiated only (i.e., one that does not have an interruptive prompting to fill out the contact form), count on achieving conversion rates of 1 percent or less, depending on how the contact form is set up and where it is located on the page. The adage, “If you don’t ask, you won’t get” applies to lead generation. Asking your website’s visitors to register will get you 10 times more potential business than waiting for them to volunteer their contact information on their own volition.<\/p>\n<p>If you still don’t think it is worthwhile to ask for your visitors’ contact information, know that 24 percent of new <a href=\"https:\/\/www.nar.realtor\/sites\/default\/files\/documents\/Study-Digital-House-Hunt-2013-01_1.pdf\">online home shoppers<\/a> complete an action on a real estate site the same day they start researching and 78 percent visit multiple real estate sites.<\/p>\n<p>The important conclusion you should come to from these statistics: If you don’t get contact information from first-time visitors and follow up with them immediately, some other agent will get the deal!<\/p>\n<h2>Encourage Revisits<\/h2>\n<p>Depending on their timelines, it can take anywhere between one month and two years before online searchers transact. A study by Hebert Research found that aspiring homebuyers can take two whole years to actually buy a home after they first consider doing so and, just as important, only spend a relatively small amount of time actively searching for homes.<\/p>\n<p>How does this fact apply to your website’s structure? After you get contact information from home searchers, following up with them is a must. Encourage visitors to come back to your site with listing alerts that meet their home search criteria &#8211; since, as we discussed above, homebuyers are most interested in seeing home listings. Following up with your leads and re-engaging them in your website will help ensure that you stay top of mind throughout the early stages of their homebuying process.<\/p>\n<p>Integrating your website with your CRM makes generating repeat visits a lot easier. The Market Leader system has agents’ IDX-enabled websites send automated listings alerts, drip email campaigns, newsletters and more.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Don’t let this happen to you. An agent decides to get involved with online lead generation. He creates online advertisements with Facebook, Craigslist, and Google Adwords in an attempt to direct traffic to his site. However, after spending much time and money on these ads, the agent has no leads to show for it and [&hellip;]<\/p>\n","protected":false},"author":29,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[34],"tags":[124,213,145,54,126,245,87,146,136],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/18661"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/29"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=18661"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/18661\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=18661"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=18661"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=18661"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}