{"id":18741,"date":"2013-09-16T16:33:00","date_gmt":"2013-09-16T16:33:00","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=18741"},"modified":"2016-02-05T09:20:51","modified_gmt":"2016-02-05T17:20:51","slug":"agent-spotlight-adam-king-of-highlands-ranch-colo","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/agent-spotlight-adam-king-of-highlands-ranch-colo\/","title":{"rendered":"Agent Spotlight: Adam King of Highlands Ranch, Colo."},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-full wp-image-18751\" title=\"Adam King\" src=\"\/wp-content\/uploads\/2013\/09\/Adam.jpg\" alt=\"Adam King is broker\/owner of Metrobrokers in Highlands Ranch, Colorado\" width=\"170\" height=\"170\" \/>Native Coloradan Adam King grew up dreaming of being a chiropractor. Instead, right out of college he began flipping houses. From there he moved right into residential sales, so real estate is all he’s ever known.<\/p>\n<p>The flipping occurred in Dallas. When he moved back to Colorado in 1997 to be with the lady he fell in love with, he left his flipping network behind, so he decided to sell residential real estate instead.<\/p>\n<p>Today, he’s the broker\/owner of <a href=\"http:\/\/forcoloradohomes.com\">Metrobrokers<\/a> in Highlands Ranch, Colo. “I like the idea of a boutique office because we’re locally owned, so the money stays local; it doesn’t go out to a national franchise,” King explained. “I get to control things and tailor them the way they work in Denver, not nationwide.”<\/p>\n<h2>Challenges<\/h2>\n<p>With the real estate market changing so rapidly we asked King to talk to us about some of the challenges he’s facing right now. One of the things he’s having a tough time dealing with is the unprofessionalism of some agents.<\/p>\n<p>“There are some really good agents in our business – they really get it, they really care, and they aren’t out there just to make a buck,” he says. “Sure, they’re making a living. Most of us are trying to make a good living. There are some agents, though, that just lack professionalism,” he continued. “So, professional communication can be a challenge when working with them.”<\/p>\n<p>Not one to point fingers, King quickly adds that another big challenge for him is keeping in touch with past clients. “I’m terrible at it,” he confessed. “I do some things, but not nearly as consistent as I should. That’s my challenge. It’s definitely my weak point, but I do have a company that’s helping me address that as we speak,” he said.<\/p>\n<h2>Marketing<\/h2>\n<p>Despite not reaching out to former clients as much as he thinks he should, King is fortunate to have a business based largely on referrals from past clients. Imagine what it will be like when he starts a client retention program!<\/p>\n<p>Although he loves all of Market Leader’s products, it’s the IDX that rocks his world. In fact, it’s what sold him on Market Leader products. “It was the most accurate IDX search engine that I could find for my clients to use outside of the MLS,” he said.<\/p>\n<h2>What’s to Like About Real Estate<\/h2>\n<p>King, like so many other agents, enjoys the personal interaction with his clients. “Working with people, it’s always something different,” he began. “I’ve worked with everyone from someone who works on the manufacturing line of a box manufacturer to the CEO of a multinational corporation.”<\/p>\n<p>“I’ve worked with some of the largest construction companies in the world, real estate attorneys and even other agents. I get people of all types, and that’s what’s fun,” King concluded.<\/p>\n<p>What he likes more than anything though, at this point in his career, is the time he can allot to be with his family. “I’d rather hang out with them than anybody else,” he admitted.<\/p>\n<p>King admits he’s not out to set the real estate world on fire at this point in life &#8211; a decision he and his wife made when the market tanked. Instead of “working the crazy hours,” he says, he now spends time coaching his sons’ baseball teams.<\/p>\n<p>His wife, Kim, by the way, is his inspiration for just about everything King does. “She’s an incredible example and resource for our boys and for me. She’s a huge, huge reason for my success,” King said.<\/p>\n<p>“Amy and I have been together since she graduated from high school. She’s much younger than me, but she knocked my socks off right away,” King said, laughing. They’ve been married for 13 years, and King says, “I got lucky – I married up. I had no idea how well I was doing, but as time goes on I realize, wow, I’m really lucky.”<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Native Coloradan Adam King grew up dreaming of being a chiropractor. Instead, right out of college he began flipping houses. From there he moved right into residential sales, so real estate is all he’s ever known. The flipping occurred in Dallas. When he moved back to Colorado in 1997 to be with the lady he [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[78,83],"tags":[190,307,275,308],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/18741"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=18741"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/18741\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=18741"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=18741"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=18741"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}