{"id":18811,"date":"2013-09-19T21:18:44","date_gmt":"2013-09-19T21:18:44","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=18811"},"modified":"2016-02-05T09:21:26","modified_gmt":"2016-02-05T17:21:26","slug":"the-pros-and-cons-of-national-real-estate-sites","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/the-pros-and-cons-of-national-real-estate-sites\/","title":{"rendered":"The Pros and Cons of National Real Estate Websites"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-18831\" title=\"The Pros and Cons of National Real Estate Websites\" src=\"\/wp-content\/uploads\/2013\/09\/Fotolia_53571161_XS-300x245.jpg\" alt=\"Agents have mixed feelings about the national real estate websites, but working with them can mean marketing to a much larger audience \" width=\"300\" height=\"245\" \/>Sure, it may sound trite, but it’s nonetheless true: Agents have a love\/hate relationship with the national real estate sites. ActiveRain is full of complaints from agents regarding the mistakes commonly found on the sites and about how chasing after these dead-end leads for their clients wastes precious time.<\/p>\n<p>Love them or hate them, agents still need to deal with the national sites because, as one ActiveRain poster states, “You can spend all of the time and money you want on your own website but the big three are still going to get the <a href=\"http:\/\/activerain.com\/blogsview\/3476614\/narep-forms-to-fight-abuse-of-the-big-3-in-listing-syndication#sthash.C7Ru2TWd.dpuf\">major rankings<\/a>.”<\/p>\n<p>Let’s take a look at some pros and cons of working with “the big three.”<\/p>\n<h2>Pros<\/h2>\n<p>Probably the biggest thing going for the national real estate sites is the fact that they rank at the top of most real estate-related Web searches. This means millions of real estate consumers visit these sites. That’s a lot of eyeballs to have on your brand.<\/p>\n<p>Since most people don’t visit these sites unless they’re actively looking at property, their audience is most assuredly focused on real estate – another mark in favor of national real estate websites.<\/p>\n<p>Most of the sites allow agents to restrict their ads to be seen only by consumers searching in a certain geographic area.<\/p>\n<p>Finally, there’s the branding benefits that appearing on these sites provides. Whether agents like it or not, the big real estate sites lend agents credibility – and that’s what helps win more clients.<\/p>\n<h2>Cons<\/h2>\n<p>Standing out in a sea of other real estate agents is challenging, and most places that agents choose to market their businesses are heavily populated with other agents vying for the same client pool.<\/p>\n<p>The national real estate sites are no different. The one saving grace is that many real estate agents find it difficult to part with money, so if a site charges to advertise, there will be less competition than you’ll find on free sites. Consider the enormous amount of competition you find in the Craigslist real estate section compared to what you find on Trulia, for instance.<\/p>\n<p>Another problem agents find with the national real estate sites is the amount of inaccurate or outdated information. Many of them don’t use MLS data, so home values quoted on the site may differ wildly from those you present to your listing client in your CMA. Agents complain that since these sites bill themselves as the experts, when figures vary, it erodes the trust they’ve worked so hard to build with their client.<\/p>\n<p>Then there are the homes advertised as available when they aren’t, and the time the agent wastes following up on these for his client.<\/p>\n<p>Finally, the cost of advertising on these sites is prohibitive for many agents. How much you’ll spend depends on the site and your area. Like any advertising campaign, however, you’ll need to give the process from three to six months and track your performance during that time period. You’ll also need to follow up and remain responsive to capture the leads.<\/p>\n<h2>Does it Work?<\/h2>\n<p>“My experience in this market is that Zillow and Trulia at least are excellent ways for me to allocate my <a href=\"http:\/\/activerain.com\/blogsview\/3819968\/online-real-estate-advertising#sthash.mov2zmST.dpuf\">advertising dollars<\/a>,” claims Scott Larson, a Park City, Utah agent in a response to a post at ActiveRain.<\/p>\n<p>“I have already closed one deal that will pay for all of my advertising at my current level of commitment for the next four years with several more in the pipeline,” he continues. “So far I would say that about 25 to 35 percent of my leads through these sources are good leads,” Larson concludes.<\/p>\n<p>The flip side to this comes from Noah Seidenberg, Chicago agent and reviewer on <a href=\"http:\/\/activerain.com\/product-reviews\/sales-marketing\/lead-generation-referrals\/zillow-agent-advertising\/126#sthash.nM7QrQ6w.dpuf\">ActiveRain<\/a>: “You can do better on ActiveRain for 20 or 40 bucks then you can do in Zillow for hundreds. I tried it and got leads that were asking about homes already under contract, sold or off the market for years.”<\/p>\n<p>National real estate sites can be a great source of leads if “you actually know how to work a lead,” according to Missouri agent Jeremy Johnston. We might also add that it helps to have a system in place to assist you in turning the leads into sales.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Sure, it may sound trite, but it’s nonetheless true: Agents have a love\/hate relationship with the national real estate sites. ActiveRain is full of complaints from agents regarding the mistakes commonly found on the sites and about how chasing after these dead-end leads for their clients wastes precious time. Love them or hate them, agents [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[50],"tags":[87,56,135,136],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/18811"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=18811"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/18811\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=18811"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=18811"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=18811"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}