{"id":18891,"date":"2013-09-23T18:10:05","date_gmt":"2013-09-23T18:10:05","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=18891"},"modified":"2021-12-02T13:30:07","modified_gmt":"2021-12-02T21:30:07","slug":"agent-spotlight-renee-helten-of-englewood-colo","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/agent-spotlight-renee-helten-of-englewood-colo\/","title":{"rendered":"Agent Spotlight: Renee Helten of Englewood, Colo."},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-18901\" title=\"Real Estate Agent Spotlight - Renee Helten\" src=\"\/wp-content\/uploads\/2013\/09\/Reneephotocolor-233x300.jpg\" alt=\"Renee Helten is a real estate agent with Keller Williams in Englewood, Colorado\" width=\"233\" height=\"300\" \/>Growing up, military brats experience a lot more than seeing the world. The discipline that the military parent learns is passed on to his or her offspring, which has served <a href=\"https:\/\/www.linkedin.com\/in\/reneehelten\/\">Renee Helten<\/a> of Keller Williams in Englewood, Colo. well.<\/p>\n<p>“I grew up all throughout the United States,” she said. “We made a circle, starting at Nebraska to Virginia near the Washington, D.C. area to Montgomery, Ala. – culture shock – to Colorado Springs, and then I became what we call a front-range girl.” The family landed in Denver, where Helten remained for 23 years.<\/p>\n<p>Helton loved living in different parts of the country and being able to meet a diverse array of people. From that, she claims, she gained “the knowledge, very, very young, that people are people no matter where you are. We’re all very much the same,” she explained. “Maybe different dialects or we sound a little bit different. But all in all, when you’re a 13- or 14-year-old girl, it doesn’t matter if you live in Alabama or Israel &#8211; you still like lip gloss and boys.<\/p>\n<p>Helton’s father, a colonel in the Air Force, taught her organizational skills and, as she explained, “a deep discipline and self-motivation to put 100 percent into everything that I do.”<\/p>\n<h2>The Best Laid Plans<\/h2>\n<p>Helten dreamed of becoming a doctor. She obtained a degree in journalism as she worked her way toward that dream but, science tripped her up.<\/p>\n<p>“After the second year of biology and chemistry classes and not doing great at organic chemistry, I decided that I didn’t want to go to school for 13 more years, so I wrote for a medical magazine and newsletters,” she recalled.<\/p>\n<p>“Then I went into special events and things like that for about two years. The second floor of the building I worked in had a little sign that said ‘real estate school upstairs,’” Helten said.<\/p>\n<p>After figuring out that no matter how hard she worked she’d still make the same amount of money, she decided to check out the real estate school.<\/p>\n<p>“So I went upstairs and the person that ran the real estate school &#8211; within 10 minutes of talking to me &#8211; said that she would hire me and train me,” Helten explained. “That’s what she and her husband did for a year, and I have not looked back. I will start my 18<sup>th<\/sup> year in real estate in November of this year.”<\/p>\n<h2>Challenges<\/h2>\n<p>I asked Helten what the challenges of a real estate veteran look like. “Juggling different tasks all at the same time &#8211; from technology and time management to anything that deals with people &#8211; and negotiations and contracts and law in between,” she said.<\/p>\n<p>She also faces challenges running the Helten team, with seven members including her.<\/p>\n<h2>Marketing and Referrals<\/h2>\n<p>Helten was introduced to Market Leader products when she joined Keller Williams. I asked her how her business has been impacted since adopting Market Leader products.<\/p>\n<p>“It has doubled,” she claimed, “especially with my Internet lead generation. I buy a certain amount of leads every month so that on a Google search or a Bing or a Yahoo, my search engine optimization for my eEdge website goes up.”<\/p>\n<p>She also mentioned that the team uses Craigslist and House Values. “All of that combined has made it so that my Internet lead generation has tripled from three years ago,” Helten said. “It’s just momentum and it’s consistency over time. You cannot expect to change your whole marketing business plan in a 90-day period of time,” she cautioned. “It’s a six to nine months’ time period. Now I’m almost at three years of working this aspect of lead generation and it’s good &#8211; a good pipeline and a good funnel of leads coming through.”<\/p>\n<p>Helten is also adept at cultivating relationships with past clients to keep referrals coming in.<\/p>\n<p>She insists that all Helten team members, including herself, talk to someone in the database three to four times a year. “Preferably, one of those four times includes seeing them in person,” she said, “doing something that’s as easy as having coffee or inviting them to one of our events.”<\/p>\n<p>Helten team events include a “big Halloween event, and then we do a client appreciation event in the summertime,” she said. “We want to see them once a year, if not twice a year, and really keep up with that database &#8211; making sure they’re not just names on a screen but people that we invest in,” Helten concluded.<\/p>\n<h2>What Sets Agents Apart?<\/h2>\n<p>“The one thing that I teach, the one thing that I preach about real estate and real estate professionals, is we all have the same 168 hours a week. What makes it so that one person is more successful than somebody else is the way in which they use that finite amount of time,” Helten said. “You have to really be able to manage your time: to know what to do and how quickly to do it. That’s what technology does for me; it buys me time.”<\/p>\n<h2>When She Isn’t Working<\/h2>\n<p>Helten leads a balanced life. “I have two kiddos; I have a 16-year-old boy, and a 14-year-old girl, and the most amazing husband on the planet,” she said. “My son plays football and my daughter is very involved in youth group and church activities, and I hang out with them and watch football practice and all of that kind of good stuff,” Helten continued. “I work about 55 hours a week and I spend about another 35 to 40 hours a week with them. So, I’m very balanced in what I do.”<\/p>\n<p>The family loves to travel and always has a trip planned. “We go on two or three major family trips every year,” Helten said. Active in her church, the family goes on short-term mission trips. “We have been to Israel and the Czech Republic. I have it in my blood to travel,” she said, chuckling. “My family and I have been to Costa Rica and Nicaragua. That’s kind of what I look forward to – I like to work hard, but I like to play hard.”<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Growing up, military brats experience a lot more than seeing the world. The discipline that the military parent learns is passed on to his or her offspring, which has served Renee Helten of Keller Williams in Englewood, Colo. well. “I grew up all throughout the United States,” she said. “We made a circle, starting at [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[78,83],"tags":[190,106,275,87,56],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/18891"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=18891"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/18891\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=18891"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=18891"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=18891"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}