{"id":19081,"date":"2013-09-28T00:25:09","date_gmt":"2013-09-28T00:25:09","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=19081"},"modified":"2016-02-05T09:20:17","modified_gmt":"2016-02-05T17:20:17","slug":"agent-spotlight-katrina-benton-of-anchorage-alaska","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/agent-spotlight-katrina-benton-of-anchorage-alaska\/","title":{"rendered":"Agent Spotlight: Katrina Benton of Anchorage, Alaska"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-19101\" title=\"Agent Spotlight - Katrina Benton\" src=\"\/wp-content\/uploads\/2013\/09\/katrina-benton-realtor-199x300.jpg\" alt=\"Katrina Benton is a Realtor in Anchorage, Alaska\" width=\"199\" height=\"300\" \/>Katrina Benton &#8211; who works for <a href=\"http:\/\/comehomeanchorage.com\">Keller Williams Realty, Alaska Group<\/a> &#8211; was recently in Texas, and somebody told her she has an “Alaskan accent.”<\/p>\n<p>“I was like, ‘What the heck is that?’” she said, laughing. I have to admit, it’s a bit disconcerting to conduct an interview over the phone with a woman who sounds exactly like Sara Palin. The similarity in cadence and inflection is uncanny. But still – a Texan pointing out someone else’s accent?<\/p>\n<p>Benton grew up in Kodiak, Alaska, and moved to Anchorage as a teenager. A third generation real estate agent, she started her career working for her dad in 2005. Although she considered other careers, she’s glad she settled on the family business. “It’s really great to be able to carry on that legacy,” Benton remarked.<\/p>\n<h2>Biggest Career Challenge Right Now<\/h2>\n<p>Benton’s career trajectory was foretold back in 2010 when she was crowned Rookie of the Year for the entire state of Alaska. Today, her challenges revolve around putting together her team.<\/p>\n<p>“Patience in training and recruiting talent, and being organized about the execution of this team plan,” takes most of her time, she said. Benton takes care of generating leads for the team while her listing specialist also manages the buyer team. Then there are two transaction coordinators and a marketing coordinator to help with administrative tasks.<\/p>\n<h2>Speaking of Marketing<\/h2>\n<p>Benton’s team relies heavily on Internet lead generation. “Ultimately, what I do is promote my website through social media and other ways, to drive traffic to my website,” she explained. “Right now my team is selling four to five houses a month, and they’re converting about 2 to 2.5 percent of the new leads I’m getting within the first 60 days. The challenge is that I need to get this team up and running and recruit more members,” Benton said.<\/p>\n<h2>Real Estate Aside<\/h2>\n<p>Outside of her hectic business schedule, Benton enjoys supporting Catholic Social Services in Anchorage and spending time with her three children.<\/p>\n<p>“Probably one of the best parts of having a team is that when I was alone I was working 14 hours a day, seven days a week, and now I get to see my kids and it’s awesome,” she said. “I’m like, ‘Oh my gosh, they’re so cute!’” she said, chuckling.<\/p>\n<p>One of her family’s favorite outings is returning to her roots. “I like to take them home to Kodiak and explore.”<\/p>\n<h2>The One Tool That is Most Critical<\/h2>\n<p>I asked Benton which tool she considers most critical to her business. “My website. My whole business all comes from that website and how much traffic I can drive to it,” she explained.<\/p>\n<p>The NAR statistics that point to how few agents get business from their websites confounds Benton. “You get what you put in. Just like everything. If I put everything into postcard marketing I’d be getting a lot of postcard marketing stuff,” she said. “If I put it all into advertising in magazines, I’m sure I’d get leads from that. But I don’t put anything anywhere else because my websites are so inexpensive for me to do everything; I do to get traffic there.”<\/p>\n<p>Benton credits MarketLeader products &#8211; especially her CRM &#8211; with a lot of her success. “When I was a buyer’s agent I sold about six houses a year. Now, it’s completely different – I have a nice house, a nice car. I have a team now. I don’t have to show houses anymore. It’s crazy how it’s changed things.<\/p>\n<h2>The Best Part of Waking Up<\/h2>\n<p>The best part of going to work every day for Benton is working with her team. “I love being successful through other people,” she began. “It’s a lot more fun for me than me selling a lot of houses.<\/p>\n<p>“I’m learning that it’s so much more rewarding. When one of my buyer’s agents sells a house and I get to give him that commission check – it’s just amazing to be able to provide a good life for other people besides myself. I think that’s my favorite part.”<\/p>\n<p>Read more about how <a href=\"http:\/\/files.marketleader.com\/pdfs\/CaseStudy-KatrinaBenton.pdf\">Katrina Benton succeeds with Market Leader<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Katrina Benton &#8211; who works for Keller Williams Realty, Alaska Group &#8211; was recently in Texas, and somebody told her she has an “Alaskan accent.” “I was like, ‘What the heck is that?’” she said, laughing. I have to admit, it’s a bit disconcerting to conduct an interview over the phone with a woman who [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[78,83],"tags":[190,310,106,275,56],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/19081"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=19081"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/19081\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=19081"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=19081"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=19081"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}