{"id":19151,"date":"2013-10-03T17:50:13","date_gmt":"2013-10-03T17:50:13","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=19151"},"modified":"2022-10-26T15:18:47","modified_gmt":"2022-10-26T22:18:47","slug":"how-to-lose-your-real-estate-license","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/how-to-lose-your-real-estate-license\/","title":{"rendered":"Top 3 Ways to Lose Your Real Estate License"},"content":{"rendered":"<p>If you think you have to be the world’s biggest shyster to lose your real estate license, think again. An innocently placed word in a property marketing piece, a bit of carelessness with money, or an unintentional omission of a material fact about a listing could land you in hot water with the real estate licensing gods.<\/p>\n<p>The grounds for revocation of an agent’s license are set by the state licensing board but are strikingly similar from state to state. Let’s take a quick refresher course on ways an agent can lose his or her license to practice real estate.<\/p>\n<h2 class=\"BlogH2\">1. Get a Criminal Conviction<\/h2>\n<p>A criminal conviction isn’t grounds for license revocation in all states, but in most states it is. And you don’t necessarily have to break as bad as Walter White to win this license-losing lottery.<\/p>\n<p>In Alaska, for instance, a guilty verdict for embezzlement, fraud, larceny, conspiracy to defraud or extortion will see your real estate license being ripped to shreds (AS 44.62).<\/p>\n<p>In Texas, conviction for a “crime of moral turpitude,” which includes murder, rape, robbery or embezzlement, will get your license immediately revoked.<\/p>\n<p>According to Paul Beakley, writing in Realtor Mag, <strong>it is impossible for anyone with a prior felony conviction to initially receive a real estate license in any state<\/strong>. Lest you think you can lie about a prior and get away with it, keep in mind that states take fingerprints before granting a real estate license. They <em>will<\/em> find out.<\/p>\n<h2 class=\"BlogH2\">2. Lie to Your Clients<\/h2>\n<p>Politicians get away with this stuff daily, but real estate agents across the country find themselves sans licenses for <strong>misrepresentation, deliberate ambiguity, exaggerating and omissions<\/strong>—all just pretty words for different types of lying. While one little lie may not get you in trouble, “do it often enough, or big enough, and you will lose your license,” according to Beakley.<\/p>\n<p>Where most agents run into trouble is during the disclosure process. Fifteen years ago, <strong>over half of the lawsuits against members of the National Association of Realtors® were for misrepresentation.<\/strong> The second largest number of lawsuits was for failure to disclose. The difference between the two infractions is that misrepresentation is not telling the whole story, and failure to disclose is not telling the story at all.<\/p>\n<p>Let’s face it: You’re a real estate agent, not a structural engineer—and it’s difficult to know everything about your listings. Foundations trip most agents up, with structural features running a close second.<\/p>\n<p>When it comes to disclosures, it’s important to disclose everything your client has told you. If need be, ask questions. Were any improvements done without permits? Are there any environmental problems that you or the sellers are aware of?<\/p>\n<p>You may think you can skate on misrepresentation, but of the three types of misrepresentation—innocent, negligent and fraudulent—only the first may save you. Failing to disclose out of ignorance is considered negligent, while purposefully keeping flaws a secret is fraudulent.<\/p>\n<p>Use your disclosure forms and <strong>always attribute third party information to the third party<\/strong>. For example, “According to the homeowner, the roof was replaced five years ago.”<\/p>\n<p>By the way, “disclosure” doesn’t apply only to property flaws. You must also disclose your relationship to the transaction. If you are a principal in it, you must disclose that fact or face losing your license.<\/p>\n<h2 class=\"BlogH2\">3. Mishandle or Steal Client Funds<\/h2>\n<p>Horror stories about shady real estate brokers dipping into buyer’s funds are a dime a dozen. Sometimes, though, money troubles happen even to the most honest of brokers and agents. The folks most in danger of being popped for money mistakes are brokers and property managers.<\/p>\n<p>Most of the problems stem from <strong>shoddy bookkeeping, commingling and “borrowing” the client’s money<\/strong>.<\/p>\n<p>To avoid temptation, client money should be with a title company, in escrow, or in a trust account. Property managers need to reconcile their books according to state laws. Not doing so may result in the loss of their licenses.<\/p>\n<p>Investigators generally look for patterns of wrongdoing. They will go over past transaction paperwork looking for violations or demonstrations of general incompetence.<\/p>\n<h2 class=\"BlogH2\">How to Avoid Losing Your Real Estate License<\/h2>\n<p>Of course, these aren’t the only ways for agents to lose their licenses. Unfortunately, there are many others—these are just some of the most common.<\/p>\n<p>The best way to avoid problems is to always tell the truth, avoid sloppiness when filling out contracts, and <strong>never, ever touch a client’s money for your own use.<\/strong><\/p>\n<p>When it comes to making decisions that may be morally questionable, use the following litmus test: If it would be uncomfortable to tell your mother about the course of action you’re considering, or to have it published in your local newspaper, then don’t do it!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>If you think you have to be the world’s biggest shyster to lose your real estate license, think again. An innocently placed word in a property marketing piece, a bit of carelessness with money, or an unintentional omission of a material fact about a listing could land you in hot water with the real estate [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":61712,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[83],"tags":[311,312,313,314,315,316,317,56,318,319],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/19151"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=19151"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/19151\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media\/61712"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=19151"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=19151"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=19151"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}