{"id":19246,"date":"2009-12-17T08:14:09","date_gmt":"2009-12-17T16:14:09","guid":{"rendered":"http:\/\/blog.marketleader.com\/?p=89"},"modified":"2009-12-17T08:14:09","modified_gmt":"2009-12-17T16:14:09","slug":"out-of-office-messages-that-delight-your-clients","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/out-of-office-messages-that-delight-your-clients\/","title":{"rendered":"Out of Office messages that delight your clients"},"content":{"rendered":"<p>You have 20 things to do at once.  Customers are calling.   They have questions about your new listing.  They want to go visit 10 houses they found on the Internet last night.<\/p>\n<p>You’re rarely in your office, and infrequently checking your email. That doesn’t mean response time with customers isn’t exceedingly important.  Responding to your customers as fast as possible through every channel – phone, email, fax and mail – is extremely important to delivering the highest-possible customer service. A leading auto-buying website did an interesting study. They found that a lead responded to in 24 hours vs less than 4 hours was half as likely to close. For better or worse, we live in an instant gratification environment and how responsive you are compared to your competition can have a profound effect on your revenue.<\/p>\n<p>But email, in particular, allows you to respond immediately.  Nearly every email service these days offers an “Out of Office assistant”, a tool that automatically sends a response to people who have emailed you, letting them know you’re out of the office.<\/p>\n<p>Most email services designed this tool for office workers, people who may be on a business trip and away from their desks for days on end.<\/p>\n<p>But for most real estate professionals, we recommend leaving your “Out of Office assistant” on all of the time.  This ensures that you’re getting back to customers immediately every time they email you.<\/p>\n<p>Now, clearly this doesn’t mean you’re responding specifically to their request.  But so few businesses do this, that you will delight your customers merely for the act of getting something back to them immediately.<\/p>\n<p>Imagine adding some value for your customer right back into that out-of-office email. Imagine a customer sent you and email, and within seconds received this response:<\/p>\n<blockquote><p>Thanks so much for your email!<\/p>\n<p>I’ll be able to address your email personally as soon as possible, and no later than by the end of the day today.<\/p>\n<p>I appreciate your patience, and would like to offer you a special treat while you’re waiting!  Just visit my Web site at www.AcmeRealty.com right now, and download a coupon for free cookie at Stan’s Bakery, on me.  Just tell Stan that I sent you, and the free cookie is yours!<\/p>\n<p>Enjoy, and I look forward to speaking with you soon!<\/p><\/blockquote>\n<p>What would you do if you got an email back like that?  Would you be surprised?  Delighted?<\/p>\n<p>The offer had nothing to do with your business, and everything to do with 1) getting back to the customer right away, 2) getting them to your website, and 3) delighting them with something unexpected and fun!<\/p>\n<p>There are a thousand different ways to handle these out-of-office emails, but make sure yours are working for you! And change it up regularly so those you communicate with regularly are curious about what will arrive in their Inbox after you&#8217;ve replied. You can even make offers that are directly related to your business if you have businesses you work with whether it&#8217;s a window washer or landscaper who might offer something to your customers that these people couldn&#8217;t otherwise get.<br \/>\nOr if you prefer, we have some alternative out-of-office messages below&#8230;<\/p>\n<ol>\n<li> I am currently out of the office at a job interview and will reply to you if I fail to get the position. Please be prepared for my mood.<\/li>\n<li>You are receiving this automatic notification because I am out of the office. If I was in, chances are you wouldn&#8217;t have received anything at all.<\/li>\n<li>Sorry to have missed you, but I&#8217;m at the doctor&#8217;s having my brain and heart removed so I can be promoted to our management team.<\/li>\n<li>I will be unable to delete all the emails you send me until I return from vacation. Please be patient, and your mail will be deleted in the order it was received.<\/li>\n<li>Thank you for your email. Your credit card has been charged $5.99 for the first 10 words and $1.99 for each additional word in your message.<\/li>\n<li>The email server is unable to verify your server connection. Your message has not been delivered. Please restart your computer and try sending again. (The beauty of this is that when you return, you can see who did this over and over and over&#8230;.)<\/li>\n<li>Thank you for your message, which has been added to a queuing system. You are currently in 352nd place, and can expect to receive a reply in approximately 19 weeks.<\/li>\n<li>Hi, I&#8217;m thinking about what you&#8217;ve just sent me. Please wait by your PC for my response.<\/li>\n<li>I&#8217;ve run away to join a different circus.<\/li>\n<\/ol>\n<p><input id=\"gwProxy\" type=\"hidden\" \/> <input id=\"jsProxy\" onclick=\"jsCall();\" type=\"hidden\" \/><\/p>\n","protected":false},"excerpt":{"rendered":"<p>You have 20 things to do at once. Customers are calling. They have questions about your new listing. They want to go visit 10 houses they found on the Internet last night. You’re rarely in your office, and infrequently checking your email. That doesn’t mean response time with customers isn’t exceedingly important. Responding to your [&hellip;]<\/p>\n","protected":false},"author":6,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[35,36],"tags":[],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/19246"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=19246"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/19246\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=19246"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=19246"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=19246"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}