{"id":19247,"date":"2010-01-06T08:28:35","date_gmt":"2010-01-06T16:28:35","guid":{"rendered":"http:\/\/blog.marketleader.com\/?p=84"},"modified":"2010-01-06T08:28:35","modified_gmt":"2010-01-06T16:28:35","slug":"three-ways-to-empower-your-business-cards","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/three-ways-to-empower-your-business-cards\/","title":{"rendered":"Three Ways to Empower your Business Cards"},"content":{"rendered":"<p>This may seem basic, but it’s far more than just ensuring that your Web address is on your business card. Because everybody has a Web address on their business card now.<span> <\/span>Too often, however, it blends in with the other contact information on the card.<span> <\/span>It doesn’t give people a reason to visit.<\/p>\n<p>What if you could change that?<span> <\/span>What if you applied the same strategies you just implemented for your email signature, right on your business card as well? Are you using the back of your business card?<span> <\/span>If so, what for?<span> <\/span>Is it simply a picture of you, or your company logo?<span> <\/span>Or could it be better served with a call to action? What if the back of your business card offered one of the following:<\/p>\n<ol>\n<li>Don’t just include your Web address.<span> <\/span>Include a link to your blog.<span> <\/span>Pick out some of your most popular and put a few samples. Don&#8217;t do massive print runs of your business cards so you can update them as you have new and interesting blog posts you&#8217;ve written or seen.<\/li>\n<li>An invitation to subscribe to your email newsletter, with a link to the sign-up page<\/li>\n<li>An offer for one of your new freebies, with a link to your Web site to redeem the offer<\/li>\n<\/ol>\n<p>Simply listing a Web address on your business card is passive.<span> <\/span>Giving customers and prospects a reason to visit is active, and will generate far better response, traffic and business back to you!<\/p>\n<p>At this point, real estate professionals sometimes ask us why we&#8217;re putting so much focus on Web sites and online information. The reason is simple – most people, both current and prospective customers, are more likely to take action online.<span> <\/span>They’re more likely to follow a knee-jerk reaction to click on a Web link, or visit a blog, than to make a phone call.<span> <\/span>They’re more likely to explore more information on their own, on their own time, as anonymously as possible, than identify themselves as more interested – at least in that moment.<\/p>\n<p>Getting your customers and prospects to take an extra step online keeps them in control, but also gets them one step closer to a more intimate contact with you.<span> <\/span>The information they’re exploring – information you’ve already built to be directly relevant to them – <em>will<\/em> lead them closer to another transaction, or a new business relationship with you.<\/p>\n<p>It will also significantly increase the “touches” you get with your customers.<span> <\/span>You may not be able to measure them all as phone calls, or walk-ins, but your business will be known far more exponentially by empowering customers and prospects with access to information, insights, content and giveaways right online.<\/p>\n<p>Do you have a great business card? Scan it and send it to us or post a link to it or just send it to us in the mail. We&#8217;d love to share your creativity.<\/p>\n<p><input id=\"gwProxy\" type=\"hidden\" \/><\/p>\n<p><!--Session data--><\/p>\n<p><input id=\"jsProxy\" onclick=\"jsCall();\" type=\"hidden\" \/><\/p>\n","protected":false},"excerpt":{"rendered":"<p>This may seem basic, but it’s far more than just ensuring that your Web address is on your business card. Because everybody has a Web address on their business card now. Too often, however, it blends in with the other contact information on the card. It doesn’t give people a reason to visit. What if [&hellip;]<\/p>\n","protected":false},"author":6,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[35,36],"tags":[],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/19247"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=19247"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/19247\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=19247"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=19247"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=19247"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}