{"id":19301,"date":"2013-10-07T16:55:46","date_gmt":"2013-10-07T16:55:46","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=19301"},"modified":"2022-10-24T10:20:16","modified_gmt":"2022-10-24T17:20:16","slug":"agent-spotlight-lori-ballen-of-las-vegas-nev","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/agent-spotlight-lori-ballen-of-las-vegas-nev\/","title":{"rendered":"Agent Spotlight: Lori Ballen of Las Vegas, Nev."},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-19321\" title=\"Agent Spotlight - Lori Ballen\" src=\"\/wp-content\/uploads\/2013\/10\/Lori-Ballen-Head-Shot-Summerlin-Las-Vegas-231x300.jpg\" alt=\"Lori Ballen is a real estate agent with Keller Williams in Las Vegas, Nevada\" width=\"231\" height=\"300\" \/>Real estate sales may be your career, but it’s also your business, and nobody gets this concept more than <a href=\"http:\/\/ballengrouphomes.com\">Lori Ballen<\/a> with Keller Williams in Las Vegas.<\/p>\n<p>Business wasn’t always her passion, though. “I grew up in Las Vegas – have been here since I was five,” she said. “I wanted to be a teacher for the handicapped or an interpreter for the deaf.”<\/p>\n<p>In fact, she reached one of those goals, becoming the youngest certified interpreter for the state of Nevada when she was only 17 years old.<\/p>\n<p>Think back to when you were 17. It’s not exactly the time for choosing a lifelong career and, sure enough, Ballen decided it “wasn’t quite as glamorous” as she thought it would be. So she had a baby and decided to go into business with her husband.<\/p>\n<h2>She Married a Magic Man<\/h2>\n<p>“We owned a catering and entertainment company,” Ballen recalled. Her husband, a Las Vegas magician at the time, owned a small party shop in the valley.<\/p>\n<p>“Together, we blew it up into the number one catering and entertainment company in Vegas,” Ballen rightfully boasts. “We catered all the big hotel company picnics for thousands and thousands of people. We wound up having a 10,000-square-foot, custom-built kitchen and a wedding banquet hall, and we owned all those big giant inflatable bounce houses and slides and carnival games for the kids,” she continued. “We also had an adjoining restaurant, so we really took it big.”<\/p>\n<p>Their bank accounts went big as well. “We sold the business in 2004 and thought we’d never have to work again to be honest with you,” Ballen remarked. “We were worth about $3.3 million at the time. With the market tanking, and a lot of really bad decisions, we wound up broke again.”<\/p>\n<p>So, back to work they went. Hubby went into real estate in 2007 while Ballen went to work at her brother’s computer software company.<\/p>\n<p>Hubby Richard, however, had bigger plans for his wife and their life. “He was convinced that if I applied the same marketing techniques that I did for our other businesses that we could kill it in real estate, and so he convinced me after seven months to come join him.”<\/p>\n<h2>The Ballen Group<\/h2>\n<p>Ballen started her real estate career with Coldwell Banker in 2007, and there she remained until 2010. That’s when she made the move to Keller Williams.<\/p>\n<p>Times have changed for Ballen since joining KW. She now oversees a team of eight who take over while she travels the country, teaching <a href=\"https:\/\/www.ballenacademy.com\/p\/the-ballen-method-to-marketing-bundle\">The Ballen Method<\/a>, her system of Internet lead generation.<\/p>\n<p>Sure, lots of agents have taken to the lecture circuit, but when an agent gets almost half of her business from organic search results, other agents clamor to learn how they can get those same results.<\/p>\n<h2>The Ballen Method<\/h2>\n<p>Ballen is a big believer in working niche markets in real estate. “We were shorts sales until April of this year and we saw the shift happen here in Vegas,” she explained.<\/p>\n<p>“We quickly decided that we needed a new niche. I really believe in having one thing that you nail at a high level, so we added Summerlin (a master-planned, high-end community of 40,000 homes on the west side of the Las Vegas valley) into the mix, and Summerlin is now our one thing. We kept the short sale site up because 35 percent of our listings are still short sales.<\/p>\n<p>I asked her for some wisdom from her live classes.<\/p>\n<p>“I teach that you never have to say no to other business,” she remarked. “When you find a niche you can focus on it proves that you have some sort of specialty, and it makes you not a jack of all trades. It just helps you leap out there in the world as a real estate agent more significantly,” she continued.<\/p>\n<p>“It doesn’t mean that all the other business won’t still come to you &#8211; because it does, by default. Once you’re out there and you’re found as a real estate agent, regardless of your specialty, they will call you for everything else, so you don’t have to choose to alienate the other things.”<\/p>\n<p>So, agents can have more than one niche? Doesn’t that kind of defeat the purpose?<\/p>\n<p>“I tell people, unless you have a lot of people on your team that can handle your websites, one niche is best,” Ballen explained. “But you can still do the other things – that’s a choice.”<\/p>\n<h2>Web-Based Real Estate<\/h2>\n<p>A Web-based real estate practice demands Web-based tools and systems. The Ballen Group uses Market Leader as the hub for everything else. “Then we use spin-off products,” she said. Once a month the team exports their sphere of influence from the Market Leader hub to the ancillary databases.<\/p>\n<p>“Keller Williams introduced me to Market Leader products,” Ballen explained. “I was building a team, and I had all these Web leads coming in. I had some kind of general database at the time – I think I was using Top Producer. I had all these leads and I was storing them all on a spreadsheet, and I was trying to track them all – who got what lead – and it was so frustrating,” she recalled.<\/p>\n<p>“I hadn’t heard of any team options,” she continued. “Somebody said, ‘Hey Lori, Market Leader has this system where you can track all of your agents and leads and who got what.’ I said, ‘You’ve got to be kidding’ – I about choked,” she said, laughing. Finally, a product that does exactly what she needs it to.<\/p>\n<p>“We’re able to track our team and we’re now better able to track our sources of where our leads are coming from, therefore being able to figure out which ones are performing at the higher level. And then we know where to spend more time or money so that we can increase the sales volume based on that particular source,” Ballen explained.<\/p>\n<p>“So Market Leader has really improved our entire strategy for how we track data,” she continued.<\/p>\n<p>“It’s amazing,” Ballen said. “We ended up working out a legal vendor services program where my lender pays for it. I just love, love, love what I can do with Market Leader.”<\/p>\n<h2>The One Word<\/h2>\n<p>Asked for a one-word description of what her life is like at this point, Ballen didn’t hesitate.<\/p>\n<p>“Magical,” she answered. “I live in such a place right now where life is just magic, and I feel like I can create whatever I want to create and do what I want to do. We constantly talk about the fact that we manifest our own magic and whatever we want in life is ours for the taking.”<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Real estate sales may be your career, but it’s also your business, and nobody gets this concept more than Lori Ballen with Keller Williams in Las Vegas. Business wasn’t always her passion, though. “I grew up in Las Vegas – have been here since I was five,” she said. “I wanted to be a teacher [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[78,83],"tags":[190,106,275,87,168,56],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/19301"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=19301"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/19301\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=19301"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=19301"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=19301"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}