{"id":19371,"date":"2013-10-10T23:18:57","date_gmt":"2013-10-10T23:18:57","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=19371"},"modified":"2021-11-19T11:42:45","modified_gmt":"2021-11-19T19:42:45","slug":"when-your-client-is-considering-a-fixer","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/when-your-client-is-considering-a-fixer\/","title":{"rendered":"What to Do When a Client is Considering a Fixer Upper"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-19391\" title=\"Is Your Client Buying a Fixer?\" src=\"\/wp-content\/uploads\/2013\/10\/Fotolia_47556948_XS-300x200.jpg\" alt=\"Real estate agents can help clients make the right choice for them when considering the purchase of a fixer house\" width=\"300\" height=\"200\" \/>We are a nation of fixer-uppers. For an active real estate agent, this isn’t news. With so many foreclosures that sat vacant and unattended for far too long, and inventories tight, much of the scant housing stock available has problems.<\/p>\n<p>A fixer is always a good suggestion for the buyer with a tight budget but a huge wish list that can’t be whittled down. With the right fixer, the buyer can get the square footage and the number of bedrooms he wants and then customize the home to include the other items on the list.<\/p>\n<p>David Bailey with Keller Williams, Beverly Hills, agrees. “A fixer can be a perfect solution when your clients have long lists with a lot of requirements and if they’re willing to do the work,” he tells HGTV.<\/p>\n<p>Whether you have clients looking specifically for fixers or you hope to suggest one to a difficult client, let’s take a look at ways to help that client make the right decision.<\/p>\n<h2>Prepare With the Facts<\/h2>\n<p>Whether your client is set on buying a rundown, major fixer or a place that maybe needs a few repairs or even just cosmetic work, it’s important to help him realistically address the situation. Ask your client the following questions:<\/p>\n<ul>\n<li>How much money is available, or how much can be borrowed?<\/li>\n<\/ul>\n<ul>\n<li>What skills, if any, does the client or his friends and family bring to the table? Carpentry, plumbing, flooring, and even painting experience can help cut costs dramatically.<\/li>\n<\/ul>\n<ul>\n<li>How long is the client willing and able to wait to move into the home? There are financial aspects to this as well. Depending on the loan he gets, he may have to pay two house payments during the process.<\/li>\n<\/ul>\n<h2>It’s a Go<\/h2>\n<p>Although a fixer may be priced lower than a non-fixer, consider that each house your client considers will require inspection – maybe more than one.<\/p>\n<p>Once he settles on a home and understands the scope of work that needs to be done, it’s time to price that work. Bring in a contractor to go over the client’s wish list and determine if it can be rehabbed to meet his wants.<\/p>\n<p>The client will also get a price for the renovations, which then gives you both a basis from which to determine an appropriate amount to offer for the house.<\/p>\n<h2>Financing the Rehab<\/h2>\n<p>There was a time when obtaining a loan to purchase a home that required work was almost impossible. Thankfully, your buyers have more options today.<\/p>\n<p>The most popular of these options is what is known as a “future value” loan – a loan based on the value of the home after improvements are made. These loans can be either conventional (Wells Fargo offers one) or federally-insured via the <a href=\"https:\/\/www.hud.gov\/program_offices\/housing\/sfh\/203k\/203k--df\">FHA 203k program<\/a>.<\/p>\n<p>The purchase plus renovation loans offer the convenience of wrapping both the purchase and the cost of the rehab into one loan so your client will only have one payment.<\/p>\n<p>The loans have either adjustable or fixed rates and can be used for single-family dwellings, one-to-four units, condos and planned unit developments.<\/p>\n<p>The beauty of these loans is that the loan amount is based on the market value of the home after the renovations are complete.<\/p>\n<h2>FHA 203k Application Process<\/h2>\n<p>The FHA 203k application process is a bit lengthy, so if your clients decide they want to pursue this option, they’ll need to get started immediately.<\/p>\n<p>Here are the basic steps in the process, once your client finds a home she wants to purchase:<\/p>\n<ul>\n<li><strong>Preliminary Feasibility Analysis<\/strong> – Before submitting an offer, you and your client need to list all the work that needs to be performed along with a rough estimate of the cost of each item. Then, you’ll need to determine the home’s market value after this work is complete. This basic analysis is merely to determine if the purchase is worth it to the buyer.<\/li>\n<\/ul>\n<ul>\n<li><strong>Client Chooses a Lender<\/strong> – If your client decides to move forward, she will need to choose a lender that specializes in the 203k program.<\/li>\n<\/ul>\n<ul>\n<li><strong>Purchase Agreement<\/strong> – Submit the purchase agreement to the seller, subject to the buyer’s approval for an FHA 203k loan and his acceptance of any additional lender or HUD-required improvements.<\/li>\n<\/ul>\n<ul>\n<li><strong>Work Write-Up and Cost Estimate<\/strong> – This part of the process is completed by the buyer’s “consultant,” or contractor. There is more information about this consultant at HUD’s website. The exhibits prepared are then submitted to HUD. If accepted, HUD issues a case number and assigns a plan reviewer, appraiser and inspector.<\/li>\n<\/ul>\n<ul>\n<li><strong>Site Review by the Fee Consultant<\/strong> – The HUD-approved fee consultant will visit the property to ensure that everything meets HUD requirements.<\/li>\n<\/ul>\n<ul>\n<li><strong>Appraisal<\/strong><\/li>\n<\/ul>\n<ul>\n<li><strong>Lender Review<\/strong> – The lender reviews the appraisal and then issues a Conditional Commitment\/Statement of Appraised Value. This tells your client how much money the lender is willing to loan on the property.<\/li>\n<\/ul>\n<ul>\n<li><strong>Client Provides Documentation to the Lender<\/strong> – Verification of employment and income and any other documents required for the lender to assess your client’s credit risk need to be provided to the lender.<\/li>\n<\/ul>\n<ul>\n<li><strong>Approval<\/strong><\/li>\n<\/ul>\n<ul>\n<li><strong>Closing<\/strong> – The Rehabilitation Loan Agreement sets forth when, and under which conditions, the lender will disburse the funds from the escrow account. The buyer will be responsible for mortgage payments on the whole loan – even escrow amounts yet to be disbursed.<\/li>\n<\/ul>\n<p>After the close of escrow, rehab work begins. Your client will have six months to complete the improvements, although larger projects may get more time.<\/p>\n<p>While the FHA option was at one time more affordable, with the recent changes in MIP requirements, a conventional loan may be better in the long run. Counsel your fixer-inclined clients to speak with an accountant to determine which loan best suits their needs.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>We are a nation of fixer-uppers. For an active real estate agent, this isn’t news. With so many foreclosures that sat vacant and unattended for far too long, and inventories tight, much of the scant housing stock available has problems. A fixer is always a good suggestion for the buyer with a tight budget but [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[83],"tags":[320,84,124,321,220,322,256,323,222,324,325],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/19371"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=19371"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/19371\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=19371"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=19371"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=19371"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}