{"id":19471,"date":"2013-10-14T16:28:23","date_gmt":"2013-10-14T16:28:23","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=19471"},"modified":"2016-02-04T16:58:10","modified_gmt":"2016-02-05T00:58:10","slug":"agent-spotlight-coleen-brennan-of-corona-del-mar-calif","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/agent-spotlight-coleen-brennan-of-corona-del-mar-calif\/","title":{"rendered":"Agent Spotlight: Coleen Brennan of Corona Del Mar, Calif."},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-19491\" title=\"Agent Spotlight - Coleen Brennan\" src=\"\/wp-content\/uploads\/2013\/10\/ColeenCROP-246x300.jpg\" alt=\"Coleen Brennan is a real estate agent with Berkshire Hathaway in Southern California\" width=\"246\" height=\"300\" \/>Poster girl for the baby boomer generation, <a href=\"http:\/\/www.homesinnewportcoastca.com\">Coleen Brennan<\/a> took up surfing when she was 50. She runs 6 miles every morning and skis or surfs on her breaks from work.<\/p>\n<p>Brennan grew up north of Boston but left home shortly after getting married. The couple ended up in Jackson Hole, Wyo., then Salt Lake City, Park City and finally Newport Beach, on the sunny Southern California coast.<\/p>\n<p>Brennan’s dream as a child was to be a flight attendant. The dream never became reality because she’s too tiny – “I never hit 5 feet,” she said, laughing. At the time, to become a flight attendant a woman had to be at least 5 feet, 2 inches.<\/p>\n<p>That didn’t stop her from flying, though. But we’ll get to that in a minute.<\/p>\n<h2>College Days<\/h2>\n<p>Brennan obtained her master’s degree in education and went into a career as a speech pathologist.<\/p>\n<p>“When I lived in Utah I became the head of the speech and hearing department for the state training school, which is where the developmentally disabled people live,” she recalled. She considered going for a doctorate but her husband’s success prompted her to rethink the idea.<\/p>\n<p>“My husband went into repping hard goods, and he was skiing and travelling and making a lot of money, and I was not,” she explained. “I felt maybe I was missing something, so I quit my job and started repping. I started out with little knit hats at $12 a dozen and backpacks, and from there worked up to some major brands.”<\/p>\n<p>At one point during her career the couple bought an airplane and Brennan got her pilot’s license. “I’d fly my samples to the buyers for them to look at,” she remarked. “We got caught in clear air turbulence over the Tetons and decided that if we got down, we would sell the plane. So, we bought a sailboat because I can swim, but I can’t fly,” she said, laughing.<\/p>\n<h2>Real Estate Beckons<\/h2>\n<p>Once upon a time, MLS listings came in the form of a huge book, like a telephone directory, with black-and-white thumbnail images. The books were closely guarded by agents, much as the MLS database is today.<\/p>\n<p>“I started looking for property in Newport,” Brennan recalls, “but my broker would not let me look at the book. I told him how much easier it would be if I could go through it and tell him what I wanted to see, but he wouldn’t let me. So I got my real estate license so I could look at my own book,” she said.<\/p>\n<p>She was quickly smitten by everything about being an agent. “I loved the fact that every day you had the opportunity to do anything you wanted,” she said. “You could work as hard as you wanted. No one could tell you what to do.”<\/p>\n<h2>Today<\/h2>\n<p>When asked about her biggest challenges today, 28 years after getting her license, Brennan offered me a job.<\/p>\n<p>“I need an assistant and I need someone to help me with these leads,” she remarked. “I have 4,000 leads on this program and 3,000 leads on another. I physically can’t get to them. You available?” she said, laughing.<\/p>\n<p>Brennan overseas a team of five and has tried to get them interested in working her leads. “I’ve tried &#8211; you know, ‘here are a few leads’ &#8211; but they don’t get instant gratification from them, so they let them die,” she said.<\/p>\n<h2>Successes<\/h2>\n<p>Brennan credits Market Leader’s leads for most of her success. “My money is better spent not on my own webpage &#8211; who cares where I come up on Google? I’m Google-able. But I’d much rather pay Market Leader the money to have them send me somebody,” she said. It helps that she’s an ace at converting leads – and actually finds the task enjoyable.<\/p>\n<p>Brennan became acquainted with Market Leader products in 2002. “The beauty of Market Leader is that I get quality leads; they’re exclusive leads,” she explained.<\/p>\n<p>In fact, she finds Market Leader’s leads invaluable to not only her business but also her peace of mind. “I don’t worry, I come to work every day so excited, and I’m on safari – who’s my next victim? And they’re all sitting here waiting,” she said.<\/p>\n<p>“The one feature I love about their process is when a person looks at a property online, I can go to that property and I can see who has looked at it. So I can work that house – talk to the people about this house and not be scattered. I can be focused on a group. I have other lead sources and they don’t have that feature,” she concluded.<\/p>\n<h2>Is She Ready to Hang Up the Shingle?<\/h2>\n<p>I asked Brennan where she sees herself a decade from now. She has mixed emotions about retirement. “I probably have three to five years left in the business. But I don’t want to get bored,” she said. “I can’t go from Mach 5 like I am, down to zero.”<\/p>\n<p>Like most boomers, though, she’s prioritizing what’s important in life. She jogs every morning and takes monthly trips to surf in Hawaii or to fly fish with her husband.<\/p>\n<p>“I’ve seen dramatic changes in this last year or so with friends who have passed away, and my dad at 90 just had a small stroke. It makes me keenly aware of time,” she explained.<\/p>\n<p>“Up until this point, I’d get up in the morning and run 6 miles and I wasn’t 60-something – until I looked in the mirror,” Brennan reflects. “But things and people in your environment are so finite. Then you start thinking, ‘OK, maybe I <em>can<\/em> go out to lunch when I want to eat; I don’t have to sit here,” she theorizes.<\/p>\n<p>“Yeah, I have a lot of stress, but it’s good stress. I’m never done with what I’m doing. I don’t sit down and rest. So, it’s all good. There are obstacles along the way, but it’s all good.”<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Poster girl for the baby boomer generation, Coleen Brennan took up surfing when she was 50. She runs 6 miles every morning and skis or surfs on her breaks from work. Brennan grew up north of Boston but left home shortly after getting married. The couple ended up in Jackson Hole, Wyo., then Salt Lake [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[78,83],"tags":[190,275,56],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/19471"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=19471"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/19471\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=19471"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=19471"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=19471"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}