{"id":19591,"date":"2013-10-17T19:00:48","date_gmt":"2013-10-17T19:00:48","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=19591"},"modified":"2021-11-22T13:22:13","modified_gmt":"2021-11-22T21:22:13","slug":"make-time-to-communicate-with-your-clients","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/make-time-to-communicate-with-your-clients\/","title":{"rendered":"Make Time to Communicate With Your Clients"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-19611\" title=\"Make Time to Communicate With Your Clients\" src=\"\/wp-content\/uploads\/2013\/10\/Fotolia_55885178_XS-300x300.jpg\" alt=\"Real estate agents can't afford to not spend time communicating with their clients\" width=\"300\" height=\"300\" \/>Remember all those reasons you gave your clients for hiring you in the first place? Like a politician who says one thing to get elected and something completely different after we vote for him, a real estate agent who sells herself one way and doesn’t deliver on those promises won’t be getting many referrals. Nobody wants to be that agent.<\/p>\n<p>Even following up on what you explicitly promise may not be enough to meet a client’s expectations, however. Maybe you don’t promise consistent communication, but I’m willing to wager that most, if not all, of your clients expect it.<\/p>\n<p>A wise broker once said: “Never take a current client for granted.” In other words, real estate agents should never view a current client as a “done deal.”<\/p>\n<h2>Tick-Tock: Time Management<\/h2>\n<p>Time – that pesky commodity we have so little of. Trying to squeeze everything that needs to be done into a typical work day can be a full-time job in itself. How you use time, however, may just determine your success in the real estate industry – at least according to Keller Williams’ Englewood, Colo. trainer and agent Renee Helten.<\/p>\n<p>“We all have the same 168 hours a week,” she reminds us. “What makes it so that one person is more successful than somebody else is the way in which they use that finite amount of time,” Helten said.<\/p>\n<p>It’s all about prioritizing what needs to be done and then plugging those priorities into the time you have available. Sure, you will invariably end up with too many duties left undone, and that’s when you need to be creative and find a way to “make” time.<\/p>\n<h2>Phone Calls<\/h2>\n<p>One way to do this is to commit to the telephone one evening a week and use it to call all your current clients. If you consistently call your clients on a specific night every week, they’ll learn to expect it and will typically hold their questions for your weekly call instead of blowing up your cell phone while you’re working in the daytime.<\/p>\n<p>Yes, it’s time-consuming, but so is chasing after clients, which you won’t have to do anymore when your business runs on a referral base. Spend the time now or in the future – it’s your choice.<\/p>\n<h2>Hire and Delegate<\/h2>\n<p>If you’re so busy, or you have so many clients that you can’t find the time to check in with them, maybe it’s time to hire an assistant.<\/p>\n<p>While an unlicensed assistant may be a lifesaver in other aspects of your business, you may want to consider hiring a licensed assistant to perform your client contact duties. There are advantages and disadvantages to both, according to the pros at Keller Williams Realty.<\/p>\n<p>The biggest advantage to a licensed assistant is that he or she is already real-estate savvy and doesn’t need training. The biggest disadvantage is that the licensed assistant may cost more and may have an eye toward bringing in her own clients.<\/p>\n<p>The assistant you do choose needs to be able to answer questions about the transactions &#8211; how they are progressing &#8211; and keep detailed notes of the conversations. She should also communicate with your clients via their preferred method, whether it’s by phone, text or email.<\/p>\n<h2>Written Communication<\/h2>\n<p>The bulk of client communication takes place when you first meet your clients, whether homeowners or buyers. The real estate transaction process is complicated for most consumers, and a good agent takes the time to walk his clients through it.<\/p>\n<p>Consider using written content to do this for you. Kris Lindahl, an agent with Edina Realty in Minnesota, provides his clients with free e-books at the outset of a transaction. He has one for sellers, one for buyers, one for veterans, one for short sellers, and one for folks who are interested in using a USDA Rural Development Loan. An extremely busy agent, these e-books save him hours every week. And his clients enjoy having the information at their fingertips.<\/p>\n<p>E-books are easy to put together using blog posts, or hire a ghostwriter to write them for you.<\/p>\n<p>If you don’t like the idea of e-books, perhaps you’ll consider putting that same type of content on your website. Basic, beginner articles on everything from shopping for a lender to what happens at closing will save you the time of having to explain the processes to clients.<\/p>\n<h2>What to Communicate<\/h2>\n<p>Once you’ve decided that you need to get better at communication, decide what you’ll say to your clients. That’s easy to do if you keep a running summary of all of the activity performed for each client.<\/p>\n<ul>\n<li><strong>Listing information &#8211;<\/strong> It’s loaded into the MLS, the sign company will be out tomorrow, the lockbox goes on tonight, etc.<\/li>\n<\/ul>\n<ul>\n<li><strong>What you’ve done since the last contact &#8211;<\/strong> Spoke with a buyer’s agent about the home’s square footage, refilled the flyer canister, ordered the preliminary title report, etc.<\/li>\n<\/ul>\n<ul>\n<li><strong>Neighborhood news &#8211;<\/strong> New listings and sales, or listings that have received offers, are always interesting to buyers and sellers.<\/li>\n<\/ul>\n<ul>\n<li><strong>Action plan &#8211;<\/strong> What you are planning for the coming week.<\/li>\n<\/ul>\n<ul>\n<li><strong>Client concerns &#8211;<\/strong> Finally, ask if they have any questions or concerns.<\/li>\n<\/ul>\n<p>On her website, Las Vegas super-agent Lori Ballen summed up her experiences at a recent Hear it Direct conference. She said of the buyers on the panel: “They ALL want more communication.”<\/p>\n<p>As proof, the Gen Y panel moderator asked one consumer about the shortcomings of her real estate agent. “She didn’t tell you what the process was going to be?”<\/p>\n<p>“Not at all,” answered the consumer.<\/p>\n<p>Nobody wants to be that agent. Find time to communicate, to explain the process, and to counsel your clients.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Remember all those reasons you gave your clients for hiring you in the first place? Like a politician who says one thing to get elected and something completely different after we vote for him, a real estate agent who sells herself one way and doesn’t deliver on those promises won’t be getting many referrals. Nobody [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[83],"tags":[154,124,292,201,156,56,262,326,327],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/19591"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=19591"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/19591\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=19591"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=19591"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=19591"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}