{"id":19681,"date":"2013-10-23T16:40:32","date_gmt":"2013-10-23T16:40:32","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=19681"},"modified":"2021-12-02T13:43:31","modified_gmt":"2021-12-02T21:43:31","slug":"google-adwords-101-a-primer-for-real-estate-agents","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/google-adwords-101-a-primer-for-real-estate-agents\/","title":{"rendered":"Google Adwords 101: A Primer for Real Estate Agents"},"content":{"rendered":"<p>Ever wonder how Google makes so much money when it doesn’t seem to charge it’s users for anything? The answer is Google Adwords. Advertising made Google over $43 billion in 2012.<\/p>\n<p>That is over $100 million in search advertising and <a href=\"https:\/\/www.searchenginewatch.com\/2012\/10\/26\/how-google-rakes-in-over-100-million-in-search-advertising-daily-infographic\/\">237.9 million Google ad clicks<\/a> each day. Google does it by getting the vast majority of the Internet eyeballs.<\/p>\n<h2>Why Agents Should Care About Adwords<\/h2>\n<ul style=\"list-style-type: disc;\">\n<li>90 percent of <a href=\"https:\/\/www.nar.realtor\/research-and-statistics\/research-reports\/real-estate-in-a-digital-age\">homebuyers searched online<\/a> during their home-buying process.<\/li>\n<li>Real estate-related searches on Google grew 253 percent over the past four years.<\/li>\n<\/ul>\n<h2>Search Ads<\/h2>\n<p>These are the ads in Google search results on the top and to the right of the “organic” unpaid results. Search has become the go-to place for homebuyers and sellers, and one of the best ways to find and connect with active home searchers is on Google. You can go the organic route and optimize your website, which may or may not be enough to improve your rank in search results, or you can pay to be up with the big players in the paid search ads.<\/p>\n<p><img loading=\"lazy\" class=\" wp-image-19741 \" title=\"Google Adwords Search Results\" src=\"\/wp-content\/uploads\/2013\/10\/Google-Adwords-Search-Results.png\" alt=\"Google Adwords enables real estate agents to advertise online in paid search results\" width=\"683\" height=\"420\" \/><\/p>\n<h2>How Does it Work?<\/h2>\n<p>You choose the phrases, called keywords, that will cause your ad to appear in the paid search results. Google determines which ads appear based on an auction as well as the quality and relevance of your site and ad copy to the keyword.<\/p>\n<p>For example, an agent in Bellevue, Wash. wants to connect with homebuyers in that area. If the agent sets up a campaign and bids on “Bellevue WA homes for sale,” his ad may or may not show up. Google decides which ads to display and where they are displayed.<\/p>\n<h2>Why Might Ads Not Appear?<\/h2>\n<p>Ad Rank is determined based on the max CPC (cost per click) bid price you set and a complicated and secret algorithm known as Quality Score. How quality score is determined is a super-secret of Google’s, but it is Google’s assessment of how relevant your chosen keyword is to your site, your ad copy and the Adwords history. If the combined score is lower than your competitors&#8217;, your ad will show up below theirs or not at all.<\/p>\n<p>Another reason an ad might not show up is if the ad is disapproved or budget is near or at the limit. If your budget is lower than Google thinks it can spend in a day, they will show your ad less frequently. Google now also personalizes their search to the individual user. This mean each time someone searches, the results may be different, even if the advertisers don’t change anything.<\/p>\n<p>So, if the agent’s ad in the example above is showing up when someone searches for “Bellevue homes for sale,” he probably meets these requirements:<\/p>\n<ul>\n<li><img loading=\"lazy\" class=\"alignright wp-image-19871\" title=\"Google Adwords Example\" src=\"\/wp-content\/uploads\/2013\/10\/Google-Adwords-Example.png\" alt=\"Ads must meet certain requirements in order to be effective in Google Adwords\" width=\"234\" height=\"97\" \/>Ad copy includes an offer to view Bellevue homes for sale.<\/li>\n<li>Landing page takes the user to listings for Bellevue homes.<\/li>\n<li>Campaign has enough budget remaining.<\/li>\n<li>Bid max CPC is high compared to competition (above the first page bid estimate).<\/li>\n<li>Ad meets Google editorial guidelines; no disapprovals.<\/li>\n<\/ul>\n<p>Search ads are just the beginning of what Google offers. Let’s look at the different types of ads you can use with Google Adwords to attract homebuyers and sellers.<\/p>\n<h2>Mobile Ads<\/h2>\n<p>These are text or banner ads on mobile devices. These are automatically targeted in your search campaigns. Home buying is going mobile, and according to a National Association of Realtors® study, 89 percent of new home shoppers use a mobile search engine in their research.<\/p>\n<p>Best practice for mobile: Mobile can and often does perform differently than computer traffic. You will need to monitor the performance and set different bid adjustments for your ads.<\/p>\n<p><img loading=\"lazy\" class=\" wp-image-19771 \" title=\"Mobile Adwords\" src=\"\/wp-content\/uploads\/2013\/10\/adwords-home7.png\" alt=\"Mobile advertising can help real estate agents reach more leads\" width=\"391\" height=\"266\" \/><\/p>\n<h2>Display Text Ads &amp; Banner Ads<\/h2>\n<p>Not only can you target people searching for content, you can also target people looking at content. There are Google ad placements all over the Internet, from local blogs to top news and content sites. All these sites together are known collectively as the Google Display Network. These campaigns are different than search campaigns since the audience is not actively searching, but browsing pages. This leads to generally lower click-through rates (the percentage of people who click on your ad).<\/p>\n<p>This is a good way for agents to get even more traffic and connect with more homebuyers, but is more complicated to optimize since you have to convey the type of content on which your ad should appear and exclude placements that are not working.<\/p>\n<p>Best practice: Turn off display on your search campaigns to start out with. In Adwords, the default for new campaigns is to have both the search network and display network turned on, despite Google saying it is a best practice to have separate campaigns for search and display. If you are interested in building out display campaigns, then build a second campaign for display. This will allow you to better set up the display campaign for success, better monitor the performance of your display campaign, and make sure your search campaigns that are hopefully performing great keep performing great.<\/p>\n<h2>Video Ads – YouTube or Display Network<\/h2>\n<p>You can also use Google Adwords to promote a video. One option is to run video ads like banner ads. These ads are outside YouTube and will appear on the display network sites as banner ads, but with video content instead of a banner image.  Another option is to use In-Stream ads. These are commercial videos that run automatically before the video that a viewer has selected. The viewer can skip the commercial after 15 seconds. This would be best for short video ads. A third option is to use in-search or in-display ad. These are the text and image ads that appear in YouTube search results and next to videos. Use these for more informational videos about neighborhoods or real estate how-tos, not commercials. Video advertising has great potential for agents, since <a href=\"https:\/\/www.nar.realtor\/research-and-statistics\/research-reports\/real-estate-in-a-digital-age\">51 percent of home shoppers<\/a> report using YouTube in their home search.<\/p>\n<p>Best Practice: Make videos 30 seconds or less; many people have short attention spans and may want to watch multiple videos.<\/p>\n<p><img loading=\"lazy\" class=\" wp-image-19811 \" title=\"Video Advertising\" src=\"\/wp-content\/uploads\/2013\/10\/Video-Advertising.png\" alt=\"Many homebuyers use videos during their online home search\" width=\"479\" height=\"371\" \/><\/p>\n<p>Google Adwords is a great way to generate leads and connect to homebuyer and sellers. There are many different options and things to learn in order for agents to advertise effectively. Market Leader has a team of Google Adwords experts that run advertising for all our paid leads products. Learn how Market Leader can help you generate more <a href=\"\/products\/real-estate-leads\/\">real estate leads<\/a>, not just clicks.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Ever wonder how Google makes so much money when it doesn’t seem to charge it’s users for anything? The answer is Google Adwords. Advertising made Google over $43 billion in 2012. That is over $100 million in search advertising and 237.9 million Google ad clicks each day. Google does it by getting the vast majority [&hellip;]<\/p>\n","protected":false},"author":29,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[35],"tags":[300,119,302,328,304,87,68,329,330],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/19681"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/29"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=19681"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/19681\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=19681"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=19681"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=19681"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}