{"id":197,"date":"2009-10-21T11:43:40","date_gmt":"2009-10-21T19:43:40","guid":{"rendered":"http:\/\/blog.marketleader.com\/?p=197"},"modified":"2009-10-21T11:43:40","modified_gmt":"2009-10-21T19:43:40","slug":"5-myths-of-real-estate-advertising","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/5-myths-of-real-estate-advertising\/","title":{"rendered":"5 Myths of Real Estate Advertising"},"content":{"rendered":"<p>Change is one thing you can count on in the real estate business. And as many top agents know, success depends upon adapting your advertising approach to meet the ever-changing needs of your consumers. Nevertheless, several key misconceptions about real estate advertising are preventing many agents from using Internet advertising to take their business to the next level.<\/p>\n<p>It may be more comfortable to do things the same way you always have, but the “same way” may now lead to fewer clients. Here’s a list of the most common myths about real estate advertising — and the surprising truths that can help you win more business now and in the future.<\/p>\n<p><strong>Myth #1: I can’t afford a Web site.<\/strong><\/p>\n<p><strong> <\/strong><\/p>\n<p><strong>The reality: <\/strong>You can’t afford <strong>not <\/strong>to have a Web site. It’s the critical marketing piece that informs potential buyers and sellers about you, your experience, your services, and your brand. It displays your listings and testimonials of your satisfied past clients. A well designed site actively generates leads. <em>And <\/em>it identifies you as an Internet-savvy real estate agent. (Why is it so important for you to be an Internet-savvy agent? You’ll find out in Myth #3.)<\/p>\n<p>Many agents mistakenly assume that a Web site is hard to organize, design and maintain—so they don’t even bother to learn more. However, many companies provide Web sites with professionally designed templates specifically designed to generate inquiries for real estate agents. You only need to personalize them with your brand and contact information as well as valuable neighborhood information that will make your Web site a true resource to buyers and sellers—not just an online brochure. When you simply put your Web address on all your emails, voicemail and business cards, you integrate your Web site into your marketing message. Your clients will appreciate that you make it easy for them to obtain helpful information about buying and selling a home.<\/p>\n<p><strong>Myth #2: Internet leads don’t really close.<\/strong><\/p>\n<p>The reality: According to the National Association of Realtors® (NAR), 84 percent of consumers use the Internet to search for homes to buy. Over 80 percent of home buyers who used the Internet to search for a home bought through a real estate agent, according to NAR. On the other hand, 65 percent of non-Internet users did that.<\/p>\n<p>The fact is, Internet buyers aren’t looky-loos; they’re looking to buy a home. They’re so interested in the process that they use the Internet—a convenient and fast research tool—to get the process started. After they’ve found some helpful information and are ready for the next step, they naturally use the Internet to find the real estate professional they need to take them through the rest of the process. If you stick to traditional lines of marketing to find new business, you’re missing out on a huge (and growing) source of transactions and income.<\/p>\n<p><strong>Myth #3: Internet buyers and sellers are a waste of time.<\/strong><\/p>\n<p><strong> <\/strong><\/p>\n<p><strong>The reality: <\/strong>Over 70 percent of home buyers are Internet buyers, according to the California Association of Realtors®.<strong> <\/strong>This research showed that Internet buyers spend more time doing research before meeting an agent compared to traditional buyers, but they spent less time working with an agent and  viewed significantly fewer homes before buying. Calling them a “waste of time” couldn’t be further from the truth! Internet-savvy consumers are looking for the help of an agent who uses the same communication techniques that they do. Market yourself as an Internet-savvy agent, and you’ll be in a prime position to tap this valuable pool of potential business.<\/p>\n<p><strong>Myth #4: Newspapers are still the strongest way to reach buyers and sellers.<\/strong><\/p>\n<p><strong> <\/strong><\/p>\n<p><strong>The reality: <\/strong>There are over 218 million Internet users in the United States as of March 2008, according to Nielsen\/\/NetRatings, which means nearly 3 out of 4 people are online. Newspapers, on the other hand, just aren’t what they used to be. In fact, daily newspaper circulation in the United States has been slowly falling since 1984. According to a report released by the Audit Bureau of Circulation in April 2008, daily circulation fell 3.6 percent for the six months ended March 31.” Circulation for Sunday papers also fell 4.6 percent. With newspaper circulation dropping and Internet usage surging, there’s no question about which one makes the most sense for advertising your business.<\/p>\n<p><strong> <\/strong><\/p>\n<p><strong>Myth #5: It’s more important to position myself as the best agent than to be the first agent potential buyers and sellers meet.<\/strong><\/p>\n<p><strong> <\/strong><\/p>\n<p><strong>The reality: <\/strong>Research shows that about 62 percent of buyers select their agent in one to three days, and 74 percent of buyers work with the first<strong> <\/strong>real estate agent they come into contact with. This means it’s essential for you to showcase your business and listings as prominently as possible in your advertising, and make sure that you can be contacted immediately when potential clients decide to contact you. And as we discussed in Myth #2, a significant majority of consumers start their home search on the Internet. <em>That’s <\/em>where you need to advertise your business to ensure that you’re the agent they find first.<\/p>\n<p>Moreover, a 2008 CAR study showed that Internet buyers expect a response from an agent in less than four hours. To get optimal results from your marketing, you need to be the first agent your potential client sees, <strong>and <\/strong>the first agent to respond to their request for more information. By using the latest Internet technologies, you can kill these two valuable birds with one stone.<\/p>\n<p><strong> <\/strong><\/p>\n<p><strong>From myth to real-world success story<\/strong><\/p>\n<p>The biggest myth of them all, however, is that what worked for you yesterday is going to work tomorrow. Successful real estate agents constantly innovate and change as the market demands. By updating your advertising strategy to attract Internet-savvy consumers, you may start seeing surprising gains in your business. The most important steps you can take are to provide consumers with helpful neighborhood information online, and to market your business and listings on a nationally advertised Web site. When you integrate the Internet into your advertising strategy, you position yourself to reach the consumers of the future. And that’s no myth.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Change is one thing you can count on in the real estate business. And as many top agents know, success depends upon adapting your advertising approach to meet the ever-changing needs of your consumers. Nevertheless, several key misconceptions about real estate advertising are preventing many agents from using Internet advertising to take their business to [&hellip;]<\/p>\n","protected":false},"author":6,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[35,36],"tags":[],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/197"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=197"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/197\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=197"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=197"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=197"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}