{"id":19971,"date":"2013-10-28T16:34:22","date_gmt":"2013-10-28T16:34:22","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=19971"},"modified":"2021-12-02T14:13:11","modified_gmt":"2021-12-02T22:13:11","slug":"agent-spotlight-stephanie-hansson-of-college-station-texas","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/agent-spotlight-stephanie-hansson-of-college-station-texas\/","title":{"rendered":"Agent Spotlight: Stephanie Hansson of College Station, Texas"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-19991\" title=\"Agent Spotlight - Stephanie Hansson\" src=\"\/wp-content\/uploads\/2013\/10\/Steph-Hansson-200x300.jpg\" alt=\"Stephanie Hansson is a real estate agent in College Station, Texas\" width=\"200\" height=\"300\" \/>If you want to know anything about College Station, Texas, talk to Stephanie Hansson of  <a href=\"https:\/\/activerain.com\/profile\/gransater\">Cortiers Real Estate<\/a> – a one-woman College Station booster club.<\/p>\n<p>“I’m going to tell you what’s interesting about College Station – in addition to Texas A&amp;M – the medical facilities that are coming in here are incredible,” she begins. “I mean, we have brand-new hospitals, doctors are coming in and Texas A&amp;M has a science center for med school. Right now they have four of 30 planned buildings,” Hansson continues. “We have a bio-med center that is working with A&amp;M and GlaxoSmithKline (a new vaccine facility) that’s just come in. This is what’s driving College Station,” she boasts.<\/p>\n<p>College Station is an adopted hometown for Hansson; she was born and raised in San Francisco where her grandfather was an architect and builder. “About 600 of his buildings still remain,” said Hansson. “That’s kind of where my love of real estate came from.”<\/p>\n<p>She didn’t always have a thing for real estate. She spent some time as a rack jobber in the music industry (doing store setups for record labels) and 25 years in international corporate agency travel.<\/p>\n<p>By the time her daughter grew up and moved on with her life Hansson realized that the travel industry had changed as well, and not for the better. That’s when she decided to take the real estate licensing exam.<\/p>\n<h2>Challenges<\/h2>\n<p>I asked Hansson what challenges she faces in this, her eighth year in real estate. “I have to say my biggest challenge is staying on top of all the new things coming out,” she began. “Making sure that I’m right there with it – not getting comfortable with the old stuff. To me, you have to keep up with technology; that’s where it’s at.”<\/p>\n<p>“The other thing is, I’m still growing my business,” Hansson continued. “I’m continuing trying to establish myself, as a notable and respected Realtor®. My most immediate challenge, though, is that my husband has left the oil fields and we have become a team,” she concluded.<\/p>\n<p>For now, it’s just she and Tom, her husband, and two virtual assistants.<\/p>\n<h2>Marketing<\/h2>\n<p>The team utilizes supermarket cart ads, which work quite well in their market. “I know that the cart advertising is working,” Hansson claimed. “This is a small enough town where I run into people who recognize me. I was waiting to have my cell phone repaired and a lady there looked at me, smiled and waved and she said, ‘You’re a Realtor®, aren’t you?’<\/p>\n<p>“And, of course, we’ve got Market Leader,” she said. “To be honest with you, I would not give up Market Leader. It works. It really works,” Hansson continued. “Their program just makes it really easy to make that contact and to keep it up. Market Leader has all the tools I need to work the leads.”<\/p>\n<p>I asked her how Market Leader products have impacted her business. “With Market Leader I have doubled my business in the last year and a half. I would be lost without them,” she replied.<\/p>\n<h2>The Best Part of Real Estate<\/h2>\n<p>Hansson enjoys the freedom that a real estate career affords. She also likes the people that she meets. “I love the people. They are so diverse, and if you take the time, they’re not just somebody to help you get a check,” she said. “They’re amazing. We get them from all over the world. I have learned that everybody has something to contribute. I’ve had the cowboys, I’ve had the intellectuals and, if you listen, they’re all great people. They really are.”<\/p>\n<p>Hansson, donning her College Station booster hat again continues. “It has been a phenomenal experience. My husband and I always felt that what we wanted to do was live in a small town that had the things that we needed and things that we liked, yet only being an hour and a half away from a big city,” she said. “We stopped and we took a look around and &#8211; oh, my gosh, this is exactly what we have here in College Station.”<\/p>\n","protected":false},"excerpt":{"rendered":"<p>If you want to know anything about College Station, Texas, talk to Stephanie Hansson of  Cortiers Real Estate – a one-woman College Station booster club. “I’m going to tell you what’s interesting about College Station – in addition to Texas A&amp;M – the medical facilities that are coming in here are incredible,” she begins. “I mean, [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[78,83],"tags":[190,106,275,56],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/19971"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=19971"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/19971\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=19971"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=19971"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=19971"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}