{"id":20151,"date":"2013-11-04T08:00:55","date_gmt":"2013-11-04T08:00:55","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=20151"},"modified":"2022-06-13T11:08:07","modified_gmt":"2022-06-13T18:08:07","slug":"agent-spotlight-christine-pura-of-austin-texas","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/agent-spotlight-christine-pura-of-austin-texas\/","title":{"rendered":"Agent Spotlight: Christine Pura of Austin, Texas"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-full wp-image-20161\" title=\"Agent Spotlight - Christine Pura\" src=\"\/wp-content\/uploads\/2013\/11\/Chris-Pura.jpg.png\" alt=\"Christine Pura is a real estate agent in Austin, Texas\" width=\"116\" height=\"160\" \/>Don’t let the “Keep Austin Weird” mantra fool you. According to <a href=\"https:\/\/www.bizjournals.com\/austin\/blog\/morning_call\/2013\/07\/austin-named-one-of-americas.html\">Travel and Leisure<\/a> magazine, Austin is a snobby city. The editors claim that the city gives off a “brainy, offbeat vibe,” but Christine Pura, of Keller Williams <a href=\"https:\/\/www.realtor.com\/realestateagents\/56cd55bd89a68901006f8735\">Austin Real Estate Team<\/a>, has another opinion.<\/p>\n<p>Pura thinks Austin gained the snobby moniker because of its transient nature. “We have about 120 people moving here a day from outside of Texas,” she said, “so Texas can’t be blamed for this snotty attitude.”<\/p>\n<p>They are coming from everywhere, these newly minted Austinites. Pura has sold homes to folks from Thailand, Iraq, and, of course, California, Nevada and Colorado.<\/p>\n<p>Decidedly un-snobby, Pura nonetheless responded to the lure of Austin and set down roots. “I like the weather, I like the people, I like the prices—it’s cheap and affordable,” she said.<\/p>\n<h2>History<\/h2>\n<p>Before attending seven different high schools, Pura began life in San Francisco. “My family owned a bar and restaurant on Fisherman’s Wharf—the first one there to feature live entertainment,” she said. The family also lived in Sacramento, Seattle and Texas.<\/p>\n<p>With dreams of someday becoming a veterinarian, Pura ended up a widow who supported her children by simultaneously holding down three jobs while still getting the kids to and from school and even attending their sporting events.<\/p>\n<p>“I never received a penny of government assistance,” she recalled. “I worked for Wells Fargo Bank and Bank of America and held two office manager jobs, all at the same time.”<\/p>\n<p>At Wells Fargo she started out as a teller, then a personal banker, then a loan officer, finally helping them launch the home equity product line.<\/p>\n<h2>The Lure of Real Estate and Self-Employment<\/h2>\n<p>Pura left Wells Fargo when they bailed Wachovia out of bankruptcy. “My boss got replaced and I got really irritated,” she said. Pura went to real estate school at night while she trained her boss’ replacement. When she finished real estate classes, she left banking and hung her real estate license with Keller Williams.<\/p>\n<p>Until this past June, Pura’s business partner was her daughter. “She’s my favorite female on the planet,” Pura said. Now Mom is starting a solo career, building a new team.<\/p>\n<h2>The Austin Real Estate Team<\/h2>\n<p>Aside from Pura, who handles all the listings, the Austin Real Estate Team consists of three buyers’ specialists and a client service specialist who is “ kind of the liaison between the buyer’s agent and the client,” Pura said. Keeping it all together is the team’s office manager.<\/p>\n<p>We asked Pura about how she markets both her team and her listings. “How <em>don’t <\/em>I market my business?” she asked. “We have 900 syndicated real estate websites, like Zillow, Realtor.com, Homes.com, and TexasRealEstate.com. You name it. We populate our listings into all 900 search engines.”<\/p>\n<p>She is also a big fan of Craigslist and YouTube. “I don’t know where we don’t market,” she said. “We market extensively.”<\/p>\n<h2>Tools Make the Woman<\/h2>\n<p>Someone who markets as extensively as Pura must have some amazing tools to keep her organized and on track. We asked her about her must-have technology.<\/p>\n<p>“I hate Top Producer passionately,” Pura explained. “Market Leader Business Suite’s powerful CRM system simplifies and streamlines my communication and keeps clients coming back.”<\/p>\n<p><strong>“<\/strong>My biggest challenge in my career right now is finding the perfect customer relationship management tool for teams,” she says. She knows exactly what she wants, but it doesn’t exist—yet. She is toying with the idea of building it herself, with the help of a tech-minded friend.<\/p>\n<h2>R&amp;R<\/h2>\n<p>When she isn’t working or dreaming of technological breakthroughs, Pura enjoys riding one of her four horses or hitting the links in Austin for a round of golf.<\/p>\n<p>Going into her 25th year of sobriety, Pura gives back to the community by counseling women who are recovering from alcoholism.<\/p>\n<p>We asked Pura where she sees herself a decade from now.<\/p>\n<p><strong>“<\/strong>In a 6-foot box,” she said, chuckling. Getting serious, she adds, “I’ll still be running my business, probably more passively. I will always be selling real estate. In 10 years I’ll be less hands-on, and I’ll just be working with my past clients and referrals, but I’ll never get out of the business—I love it.”<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Don’t let the “Keep Austin Weird” mantra fool you. According to Travel and Leisure magazine, Austin is a snobby city. The editors claim that the city gives off a “brainy, offbeat vibe,” but Christine Pura, of Keller Williams Austin Real Estate Team, has another opinion. Pura thinks Austin gained the snobby moniker because of its [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[78,83],"tags":[190,106,275,56],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/20151"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=20151"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/20151\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=20151"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=20151"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=20151"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}