{"id":20331,"date":"2013-11-06T17:49:03","date_gmt":"2013-11-06T17:49:03","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=20331"},"modified":"2022-01-31T14:35:40","modified_gmt":"2022-01-31T22:35:40","slug":"it-isnt-too-early-to-plan-for-2014","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/it-isnt-too-early-to-plan-for-2014\/","title":{"rendered":"It Isn’t Too Early to Plan for 2014"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-20421\" title=\"Creating a Business Plan for 2014\" src=\"\/wp-content\/uploads\/2013\/11\/Fotolia_53597186_XS-300x216.jpg\" alt=\"Is your real estate business ready for 2014? It's time to evaluate strengths and weaknesses and create a plan for success in the coming year\" width=\"300\" height=\"216\" \/>It might only be early November, but 2014 will be here before you know it, and it isn’t too early to start planning. To help agents prepare for 2014, Market Leader has just released the <a href=\"http:\/\/success.marketleader.com\/2014BusinessPlan?lsr=AI-ROW-BLG-2014RealEstateBizPlan-DustinR&amp;del=2014BizPlan\">2014 Real Estate Business Plan<\/a>.<\/p>\n<p>This year’s business plan gives you predictions for the 2014 real estate market, tests you on your strengths and weaknesses, and is jam-packed with worksheets to help you make 2014 the best year yet for your business. Let’s take a peek at what you will learn in this year’s guide.<\/p>\n<h2>How was 2013?<\/h2>\n<p>Before you set out to plan for 2014, the first step is to review 2013. Figure out what went right, what went wrong, and identify your strengths and weaknesses. A SWOT Analysis (Strength, Weakness, Opportunities, and Threats) is a great tool to identify places for improvement.<\/p>\n<ul>\n<li><strong>Strengths:<\/strong> Where have you succeeded in 2013?<\/li>\n<\/ul>\n<ul>\n<li><strong>Weaknesses:<\/strong> Where have you not done well in 2013?<\/li>\n<\/ul>\n<ul>\n<li><strong>Opportunities:<\/strong> Things that you haven’t exploited in 2013 that can be to your advantage in 2014.<\/li>\n<\/ul>\n<ul>\n<li><strong>Threats:<\/strong> Potential issues that might cause problems for your business.<\/li>\n<\/ul>\n<p>Strengths and weaknesses represent how you are performing – the areas in which you are succeeding or need improvement. Opportunities and threats are external factors that impact your business. Some examples of opportunities or threats for the real estate agent would be how the real estate market is doing, agent competitors, and new technologies for agents such as CRM and marketing software.<\/p>\n<p>The 2014 business plan includes a test to help identify your internal strengths and weaknesses in four key business areas:<\/p>\n<p><strong>1. Lead Generation:<\/strong> Leads are the fuel in your real estate business. Without enough leads, your business won’t be going anywhere. Is the number of leads you generated in 2013 a strength or weakness?<\/p>\n<p><strong>2. Lead Engagement:<\/strong> Once you have your leads, do you know what to do with them? Engaging leads and following up with them effectively is important for turning leads into clients. Is your lead engagement a strength or weakness?<\/p>\n<p><strong>3. Marketing\/Branding:<\/strong> People won’t magically know about you and your business. How well are you promoting yourself in your community and online? Have you established a brand? Is your marketing a strength or weakness?<\/p>\n<p><strong>4. Referrals:<\/strong> Referrals are the best leads and are vital to building a successful business. Is getting referrals a strength or weakness?<\/p>\n<p>The business plan will also help you identify opportunities and threats by sharing where the real estate market is headed in 2014.<\/p>\n<h2>Market Outlook for 2014<\/h2>\n<p>In October 2013, Market Leader had a live video conference with Jed Kolko, chief economist at Trulia, about the state of the current market and where he thinks we’re headed in 2014. While he doesn’t have a crystal ball, he can o¬ffer industry expertise to help you plan for success next year.<\/p>\n<p>In 2014, Jeff Kolko predicts:<\/p>\n<ul>\n<li>Interest rates and home prices will rise, making it more expensive to buy a home.<\/li>\n<li>Potential in the move-up market, as homeowners take advantage of the price increases.<\/li>\n<li>Sales volumes will continue to increase with more conventional sales.<\/li>\n<\/ul>\n<h2>What Does This Mean for Agents?<\/h2>\n<p>There are many signs that the real estate market is returning and recovering. With increasing opportunities, 2014 is looking like a great year for agents. In 2013, we have seen recovery and the start of a seller’s market; 2014 will continue to be good for sellers as prices rise. For agents focusing on listings, developing leads and finding home sellers will be key to building business.<\/p>\n<p>Find more predictions and create a plan for the coming year with the 2014 Real Estate Business Plan, available now for download.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>It might only be early November, but 2014 will be here before you know it, and it isn’t too early to start planning. To help agents prepare for 2014, Market Leader has just released the 2014 Real Estate Business Plan. This year’s business plan gives you predictions for the 2014 real estate market, tests you [&hellip;]<\/p>\n","protected":false},"author":29,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[97],"tags":[92,106,54,87,272,273,56],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/20331"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/29"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=20331"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/20331\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=20331"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=20331"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=20331"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}