{"id":20651,"date":"2013-11-11T08:00:24","date_gmt":"2013-11-11T08:00:24","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=20651"},"modified":"2021-12-02T14:08:16","modified_gmt":"2021-12-02T22:08:16","slug":"agent-spotlight-wendy-gilligan-of-saratoga-springs-ny","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/agent-spotlight-wendy-gilligan-of-saratoga-springs-ny\/","title":{"rendered":"Agent Spotlight: Wendy Gilligan of Saratoga Springs, NY"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-full wp-image-20661\" title=\"Agent Spotlight - Wendy Gilligan\" src=\"\/wp-content\/uploads\/2013\/11\/wendy-pic.jpg\" alt=\"Wendy Gilligan is a real estate agent in Saratoga Springs, New York\" width=\"150\" height=\"200\" \/>It’s interesting how when one of life’s doors closes, another opens. <a href=\"https:\/\/www.facebook.com\/Wendy-Gilligan-Keller-Williams-Realty-Saratoga-Springs-204609500281925\/\">Wendy Gilligan<\/a> with Keller Williams in Saratoga Springs, N.Y. is mighty happy she walked through that door five years ago.<\/p>\n<p>Back then, Gilligan had a floral business. She enjoyed the creative outlet her work provided until disaster struck: “My hands gave out,” she recalled. She was diagnosed with carpal tunnel syndrome in both hands.<\/p>\n<p>With that door slammed shut, real estate beckoned. “I took the real estate courses online, took the test and, voilà! I’m a Realtor®,” said Gilligan.<\/p>\n<p>Gilligan, a native of Utica, N.Y., refuses to look back to her floral days. “I had a very, very good summer,” she said. In fact, freeing up extra time is one of the challenges she’s facing right now.<\/p>\n<h2>The Secret to Her Success<\/h2>\n<p>Gilligan was introduced to Market Leader products during her first year in real estate. She didn’t know a soul in town. “I didn’t know where I was or how to get anywhere, so Market Leader really got me on board.”<\/p>\n<p>After buying leads, she started getting buyers. “My office poo-poo’d it – they thought it was terrible that I was doing something like that. I said, ‘You know what? If I sell one property, it’ll pay for the whole year.’ I did sell properties. I have to say it does work – I’m proof,” she said.<\/p>\n<p>In the past couple of years, Gilligan has learned how to convert those leads, and instantly responding is a must. “I had four closings last month and would not have had all of these buyers without Market Leader,” she continued. In fact, she has been so successful that she teaches new Keller Williams agents in her office how to get their businesses off and running.<\/p>\n<p>“One of the things I promote is buying listings,” she explained. “It’s worth it to put out the money and have one closing that pays for it and the rest is gravy. Why <em>wouldn’t <\/em>anyone do this?”<\/p>\n<h2>Spare Time? In Real Estate?<\/h2>\n<p>When she can, Gilligan enjoys spending time with her grandkids. “It’s like reliving having little kids again; I love it,” she said.<\/p>\n<p>She also tries to find ways to give back to the community and feels that Keller Williams is the ideal company to work with in that regard. “Keller Williams is big on this,” she said. “It’s a give-back real estate company.&#8221;<\/p>\n<h2>A Peek Into the Future<\/h2>\n<p>I asked Gilligan where she sees herself a decade from now.<\/p>\n<p>“I’ll probably have some people under me, like a buyer’s agent, maybe an administration person,” she began. “I was so busy this year I could hardly keep up with it. I found that I was spending so many hours on transactions and just keeping everything going,” she continued. “I have five deals pending right now, plus I have listings and buyers I’m working with. If I continue to do as well as I am, and I think I will, there will be some point in time where I’m going to need some help,” Gilligan concluded.<\/p>\n<h2>The Best Part of Real Estate<\/h2>\n<p>Gilligan loves pretty much everything about her real estate career, but a few aspects are close to her heart.<\/p>\n<p>“I am the type of person that likes to go into homes and give ideas on how to stage them,” she claimed.<\/p>\n<p>“Then, it’s always fun to see someone happy, whether it is from selling their home and moving on or a brand new buyer that’s just ecstatic about having their own home.”<\/p>\n<p>Overall, she likes the variety a career in real estate offers. “I learn something new every day,” Gilligan said. “I like the fact that every transaction is different, every person I meet is different. It’s always fun. I’ll be selling real estate until I can’t.”<\/p>\n","protected":false},"excerpt":{"rendered":"<p>It’s interesting how when one of life’s doors closes, another opens. Wendy Gilligan with Keller Williams in Saratoga Springs, N.Y. is mighty happy she walked through that door five years ago. Back then, Gilligan had a floral business. She enjoyed the creative outlet her work provided until disaster struck: “My hands gave out,” she recalled. [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[78,83],"tags":[190,106,275,56],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/20651"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=20651"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/20651\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=20651"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=20651"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=20651"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}