{"id":20751,"date":"2013-11-13T21:46:46","date_gmt":"2013-11-13T21:46:46","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=20751"},"modified":"2022-01-26T14:35:17","modified_gmt":"2022-01-26T22:35:17","slug":"how-to-automate-without-sounding-like-a-robot","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/how-to-automate-without-sounding-like-a-robot\/","title":{"rendered":"How to Automate Without Sounding Like a Robot"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-20781\" title=\"How to Automate Without Sounding Like a Robot\" src=\"\/wp-content\/uploads\/2013\/11\/Fotolia_35409514_XS-300x262.jpg\" alt=\"Automating tasks will save real estate agents time, but providing good customer service requires a human element\" width=\"300\" height=\"262\" \/>The object of the real estate agent game is to fit as many tasks as possible into a finite amount of time. From lead generation and follow-up to coordinating transactions, that’s a lot of tasks. Thankfully, many of them can be either delegated or automated, freeing up time for you to do the things you do best.<\/p>\n<p>Hiring the right people to pick up some of these tasks is a challenge unto itself. Automating certain duties is easy; doing so while maintaining the human element is a bit harder, and many agents end up utterly failing.<\/p>\n<p>Palm Beach real estate agent Paul Schafranic tells the story of a European client who emailed five real estate agents regarding his desire to purchase property in the area. All but one of them sent automated responses that sounded, well, automated.<\/p>\n<p>A month later, when the client was due to roll into town to make the purchase, Schafranic &#8211; the one out of the five who personalized his response &#8211; was his agent and assisted him in the purchase of a $4 million home.<\/p>\n<p>There’s nothing wrong with automating as many of your systems as possible. What is unforgiveable, however, is sounding like a robot. If you don’t want to lose buyers and listings, read on.<\/p>\n<h2>Lead Generation<\/h2>\n<p>Lead generation is a necessary evil if you hope to remain in the real estate business. The good news is that there is an easy way to do this: Buy Internet leads.<\/p>\n<p>Staci Dancey, an agent with Surterre Properties in Newport Beach, Calif., automated her lead generation efforts by buying leads and sold $24 million in real estate in one year.<\/p>\n<p>“I was able to work Monday through Thursday, and I was still one of the top producing agents in the area,” she said. “That success came from the fact that I wasn’t spending time generating new leads &#8211; they were coming to me.”<\/p>\n<p>Since 94 percent of buyers ranked responsiveness as a “very important,” agent quality, according to the National Association of Realtors®, follow-up is the key to converting these leads into sales.<\/p>\n<p>It’s challenging to reach out to leads immediately, but the sooner you do so the better your chances of making contact. In fact, NAR says that the odds of connecting with a lead increase 100 times if the attempt is made within five minutes instead of 30 minutes.<\/p>\n<p>Avoid the robotic email on this first reach-out. Pick up the phone and touch bases with the lead.<\/p>\n<h2>Delegate Tasks<\/h2>\n<p>Hire an assistant to reach out and call your leads, keeping in mind that a licensed assistant can answer more questions than one who isn’t licensed. Either way, train your assistant on how to qualify leads and the importance of immediate follow-up.<\/p>\n<p>Training is everything when it comes to your staff. Ensure that the person is professional yet personable and knows exactly what type of lead should be transferred to you immediately.<\/p>\n<h2>Listings Alerts<\/h2>\n<p>A listing alert is an automatic email notifying a contact of new listings that match the search criteria that the contact provides. Listing alerts are designed to keep your contacts coming back to your website frequently.<\/p>\n<p>Market Leader has found that the more contacts you have who receive listing alerts, the more returning visitors you have to your website. The more returning visitors you have, the more likely you are to get a phone call when a contact finds his or her ideal home.<\/p>\n<p>To set up this system, you’ll need to have software tied into your MLS. Market Leader software has listings alerts built into the website and CRM. The beauty of this system is that your leads can set up and edit their listing alerts as their criteria evolve.<\/p>\n<p>Listing alerts by their very nature run the danger of making you seem robotic. To avoid this, ensure that your listing alert service is customizable so that the alerts appear to be coming from you.<\/p>\n<p>Next, personalize the message so that it sounds more like your voice. Don’t forget to add an email signature.<\/p>\n<h2>Email Marketing<\/h2>\n<p>“I was able to set up mass emails in my Market Leader Professional system and make them appear as if they were individual,” said Danci. “It continues to work beautifully.”<\/p>\n<p>Not all the leads you receive are ready to transact right away, so email marketing helps you stay in touch until they are ready.<\/p>\n<p>Use email marketing software to send emails automatically, based on the schedule you desire, from every few days to every few months. The Market Leader system does this, and it is built-in with website and contacts, making it easy.<\/p>\n<p>If the lead communicates back to you, turn off the drip email and respond by phone.<\/p>\n<p>If you are using templates, personalize them.<\/p>\n<h2>When Not to Automate<\/h2>\n<p>While having the proper systems and tools in place and automating as much as you can frees you up for more important tasks, some things require the personal touch. To ensure you are providing quality <a href=\"\/blog\/how-to-provide-great-customer-service\/\">customer service<\/a>, do not automate:<\/p>\n<ul>\n<li>Your replies to leads that have contacted you.<\/li>\n<li>Phone calls.<\/li>\n<li>Buyer and agent feedback.<\/li>\n<\/ul>\n<p>The best way to avoid sounding robotic is to have a voice and not be afraid to use it. “Everyone hates automated phone systems, so why would they want to read the digital equivalent of the same thing?” asks Chelsey Yearin at Social Media Contractors. “Sounding human will at least make people want to interact with you,” she continues, “and your company&#8217;s voice is as much a part of your brand as anything else.”<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The object of the real estate agent game is to fit as many tasks as possible into a finite amount of time. From lead generation and follow-up to coordinating transactions, that’s a lot of tasks. Thankfully, many of them can be either delegated or automated, freeing up time for you to do the things you [&hellip;]<\/p>\n","protected":false},"author":29,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[97],"tags":[336,337,338,339,201,340,156,54,126,87],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/20751"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/29"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=20751"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/20751\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=20751"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=20751"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=20751"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}