{"id":208,"date":"2009-09-21T12:01:05","date_gmt":"2009-09-21T20:01:05","guid":{"rendered":"http:\/\/blog.marketleader.com\/?p=208"},"modified":"2009-09-21T12:01:05","modified_gmt":"2009-09-21T20:01:05","slug":"creating-your-own-brand-for-success","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/creating-your-own-brand-for-success\/","title":{"rendered":"Creating your own BRAND for success"},"content":{"rendered":"<p><strong>BRAND power<\/strong><br \/>\nWhat’s your favorite cola drink? If you’re like most people, you have strong feelings about the question and can answer immediately. When you’re standing in front of the refrigerator case at the local convenience store, you reach for that beverage without considering any other drink. When you’re thirsty, no other drink<br \/>\nwill do.<\/p>\n<p>As a real estate agent, your marketing goal is to be like your favorite cola. You want to be the one your prospects reach for when they’re “thirsty” for an agent. The secret to accomplishing this is to establish your own unique brand. An effective brand creates strong, positive associations in the minds of your prospects and clients. They’ll perceive you as a trustworthy expert in local real estate. This perception provides the competitive advantage that helps you attract more clients, close more business, and earn more money. So how can you harness the brand concept to increase your success in real estate? We’re very glad you asked.<\/p>\n<blockquote><p>what is BRAND? Brand is the conscious effort of presenting and perpetuating a specific,<br \/>\npositive perception of your business by consumers.<\/p><\/blockquote>\n<p><strong>all about BRAND<\/strong><br \/>\nYou may not realize it, but you’re already creating a brand with every email you send to a prospect, every phone call, every postcard. Many agents have an “accidental” brand that changes almost daily, depending on their mood and whatever marketing piece they’re printing that week. On the other hand, successful agents work to create and maintain a brand that helps them stand out from the crowd of average agents.<br \/>\nA successful brand forms a unique emotional reaction in the public when they hear your name or see your logo. The consumer must believe that you can do a better job at helping them buy or sell a home than your competitors can. By establishing your brand, you perpetuate the perception that you are the agent consumers need to handle their transaction—and no other agent will do.<\/p>\n<p><strong>how to define your BRAND<\/strong><br \/>\nYour brand is an expression of you and must identify exactly what you  offer. To be effective, your brand must touch your entire business, including your choice of marketing tactics, businesses you associate with, design, how you and your team conduct yourselves with clients, and more. So it’s essential to take the time to create the right brand for you.<br \/>\n<strong><br \/>\nHere’s how:<\/strong><br \/>\n1. Make a complete list of your strengths as an agent. Start your list, then come back to it every few days and add to it when you have a fresh perspective. When you have nothing more to add, move to the next step.<br \/>\n2. Study top competitors in your area. What are their brands like? How do they position themselves to  prospects? Write your thoughts and reactions to each of them from the consumer’s point of view.<\/p>\n<blockquote><p>A STRONG BRAND…<br \/>\nMakes a promise to consumers. Evokes emotion—not just abstract ideas. Shows how you’re different from the competition. Identifies specific benefits. Provides a short, memorable idea. Offers a consistent message.<\/p><\/blockquote>\n<p>3. Compare these two lists. The right brand opportunity will spring from your strengths that are distinct from your competition. How do you want people to feel when they think of you? Focus on one or two key differentiators.<br \/>\n4. Create your brand promise. Choose a simple, strong message that consumers will quickly understand. This statement might become your slogan, or it may simply describe the brand experience you’ll integrate into your business.<\/p>\n<p><strong>it’s in the way that you use it<\/strong><br \/>\nYour logo and slogan are just the beginning of your brand. Here’s how to use your brand in your business:<br \/>\n1. Include your brand in all marketing materials. Be accurate, and make sure that what you think you’re saying about yourself is what your prospects and clients perceive.<br \/>\n2. Be positive about your business. When you’re enthusiastic, prospects and clients will sense that you’ll work hard for them.<br \/>\n3. Associate with other businesses with similar, well known brands that provide responsive service. This includes mortgage professionals you work with and technology companies that generate leads and communicate with prospects on your behalf.<\/p>\n<blockquote><p>The energy with which you commit to your work will boost your success.<\/p><\/blockquote>\n<p>4. Start serving a niche market. Working a niche market helps establish your identity as an expert.<br \/>\n5. Use technology to promote your brand to your prospects. By using a service like those from Market Leader, you can send automated newsletters to thousands of prospects—with your name and photo on every one.<br \/>\n6. Provide responsive, helpful service. A fast and courteous response builds trust and rapport with prospects, and it will quickly set you apart from other agents.<br \/>\n7. Offer helpful information. Consumers expect their agent to know the local real estate market inside and out. Send email newsletters to all your prospects to show you offer knowledge, not just a sales pitch.<br \/>\n8. Communicate your brand promise clearly and consistently in everything, from the phone to the doorstep, from emails to past clients and prospects… everything.<\/p>\n<p><strong>long-term BRANDING to boost your business<\/strong><br \/>\nBuilding a brand is very different from other marketing tasks. The marketing that most agents do provides immediate gratification. Place an ad in a local property magazine, get a few phone calls. Hold an open house, meet a motivated buyer. But when you build your brand, you build your image over time. While there will always be a place in your business for direct marketing, building your brand delivers long-term benefits that direct marketing never will.<\/p>\n<p>Your brand is an investment in the success of your business. It defines how prospects and clients think of you now and in the future. When you consistently fulfill your brand’s promise and keep customers satisfied, they’re much more likely to refer you to friends and come back to you for their next transaction.<\/p>\n<p><strong>commit to your BRAND<\/strong><br \/>\nMake your brand the centerpiece of your marketing plan. With a strong brand, you can gain the competitive advantage and receive more referrals. In fact, you may discover that with a strong brand you can actually decrease your marketing budget and still attract more business. When you create a strong, memorable brand, consumers will naturally think of you before any other agent—and that’s what will drive your success.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>BRAND power What’s your favorite cola drink? If you’re like most people, you have strong feelings about the question and can answer immediately. When you’re standing in front of the refrigerator case at the local convenience store, you reach for that beverage without considering any other drink. When you’re thirsty, no other drink will do. [&hellip;]<\/p>\n","protected":false},"author":6,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[35,36],"tags":[],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/208"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=208"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/208\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=208"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=208"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=208"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}