{"id":21211,"date":"2013-11-18T18:27:53","date_gmt":"2013-11-18T18:27:53","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=21211"},"modified":"2022-08-09T18:59:29","modified_gmt":"2022-08-10T01:59:29","slug":"agent-spotlight-aj-ackerman-of-cape-coral-fla","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/agent-spotlight-aj-ackerman-of-cape-coral-fla\/","title":{"rendered":"Agent Spotlight: AJ Ackerman of Cape Coral, Fla."},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-21231\" title=\"Agent Spotlight - AJ Ackerman\" src=\"\/wp-content\/uploads\/2013\/11\/AJ-199x300.jpg\" alt=\"AJ Ackerman is a real estate agent in Cape Coral, Florida\" width=\"199\" height=\"300\" \/>Being a customer service whiz comes naturally when one has years of experience in both the hospitality and food service industries. AJ Ackerman, with CENTURY 21 Sunbelt Realty, has that, but he also has an inherent desire to serve people.<\/p>\n<p>As the son of an entrepreneur dad and a mom who spent most of her adult life working for the Hilton Hotels Corporation, “Customer service was a big part of who I was growing up,” he told us.<\/p>\n<p>The lifestyle of corporate America drove him away, however. “My mom would work 70, 80 hours a week,” he said, “so I learned pretty quickly it wasn’t what I wanted.”<\/p>\n<h2>Good Old Days<\/h2>\n<p>Ackerman was born in Las Vegas, but because of his mother’s career with Hilton, the family moved around a bit. “I’ve lived in Vegas, Florida, Chicago and Atlanta,” he said.<\/p>\n<p>Although his parents had him in modeling as a child, and he was with the Mickey Mouse Club in Orlando, his dream as a child was to follow in his grandfather’s footsteps and become an Air Force pilot. “That went about as far as a poster on a wall,” he said, laughing.<\/p>\n<p>It was his father’s footsteps he eventually stepped into. “My dad was an entrepreneur; he was in sales his whole life,” Ackerman explained.<\/p>\n<h2>Real Estate Happens<\/h2>\n<p>“In 2008 I went through a really bad breakup. I had some partners and we owned a custom deck-building company, and it wasn’t working out … the economy was kind of taking a hit,” Ackerman began. “I lost everything I owned. Somebody owed me money for four months’ worth of work – I was never paid. It was just crazy, there was a lot going on,” he said.<\/p>\n<p>Shortly after his 30<sup>th<\/sup> birthday, Ackerman had a sit-down with himself – one of those man-in-the-mirror moments.<\/p>\n<p>“I had just turned thirty and I felt like I should be much farther along in my life,” he recalled. “I looked in the mirror and said, ‘Alright, everything is up to you, and the reason you are where you are is because of you.’”<\/p>\n<p>He decided to pay a visit to his best friend of 20 years who had moved back to Cape Coral, Fla., where the two had attended high school. He decided to stay.<\/p>\n<p>“My friend’s father had been in real estate for about 30 years,” said Ackerman. “For some reason I couldn’t find a job &#8211; it was crazy. So I said, “Randy, I’m at my best friend’s house and sleeping on his couch, I’ve got no car, I’ve got no place to live. I’ve got a brain and I’m ready to use it if there’s anything I can do to help,” he recalled.<\/p>\n<p>Randy put Ackerman to work making cold calls. He lasted two weeks before discovering that he could and should be making those calls for himself. So, with Randy’s assistance, he studied for the real estate exam. A little over three weeks later he had his license and started making calls on his own behalf.<\/p>\n<p>“My first six months in the business I did a million dollars in sales,” Ackerman said. “That was in 2009. I’ll hit four and a half years in the business at the end of this year, and I’ll do about seven and a half or eight million in sales. I’ve been working hard,” he explained, laughing.<\/p>\n<h2>Challenges<\/h2>\n<p>Asked about the challenges he faces at this point in his career, Ackerman said, “My biggest challenge right now is delegating business and figuring out how to take it to the next level as far as becoming a broker and owning my own brokerage, building a team and leadership.”<\/p>\n<p>Ackerman is working on next year’s business plan, and we asked for a peek into it.<\/p>\n<p>“My three main goals for next year are to be among the top 100 agents in my area, so continuing to grow my business is important,” he began. “The second is to become financially stable as far as finally not having any debt and having reserves put away. The third is I want to continue to grow in all the other areas of my life,” Ackerman concluded.<\/p>\n<h2>Keeping the Funnel Full<\/h2>\n<p>Ackerman is still an avid cold caller. We asked him if he has any advice for agents who suffer from call reluctance.<\/p>\n<p>“You gotta figure out why you’re doing what you’re doing,” he began. “If you don’t have a reason, you’re not going to do it. When I first started in the business I was in survival mode; I had no other options but to call people at the time,” Ackerman continued.<\/p>\n<p>“My reason is different now. Right now I’m worth about $150 an hour. When I get on the phone I don’t think about the calls that I’m making, I’m thinking about how much money I’ll make if I make the calls. I don’t look at it as cold calling. I look at it as building a life to be able to have happiness and be able to make the choices I want.”<\/p>\n<p>Ackerman also divulged that he is most successful when calling around new listings and homes he’s sold.<\/p>\n<h2>The Tools of His Trade<\/h2>\n<p>Ackerman figures that about 40 percent of last year’s business came from past clients and referrals, and he credits his CRM for that.<\/p>\n<p>“One of the most important things for me when I started building my business was a contact management system; it’s a huge key to long-term success,” he said. “I do email campaigns. I also try to call everyone at least three times a year, minimum,” Ackerman continued.<\/p>\n<p>“A contact management system like the one I have from Market Leader allows me to do a lot of things. I do email campaigns; I leave reminders to give them a call every three or four months.”<\/p>\n<p>In fact, his CRM is the one tool he considers most critical to his real estate business. “Without being able to keep track of everything, I would never be able to grow as fast as I’m growing.&#8221;<\/p>\n<h2>The Best Part of Real Estate<\/h2>\n<p>Ackerman claims that his real estate business fulfills everything he wanted in a career. We asked him about the best part of being in the business.<\/p>\n<p>“Everything,” he said, chuckling. “I love what I do. I love the freedom. I love that I have no limits to what I can make &#8211; it’s all up to me. I love that I can help people. When people buy or sell homes I’m ultimately helping them accomplish some type of goal. Everything I’ve ever wanted, I can get in real estate.”<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Being a customer service whiz comes naturally when one has years of experience in both the hospitality and food service industries. AJ Ackerman, with CENTURY 21 Sunbelt Realty, has that, but he also has an inherent desire to serve people. As the son of an entrepreneur dad and a mom who spent most of her [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[78,83],"tags":[190,106,275,341,267,56],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/21211"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=21211"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/21211\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=21211"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=21211"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=21211"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}