{"id":21391,"date":"2013-11-20T09:00:00","date_gmt":"2013-11-20T09:00:00","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=21391"},"modified":"2022-07-11T15:59:03","modified_gmt":"2022-07-11T22:59:03","slug":"road-to-homeownership","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/road-to-homeownership\/","title":{"rendered":"The Road to Homeownership"},"content":{"rendered":"<p>The home-buying process is a long and complicated one. Even those who have purchased homes before may need guidance with some of the more convoluted steps. The Market Leader blog staff has boiled the process down as much as possible while still maintaining all the important parts and weren’t able to get the total number of steps under 20!<\/p>\n<p>The below graphic, <strong>“The Road to Homeownership,”<\/strong> is designed to make the home-buying process easier for aspiring homeowners to understand. A more complete walk-through of the home-buying process can be found below the graphic.<\/p>\n<p><strong>Interested in sharing this graphic with visitors on your site?<\/strong> An HTML embed code can be found below the graphic. Copy and paste this code into the HTML editor (sometimes called the text editor) of a page or blog post on your site to publish it there!<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-21421\" title=\"Road-to-Homeownership\" src=\"\/wp-content\/uploads\/2013\/11\/Road-to-Homeownership.jpg\" alt=\"A simplified guide to the home-buying process for aspiring homebuyers\" width=\"600\" height=\"1958\" \/><\/p>\n<div style=\"margin-left: 10px;\">\n<form action=\"\"><textarea readonly=\"readonly\" onclick=\"this.focus();this.select()\" rows=\"8\" cols=\"70\" style=\"overflow:hidden; font-family: courier new; border: 1px solid black; padding: 5px; background-color: #eeeeee; margin-bottom: 10px;\"><a href=\"https:\/\/www.marketleader.com\/blog\/road-to-homeownership\/\" title=\" Guide to the Home-Buying Process \"><img loading=\"lazy\" src=\"\/wp-content\/uploads\/2013\/11\/Road-to-Homeownership.jpg\" title=\"Guide to the Home-Buying Process\" alt=\"A roadmap for homeownership\" width=\"600\" height=\" 1958\"\/><\/a><br \/>\n<a href=\"https:\/\/www.marketleader.com\/blog\/road-to-homeownership\/\">The Road to Homeownership – A Guide to the Home-Buying Process<\/a><\/textarea><br \/>\n<\/form>\n<\/div>\n<hr style=\"height: 2px;\" \/>\n<h2>Before the Home Search<\/h2>\n<p>These oft-forgotten steps are the important precursors to the bulk &#8211; and exciting parts &#8211; of the home-buying process.<\/p>\n<h3>Find Out if You’re Ready to Buy a Home<\/h3>\n<p>Having sufficient funds doesn’t automatically qualify someone for homeownership. There are major life-stage questions aspiring homeowners should ask themselves before even <em>beginning <\/em>the home-buying process!<\/p>\n<p>These questions include:<\/p>\n<ul>\n<li>Are you capable of being your own landlord?<\/li>\n<li>Are you happy with your job?<\/li>\n<li>Are you ready to settle down?<\/li>\n<\/ul>\n<p><iframe loading=\"lazy\" src=\"\/\/www.youtube.com\/embed\/AaN3xfro2NA\" frameborder=\"0\" width=\"560\" height=\"315\"><\/iframe><\/p>\n<h3>Get Your Credit Report<\/h3>\n<p>Before advancing further into the home-buying process, check your credit score to ensure it is sufficient to be approved for a mortgage loan. <strong>Your score should be <\/strong><a href=\"https:\/\/homeguides.sfgate.com\/minimum-credit-score-needed-buy-house-7410.html\"><strong>620 or higher<\/strong><\/a><strong>.<\/strong>* Even with a score above 620, lenders may require a heftier down payment or large income from the borrower.<\/p>\n<p><strong>Note: <\/strong>The lower your credit score drops below 740 points, <a href=\"https:\/\/www.lendingtree.com\/home\/mortgage\/credit-score-needed-buy-house\/\">the more fees<\/a> you will pay to compensate for being a less attractive borrower.<\/p>\n<p>This is your opportunity to make sure nothing in your credit report is inaccurate. The last thing you want when you apply for a mortgage loan preapproval is to discover that your report contains mistakes that make you wrongly appear like an unreliable borrower.<\/p>\n<p><em>*Required credit scores vary from lender to lender and can be changed based on a borrower’s other qualifications. Consider this is a guideline, not a rule.<\/em><\/p>\n<h3>Research Loan Programs<\/h3>\n<p>Various governmental agencies have loan programs available to help aspiring homebuyers. Look into the following:<\/p>\n<ul>\n<li>FHA-insured loan: Available to lower-income Americans to help them buy a home they otherwise would not be able to afford.<\/li>\n<li>VA loan: Available to American veterans or their surviving spouses, enabling them to purchase homes without a down payment.<\/li>\n<li>Rural development programs: Offers financing to low-income Americans buying in rural areas.<\/li>\n<\/ul>\n<h3>Estimate How Much You Can Afford<\/h3>\n<p>Buy a house more expensive than you can afford and you will find yourself in hot water.<\/p>\n<p>The true cost of a house includes more than just the mortgage payments. Make sure to also factor in the cost of the following:<\/p>\n<ul>\n<li>Homeowners insurance.<\/li>\n<li>Property taxes.<\/li>\n<li>Utilities.<\/li>\n<li>Maintenance costs.<\/li>\n<li>HOA dues (if applicable).<\/li>\n<\/ul>\n<h3>Get Mortgage Loan Preapproval<\/h3>\n<p>Preapproved buyers are more attractive because preapproval speeds up closing times and demonstrates seriousness when it’s time to make an offer.<\/p>\n<p>Steps involved in getting a mortgage loan preapproval:<\/p>\n<ul>\n<li>Choose a mortgage lender. Make sure to shop around &#8211; finding a better deal on your mortgage could save you thousands!<\/li>\n<li>Submit financial documents to the mortgage lender you choose. These documents can include W-2s, business tax returns, pay stubs, and a two-year employment history.<\/li>\n<li>Calculate the total cost of the home-buying transaction. Include down payment, closing costs, and escrows for taxes and insurance costs.<\/li>\n<\/ul>\n<p>Some additional notes about mortgage loan preapproval:<\/p>\n<ul>\n<li>Getting preapproved with a lender does not make you commit to using them.<\/li>\n<li>You can get preapproved by as many lenders as you would like, but each preapproval requires a new credit check.<\/li>\n<\/ul>\n<hr style=\"height: 2px;\" \/>\n<h2>During the Home Search<\/h2>\n<h3>Find a Real Estate Agent<\/h3>\n<p><img loading=\"lazy\" class=\"alignright size-full wp-image-21441\" title=\"Female Real Estate Agent talking on phone\" src=\"\/wp-content\/uploads\/2013\/11\/real-estate-agent.jpg\" alt=\"Finding the right real estate agent is key during the home-buying process - they'll be your best friend throughout it\" width=\"284\" height=\"282\" \/>Your real estate agent will be your greatest ally during the home-buying process; it’s important you find a competent one you are compatible with!<\/p>\n<p>Tips for finding a good real estate agent:<\/p>\n<ul>\n<li>Ask friends, family members, and co-workers for referrals.<\/li>\n<li>Use a search engine if referrals fall through.<\/li>\n<li>Don’t automatically choose the first agent you meet!<\/li>\n<\/ul>\n<h3>Look at Real Estate Listings<\/h3>\n<p>It’s time for the fun part of the home-buying process &#8211; finding your dream home! Your real estate agent will help you during this step by finding listings you may be interested in that are in your price range.<\/p>\n<h3>Research Neighborhoods<\/h3>\n<p>It’s important to research neighborhoods before getting serious about buying a house, and not just because the neighborhood’s vibe can significantly influence how much you enjoy living in your new home. The day may come when you decide to sell your dream house, and you’ll want to make sure potential buyers find your neighborhood a pleasant place to live! If your dream home is located in a neighborhood in decline, your ability to resell it for a good price will be slim, regardless of how well you keep it up.<\/p>\n<p>The following factors can affect how much you and future buyers value the house:<\/p>\n<ul>\n<li>Walkability.<\/li>\n<li>Crime rates.<\/li>\n<li>Quality of local schools.<\/li>\n<li>Desirability &#8211; Is the culture of the area driving people to\/from this area?<\/li>\n<li>General neighborhood deterioration &#8211; How well are homes maintained?<\/li>\n<\/ul>\n<h3>Choose the Home You Want<\/h3>\n<p>After researching online listings, exploring potential neighborhoods, and viewing homes with your real estate agent, choose the home you want to commit to living in for years to come!<\/p>\n<h3>Keep Finances in Line<\/h3>\n<p>You can greatly hurt your chances of getting a mortgage loan if you do any of the following at this stage of the home-buying process:<\/p>\n<ul>\n<li>Open a credit card.<\/li>\n<li>Make major purchases (car, appliances, expensive electronics, etc.).<\/li>\n<li>Make a big career change.<\/li>\n<\/ul>\n<h3>Talk to Neighbors<\/h3>\n<p>Nobody knows what living in your dream home’s neighborhood will be like better than your potential neighbors. Go from door to door to inquire about the local noise levels, crime rates, amenities, traffic congestion, and anything else you might be concerned with. They’ll be able to give you a far more complete picture of life in that neighborhood than Internet searches of any length.<\/p>\n<hr style=\"height: 2px;\" \/>\n<h2>Before Making an Offer<\/h2>\n<p>While you may have found your dream home, don’t get too excited yet! There are still a couple of tasks you need to accomplish before you make an offer.<\/p>\n<h3>Check for Unpaid Property Taxes, Liens<\/h3>\n<p>Good real estate agents will automatically check these for you; if your agent doesn’t mention that they will do this, ask!<\/p>\n<h3>Determine Offer Price<\/h3>\n<p>This is a stage of the home-buying journey when the real estate agent’s value really becomes apparent. Without access to the accumulated knowledge of local markets that agents possess, aspiring homebuyers can easily make offers that would dramatically overpay for the home or not be taken seriously by the current owners.<\/p>\n<p>To help you make an offer, your real estate agent will provide you with a competitive market analysis (referred to as a CMA) to give you insight on what your offer should be.<\/p>\n<p><iframe loading=\"lazy\" src=\"\/\/www.youtube.com\/embed\/9XWCUHes_rc\" frameborder=\"0\" width=\"560\" height=\"315\"><\/iframe><\/p>\n<h3>Determine Contingencies<\/h3>\n<p>“Contingencies” are provisions in real estate contracts that allow them to be dissolved in the event a specified occurrence comes to pass. Consult with your real estate agent to determine if you want to add contingencies to your offer. Contingencies are by no means required but can be a life-saver for homebuyers with reservations about a home.<\/p>\n<p>The most common contingencies for homebuyers are:<\/p>\n<ul>\n<li>Appraisal contingency: Gives the homebuyer the opportunity to cancel the purchase agreement if the home does not appraise for the purchase price.<\/li>\n<li>Financing contingency: Allows the homebuyers time to secure financing for the home purchase.<\/li>\n<\/ul>\n<p><strong>Be warned:<\/strong> Having contingencies makes your offer less desirable to the seller, since it gives you a way out of the deal and thus lowers the seller’s chance of successfully selling the home.<\/p>\n<hr style=\"height: 2px;\" \/>\n<h2>Make an Offer<\/h2>\n<p>Work with your agent to create an offer on your dream home.<\/p>\n<p>If your dream home is located in a competitive market, consider including the following with your offer to make it more competitive:<\/p>\n<ul>\n<li><strong>Cover letter: <\/strong>Including a handwritten “love letter,” a note that explains to the seller what you appreciate about their house and how much you would love to live there, will add an element of emotion to what would otherwise would be a cold, impersonal business transaction. Sellers would rather see their old home pass to some who truly appreciates it!<\/li>\n<li><strong>Proof of funds:<\/strong> Prove that you have the ability to pay the down payment and closing costs by including information about your liquid assets (cash, investments, etc.).<\/li>\n<li><strong>Desktop underwriter approval letter:<\/strong> This is a more rigorous form of mortgage preapproval that demonstrates you are organized, proactive and ready to close escrow.<\/li>\n<\/ul>\n<p>If you are nervous about your offer getting accepted, have your agent hand-deliver it. The practice of hand-delivering real estate offers has become rare; doing so will make your offer stand out from others and demonstrate your strong interest in the house.<\/p>\n<hr style=\"height: 2px;\" \/>\n<h2>After the Offer is Accepted<\/h2>\n<p>Congratulations! Your offer has been accepted and you have taken one <em>giant <\/em>step toward owning your dream home. The home-buying process is far from over, however &#8211; several vital steps still separate you from closing the deal.<\/p>\n<h3>Hire a Home Inspector<\/h3>\n<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-21431\" title=\"Hire a home inspector\" src=\"\/wp-content\/uploads\/2013\/11\/Home-Inspector-200x300.jpg\" alt=\"Home inspectors will find any defects or dangers in your dream home that you missed\" width=\"200\" height=\"300\" \/>Skilled home inspectors find issues that escape the buyer’s (and hopefully also the seller’s) attention. Common issues uncovered by inspectors include bad electrical wiring, drainage issues, mold and other hazardous building or insulation materials, and roofing in need of replacement.<\/p>\n<p>Tips for hiring a good home inspector:<\/p>\n<ul>\n<li><strong>Don’t necessarily use the inspector your agent recommends:<\/strong> Unscrupulous agents can have agreements with inspectors to get commissions for referrals. Make sure your agent’s recommendation is based on merit, not monetary interests.<\/li>\n<li><strong>Ask for guarantees:<\/strong> Competent inspectors who are confident in their skills will have monetary guarantees. Example: If the inspector fails to identify that your dream home needs new roofing, they may have a guarantee that will pay for the resulting water damage.<\/li>\n<li><strong>Ask for credentials:<\/strong> An inspector who belongs to a professional organization like the American Society of Home Inspectors is much less likely to be a charlatan.<\/li>\n<\/ul>\n<h3>Get the Home Appraised<\/h3>\n<p>The home appraisal will estimate the market value of your dream home. The appraiser is typically hired by the mortgage lender, but sellers sometimes agree to pay for it during home price negotiations. Appraisals typically cost <a href=\"https:\/\/homeguides.sfgate.com\/average-cost-home-appraisal-51636.html\">between $300-400<\/a>.<\/p>\n<h3>Make Purchase Funds Available<\/h3>\n<p>Make sure the funds you need for closing are accessible. If you liquidate funds from an investment, make sure you keep the paperwork so you can show the lender.<\/p>\n<h3>Complete Final Walk-Through<\/h3>\n<p>Homebuyers are allowed to do a final walk-through of their new home 48 hours before closing. This gives them the chance to check that the sellers kept the property in good shape, and that they performed agreed-upon maintenance and improvements, before any names are signed on dotted lines.<\/p>\n<p>What the final walk-through is not:<\/p>\n<ul>\n<li>An opportunity to back out of the deal.<\/li>\n<li>A home inspection.<\/li>\n<li>An opportunity to negotiate with the seller.<\/li>\n<\/ul>\n<h3>Closing!<\/h3>\n<p>You are close to owning your dream home! After signing the closing and mortgage documents &#8211; and what will seem like a million other documents &#8211; with the lender you selected during the preapproval process, you will officially gain ownership of the property!<\/p>\n<p>Make sure you bring ID and a cashier’s check to pay closing costs. You’ll be notified in advance about the total closing costs.<\/p>\n<p style=\"text-align: center; font-size: 18px;\"><strong>CONGRATULATIONS ON YOUR NEW HOME!<\/strong><\/p>\n","protected":false},"excerpt":{"rendered":"<p>The home-buying process is a long and complicated one. Even those who have purchased homes before may need guidance with some of the more convoluted steps. The Market Leader blog staff has boiled the process down as much as possible while still maintaining all the important parts and weren’t able to get the total number [&hellip;]<\/p>\n","protected":false},"author":28,"featured_media":35691,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[83],"tags":[348,349,350,351,352,353,56,96],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/21391"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/28"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=21391"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/21391\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=21391"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=21391"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=21391"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}