{"id":21521,"date":"2013-11-21T09:00:33","date_gmt":"2013-11-21T09:00:33","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=21521"},"modified":"2022-01-26T15:09:55","modified_gmt":"2022-01-26T23:09:55","slug":"2014-housing-market-predictions","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/2014-housing-market-predictions\/","title":{"rendered":"2014 Housing Market Predictions With Jed Kolko"},"content":{"rendered":"<p>Market Leader recently featured Trulia’s chief economist, Jed Kolko, during a special live webinar event. In it, Kolko shared his thoughts about the past, present and future of the U.S. housing market. Like it or not, the health of the national real estate industry affects the businesses of individual Realtors®. Market Leader was grateful that Kolko shared his insights with us so we can be aware of what lies ahead!<\/p>\n<hr style=\"height: 2px; margin: 20px 0px 40px 0px;\" \/>\n<h2>What to Expect in the 2014 Housing Market<\/h2>\n<p>The future is bright for the U.S. housing market! Here are five real estate trends to look forward to:<\/p>\n<h3>Rising Mortgage Rates &#8211; But No Derailed Recovery<\/h3>\n<p>The period of economic recovery that follows a recession, like the one the U.S. is currently shuffling through, tends to usher in higher rates. While economic recovery during this post-Great Recession period is hardly stellar, it is undoubtedly occurring; we know that rates will continue to rise as a result. The Federal Reserve is planning on tapering its bond purchases, which will also cause rates to increase.<\/p>\n<p>Some believe that rising rates will derail the housing market recovery, but Kolko disagrees. Why? Compared to historical rates, even those found in the last decade, today’s rates are quite low. This means that rates could rise to 6 percent or higher and consumers would still be able to afford mortgages.<\/p>\n<p>Kolko has also found that rising rates do little to hamper housing market recoveries. They really only affect applications for mortgage refinancing; a half-point increase in a month will cause, at most, a 45 percent reduction in these applications.<\/p>\n<h3>More Inventory on the Market<\/h3>\n<p>Nobody wants to sell their home when prices are resting at the bottom. As home prices continue to rise, expect more sellers to put their homes on the market.<\/p>\n<h3>Rebounding but Still Lagging Construction<\/h3>\n<p><img loading=\"lazy\" class=\"alignright  wp-image-21561\" title=\"New home construction\" src=\"\/wp-content\/uploads\/2013\/11\/home-construction-300x198.jpg\" alt=\"New home construction will lag behind home sales and prices in 2014\" width=\"270\" height=\"178\" \/>Home sales and prices are close to pre-bubble levels, but construction is not. Why? Inventory may be tight, but housing is not. While less than 2 percent of housing units are currently for sale, the vacancy rate of U.S. homes is above 10 percent! This explains why new homes are being built at a rate of 900,000 a year, significantly lower than the normal rate of 1.5 million.<\/p>\n<p>Fortunately, more homes are being built now than before the housing market crash, and construction is sure to increase as the housing surplus decreases.<\/p>\n<h3>Rising Home Prices &#8211; But No Bubble<\/h3>\n<p>Prices are around 11.5 percent higher than they were a year ago and are likely to continue rising in 2014, albeit at a slower rate. Kolko believes these rapidly rising prices do not indicate that the market is in another bubble.<\/p>\n<p>Here are three simple reasons why:<\/p>\n<ul>\n<li><strong>Home prices are still below their long-term norm! <\/strong>According to Trulia’s Bubble Watch, U.S. homes are still 5 percent below their long-term norm.<\/li>\n<li><strong>Lending is constrained.<\/strong> There are few, if any, similarities between what is going on in today’s housing market and the reckless lending that took place in the early to mid-2000s.<\/li>\n<li><strong>No overbuilding is taking place.<\/strong> As previously discussed, there is no flood of inventory entering the market. Builders are playing it safe, preventing overbuilding from rearing its ugly head.<\/li>\n<\/ul>\n<h3>More Long-Distance Moves<\/h3>\n<p>Long-distance moves are typically made because of new jobs. As the economy improves and more jobs become available in your area, expect an influx of residents from other counties and states to your market. These consumers will most likely not be familiar with your market, which gives you the opportunity to introduce them to it!<\/p>\n<hr style=\"height: 2px; margin: 20px 0px 40px 0px;\" \/>\n<h2>Jed Kolko’s 3 Big Real Estate Worries<\/h2>\n<p>Despite all the positive developments that have occurred in the last year, the U.S. housing market still faces major challenges that could slow or even cripple its progress in 2014. These are Jed Kolko’s thoughts about the three biggest upcoming challenges.<\/p>\n<h3>Availability of Mortgage Credit<\/h3>\n<p>After years of wild and carefree lending leading up to the bubble burst, lenders have made mortgage credit tight throughout the recession. This has made it more difficult for aspiring homebuyers to buy homes, further hampering the market’s recovery.<\/p>\n<p>It is unclear if access to credit will become easier in 2014, but Kolko believes it might. Here are two reasons why:<\/p>\n<ul>\n<li><strong>Rising mortgage rates could lead to more mortgage credit for homebuyers.<\/strong> As rates have risen, the demand for refinancing existing loans has dropped. This may cause lenders to shift credit to new home purchases instead.<\/li>\n<li><strong>New rules for lenders will clarify what is a “safe” loan. <\/strong>These rules will make banks more confident in issuing “safe” loans, making it easier for homebuyers to get them.<\/li>\n<\/ul>\n<h3>Homeownership Rates for Young Adults<\/h3>\n<p><img loading=\"lazy\" class=\"alignright  wp-image-21571\" title=\"Young Millennial homeowner\" src=\"\/wp-content\/uploads\/2013\/11\/young-homeowner-200x300.jpg\" alt=\"Fewer households are being formed because young adults are waiting longer to buy homes\" width=\"180\" height=\"270\" \/>Millennials will play an important role in the continuing recovery of the U.S. housing market.<\/p>\n<p>Why is this? New home construction is relatively slow in part because fewer households are being formed. This can be partially attributed to the lack of job opportunities available to young adults in our post-recession economy. Without the requisite funds to buy a home, young Americans are choosing to live with their parents in staggering numbers. According to AOL Real Estate, today’s young adults are less mobile now than their age group has been in 50 years and have been dubbed “Generation Wait.”<\/p>\n<p>Kolko predicts the long-term housing market recovery won’t be complete until Millennials are able to afford homes of their own. This means the availability of jobs &#8211; the means for young Americans to buy housing &#8211; will be key to your market’s growth in 2014 and beyond.<\/p>\n<h3>Government Impact on the Real Estate Industry<\/h3>\n<p>Is the federal government’s housing policy helping or hurting the real estate industry? The answer is unclear, but will hinge on how the government handles these three issues:<\/p>\n<ul>\n<li><strong>Budget reforms:<\/strong> Everything is on the table for the budget reforms that were agreed upon in the negotiations that ended the government shutdown. This includes the mortgage interest deduction, which gives consumers a financial incentive to own their housing. Altering this deduction will presumably reduce consumer demand &#8211; the question is how much.<\/li>\n<li><strong>Reforming Fannie and Freddie:<\/strong> According to Kolko, the argument around Fannie and Freddie boils down to this: “How much should the government and consumers be on hook for keeping the 30-year fixed-rate mortgage available and relatively cheap? How much risk do we want the government and taxpayers to take when the next housing downturn happens?” The policy created to answer these questions will undoubtedly impact the housing market.<\/li>\n<li><strong>The tapering of bond-buying: <\/strong>For many months now, the Federal Reserve has planned on cutting back its bond purchases. Mortgage rates spiked during the summer not because the Fed started tapering bond purchases, but because they were <em>expected <\/em>to start tapering them! Kolko expects that the Fed won’t begin tapering anytime soon (the government shutdown was good for something!) but when it does, rates will almost surely rise.<\/li>\n<\/ul>\n<hr style=\"height: 2px; margin: 20px 0px 40px 0px;\" \/>\n<h2>2014 Real Estate Business Plan<\/h2>\n<p>We hope that Jed’s insights into next year’s market were beneficial. 2013 has been a great year for the real estate industry, and, if Jed’s predictions hold true, 2014 could be a great one for Realtors® as well.<\/p>\n<p>If you would like additional assistance preparing for the coming year, get ahold of Market Leader’s 2014 Real Estate Business Plan. It will help you identify your strengths and weaknesses to determine which aspect of your business you should focus on most. You’ll also find information on how to boost referrals and improve your lead generation, lead engagement, and marketing\/branding.<\/p>\n<p style=\"text-align: center;\">&#8212;<\/p>\n<p style=\"text-align: center; font-size: 22px;\" align=\"center\"><strong><a href=\"http:\/\/success.marketleader.com\/2014BusinessPlan?lsr=AI-ROW-BLG-2014RealEstateBizPlan-DustinR&amp;del=2014BizPlan\">DOWNLOAD THE 2014 REAL ESTATE BUSINESS PLAN<\/a><\/strong><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Market Leader recently featured Trulia’s chief economist, Jed Kolko, during a special live webinar event. In it, Kolko shared his thoughts about the past, present and future of the U.S. housing market. Like it or not, the health of the national real estate industry affects the businesses of individual Realtors®. Market Leader was grateful that [&hellip;]<\/p>\n","protected":false},"author":28,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[83],"tags":[92,354,355,356,244,357,358,56,187],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/21521"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/28"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=21521"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/21521\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=21521"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=21521"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=21521"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}