{"id":21621,"date":"2013-11-25T08:00:26","date_gmt":"2013-11-25T08:00:26","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=21621"},"modified":"2021-11-30T11:27:02","modified_gmt":"2021-11-30T19:27:02","slug":"agent-spotlight-tim-houk-of-baton-rouge-la","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/agent-spotlight-tim-houk-of-baton-rouge-la\/","title":{"rendered":"Agent Spotlight: Tim Houk of Baton Rouge, La."},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-21651\" title=\"Agent Spotlight - Tim Houk\" src=\"\/wp-content\/uploads\/2013\/11\/Tim-Houk-175x300.jpg\" alt=\"Tim Houk is a real estate agent in Baton Rouge, Louisiana\" width=\"175\" height=\"300\" \/>So, how does a real estate agent obtain a 70 percent referral rate and close a deal every three days? If you’re anything like <a href=\"https:\/\/timhouk.com\/\">Tim Houk<\/a> with Keller Williams in Baton Rouge, La., it takes hard work, long hours and a thorough plan to build a team.<\/p>\n<h2>The Path to Real Estate<\/h2>\n<p>Tim started life in Baton Rouge, where he grew up with dreams of becoming a veterinarian. Instead, he found himself in the Navy, where he remained for six years.<\/p>\n<p>“When I got out of the service I got into the restaurant business,” he recalled. “I wanted to open a restaurant, so I waited tables and worked my way into management.” The reality of running a restaurant hit head-on with the dream, however.<\/p>\n<p>“When I started running a restaurant, I realized that it was absolutely miserable. The hours were terrible &#8211; working shift work, weekends, lots of late nights. There was no consistency, and it was just something I didn’t want to do for the rest of my life,” Houk said.<\/p>\n<p>He landed in the mortgage business where, on the advice of others, he considered a career in real estate.<\/p>\n<p>“I went back to the restaurant business at night,” he said, “and did real estate in the daytime.” He did double duty like this for about six months until he was able to devote all his time to real estate.<\/p>\n<h2>Growing Pains<\/h2>\n<p>We asked Houk about the challenges he currently faces in his real estate practice. “Every time we seem to grow a little bit we take a step back,” he said. “Our production has gone up 25 to 30 percent every year, but growth in management has proven to be a challenge.”<\/p>\n<p>The Houk team currently consists of Houk, an executive assistant, a transaction coordinator and a buyer’s agent.<\/p>\n<p>The team uses the Internet almost exclusively for marketing the business and works their sphere extensively.<\/p>\n<p>Their reach-out to former clients includes client events, such as a huge crawfish boil held at Houk’s home. He includes vendors on the invitation lists as well as past clients.<\/p>\n<p>For new clients who don’t come from their sphere, he holds housewarming parties. “The clients give us a list of 25 names for an invitation list. These names go into our database. We then mail out the invitations,” he continues. “We host a party, providing food and drinks. We get to meet all the people we invited and the buyer gets gifts from everyone we invited. It brings in a lot of referrals,” Houk concluded.<\/p>\n<p>Houk also credits his business practices when it comes to building referrals. “I don’t think I’ve ever sold somebody a house that they didn’t belong in,” he said. “I help people make sound financial decisions and get into the right house, and it helps us tremendously. I think that’s why our referrals are so high.”<\/p>\n<h2>Work\/Life Balance and Future Goals<\/h2>\n<p>When he isn’t selling real estate in Baton Rouge, you may find Houk on the beach or biking around Santa Monica, Calif. “It’s my Zen spot,” he said, chuckling. “I don’t know what it is. I hike, bike, hit the ocean, eat, marinate.” He also enjoys Austin, Texas, and says that if he had to choose between the two, he’d have a tough time.<\/p>\n<p>Most of all, Houk loves to cook and is working on a cookbook. He still has dreams of the restaurant industry as well, which came out when I asked him where he sees himself a decade from now.<\/p>\n<p>“I know I’m a glutton for punishment, but I want a small restaurant where my friends and family can come and hang out and have some good food,” he confessed. Will he cook there? Nope &#8211; he’s learned how to delegate.<\/p>\n<p>He also wants to reach the point in his business where he is selling a house every day. The long hours required to reach that goal don’t scare him a bit.<\/p>\n<p>“Between military and restaurants I was working 18 hours a day, so 50 to 60 hours a week is easy,” he claims.<\/p>\n<p>“You put in the time and you get rewarded, if you do it smart. There was a time I was working 80 hours a week in real estate. That’s when I started hiring talented people, and it made my world a lot better. Most of the time now I’m working 50 hours a week, he said. He considers that the perfect schedule.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>So, how does a real estate agent obtain a 70 percent referral rate and close a deal every three days? If you’re anything like Tim Houk with Keller Williams in Baton Rouge, La., it takes hard work, long hours and a thorough plan to build a team. The Path to Real Estate Tim started life [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[78,83],"tags":[190,106,275,56],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/21621"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=21621"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/21621\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=21621"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=21621"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=21621"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}