{"id":21821,"date":"2013-11-27T01:59:30","date_gmt":"2013-11-27T01:59:30","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=21821"},"modified":"2021-11-24T12:14:55","modified_gmt":"2021-11-24T20:14:55","slug":"guide-to-the-best-real-estate-videos","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/guide-to-the-best-real-estate-videos\/","title":{"rendered":"Guide to the Best Real Estate Videos"},"content":{"rendered":"<p>If a picture is worth a thousand words, a video has to be worth <em>at least<\/em> a million.<\/p>\n<p>If we are living in the age of the Internet, we are entering the era of online video. The size and social prominence of video hosting sites like YouTube and Vimeo is growing by leaps and bounds. Even the all-powerful <a href=\"https:\/\/www.forbes.com\/sites\/parmyolson\/2013\/11\/12\/heres-where-teens-are-going-instead-of-facebook\/?sh=26b554706f12\">Facebook is losing ground<\/a> to social networks that are completely or partially based on sharing videos (Vine, Snapchat, Instagram, Kik, etc.).<\/p>\n<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-21831\" title=\"real estate video\" src=\"\/wp-content\/uploads\/2013\/11\/real-estate-video-300x246.jpg\" alt=\"Best real estate videos on the Internet\" width=\"300\" height=\"246\" \/>Online video is particularly useful for the real estate industry. Because <span style=\"text-decoration: underline;\"><a href=\"https:\/\/www.nar.realtor\/sites\/default\/files\/migration_files\/Study-Digital-House-Hunt-2013-01.pdf\">90 percent of homebuyers use the Internet during their home search<\/a><\/span>, online video gives real estate agents the chance to introduce themselves, share market updates and show potential clients the features of their listings without ever meeting them. In this way, a series of short YouTube videos can do more to brand and advertise agents’ services than more conventional marketing methods like riders, newspaper ads or radio spots ever could!<\/p>\n<p>The Market Leader blog staff has compiled its favorite real estate videos below. Learn from the masters and adapt their techniques into your business’s real estate video marketing strategy. At the very least, we hope you enjoy these videos as much as we do!<\/p>\n<h2>The Humorous Branding Video<\/h2>\n<p><strong>PURPOSE:<\/strong> Make potential clients laugh and take up some mental real estate in an upbeat, unique way.<\/p>\n<p>Real estate agents are consumers’ greatest friends during the home-buying process. It thus makes sense for homebuyers and sellers to work with agents they like as people. There’s perhaps no better way to share your personality with potential clients than to display your sense of humor and fun.<\/p>\n<p>Of course, humor can be a double-edged sword; your sense of humor could turn some potential clients off! Make sure your humorous branding videos don’t alienate or annoy anyone.<\/p>\n<p><em>Here&#8217;s a funny and clever humorous branding video from Kentucky Realtor® Brad Simmons:<\/em><\/p>\n<p><iframe loading=\"lazy\" src=\"\/\/www.youtube.com\/embed\/37mxqjBNEnU\" frameborder=\"0\" width=\"560\" height=\"315\"><\/iframe><\/p>\n<h2>The Introductory Video<\/h2>\n<p><strong>PURPOSE:<\/strong> Gives consumers an idea of what agents are like to work with, and what they are like as people.<\/p>\n<p>Agents use these videos to introduce themselves and their teams, give client testimonials, and explain their values, interests and why they work in real estate. They are more feel-good than educational, showing that the agent is someone you should want to work with on the basis of their personality and work ethic.<\/p>\n<p><em>Southern California Realtor® Chuck Costigan does a great job introducing himself in this video:<\/em><\/p>\n<p><iframe loading=\"lazy\" width=\"560\" height=\"315\" src=\"https:\/\/www.youtube.com\/embed\/xQv2eRuFdoE\" frameborder=\"0\" allowfullscreen><\/iframe><\/p>\n<h2>The Listing Video<\/h2>\n<p><strong>PURPOSE:<\/strong> Provide consumers the opportunity to peek inside agents’ listings without physically being there.<\/p>\n<p>Listing videos give consumers a <em>much<\/em> better idea of what a house looks and feels like than listing photos can. They also give agents the opportunity to quickly describe their listings’ important features as consumers are taken on video tours of them.<\/p>\n<p><em>A listing video from the charismatic Travis brothers, Benji and Julian, two Realtors® from the Seattle area:<\/em><\/p>\n<p><iframe loading=\"lazy\" src=\"\/\/www.youtube.com\/embed\/4PCiCymzNeQ\" frameborder=\"0\" width=\"560\" height=\"315\"><\/iframe><\/p>\n<h2>The Informational Video<\/h2>\n<p><strong>PURPOSE:<\/strong> Share the real estate agent’s abilities, credentials and processes, and differentiate the agent from his competitors.<\/p>\n<p>Unlike the introductory video, which shares what the agent is like to work with and as a person, informational videos are more of a sales pitch. They address an agent’s:<\/p>\n<ul>\n<li>Abilities and talents.<\/li>\n<li>Industry experience and other credentials.<\/li>\n<li>Honed, tried-and-true method for buying\/selling homes.<\/li>\n<li>Unique and notable attributes, especially compared to other agents in the market.<\/li>\n<\/ul>\n<p><em>Los Angeles-area Realtor® Greg Geilman gives information about himself and his business in this video:<\/em><\/p>\n<p><iframe loading=\"lazy\" src=\"\/\/www.youtube.com\/embed\/l97QJDvrYYU\" frameborder=\"0\" width=\"560\" height=\"315\"><\/iframe><\/p>\n<p><em>Another informational video, this one from Vancouver, British Columbia Realtor® Phil LeGree:<\/em><\/p>\n<p><iframe loading=\"lazy\" src=\"\/\/www.youtube.com\/embed\/2ft5NkFA61o\" frameborder=\"0\" width=\"560\" height=\"315\"><\/iframe><\/p>\n<h2>The Market Update Video<\/h2>\n<p><strong>PURPOSE:<\/strong> To give information about housing market trends in the agent’s market.<\/p>\n<p>Consumers will want to know if it is the right time to buy or sell their home before they start doing so. Real estate agents can answer their questions by releasing monthly or quarterly market update videos with information about trends in home sales, home prices, mortgage rates and other facts and figures.<\/p>\n<p>Of course, agents can also use market update videos to impress potential customers with their knowledge of their market and the real estate industry. “Knowledge is power” &#8211; show potential clients that you have it!<\/p>\n<p><em>Check out this summary of the Atlanta metropolitan region&#8217;s real estate market produced by Realtor® Kyle Eaves:<\/em><\/p>\n<p><iframe loading=\"lazy\" src=\"\/\/www.youtube.com\/embed\/T0qxdtqwzgg\" frameborder=\"0\" width=\"420\" height=\"315\"><\/iframe><\/p>\n<h2>The Community Video<\/h2>\n<p><strong>PURPOSE:<\/strong> To introduce buyers to the neighborhood or city in which the agent operates.<\/p>\n<p>Every real estate agent has the ability to be a tour guide for their local market. You know why people should want to live in your community, so put your reasons on video and post them online for potential clients to see! Community videos are particularly valuable in markets with many out-of-state or out-of-country buyers.<\/p>\n<p>Community videos should address the local economy, the quality of schools and parks, shopping and dining options, culture (fairs, festivals, museums and the like), weather and anything that makes residents enjoy living there. Skip local tourist attractions unless they affect day-to-day life. For example, no one ever moved to Seattle for the Space Needle.<\/p>\n<p><em>Realtor® Richard Silver gives a virtual tour of Toronto&#8217;s Rosedale community in this video:<\/em><\/p>\n<p><iframe loading=\"lazy\" src=\"\/\/www.youtube.com\/embed\/fSfCt94Ygc0\" frameborder=\"0\" width=\"560\" height=\"315\"><\/iframe><\/p>\n","protected":false},"excerpt":{"rendered":"<p>If a picture is worth a thousand words, a video has to be worth at least a million. If we are living in the age of the Internet, we are entering the era of online video. The size and social prominence of video hosting sites like YouTube and Vimeo is growing by leaps and bounds. [&hellip;]<\/p>\n","protected":false},"author":28,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[35],"tags":[190,100,240,363,364,56,187,329,330],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/21821"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/28"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=21821"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/21821\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=21821"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=21821"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=21821"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}