{"id":21951,"date":"2013-12-03T18:33:53","date_gmt":"2013-12-04T02:33:53","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=21951"},"modified":"2017-08-17T13:25:00","modified_gmt":"2017-08-17T20:25:00","slug":"keep-your-leads-coming-back-to-your-website","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/keep-your-leads-coming-back-to-your-website\/","title":{"rendered":"Keep Your Leads Coming Back to Your Website"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-21981\" title=\"Keep Leads Coming Back to Your Website\" src=\"\/wp-content\/uploads\/2013\/12\/Fotolia_53892956_XS-300x257.jpg\" alt=\"Part of converting leads into clients is giving them reasons to return to your website\" width=\"300\" height=\"257\" \/>I have a very dear friend who recently opened a retail clothing store. As a business newbie, one of her biggest fears is how to build a loyal customer base and keep them coming back to the store. It’s a common concern of all business people, considering how much more expensive and time-consuming it is to chase after new business.<\/p>\n<p>Yet one of the most common mistakes business owners make, according to Entrepreneur’s Daniel Bortz, is focusing “so much time on attracting new customers that they skimp on the effort it takes to <a href=\"http:\/\/www.entrepreneur.com\/article\/222520\">create loyal customers<\/a>.”<\/p>\n<p>While your leads aren’t yet customers, to retain them in any capacity requires offering them a reason to keep coming back to your website until you can convert them. Let’s take a look at some of the most effective ways of doing this.<\/p>\n<h2>The Right Tools<\/h2>\n<p>No matter what stage of the process buyers are in you can be certain that what they most want to see are listings. It may seem overly obvious, but the most important tool on your website is an IDX (Internet Data Exchange) system. Without this, leads will quickly move on to another site that offers the opportunity to search for listings.<\/p>\n<p>Your website should also remember who has registered so that when the lead returns to the site she isn’t treated as a new user. Having all of her interests conveniently saved gives her a reason to come back.<\/p>\n<p>What if a user finds a couple of houses he’s interested in? Easy-to-use sharing capabilities, via email and social media, offer another convenience that creates loyalty.<\/p>\n<p>Photos, and lots of them, are important to not only break up the monotony of text blocks, but to show as well as tell.<\/p>\n<h2> Drive Them Back With Email<\/h2>\n<p>One of the best ways of getting leads to pay another visit to your website is with fresh content that you’ve teased on social media and via email blasts. As long as the content is compelling and you promote it right, they’ll return to the site to check it out.<\/p>\n<p>Neighborhood and market updates, fun news about the area, and even information about new listings, if packaged right, can peak a lead’s interest.<\/p>\n<h2>Don’t Smother Your Leads<\/h2>\n<p>While there isn’t a thing wrong with just reaching out to touch base and see how the search is going, having a valid reason for calling or emailing turns that cold call into a warm one. If you segment your leads according to where they stand in the buying process, driving them to relevant website content is a warm way of contacting them.<\/p>\n<p>For instance, leads in the early stages need more step-by-step information than those closer to actually purchasing. Find experts who can help you provide quality content. For example, ask your favorite home inspector to write a blog post about the home inspection process, then make it known, via social media and email, that you have incredible information from the mind of an expert right there on your site.<\/p>\n<h2>Considerations<\/h2>\n<p>Although you want leads to return to your website, there is such a thing as going overboard in the enticement arena. Don’t push these people away by excessively contacting them. Reach out right after they sign up and then leave them in peace for a while &#8211; unless, of course, it’s a lead who wants to proceed right away. In that case, you have our permission to hound them to the ends of the earth!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>While your leads aren’t yet customers, to retain them in any capacity requires offering them a reason to keep coming back to your website until you can convert them. Let’s take a look at some of the most effective ways of doing this.<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[34],"tags":[124,86,144,44,141,126,87,136],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/21951"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=21951"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/21951\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=21951"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=21951"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=21951"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}