{"id":22081,"date":"2013-12-04T09:00:25","date_gmt":"2013-12-04T09:00:25","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=22081"},"modified":"2021-12-10T16:35:18","modified_gmt":"2021-12-11T00:35:18","slug":"google-plus-pinterest-real-estate-marketing","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/google-plus-pinterest-real-estate-marketing\/","title":{"rendered":"Google Plus and Pinterest – Real Estate Marketing Powerhouses"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright  wp-image-22131\" title=\"social media for real estate\" src=\"\/wp-content\/uploads\/2013\/12\/social-media-and-real-estate.jpg\" alt=\"Pinterest and Google Plus are two social networks that are ideal for real estate agents\" width=\"305\" height=\"204\" \/>One of the major goals of any social media strategy is to get more visitors to your website. It is a long process, often referred to as the tortoise of marketing (slow and steady wins the race!), because you have to take the time to grow your follower base and build a strong bond with them.<\/p>\n<p>Pinterest and Google Plus are goldmines of website traffic because their target audiences (home décor fanatics and web-savvy professionals) are more likely to enjoy and interact with  real estate-related posts. Oddly enough, Pinterest and Google Plus are two of the most underrated social media sites for real estate agents. This article explores why you should beef up your online marketing strategy by using these two powerful social networks.<\/p>\n<h2>How Real Estate Agents Should Use Google Plus<strong><\/strong><\/h2>\n<p>Here are some pointers for agents interested in using Google Plus:<\/p>\n<h3>Set Up Google Authorship<\/h3>\n<p>Set up <strong>Google Authorship<\/strong> on your Google Plus profile and your blog to link the two together. The primary benefit of Google Authorship is that your Google Plus profile picture shows up next to your blog posts in search results. This leads to a much higher click-through rate; having images next to your blog posts in search results will attract users’ eyes and can garner as high as a <a href=\"http:\/\/www.seobodybuilder.com\/marketing-conversion\/click-through-rate-increased-with-rel-author\/\">38 percent uptick<\/a> in the number of times your posts get clicked!<\/p>\n<h3>How to Get Engagement on Google Plus<\/h3>\n<p>There is a right way and a wrong way of using social media for real estate. In fact, one of the biggest social media mistakes Realtors® make is just blogging about real estate listings on Google Plus.<\/p>\n<p>As a social community Google Plus happens to be one of the most intelligent. The conversations you see on Google Plus are a little different than those on Facebook. Those that get the most engagement on Google Plus are sharing awe-inspiring content. A humdrum post about a real estate listing is not the kind of content that is going to make people want to interact with you.<\/p>\n<h2>How Real Estate Agents Should Use Pinterest<\/h2>\n<p><img loading=\"lazy\" class=\"alignleft  wp-image-22171\" title=\"Pinterest for real estate\" src=\"\/wp-content\/uploads\/2013\/12\/Pinterest-219x300.jpg\" alt=\"How real estate agents should use Pinterest\" width=\"83\" height=\"114\" \/>Pinterest users are crazy about interior decorating, home improvement projects, and other home-related topics. This makes them the perfect audience for real estate agents using social media to generate traffic to their websites.<\/p>\n<p>A great feature of Pinterest is that its posts, called “pins,” are easy for Pinterest users – and even search engine browsers – to find weeks or even months after they are originally posted. Compared to Twitter, where tweets get buried in your followers’ feeds in minutes and are rarely seen in search results, Pinterest has the potential to drive a lot more traffic to your website.<\/p>\n<p><strong>Follow these simple tips to drive traffic to your website from Pinterest:<\/strong><\/p>\n<ul>\n<li>Use intriguing images worthy of a <strong>“re-pin”<\/strong> (when another user reposts your pin). One way to get your hands on Pinterest-worthy images is to take pictures of interesting architecture and unique features in the homes you are selling. Pin these images and include links back to the listings on your website.<\/li>\n<li>Create several <strong>“boards”<\/strong> (categories that your pins are classified into) related to homes and home life to give your followers a reason to frequently look at the images you post for ideas and inspiration. Other board topics that are ideal for the real estate industry are home improvement, mortgages\/financing, and home staging.<\/li>\n<li>Set up <a href=\"https:\/\/www.thesocialmediahat.com\/blog\/why-real-estate-agents-should-have-community-pages-and-how-to-promote-them\/\">boards for the communities<\/a> where you sell real estate. If you frequently post images on these boards and use community-specific keywords in the titles, descriptions and image captions, these boards can show up in Google searches related to the communities they target.<\/li>\n<li>Consider using <strong>&#8220;rich pins&#8221;<\/strong> to enhance the quality of your posts by adding information not included in typical pins. Unfortunately, Pinterest users must be comfortable tinkering with HTML code using Schema.org markup or Open Graph tags to create rich pins. For more information, Pinterest offers a guide on <a href=\"https:\/\/help.pinterest.com\/en\/business\/article\/rich-pins\">creating rich pins<\/a> (including using the markup languages they require).<\/li>\n<\/ul>\n<div><em><a href=\"https:\/\/www.thesocialmediahat.com\/blog\/what-every-real-estate-agent-needs-to-know-about-pinterest\/\">Click here<\/a> to read more Pinterest tips for real estate agents.<\/em><\/div>\n<h2>Benefits of Using Pinterest and Google Plus Together<\/h2>\n<p>Here’s why you should use both Pinterest and Google Plus:<\/p>\n<ul>\n<li><strong>Images are similar on both networks.<\/strong> Images ideal for Pinterest will also work well on Google Plus. For the pictures you post on these networks, consider adding your watermark for added branding opportunities.<\/li>\n<\/ul>\n<ul>\n<li><strong>Hashtags are similar on both networks.<\/strong> The most popular hashtag on Pinterest, #pinoftheday, is also commonly used on Google Plus.<\/li>\n<\/ul>\n<ul>\n<li><strong>Get double the exposure with people using both networks.<\/strong>  By maintaining an active presence on both Google Plus and Pinterest, you double your chances of being found and driving traffic to your website.<\/li>\n<\/ul>\n<ul>\n<li><strong>Connect with different demographics.<\/strong> Not all Pinterest users are on Google Plus, and vice versa. Maintaining a presence on both networks will give you a wider reach than if you only use one.<\/li>\n<\/ul>\n<h2>How to Post on Both Social Networks<\/h2>\n<p>There are many different strategies to use when combining Pinterest and Google Plus. Here are a few:<\/p>\n<p><strong>Rock the simultaneous post.<\/strong> Apps like Everypost allow social media users to simultaneously create and publish posts on all their accounts with major social media platforms. These applications are great time-savers and are ideal for posting on Google Plus and Pinterest because images and hashtags operate in similar fashions on both networks.<\/p>\n<p><strong>Have Pinterest be your guinea pig.<\/strong> Test images on Pinterest to see how popular they have the potential to be. If your images don’t get any interaction on Pinterest, skip posting them on Google Plus and test other images instead. Why use Pinterest as a guinea pig? Pinterest users are barraged with images the moment they log in; any image that inspires interaction on Pinterest will likely do the same on Google Plus!<\/p>\n<p style=\"text-align: center;\">&#8212;<\/p>\n<p><em>This guest blog post was written by Bill Gassett, a nationally recognized Realtor® who has worked in the MetroWest Massachusetts area for the past 26 years. Gassett was named the No. 1 RE\/MAX real estate agent in all of New England in 2012. <\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>One of the major goals of any social media strategy is to get more visitors to your website. It is a long process, often referred to as the tortoise of marketing (slow and steady wins the race!), because you have to take the time to grow your follower base and build a strong bond with [&hellip;]<\/p>\n","protected":false},"author":36,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[35],"tags":[365,366,197,56,96,367,57,136],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/22081"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/36"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=22081"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/22081\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=22081"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=22081"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=22081"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}