{"id":22521,"date":"2014-01-29T09:00:30","date_gmt":"2014-01-29T09:00:30","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=22521"},"modified":"2021-11-22T13:26:34","modified_gmt":"2021-11-22T21:26:34","slug":"a-portrait-of-the-agent-realtor-habit-survey","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/a-portrait-of-the-agent-realtor-habit-survey\/","title":{"rendered":"A Portrait of the Agent – Realtor® Habit Survey"},"content":{"rendered":"<p>Market Leader surveyed 1,967 Realtors® in August 2013 to learn about their habits. We asked questions about offbeat topics not covered in NAR’s annual Member Profile or similar studies. Questions touched on topics as diverse as their procrastination habits, cell phone usage while driving, and favorite cuisine.<\/p>\n<p>Read on to discover what Market Leader’s survey uncovered about Realtors® &#8211; from habits common across the profession to the differences in habits between the most and least successful Realtors®!<\/p>\n<p style=\"text-align: center;\"><img loading=\"lazy\" class=\"aligncenter size-full wp-image-24461\" title=\"A Portrait of the Agent\" src=\"\/wp-content\/uploads\/2014\/01\/A-Portrait-of-the-Agent.jpg\" alt=\"An infographic with interesting, offbeat facts about Realtors you can't find anywhere else\" width=\"600\" height=\"2525\" \/><\/p>\n<hr style=\"height: 2px;\" \/>\n<h2 style=\"text-align: left;\">Meet the Typical Realtor®<\/h2>\n<p>According to NAR’s 2012 Member Profile study, the typical Realtor® has the following characteristics:<\/p>\n<ul>\n<li>57 years old.<\/li>\n<li>Female.<\/li>\n<li>Earns $43,500 a year.<\/li>\n<li>Has worked in the real estate industry for 13 years.<\/li>\n<li>Works 40 hours a week.<\/li>\n<\/ul>\n<p>This information is interesting and certainly good to know, but doesn’t say much about how Realtors® actually conduct their business or what they’re like when not on the job. The objective of our “A Portrait of the Agent” survey was to get a more complete picture of what real estate professionals are truly like. As you’ll discover below, the survey certainly accomplished this!<\/p>\n<hr style=\"height: 2px;\" \/>\n<h2>Interesting Realtor® Habits<\/h2>\n<h3>Caffeine Consumption<\/h3>\n<p>Realtors® tend to not be over-caffeinated. Most Realtors® (54 percent) only drink one to two cups a day. Their preferred way to get caffeine is to drink coffee. Seventy-two percent of Realtors® prefer coffee to other caffeinated beverages like tea, soda and energy drinks.<\/p>\n<h3>Style Preferences<\/h3>\n<p>Business casual is the style of dress used by the vast majority, 85 percent, of real estate professionals when they meet with their clients. Business formal is worn more often than casual clothing (9 percent compared to 6 percent).<\/p>\n<h3>Car and Driving Habits<\/h3>\n<p>Realtors® predominantly drive sedans and SUVs. Combined, these styles account for 73 percent of the cars Realtors® drive. They seem to prefer plain-colored cars; 65 percent drive a white, silver\/grey or black car. The most common car color for Realtors® is silver\/grey, with 29 percent choosing this color.<\/p>\n<p>Only 11 percent of Realtors® are unwilling to drive more than 15 miles to meet with new clients. Forty-six percent are willing to drive 15 to 30 miles, 33 percent are willing to drive 31 to 60 miles, and 11 percent are willing to drive more than 60 miles!<\/p>\n<p>A surprisingly small number of Realtors® (17 percent) never text message or take phone calls while driving. Most Realtors® (53 percent) only <em>sometimes <\/em>use their phone while driving.<\/p>\n<h3>Procrastination and Relaxation Habits<\/h3>\n<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-23671\" title=\"Realtor procrastination habits\" src=\"\/wp-content\/uploads\/2014\/01\/Realtor-procrastination-habits-200x300.jpg\" alt=\"Real estate agent procrastinating by watching TV\" width=\"200\" height=\"300\" \/>Only 10 percent of Realtors® say they never catch themselves off task. The majority of Realtors®, 65 percent, say they <em>occasionally <\/em>find themselves off task.<\/p>\n<p>Surfing the Internet (50 percent), followed by watching TV\/movies (12 percent) and reading books\/magazines (10 percent), are the most popular procrastination methods. The most commonly cited ways Realtors® kill time on the Internet are Facebook (58 percent), online shopping (22 percent), and, surprisingly, Pinterest (19 percent).<\/p>\n<p>For relaxation after work, Realtors® prefer spending time with family\/friends (43 percent), watching TV\/movies (28 percent) and exercising (12 percent).<\/p>\n<h3>Client Schmoozing Habits<\/h3>\n<p>The vast majority of Realtors®, 92 percent, send gifts to their clients after they close transactions at least some of the time. Forty-three percent of Realtors <em>always <\/em>send gifts to their clients, 27 percent <em>occasionally <\/em>send gifts, and 22 percent <em>frequently <\/em>send them. Gift cards and certificates, gift baskets, wine and CutCo knives are the most common gifts.<\/p>\n<p>Most Realtors®, 70 percent, say they only <em>occasionally<\/em> socialize with their clients. Popular ways of socializing with clients are taking them out to dinner, lunch, coffee or other drinks.<\/p>\n<h3>Vacations<\/h3>\n<p>Forty percent of Realtors® take between one and three vacations each year. Fifteen percent of Realtors® take no vacations at all!<\/p>\n<h3>Children<\/h3>\n<p>Thirty-five percent of Realtors® have two children while 20 percent have no children.<\/p>\n<p><img loading=\"lazy\" class=\"alignleft  wp-image-23681\" title=\"Realtor lunch preferences\" src=\"\/wp-content\/uploads\/2014\/01\/Realtor-lunch-preferences-300x200.jpg\" alt=\"Realtors mostly bring lunch from homes, but also get takeout and fast food, and prefer &quot;American&quot; food over all other cuisines\" width=\"240\" height=\"160\" \/><\/p>\n<h3>Lunch Preferences<\/h3>\n<p>52 percent of Realtors® eat the lunch they brought from home, 27 percent eat at or get takeout from a local restaurant, and 21 percent get fast food.<\/p>\n<p>“American” is the most popular cuisine amongst Realtors® (27 percent), followed by Mexican and Italian (20 percent and 19 percent, respectively).<\/p>\n<h3><\/h3>\n<h3>Gym Membership<\/h3>\n<p>Forty-three percent of Realtors® have gym memberships, but only 27 percent go to the gym at least once a week.<\/p>\n<h3>Continuing Education<\/h3>\n<p>As a whole, Realtors® spend time continuing their education beyond what they are required. Thirty-two percent spend six to 10 hours a year, 24 percent spend 11 to 25 hours, and 14 percent spend more than 25 hours.<\/p>\n<h3>Technology Used on the Job<\/h3>\n<p>The vast majority of Realtors® &#8211; 95 percent &#8211; have a smartphone on them at all times. Forty percent have pen and paper, 33 percent have a tablet, and 25 percent have a laptop.<\/p>\n<h3>Favorite Movie Genre<\/h3>\n<p>Realtors® love to laugh! Forty-two percent of survey respondents said comedy is their favorite movie genre. Half as many respondents chose the runner-up genre, thriller\/drama, as their favorite.<\/p>\n<h3>Starting Time<\/h3>\n<p>Most Realtors®, 58 percent, start working sometime between 7 and 9 a.m.<\/p>\n<hr style=\"height: 2px;\" \/>\n<h2>Differences Between the Most and Least Successful Realtors®<\/h2>\n<p>Interestingly enough, the habits of the <strong><em>most <\/em><\/strong>successful Realtors®, those who make more than $100,000 a year, and the <strong><em>least <\/em><\/strong>successful, those who make under $35,000 a year, differ greatly. These differences are broken down below.<\/p>\n<h3>Age<\/h3>\n<p>The least successful Realtors® are both more likely to be in their 20s and more likely to be in their 60s, while their more successful peers are more likely to be middle-aged, in their 30s-50s. We expected to see this trend. Young, novice real estate professionals who are still learning how to sell homes will naturally make less commission income than their more experienced elders. Many Realtors® in their 60s are on the verge of retirement or work in the real estate industry on a part-time basis to keep themselves busy; for them, making a ton of money is not really a concern.<\/p>\n<h3>Gender<\/h3>\n<p>The most successful Realtors® are 36 percent more likely to be male than female. The least successful Realtors® are 151 percent more likely to be female than male.<\/p>\n<h3>Starting Time<\/h3>\n<p>The most successful real estate professionals are 79 percent more likely to start working before 7 a.m. (How do they do that?) The least successful Realtors® are a whopping 218 percent more likely to start working after noon!<\/p>\n<h3>Caffeine Consumption<\/h3>\n<p>Income has no effect on whether Realtors® enjoy drinking caffeinated beverages; a similar percentage of Realtors® drink them, regardless of income. The <em>types <\/em>of caffeinated beverages do vary based on income, however. Higher-earning Realtors® are more likely to drink energy drinks and coffee while Realtors® with lower incomes are more likely to drink tea and soda.<\/p>\n<h3>Style of Dress Preferences<\/h3>\n<p>The Realtors® with the highest incomes are more likely to wear casual clothes (shorts, flip flops, etc.) <strong><em>and <\/em><\/strong>wear formal clothes (suits) while on the job than their peers who earn less. The vast majority of Realtors® who make under $35,000 a year &#8211; around 89 percent &#8211; wear business casual (slacks, a button-up shirt and the like).<\/p>\n<h3>Car Preferences and Driving Habits<\/h3>\n<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-23811\" title=\"Realtor texting while driving\" src=\"\/wp-content\/uploads\/2014\/01\/Realtor-texting-while-driving-300x210.jpg\" alt=\"Realtors that make the most money tend to use their cell phones while driving more than Realtors that make relatively little money\" width=\"300\" height=\"210\" \/>Unsurprisingly, the highest-earning real estate professionals are 172 percent more likely to drive luxury cars. They prefer black, white and silver\/grey for their vehicles. The lowest-earning real estate professionals, on the other hand, are 282 percent more likely to drive minivans, 45 percent more likely to drive sedans, and 20 percent more likely to drive sports cars. Their favorite car colors are blue and red.<\/p>\n<p>Funnily enough, higher-paid Realtors® are simultaneously willing to travel the farthest distances (60 miles or more) <strong><em>and <\/em><\/strong>shortest distances (15 miles or less) to meet with clients.<\/p>\n<p>There are no breaks in real estate, apparently not even while Realtors® are driving. The highest-earning real estate professionals are 58 percent more like to <em>constantly <\/em>use their phones while driving to text or make phone calls, while their lowest-earning counterparts are 57 percent more likely to <em>never <\/em>use their phone while driving.<\/p>\n<h3>Procrastination and Relaxation Habits<\/h3>\n<p>Ironically, the higher-earning real estate professionals are more likely to be off task all the time <strong><em>and <\/em><\/strong>never be off task. While being laser-focused on the tasks at hand will never hurt your productivity, it seems you don’t need to have focus to sell homes! The preferred procrastination methods for the most-successful real estate professionals are reading books and magazines and surfing the Internet, while their less-successful peers are more likely to procrastinate by watching TV or playing games on their phones, computers, or game consoles.<\/p>\n<p>When surfing the Internet, the preferred procrastination method for both groups is using Facebook, but the best-paid Realtors® are more likely to enjoy perusing e-commerce sites while the least-paid Realtors® are more likely to scroll and click their way through Pinterest.<\/p>\n<p>To relax, successful Realtors® are more likely to exercise, cook, or spend time with friends and family. The less successful Realtors® are more likely to relax by playing video games, performing home renovations, or watching TV shows and movies.<\/p>\n<h3>Client Schmoozing Habits<\/h3>\n<p>While the majority of both high- and low-earning Realtors® always give gifts to their clients after deals are closed, low-earning Realtors® are simultaneously more likely to always give gifts <strong><em>and <\/em><\/strong>never give gifts than their better-paid counterparts.<\/p>\n<p>Socializing with clients is much more popular among the high-earning Realtors®. They are more than 100 percent more likely to socialize with clients <em>frequently <\/em>and <em>all the time<\/em>. In comparison, the lowest-paid Realtors® are 218 percent more likely to <em>never <\/em>socialize with their clients!<\/p>\n<p><img loading=\"lazy\" class=\"alignleft size-medium wp-image-23801\" title=\"Realtor vacation\" src=\"\/wp-content\/uploads\/2014\/01\/Realtor-vacation-182x300.jpg\" alt=\"Unsurprisingly, Realtors that make the most money are the ones that take the most vacations\" width=\"182\" height=\"300\" \/><\/p>\n<h3>Vacations<\/h3>\n<p>The most successful Realtors® are 154 percent more likely to take four or more vacations a year and 91 percent more likely to take two or three vacations. Their least successful counterparts, on the other hand, are 169 percent more likely to take no vacations.<\/p>\n<p>At first glance, the fact that highly successful Realtors® take more vacations makes sense; the more money someone makes, the more vacations they can afford to take. However, commission income is typically correlated to the time Realtors® invest in their jobs. The more they work, the more they make! We are glad that the most successful Realtors® have enough time to enjoy their money.<\/p>\n<h3>Children<\/h3>\n<p>Lower-earning Realtors® are 59 percent more likely to have no children than higher-earning Realtors®. This makes sense, as many low-earning Realtors® are in their 20s and, presumably, are holding off on having kids. On the other hand, higher-earning Realtors® are 16 percent more likely to have three or more children!<\/p>\n<h3>Lunch Preferences<\/h3>\n<p>Eating at a restaurant or getting takeout for lunch is more common among the most successful real estate professionals, while their least-successful peers are more likely to eat fast food. Income has relatively little impact on what Realtors® have for lunch; the only real difference is that the most successful Realtors® are more likely to enjoy Thai cuisine while the least successful ones are more likely to have Chinese.<\/p>\n<h3>Gym Membership<\/h3>\n<p>The highest-earning real estate professionals are 42 percent more likely to have gym memberships and 39 percent more likely to use them all the time. The lowest-earning real estate professionals are 36 percent more likely to never use their gym memberships.<\/p>\n<h3>Continuing Education Past the Requirement<\/h3>\n<p>The best-paid Realtors® are 149 percent more likely to spend 25 or more hours a year on continuing their real estate education past the requirement than their lesser-paid peers. Conversely, the lowest-paid Realtors® are 57 percent more likely to spend less than five hours studying past their requirement than the highest-paid Realtors®.<\/p>\n<p>Based on these facts, it seems reasonable to conclude that commission income is proportional to hours spent on continuing education. The more you study, the more you are likely to earn!<\/p>\n<h3>Technology Used on the Job<\/h3>\n<p>Higher-earning Realtors® are more likely to use tablets, like the iPad or Windows Surface, and smartphones. Lower-earning Realtors® are more likely to use laptops and good, old-fashioned pens and paper.<\/p>\n<h3>Favorite Movie Genre<\/h3>\n<p>Action movies are 44 percent more popular among the real estate professionals that earn the most. For the Realtors® who earn the least, science fiction movies are 65 percent more popular, crime movies are 27 percent more popular, and thriller\/dramas are 10 percent more popular.<\/p>\n<hr style=\"height: 2px;\" \/>\n<h2>What Characteristics Do Homebuyers Look for in Real Estate Agents?<\/h2>\n<p>We just spent several thousand words telling you what characteristics the most and least successful real estate agents possess. While we hope you found these facts to be interesting, at the end of the day the characteristics favored by consumers are <em>probably<\/em> the ones agents should be the most interested in.<\/p>\n<p>According to a survey conducted by Trulia, these are the top five things homebuyers want in their agents:<\/p>\n<ol>\n<li>Honesty and credibility<\/li>\n<li>Area familiarity<\/li>\n<li>Good follow through<\/li>\n<li>Organization<\/li>\n<li>Being a good listener<\/li>\n<\/ol>\n<p>Keep these traits in mind when you next market your services!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Market Leader surveyed 1,967 Realtors® in August 2013 to learn about their habits. We asked questions about offbeat topics not covered in NAR’s annual Member Profile or similar studies. Questions touched on topics as diverse as their procrastination habits, cell phone usage while driving, and favorite cuisine. Read on to discover what Market Leader’s survey [&hellip;]<\/p>\n","protected":false},"author":28,"featured_media":24491,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[78],"tags":[391,392,393,394,56,218,187,395],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/22521"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/28"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=22521"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/22521\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=22521"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=22521"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=22521"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}