{"id":22731,"date":"2013-12-16T18:09:08","date_gmt":"2013-12-16T18:09:08","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=22731"},"modified":"2016-02-04T16:53:04","modified_gmt":"2016-02-05T00:53:04","slug":"agent-spotlight-keith-riddle-of-spokane-wash","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/agent-spotlight-keith-riddle-of-spokane-wash\/","title":{"rendered":"Agent Spotlight: Keith Riddle of Spokane, Wash."},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-full wp-image-22741\" title=\"Agent Spotlight - Keith Riddle\" src=\"\/wp-content\/uploads\/2013\/12\/Keith-Riddle.jpg.png\" alt=\"Keith Riddle is a real estate agent in Spokane, Washington\" width=\"120\" height=\"160\" \/>Keith Riddle grew up on a working farm in eastern Washington, and for most of his life he assumed he’d be a farmer when he grew up. Then, life happened.<\/p>\n<p>“I was a diesel mechanic,” he said, “from 1998 to 2000 in Phoenix, Arizona. I worked on generators and industrial rental equipment. I knew it wasn’t something I wanted to do long-term, so I ended up going back to college.”<\/p>\n<p>Riddle left Phoenix and went home to Washington where he enrolled in Gonzaga University. Although he graduated with a degree in mechanical engineering, he was actually a double major. “I majored in mechanical engineering with a physics minor, and I also majored in philosophy.<\/p>\n<p>Fate, once again, had other plans for this Spokane native.<\/p>\n<p>“I had a buddy in the real estate field,” Riddle explained. “He’d gone into the navy for four years after high school and then got out of the Navy and moved back home and started selling real estate.” It was over lunch that Riddle’s buddy suggested to him that he might enjoy a career in real estate.<\/p>\n<p>“I had one year of school left, so I started selling real estate between my junior and senior year of college,” he said. He’s never looked back.<\/p>\n<h2>A Decade Into Real Estate<\/h2>\n<p>We asked Riddle what challenges he faces at this point, almost 10 years into his career. “I don’t think it’s a challenge,” he replied, “I’m doing some soul-searching as far as remaining committed to the industry,” he continued.<\/p>\n<p>It’s a question most agents come to at some point in their careers. Do you want to be an independent agent who sells maybe a dozen homes a year, or do you head for the big leagues, selling hundreds? To what level do you have the energy and desire to take your business?<\/p>\n<p>Riddle is leaning toward owning his own brokerage someday, with 25 to 30 agents under him.<\/p>\n<h2>Riddle’s Synergy<\/h2>\n<p>Right now, Riddle works with <a href=\"http:\/\/synergyrealtyspokane.com\/\">Synergy Properties<\/a>, running a team of 10 agents and three administrative folks. “One person does file transaction coordination and another gal does all the marketing for our listings,” he said. His third administrative employee is what he calls his “universal soldier.” “She is in charge of helping the agents with anything they need,” he said.<\/p>\n<p>Managing a team and staff doesn’t leave much time for Riddle to hit the streets selling real estate. “I do a lot of the managing and overseeing and business planning,” he explained. But he also keeps his seven buyer’s agents and three listing agents busy with the massive amount of leads he generates.<\/p>\n<p>“We do a lot of Web advertisement,” he explained. “That’s probably 80 percent of my marketing. I do some supplemental magazine advertisements in two local magazines here in Spokane, and I’m just venturing into the radio field. All of the advertising I do really directs people back to my online presence,” he concluded.<\/p>\n<p>The Web advertising he speaks of is mainly pay-per-click, a form of lead generation he swears by. “I think it’s one of the most effective forms of advertising,” he explained. “The reason I say that is with pay-per-click advertising you can target your consumer. I think that’s one thing that the Internet has provided us that a lot of other marketing forms don’t,” he continued. “If I buy a billboard on the side of the road, it’s just kind of a broad message to random people,” Riddle said.<\/p>\n<p>Riddle currently spends about $2,500 per month on pay-per-click ads and he figures they generate about 200 leads a month. “So, $2,500 computes to about 200 people that give me their email address, their name, possibly a contact phone number and express what they are interested in,” he said. “Out of those 200 or so people that log into my website and provide that information, I would say that about 3 percent of them end up buying a house through me and my company.”<\/p>\n<h2>A Most Valuable Tool<\/h2>\n<p>Riddle is the first to admit he’d be lost without Market Leader. “For me, it is the one &#8211; if not the only &#8211; platform that I’ve had for the longest amount of time,” he explained. “I fully integrated it into the rest of my business. It really removes a bunch of the obstacles that I faced early on with Internet lead generation with an all-in-one platform,” he said.<\/p>\n<p>Riddle also credits Market Leader products with helping him keep a presence on Craigslist and with marketing his listings on his website.<\/p>\n<p>Mostly, he values the organizational aspect of his Market Leader tools. “They have a systemized way of creating campaigns so that when leads come in I can set them up on different campaigns, short-term or long-term, with messages that I can customize,” Riddle said.<\/p>\n<p>“For each lead that comes in, there is a system where I can put in notes, I can put in reminders to follow up with them at a later date, and I can share that information with maybe a lender or other partner,” he said. “Market Leader allows me to have a platform where I can control all that. So, when these hundreds of leads come in, I have the ability to really stay organized and stay on top of my communication. It’s just a really great all-in-one system in my opinion.”<\/p>\n<h2>The Non-Real Estate Riddle<\/h2>\n<p>When he’s not running a real estate team, Riddle and his wife enjoy the outdoors. “I am kind of an extreme sports fanatic,” he claims. “I love to play as hard as I work. I like to go snowboarding and I like to go skiing; I like to surf. Anytime I can get on a board of any type, whether it’s a skateboard, a snowboard or a surfboard, I am all in. I am a board kind of guy,” he said, laughing.<\/p>\n<p>Riddle didn’t hesitate with an answer when asked about what he enjoys most in his real estate career. “The autonomy,” he said, “along with the freedom and the flexibility that the industry allows. Just the thought of going back to work for someone else is horrifying to me.”<\/p>\n<p>We think that’s a sentiment most agents can agree with.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Keith Riddle grew up on a working farm in eastern Washington, and for most of his life he assumed he’d be a farmer when he grew up. Then, life happened. “I was a diesel mechanic,” he said, “from 1998 to 2000 in Phoenix, Arizona. I worked on generators and industrial rental equipment. I knew it [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[78,83],"tags":[190,106,275,56],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/22731"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=22731"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/22731\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=22731"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=22731"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=22731"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}