{"id":22911,"date":"2013-12-23T08:00:10","date_gmt":"2013-12-23T08:00:10","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=22911"},"modified":"2016-01-30T01:33:07","modified_gmt":"2016-01-30T01:33:07","slug":"agent-spotlight-johnny-loewy-of-tampa-bay-fla","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/agent-spotlight-johnny-loewy-of-tampa-bay-fla\/","title":{"rendered":"Agent Spotlight: Johnny Loewy of Tampa Bay, Fla."},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-full wp-image-22931\" title=\"Agent Spotlight - Johnny Loewy\" src=\"\/wp-content\/uploads\/2013\/12\/Johnny-Loewy.jpg\" alt=\"Johnny Loewy is a real estate agent and coach in Tampa Bay, Florida\" width=\"174\" height=\"200\" \/>From child sales prodigy to one of five national trainers for Exit Realty Corp. International, Johnny Loewy’s life has been one great big listing presentation.<\/p>\n<p>A Long Island native, Loewy did what many New Yorkers do: “We grow up in New York and we immigrate to Florida – there’s a memo about it somewhere,” he said, laughing.<\/p>\n<h2>Selling to Long Islanders<\/h2>\n<p>But it’s in Long Island where Loewy’s tale begins.<\/p>\n<p>“I can actually tell you that I created the pet rock before the Pet Rock went national,” he claimed. “At age four I started to take rocks and paint them and glue eyeballs on them and little pieces of yarn, and I would sell them door to door as paperweights,” Loewy said. Depending on size, the young Loewy made 50 cents to $1 on his inventions.<\/p>\n<p>In the first grade, he decided to open a farm stand. After all, the local commercial farm stand did great business and Loewy’s dad had a vegetable garden.<\/p>\n<p>“So, I started to pick all his vegetables and I set up a little stand on the corner and was selling them,” he recalled. “Sales were going great, too, until my dad pulled up and said, ‘Hey kid what are you doing?’ and I had to report that I was hijacking his vegetables from his garden to sell on the corner for a profit.”<\/p>\n<p>From elementary through high school, Loewy plied his trade, selling candy to fellow students. “I would carry a duffel bag and I would sell anything from Blow Pops to Jolly Rancher sticks, the Astro Pops, Snickers bars – anything between a quarter and 50 cents was my cup of tea,” he explained.<\/p>\n<p>Since his school had an on-campus store, and it also sold candy, invariably Loewy was asked to close up his candy business and work in the school store instead.<\/p>\n<h2>All it Takes is a Pair of Glasses<\/h2>\n<p>While still in high school, Loewy took a job with a chimney cleaning service. “I’m a little guy and I could fit in the fire boxes and the fireplace and crawl around,” he explained. One day he did some work for a gentleman who just happened to be a real estate agent. He remarked on Loewy’s amazing ability to upsell his company’s products and suggested that Loewy might want to look into a career in real estate.<\/p>\n<p>Loewy felt that, at 18 years of age, he wasn’t ready for the big leagues, so he decided to open his own chimney cleaning business instead. “After owning it for a while I realized I didn’t make my money cleaning the chimneys; I made my money getting the business. Cleaning the chimneys was the reward; the work was finding the chimney to clean,” he said. This led him to consider what else he might be able to sell that would bring him more money. Eventually, he sold the chimney cleaning business and got into real estate.<\/p>\n<h2>20 Years Later<\/h2>\n<p>Loewy celebrates 20 years in the industry this year, so we asked him what kind of challenges he faces at this point in his career.<\/p>\n<p>“The toughest thing for me as a coach is that I have to face the fact that sometimes I want it more for the student than the student wants it for himself,” he explained. “I can show these guys how they can be great, but at the end of the day, if they don’t want it and they don’t want it bad enough, there ain’t nothing I’m going to be able to show them to get them to make the jump and want to work,” Loewy concluded.<\/p>\n<p>Right now, he runs a real estate team, trains, coaches and recruits. “Exit is a company that rewards each agent that finds other great agents who will complement our company,” he explained. “We introduce them to our firm, and we become almost like a partner in our organization. So, I’m kind of like a talent scout. I find members who I think may be a good fit for Exit and a good fit for me.”<\/p>\n<h2>Loewy the Headhunter<\/h2>\n<p>Once onboard, Loewy creates a Market Leader website for each of them, throws them some leads, and teaches how to convert them.<\/p>\n<p>“I know the importance of lead generation and the importance of Internet leads,” he explained. “It’s something that gets an agent up and running quickly and puts a deal in their pockets in days rather than months.”<\/p>\n<p>Although he doesn’t actively list and sell real estate any longer, Loewy maintains his license. His real love, though, is headhunting.<\/p>\n<p>“Recruiting is one of my favorite things to do,” he said. “It’s all about hunting. As an agent, you’re hunting for business. As a broker-manager, you’re hunting for agents,” he continued. “I don’t know if you could put me in any one box, but I would say that I definitely like the thrill of the hunt, whether it’s hunting for business, or hunting for prospects, or hunting for that next recruit to put into my brokerage to turn into the next superstar,” he concluded.<\/p>\n<h2>Finding the Right Tools<\/h2>\n<p>“I actually fought Market Leader,” Loewy said when we asked how he was introduced to Market Leader products. “I was probably their toughest sale. I gave those guys such a hard time in the beginning. I told them, ‘If you get me to sign up with you, you’ve earned this sale.’ And boy did they ever! But you know what? The truth be told, I should’ve done it a year sooner,” he said, laughing.<\/p>\n<p>Loewy explained that he bounced around from company to company until he found the ideal fit with Market Leader’s products. “It took me awhile,” he began. “In fact, I tried a lot of companies before I actually went to Market Leader, and when I got with them I still drove them crazy. But man, they are first-class all the way,” he continued. “They handled me with kid gloves, they took me through the entire process, and they made me feel like I was their only client. They’ve just been great to me; I can’t say enough nice things about the folks at Market Leader.”<\/p>\n<p>Loewy swears by the leads he gets from Market Leader, as well. “They created more lead traffic for me than any other lead source,” he explained. “I’ve heard people say, ‘Well, you may get a lot of leads, but are they good leads?’ Listen, if you’re a good Realtor®, they’re good leads. If you can’t convert, you need to be trained on how to convert. But if you’ve got someone that says, ‘Here’s my email address and I’m looking at this,’ that’s all I need, baby. It’s hunting season,” he said, laughing.<\/p>\n<p>We asked Loewy how he would recommend Market Leader to other real estate agents and brokers. “Take it now or take it later, but eventually you’re going to want them because nobody else compares,” he answered.<\/p>\n<h2>The Best Part of His Job<\/h2>\n<p>Loewy most enjoys helping agents move their careers down a more productive path. “There’s just nothing like it. It’s a feeling I can’t even describe,” he said.<\/p>\n<p>“My favorite thing is to see them on that stage at our convention, and they’re holding up an award in their hands,” he said, quietly.<\/p>\n<p>“They’re fighting not to cry on that stage and man, I have to tell you, I fight not to cry sitting in that front row. It’s pretty intense … you might think I’m a sap, but that stuff makes me cry.”<\/p>\n<h2>Life Beyond Real Estate<\/h2>\n<p>At this point in his career, the man once listed as one of the Top 50 Realtors® in the country by the Wall Street Journal ensures he makes time for his life outside of real estate. He and his wife enjoy ballroom dancing twice a week and Loewy does martial arts. They’re also planning an off-the-grid camping trip in the near future.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>From child sales prodigy to one of five national trainers for Exit Realty Corp. International, Johnny Loewy’s life has been one great big listing presentation. A Long Island native, Loewy did what many New Yorkers do: “We grow up in New York and we immigrate to Florida – there’s a memo about it somewhere,” he [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[78,83],"tags":[190,106,275,107,109,56],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/22911"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=22911"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/22911\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=22911"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=22911"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=22911"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}