{"id":22981,"date":"2013-12-26T08:00:48","date_gmt":"2013-12-26T08:00:48","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=22981"},"modified":"2021-12-02T13:27:25","modified_gmt":"2021-12-02T21:27:25","slug":"workplace-tips-creating-a-productive-workplace","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/workplace-tips-creating-a-productive-workplace\/","title":{"rendered":"Workplace Tips &#8211; Creating a Productive Workplace"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-23011\" title=\"Creating a Productive Workplace\" src=\"\/wp-content\/uploads\/2013\/12\/Fotolia_47169188_XS-300x258.jpg\" alt=\"Real estate professionals can become more productive by changing their work environment, updating their business tools and delegating tasks\" width=\"300\" height=\"258\" \/>Most agents have the occasional day when everything runs smoothly and each task is completed on time. If those days spent “in the groove” are few and far between, consider changing or updating your workspace, your processes, your tools and your systems.<\/p>\n<p>Productivity is the name of the game that leads to more closed sales and a higher income. “The potential for associations, brokers and agents to better understand which tools … lead to improved productivity has the potential to help them change their own practices and increase revenue,” according to Scout Research.<\/p>\n<h2>Work Environment<\/h2>\n<p>Whether you work from home or have a company-provided office or cubicle, your environment plays a big role in how productive you are. Of course, with a home office you have a lot more freedom to set it up just how you want, but a little creativity in a broker-supplied office can go a long way.<\/p>\n<p>Think about what inspires you and, more importantly, what distracts you. It’s great to have a window from which to gaze while you work, but if what is going on outside is more interesting than your current project, you won’t get much done.<\/p>\n<p>Furniture should be functional yet comfy, especially your chair, for those days when you’re stuck in the office instead of showing property.<\/p>\n<p>Create an organizational system for paperwork, files and office supplies. Use wall space to keep important items front and center, such as your monthly plan, information about deals in progress, to-do lists and schedules.<\/p>\n<h2>Forget About Multitasking<\/h2>\n<p>Our brains can only handle so much at any given time, according to Guy Winch, author of “Emotional First Aid: Practical Strategies for Treating Failure, Rejection, Guilt and Other Everyday Psychological Injuries.”<\/p>\n<p>Spreading your attention among several tasks shortchanges all of them, he says, never allowing you to get in the groove for any one task. While he believes that multitasking wastes time, he feels that doing tasks in batches – all emails at once, returning phone calls in one session and the like – saves time.<\/p>\n<h2>Delegating Work<\/h2>\n<p>“Top production cannot be achieved without learning to organize and share the work,” claims the Keller Williams Realty Agent Productivity Workshop.<\/p>\n<p>If you aren’t keen on taking on a partner to share the work with, consider hiring an assistant. To determine if you’re ready to take on an assistant, the National Association of Realtors® has a <a href=\"https:\/\/www.nar.realtor\/rmoquiz2.nsf\/assistantquiz?openform\">quiz<\/a> to help you decide.<\/p>\n<p>An assistant can manage the tasks that don’t require your attention yet still need to be done, freeing you for more important tasks. If you’re worried about breaking the budget, hire a part-time virtual assistant.<\/p>\n<p>Whether virtual or on-site, delegating administrative tasks gets all that “stuff” off your desk and helps your workspace help you become more productive.<\/p>\n<h2>Lean on Technology<\/h2>\n<p>Few things can help streamline your day better than technology. Tools such as apps, a CRM and tablets, help systemize your business, which is vital to your productivity.<\/p>\n<p>Look for systems that automate the more time-consuming tasks you perform every week, such as email follow-ups.<\/p>\n<p>Next, think about lead management. Is your CRM doing all that it can and should be doing? If not, it may be time to upgrade to a more robust system<\/p>\n<p>Don’t forget to amp up your productivity in the field. The National Association of Realtors® says that agents’ top three mobile tools include the iPad, a smartphone and a digital camera. Start there and load up on more as your business becomes more productive. If you need apps, the NAR has a list of useful <a href=\"https:\/\/www.nar.realtor\/stay-connected\/apps\">mobile apps<\/a> on its website.<\/p>\n<h2>Get Out of Town<\/h2>\n<p>“Paradoxically, the best way to get more done may be to spend more time doing less,” claims Tony Schwartz at the New York Times. He goes on to cite research that shows how “<a href=\"https:\/\/www.nytimes.com\/2013\/02\/10\/opinion\/sunday\/relax-youll-be-more-productive.html?_r=0\">strategic renewal<\/a>,” such as a break from work to hit the gym, an afternoon nap, and more and longer vacations boost productivity.<\/p>\n<p>Who knew that all the things we think will slow us down actually propel us to greater productivity?<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Most agents have the occasional day when everything runs smoothly and each task is completed on time. If those days spent “in the groove” are few and far between, consider changing or updating your workspace, your processes, your tools and your systems. Productivity is the name of the game that leads to more closed sales [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[97],"tags":[106,156,159,375,376],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/22981"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=22981"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/22981\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=22981"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=22981"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=22981"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}