{"id":23191,"date":"2014-01-02T17:44:34","date_gmt":"2014-01-02T17:44:34","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=23191"},"modified":"2021-11-24T11:49:52","modified_gmt":"2021-11-24T19:49:52","slug":"how-to-manage-remorseful-clients","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/how-to-manage-remorseful-clients\/","title":{"rendered":"How to Manage Remorseful Clients"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-23211\" title=\"How to Manage Remorseful Clients\" src=\"\/wp-content\/uploads\/2014\/01\/Fotolia_51212901_XS-300x199.jpg\" alt=\"A real estate transaction is an emotional process for both buyers and sellers, and sometimes agents have to help their clients deal with remorse\" width=\"300\" height=\"199\" \/>Just like brides and grooms can freak out and leave one another standing at the altar, those involved in a real estate transaction can also be guilty of jilting or &#8211; heaven forbid &#8211; at risk of being jilted. It&#8217;s called “cold feet” when you leave your fiancée at the altar; in sales, the phenomenon is known as “buyer&#8217;s remorse.”<\/p>\n<p>It is symptomized by that sick feeling the buyer of a big-ticket item might get, accompanied by a voice inside that says, “What did I just do?”  Sellers can experience this reaction as well, and for a variety of reasons.<\/p>\n<h2>Seller’s Remorse<\/h2>\n<p>The doubt, apprehension, and stress brought on by seller’s remorse can make a seller panic and lead to a feeling of being overwhelmed. The causes of seller&#8217;s remorse vary. Sometimes the seller has simply failed to consider whether or not she really <em>needs <\/em>to sell.<\/p>\n<p>A tough buyer&#8217;s market can also lead to a case of cold feet for homeowners. After the hot and heavy multiple-offer scenarios of a few months back, it can be discouraging for a homeowner to think of letting his investment go for a deflated price. The flip side is true as well; in a seller’s market homeowners may get the feeling that they let the home go for a price that is too low.<\/p>\n<p>Then, there is the person who finds that she is too emotionally attached to the home and feels she just can&#8217;t part with it after all. Memories, roots and ties to the neighborhood all play into these feelings.<\/p>\n<p>A seller’s regret may also be connected to the basic psychological resistance to any loss. Especially if the home is being sold due to a death or divorce, the emotions can be quite intense.<\/p>\n<p>The anxiety and regret during the period of a home sale is not irrational. After all, the sale of a home is one of the biggest financial &#8211; and most emotional &#8211; transactions most of us will likely ever make.<\/p>\n<p>So, how to nip this remorse in the bud?<\/p>\n<p>Communicate with and listen to your client before putting the home on the market. Get clear on her motivations for selling so that if regret rears its ugly head you can remind her of those reasons.<\/p>\n<p>If the home goes quickly under contract, remind the seller that the two of you worked hard to establish a good, market-driven sales price, and pricing it higher may have resulted in the home eventually languishing on the market.<\/p>\n<p>Assist your client with focusing on the home she’ll be moving into after this one sells. Help her “virtually” decorate it &#8211; where will she put the sofa, what does she plan on doing with the yard? Help her build excitement about the future so that the present becomes something she merely wants out of the way.<\/p>\n<h2>Buyer’s Remorse<\/h2>\n<p>If you’ve ever beat yourself up after making a major purchase, you are intimately familiar with the emotions involved in buyer’s remorse. Because of the financial outlay, this type of regret is far more widespread than seller’s remorse &#8211; at least in the real estate industry.<\/p>\n<p>Buyer’s remorse may be even more prevalent in a buyer’s market when there are too many choices that fall within the buyer’s criteria. Psychologists call this “the paradox of choice.” Postulated by psychologist Barry Schwartz, the theory claims that an increase in the number of choices available to someone significantly increases that person’s stress level.<\/p>\n<p>In a buyer’s market your client may find a number of homes that fit his wish list criteria. Even after finally settling on one, he may revisit in his mind the attributes of the homes that he rejected, wondering if one of those alternatives might have been a better choice. Schwartz calls the resulting emotions “strong feelings of dissonance and remorse.”<\/p>\n<p>Whatever the cause, there are ways to help prevent buyer’s remorse.<\/p>\n<h2>Preventing Buyer’s Remorse<\/h2>\n<p>Psychologists Daniel Gilbert and Jane E.J. Ebert conducted a 2002 research project for Harvard University and found that people who get a 30-day money-back guarantee on a purchase are less likely to experience buyer’s remorse. Of course, it isn’t possible to offer such a guarantee in a real estate transaction, but if you take the time to walk your buyer through what to expect along the way, you may be able to prevent regret down the road.<\/p>\n<p>Let her know about the various contingencies that give her a somewhat painless way out of the deal. These may make her feel that she has somewhat of a guarantee, at least until the contingencies are removed.<\/p>\n<p>Explain the importance of being reasonable with the seller. A University College of London study showed that people who negotiate reasonably (“less aggressive or greedy”) tended to feel less regret than those that made huge demands and tried to excessively bargain down the price.<\/p>\n<p>Today’s real estate agent is no longer considered, at least among his peers, a salesperson. Working with a buyer or seller whom you feel may not be emotionally ready to pull the trigger on a transaction requires you to put on your “counselor” hat and go overboard with the hand-holding.<\/p>\n<p>If all else fails, remind your client of Søren Kierkegaard’s famous words: “I see it all perfectly; there are two possible situations &#8211; one can either do this or that. My honest opinion and my friendly advice is this: Do it or do not do it &#8211; you will regret both.”<\/p>\n<p>Or, then again, maybe not.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Just like brides and grooms can freak out and leave one another standing at the altar, those involved in a real estate transaction can also be guilty of jilting or &#8211; heaven forbid &#8211; at risk of being jilted. It&#8217;s called “cold feet” when you leave your fiancée at the altar; in sales, the phenomenon [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[83],"tags":[254,256,56,380,209],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/23191"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=23191"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/23191\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=23191"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=23191"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=23191"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}