{"id":23251,"date":"2014-01-06T19:01:43","date_gmt":"2014-01-06T19:01:43","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=23251"},"modified":"2016-01-30T01:31:21","modified_gmt":"2016-01-30T01:31:21","slug":"resolve-to-get-more-referrals-in-2014","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/resolve-to-get-more-referrals-in-2014\/","title":{"rendered":"Resolve to Get More Referrals in 2014"},"content":{"rendered":"<p>What if you never, ever again had to pick up the phone and “dial for dollars”? No sitting behind closed doors, palms sweating, an endless rambling of scripts and dialogs clogging your brain as you stare at the phone. No more call reluctance.<\/p>\n<p>Cold calls <em>can<\/em> be a thing of the past if you resolve to get more referrals in 2014.<\/p>\n<h2>Your Sphere of Influence<\/h2>\n<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-23271\" title=\"Get More Referrals in 2014\" src=\"\/wp-content\/uploads\/2014\/01\/Fotolia_50400365_XS-243x300.jpg\" alt=\"To improve business in 2014, real estate agents can focus on increasing referrals\" width=\"243\" height=\"300\" \/>Referrals are recommendations from people you know &#8211; people that like you and trust you. These people can be anyone from past clients to family members to the lady who cuts your hair. Virtually every person you come into contact with during a typical day can be a source of referrals. This group of people is known as your sphere of influence, or SOI &#8211; something every rookie learns about on day one in real estate.<\/p>\n<p>Who do you know, even remotely, that you can shove into a database and include in your SOI? The bigger that list is, the faster you’ll make money, agents are told in the beginning. For the most part, it’s true.<\/p>\n<p>After all, even though your cousin Joe isn’t thinking about buying or selling, someone he knows just may be. The trick, then, is to stay top-of-mind with everyone you know so that when the topic of buying and selling real estate comes up, your name will too.<\/p>\n<p>The New Year is a great time to beef up your sphere. Getting all these folks into a CRM is critical, and setting up a campaign to reach out to them periodically throughout the year is key. It’s all about nurturing these relationships &#8211; especially those with people you’ve worked with in the past.<\/p>\n<hr style=\"height: 2px;\" \/>\n<h2>Webinar: Turn Relationships Into Real Estate Referrals<\/h2>\n<div class=\"wistia_responsive_padding\" style=\"padding:75.0% 0 0 0;position:relative;\">\n<div class=\"wistia_responsive_wrapper\" style=\"height:100%;left:0;position:absolute;top:0;width:100%;\"><iframe loading=\"lazy\" src=\"\/\/fast.wistia.net\/embed\/iframe\/hb6twazgz6?videoFoam=true\" allowtransparency=\"true\" frameborder=\"0\" scrolling=\"no\" class=\"wistia_embed\" name=\"wistia_embed\" allowfullscreen mozallowfullscreen webkitallowfullscreen oallowfullscreen msallowfullscreen width=\"100%\" height=\"100%\"><\/iframe><\/div>\n<\/div>\n<p><script src=\"\/\/fast.wistia.net\/assets\/external\/E-v1.js\" async><\/script><\/p>\n<hr style=\"height: 2px;\" \/>\n<h2>Your CRM Is a Critical Tool<\/h2>\n<p>If you don’t have a contact management system, vow to get one this year and to use it religiously. To beef up your referral stream, you will need a CRM with fully integrated contact management tools so that you can automate ongoing contact with past clients and others in your sphere. Email and postcard templates that you can customize are handy and help you sound less robotic while you attempt to remain top-of-mind with folks in your SOI.<\/p>\n<h2>Strategies for Getting Referrals<\/h2>\n<h3>Be Social<\/h3>\n<p>New Jersey agent Val Nunnenkamp knows how to remain memorable with former clients. Not only does he stay in touch with them throughout the year, at year’s end he throws an amazing black-tie affair known as the annual Val Nunnenkamp Client Appreciation and Charity Gala.<\/p>\n<p>Of course, you don’t have to spend the gobs of money on your soirees. A summer picnic, movie nights or an evening at the local bowling alley are all less expensive yet fun ways to treat past clients and remain memorable.<\/p>\n<h3>Network Like a Pro<\/h3>\n<p>Linda Lougee of Realty of Maine in Bangor, runs a real estate business based completely on referrals and is a big believer in networking. From her involvement in her local chamber of commerce to her membership in an international women’s organization, she has not only found a way to give back to the community but has also tapped into an endless stream of real estate referrals.<\/p>\n<p>Lougee says that when she heads out the door every day she sticks five business cards in her pocket. “When I come home, they should be gone and I should have five cards from other people,” she remarked.<\/p>\n<p>Get involved in the community or attend local events where you can make new contacts to add to your sphere of influence.<\/p>\n<h3>Campaigns Aren’t Just for Politicians<\/h3>\n<p>A good educational drip campaign is worth the time and effort it takes to set up. Consider sending out a newsletter with valuable content for past buyers and sellers. Information they may look forward to receiving includes landscaping and remodeling tips. People are always interested in what’s going on in the market, so local home value updates and information on interest rates should be included.<\/p>\n<p>When the National Association of Realtors® looked at the business characteristics and activity of Realtors® by gross personal income, they found that agents making in excess of $100,000 got 29 percent of their business through referrals from past clients and 34 percent through repeat business from past clients. The clients you’ve worked with in the past are gold mines for your real estate business, so while it’s not wise to rely on referrals as your sole source of leads, beefing up your referral program may just take your business to the next level in 2014.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>What if you never, ever again had to pick up the phone and “dial for dollars”? No sitting behind closed doors, palms sweating, an endless rambling of scripts and dialogs clogging your brain as you stare at the phone. No more call reluctance. Cold calls can be a thing of the past if you resolve [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[34],"tags":[92,106,101,170,267,126,142,171,117,56,127,262,105],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/23251"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=23251"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/23251\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=23251"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=23251"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=23251"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}