{"id":23861,"date":"2014-01-13T15:53:34","date_gmt":"2014-01-13T15:53:34","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=23861"},"modified":"2021-12-02T09:31:38","modified_gmt":"2021-12-02T17:31:38","slug":"fewer-first-timers-more-repeat-buyers-in-2014","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/fewer-first-timers-more-repeat-buyers-in-2014\/","title":{"rendered":"Fewer First-Timers, More Repeat Buyers in 2014"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-23881\" title=\"Fewer First-Timers, More Repeat Homebuyers in 2014\" src=\"\/wp-content\/uploads\/2014\/01\/Fotolia_43335725_XS-300x240.jpg\" alt=\"Rising home prices and interest rates, combined with new lending restrictions, could make 2014 a tough year for first-time homebuyers\" width=\"300\" height=\"240\" \/>Low housing inventories and über-low interest rates combined to make the housing sector the economy’s comeback kid in 2013. Like a precarious stack of Jenga cubes, however, pull one leg out from under that delicate balance and the whole thing comes crashing down – or at least changes dramatically. If you’re an agent who prefers working with first-time buyers, be prepared to either diversify your client base or have a very slow 2014. Or so the news coming from housing industry experts indicates.<\/p>\n<h2>Interest Rates<\/h2>\n<p>The favorite mortgage of most first-time buyers – the 30-year fixed – may be unaffordable for many in 2014. Rates are expected to hit and hover at 5.5 percent, according to NAR chief economist Lawrence Yun. He chalks up the <a href=\"https:\/\/www.usatoday.com\/story\/money\/business\/2014\/01\/01\/home-prices-2014-housing-starts\/4181021\/\">interest rate rise<\/a> to the tapering of quantitative easing. Bankrate.com’s senior financial analyst, Greg McBride, agrees, but feels that we won’t see 5.5 percent interest rates until after mid-summer.<\/p>\n<p>Since each percentage point rise in the interest rate adds about 10 percent to a mortgage loan, higher housing payments may just kick some first-time buyers to the sidelines. It’s definitely time to turn up the heat under any lollygagging buyers to get them into a mortgage and a home before they are priced out of the market.<\/p>\n<h2>Rising Home Prices<\/h2>\n<p>Your commission checks were a little bit bigger last year because home prices rebounded – up 12.5 percent in October, year over year. It’s anybody’s guess how much more prices will continue to increase in 2014.<\/p>\n<p>Economist John Burns tells USA Today that he anticipates a 6 percent <a href=\"https:\/\/www.usatoday.com\/story\/money\/business\/2014\/01\/01\/home-prices-2014-housing-starts\/4181021\/\">hike in housing prices<\/a> this year. Jed Kolko, Trulia’s chief economist, says that although the pace will be slower than last year, “prices will still rise faster than both incomes and rents.” While this is fabulous news for your listing clients, it will further discourage a lot of first-time buyers.<\/p>\n<h2>“Ability to Repay” Rules<\/h2>\n<p>Hot-off-the-presses mortgage lending rules will ensure that lenders scrutinize borrowers’ ability to repay a loan even more than they have in the past. The “ability to repay” rule requires lenders to take into account the following <a href=\"https:\/\/files.consumerfinance.gov\/f\/201301_cfpb_ability-to-repay-summary.pdf\">eight underwriting factors<\/a>:<\/p>\n<ul>\n<li>The applicant’s income and assets.<\/li>\n<\/ul>\n<ul>\n<li>Employment verification.<\/li>\n<\/ul>\n<ul>\n<li>Monthly payments for this and simultaneous loans.<\/li>\n<\/ul>\n<ul>\n<li>Mortgage-related obligation payments.<\/li>\n<\/ul>\n<ul>\n<li>Debt payments, including child support and alimony.<\/li>\n<\/ul>\n<ul>\n<li>Monthly DTI ratio.<\/li>\n<\/ul>\n<ul>\n<li>Credit history.<\/li>\n<\/ul>\n<p>By the way, Yun claims that, at a minimum, 5 percent of mortgages granted last year didn’t meet the new standards.<\/p>\n<p>It is such a common-sense regulation that one wonders why it wasn’t put into place decades ago, but it will present additional hoops for your buyers to jump through.<\/p>\n<h2>Qualified Mortgages<\/h2>\n<p>Lenders will also be aiming to increase the number of loans considered “<a href=\"https:\/\/www.usatoday.com\/story\/money\/business\/2014\/01\/09\/qualified-mortgage-borrowers-consumer-protection\/4361281\/\">qualified mortgages<\/a>.” To reach this goal, they’ll be shooting for the following features:<\/p>\n<ul>\n<li>Clean loans, free of extended terms, interest-only payments and loans that don’t meet the full amount of interest.<\/li>\n<\/ul>\n<ul>\n<li>Loans above $100,000 with less than 3 percent in upfront points and fees.<\/li>\n<\/ul>\n<ul>\n<li>A mortgage that keeps the borrower’s debt below 43 percent of monthly income (unless it’s backed by Fannie, Freddie or the FHA).<\/li>\n<\/ul>\n<p>While not all lenders plan on sticking to qualified mortgages, most will in order to avoid the liability challenges inherent in riskier loans.<\/p>\n<h2>Insult to Injury<\/h2>\n<p>To top off the bad news, the <a href=\"https:\/\/www.usnews.com\/opinion\/blogs\/economic-intelligence\/2014\/01\/07\/falling-fha-loan-limits-are-bad-news-for-first-time-homebuyers?src=usn_tw\">FHA is lowering loan limits<\/a> in 652 counties nationwide. The western half of the country will be hit the hardest with Arizona leading the way, followed by Nevada, California and Utah.<\/p>\n<p>Since many first-time buyers rely on FHA guarantees to achieve the dream of homeownership, look for the new loan limits to lock out some first-time buyers in pricier markets.<\/p>\n<p>The NAR says that first-time buyers made up only <a href=\"https:\/\/eyeonhousing.org\/2013\/12\/existing-sales-down\/\">28 percent of homebuyers<\/a> in November 2013. With the significant challenges first-timers will meet in 2014, coupled with investor attrition as a result of higher prices, it’s a safe bet that 2014 will be the year of the repeat buyer.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Low housing inventories and über-low interest rates combined to make the housing sector the economy’s comeback kid in 2013. Like a precarious stack of Jenga cubes, however, pull one leg out from under that delicate balance and the whole thing comes crashing down – or at least changes dramatically. If you’re an agent who prefers [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[83],"tags":[92,254,220,256,386,387,388,56],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/23861"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=23861"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/23861\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=23861"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=23861"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=23861"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}