{"id":24141,"date":"2014-01-15T17:40:53","date_gmt":"2014-01-15T17:40:53","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=24141"},"modified":"2021-11-19T10:21:26","modified_gmt":"2021-11-19T18:21:26","slug":"2014-business-resolutions-clean-up-your-crm","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/2014-business-resolutions-clean-up-your-crm\/","title":{"rendered":"2014 Business Resolutions: Clean Up Your CRM"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-24161\" title=\"2014 Business Resolutions: Clean Up Your CRM\" src=\"\/wp-content\/uploads\/2014\/01\/Fotolia_54266820_XS-300x300.jpg\" alt=\"If you want to improve your real estate business in 2014, cleaning up your CRM should be one of your top resolutions\" width=\"300\" height=\"300\" \/>Rollercoasters are supposed to be fun, yet the housing industry ride has left many agents feeling queasy. From having to pound the streets to find homes for buyers to the sudden switch to a seller’s market in many regions, 2013 was a busy year.<\/p>\n<p>While being busy is great for the pocketbook it can wreak mayhem on a real estate practice, especially for independent agents – those who aren’t a member of a team and lack administrative support.<\/p>\n<p>As you look back on 2013 and consider parts of your business that slipped through the cracks, your CRM will no doubt be on the list. Something had to give, right? So it’s only natural that lead management may have become less of a priority as you attempted to keep up with what was right in front of you.<\/p>\n<p>If you are looking for a solid business resolution for 2014, notice your CRM in the back of the room, hand held high, waving wildly and all but screaming out, “Pick me! Pick me!”<\/p>\n<h2>Baby Steps<\/h2>\n<p>Intimidation is a word that must have been invented to describe the scraps of paper, backs of business cards, and emails containing the names of potential clients that stacked up last year. Getting those names into your database and the leads into a drip cycle should be the first step if you want your pipeline to be full during the coming year.<\/p>\n<h2>Finish the Job<\/h2>\n<p>Even the best CRM is useless if it’s populated with bad information. While fixing the problem is time-consuming, its importance can’t be overstated. Here are a few steps to consider:<\/p>\n<ul>\n<li>Start by getting rid of any duplicate entries. There’s nothing more embarrassing than sending duplicate information to the same lead.<\/li>\n<\/ul>\n<ul>\n<li>Get rid of entries that don’t have contact information. Without this vital information, the lead is useless.<\/li>\n<\/ul>\n<ul>\n<li>Update the contact information for those people in your database that you know personally. Have they moved? Was there a death or divorce in the family? Automated emails to couples when they are no longer couples can make you seem out-of-touch and insensitive.<\/li>\n<\/ul>\n<ul>\n<li>Get rid of lost causes. This is the most difficult part of the process because you’ll have to study each one to determine which stage they’re in and how likely it is they’ll pull the trigger. Any that seem like a waste of time should be deleted.<\/li>\n<\/ul>\n<ul>\n<li>Determine campaigns for the remaining leads in your CRM and get them set up.<\/li>\n<\/ul>\n<ul>\n<li>Update your CRM’s automated marketing templates. If you’ve spiffed up your signature, ensure that the new one is in the template and looks good. Consider adding a social sharing button to your emails this year. These buttons can <a href=\"https:\/\/www.business2community.com\/marketing\/20-fascinating-statistics-marketing-2014-infographic-0711604#!q9XRu\">increase click-through rates<\/a> by 158 percent.<\/li>\n<\/ul>\n<h2>Ongoing Maintenance<\/h2>\n<p>Vow to make 2014 the year you get into the habit of routinely ridding your CRM of inconsistent, inaccurate and incomplete information. If no garbage goes in, next year’s cleanup will be a snap.<\/p>\n<p>Remember that your CRM isn’t a “set it and forget it” part of your business. It requires input all year, including adding new leads and a plan to nurture those leads.<\/p>\n<p>If your CRM isn’t giving you everything you need, maybe this is the year to upgrade. While some of the free software does an adequate job of keeping track of contacts, they do nothing to automate your touch campaign if you have one &#8211; and you should.<\/p>\n<p>Look for a product that offers, at a minimum, an email drip system, preset marketing campaigns and flyer creation. The ability to import or export your database is important as well. Decide to take your business to the next level in the new year by spending the money required to upgrade your lead gen system.<\/p>\n<p>Finally, if the coming year looks to be a busy one, congratulations! Perhaps it’s time to consider hiring someone to take care of the ongoing maintenance of your CRM.<\/p>\n<p>By the way, there are no rules for database cleanup, so take it slow if the project seems overwhelming. Happy 2014!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Rollercoasters are supposed to be fun, yet the housing industry ride has left many agents feeling queasy. From having to pound the streets to find homes for buyers to the sudden switch to a seller’s market in many regions, 2013 was a busy year. While being busy is great for the pocketbook it can wreak [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[34],"tags":[106,124,389,267,181,126,142,390],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/24141"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=24141"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/24141\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=24141"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=24141"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=24141"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}