{"id":24201,"date":"2014-01-20T16:58:38","date_gmt":"2014-01-20T16:58:38","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=24201"},"modified":"2016-02-04T16:48:35","modified_gmt":"2016-02-05T00:48:35","slug":"agent-spotlight-alan-donald-of-mount-pleasant-s-c","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/agent-spotlight-alan-donald-of-mount-pleasant-s-c\/","title":{"rendered":"Agent Spotlight: Alan Donald of Mount Pleasant, S.C."},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-24221\" title=\"Agent Spotlight - Alan Donald\" src=\"\/wp-content\/uploads\/2014\/01\/alan-donald-2-240x300.jpg\" alt=\"Alan Donald is a real estate agent with Keller Williams in Mount Pleasant, South Carolina\" width=\"240\" height=\"300\" \/>A self-described “product of international migration,” <a href=\"http:\/\/www.findhomesincharleston.com\">Alan Donald<\/a> inherited the itch to travel. The Keller Williams agent has visited, by last count, 41 countries and has lived in several of them.<\/p>\n<p>“My grandfather was from Scotland and migrated to Colombia in the 1920s, and married my grandmother who was Colombian,” he explains. “My other grandfather was from Germany, also migrated to Colombia in the 1920s, and also married a Colombian. I guess I have the spirit of a gypsy,” he said, laughing.<\/p>\n<p>Although Donald was born in Colombia, he has lived in Sidney, Vancouver and the U.S., where he’s been for 10 years now.<\/p>\n<p>Donald’s first trip to the U.S. occurred when he received a Fulbright scholarship to attend the University of California, Berkeley. He graduated with a master&#8217;s degree in business administration. “It was great,” he says, “it changed my life.”<\/p>\n<p>After graduating from college, Donald worked for Safeway Stores and Kaiser Permanente in strategic planning for a time. It was when he and his wife moved to Australia that he got bit by the real estate bug, while working with commercial investors. The “infection” simmered inside, however, because the next move he made was back home to Colombia.<\/p>\n<p>“I was a trade commissioner for the government of Colombia for about five years. Then we went to Vancouver, and I was the director for an international management diploma program for a university there.”<\/p>\n<p>Finally, the couple moved to South Carolina where, for the first time in his adult life, he had trouble finding a job that fit his talents. The solution? “I decided to go into my own business,” he recalls.<\/p>\n<p>One year into his new real estate business, the market tanked. Ever the entrepreneur, he refused to quit. “I decided to focus on a niche market, which was Hispanics,” Donald recalls. “That allowed me to survive the next five years.”<\/p>\n<p>Today, he is finally dusting off his original business plan, which is to develop a market in the Mount Pleasant area. “There’s a higher price point there than in the Charleston area,” Donald explains. “My average price point for the first five years was about $175,000, and I think last year our average was about $250,000, so it’s getting better.”<\/p>\n<p>At the nine-year mark in his real estate career, Donald’s biggest challenge is growth. “I’ve grown my sales the past three years from 3.5 to 5.8 to 7.5 million, and my next objective is 11 million, so it’s a growth challenge,” he explains. To meet that challenge he’s hired a colleague to help him with the multifaceted parts of the business.<\/p>\n<h2>Marketing Plans<\/h2>\n<p>Despite claiming that he hasn’t been diligent in past-client retention, 80 percent of Donald’s business comes from his sphere and referrals from past clients. The rest are Internet leads.<\/p>\n<p>“We’ve had a big focus on online lead generation in the last couple of years,” he said. “Online you have to be everywhere; there isn’t one source of leads. The fact is, you don’t know where they’re going to find you,” he continued. “So we do everything. We have four websites, five blogs; we have videos, four Facebook pages and two Pinterest pages. You name it &#8211; whatever generates leads online, we do it.”<\/p>\n<p>He also plans on kicking his client retention program into high gear in 2014. “We have our plan all mapped out and budgeted for,” said Donald. “This year we’ll be doing what they call a ‘33 touch program,’ meaning we’ll try to touch everyone in our database 33 times a year. That includes everything from email newsletters to postcards, client events, phone conversations and in-person meetings,” he concluded.<\/p>\n<p>Donald claims that if it weren’t for Market Leader’s tools doing the heavy lifting, he couldn’t handle such an intense marketing campaign. “One of the things that I like about Market Leader is the ability to set people on alerts &#8211; pretty much on automatic &#8211; so that people can set it up themselves and get listings in their email every day,” Donald explains. “It’s branded; it comes from me. I’m in front of them every day without me having to do much. When they’re ready, they put up their hand.<\/p>\n<p>Market Leader’s tools, he explains, give him the ability to configure even the most detailed marketing campaigns. He utilizes the templates the most, and he appreciates that he can customize them.<\/p>\n<h2>The Best Part of Real Estate<\/h2>\n<p>So, what does a die-hard entrepreneur with an MBA enjoy most about his career in real estate?<\/p>\n<p>“What I enjoy about real estate is that there’s no limit to what you can do or not do, except by law,” he said, laughing. “In terms of business, you can be creative and set up your business the way you want and manage it the way you want,” Donald continues.<\/p>\n<p>“No one’s telling you how to do it. I’m very entrepreneurial in spirit as you can see. I enjoy being creative, creating things and setting up businesses. That’s the part that I like a lot.”<\/p>\n<h2>Downtime<\/h2>\n<p>Donald is an avid tennis player, so when he’s not working, he hits the courts. He also gives back to the community by mentoring area students. “I belong to the Citadel School of Business mentorship program,” he begins. “I do some mentorship also for some students at the College of Charleston.”<\/p>\n","protected":false},"excerpt":{"rendered":"<p>A self-described “product of international migration,” Alan Donald inherited the itch to travel. The Keller Williams agent has visited, by last count, 41 countries and has lived in several of them. “My grandfather was from Scotland and migrated to Colombia in the 1920s, and married my grandmother who was Colombian,” he explains. “My other grandfather [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[78,83],"tags":[190,106,275,87,56],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/24201"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=24201"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/24201\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=24201"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=24201"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=24201"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}