{"id":24301,"date":"2014-01-23T18:47:45","date_gmt":"2014-01-23T18:47:45","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=24301"},"modified":"2021-11-22T11:07:31","modified_gmt":"2021-11-22T19:07:31","slug":"2014-resolutions-is-farming-in-your-marketing-plan","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/2014-resolutions-is-farming-in-your-marketing-plan\/","title":{"rendered":"2014 Resolutions: Is Farming in Your Marketing Plan?"},"content":{"rendered":"<p>Here we are in the new year, and if you’re anything like a lot of agents, you’re still not finished with your 2014 business plan. Because business plans are not one of Shakespeare’s “ever fixed marks,” and it’s perfectly acceptable to tweak them throughout the year, it’s OK if you’re among the tardy.<\/p>\n<p>In fact, we have some ideas that may help you nail down the final touches of the marketing section of your business plan.<\/p>\n<h2>Marketing Plan Overview<\/h2>\n<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-24321\" title=\"Create a Marketing Plan for Your Business in 2014\" src=\"\/wp-content\/uploads\/2014\/01\/Fotolia_58941519_XS-300x300.jpg\" alt=\"Creating a marketing plan and sticking to it will help you reach your business goals in 2014\" width=\"300\" height=\"300\" \/>A formal, written real estate marketing plan with all the essential details covered is a must for your business. Second in importance is that the plan has to be somewhat easy to “carry out” if you want to have any hopes of sticking with it.<\/p>\n<p>Determine your 2014 marketing goals. These may include:<\/p>\n<ul>\n<li>Increasing your brand awareness in your niche.<\/li>\n<li>Getting your content in front of a more targeted audience.<\/li>\n<li>Exploring search engine marketing.<\/li>\n<\/ul>\n<p>Make your objectives and goals realistic and determine how you’ll measure the success of what you put into place.<\/p>\n<p>The easiest way to measure success is by setting targets or timelines. For example: “I will increase brand awareness in the condo market by 5 percent by the end of the year.” Then, make a vow to check your progress at several points throughout the year.<\/p>\n<h2>The Budget<\/h2>\n<p>The next step in building your marketing plan is figuring out how much money you can spend on this part of your business. While you may not be a top producer, keep in mind that those agents who are at the top got there by effectively marketing themselves.<\/p>\n<p>In fact, agents who make over $100,000 a year spend <a href=\"https:\/\/activerain.com\/blogsview\/2594884\/rich-real-estate-agent\">10 times more money on marketing<\/a> than those earning under $35,000 a year, according to an ActiveRain study.<\/p>\n<p>One rule of thumb, promoted by agent and author Jerry Rossi, is to plan on spending at least <a href=\"https:\/\/magazine.realtor\/sales-and-marketing\/feature\/article\/2007\/05\/3-marketing-budgets-3-great-plans\">10 percent of your commission income<\/a> on marketing.<\/p>\n<h2>The Geographic Farm<\/h2>\n<p>There are so many ways to market a real estate business that it’s challenging to decide which ones to include in your plan. Geographic farming, although an old idea, is still something many agents rely on, and it works if done right. Branding yourself and developing relationships within your target area takes time, but it isn’t quite as expensive as other marketing methods. Farming is something to consider when thinking about an additional form of marketing.<\/p>\n<p>Marketing to your chosen area can be done both offline and on by adding farm-specific content to your website and using direct mail.<\/p>\n<p>The messages you send to your farm area will be different than those you send to Web leads or your sphere. Because you’re trying to set yourself apart from other agents as the area expert, you’ll want to ensure that the information you send is useful and valuable, but also locally focused. Local homeowners will be interested in:<\/p>\n<ul>\n<li>Updates on recent sales and home values.<\/li>\n<li>New business or development announcements.<\/li>\n<li>Special events in the area.<\/li>\n<li>School information.<\/li>\n<li>Information on public services and businesses in the area.<\/li>\n<\/ul>\n<p>If you plan on beefing up marketing to your farm this year, start by determining a budget for this section of the marketing plan. Will you primarily depend on snail mail or combine it with email? Which mediums will you use: postcards, flyers, door hangers?<\/p>\n<p>Since most marketing gurus recommend a monthly or quarterly mailing to your target area, determine the frequency of contact and then how much money you’ll require to meet it.<\/p>\n<p><strong>Tip<\/strong>: If you find that the cost is much more than you can afford, consider whittling down your farm area. Fewer houses to market to will cost less, and you can always build the area back up as you make more money.<\/p>\n<h2>Choosing Your Farm<\/h2>\n<p>When considering an area to farm it helps to know who lives there and how long they’ve lived there. Knowing the “who” helps you target your content. For example, information targeted to Generation X homeowners is unimportant to baby boomers.<\/p>\n<p>Knowing how long folks in the area have lived in their homes gives you an idea of how ready they may be to sell. The <a href=\"https:\/\/www.nahb.org\/\">National Association of Home Builders<\/a> says that, although the stats don’t tell the whole story, “… about 5 percent of the owner-occupied stock turns over in a given year.” Based on data obtained from the 2011 American Housing Survey, the association claims that, on average, homeowners are expected to remain in their homes for 13 years.<\/p>\n<p>When choosing an area to farm, keep the following in mind.<\/p>\n<p><strong>Average Price<\/strong>  – Knowing the average price of a home in the area is crucial in determining whether or not the area supports your income goals.<\/p>\n<p><strong>Turnover<\/strong> &#8211; You’ll need to do some MLS research to determine how many homes in the area sell each year. This, along with understanding the average sales price, will give you an idea of how much commission income the area generates. Once you are established as the area expert, a large part of that income can be yours.<\/p>\n<p><strong>Practicality<\/strong> &#8211; Choose a farm that is close to the office or your home. These areas work better because chances are good that you already know people in the area, and because you’re more likely to become involved in community goings-on if the area is convenient to home or work.<\/p>\n<p><strong>Competition<\/strong> &#8211; If there is an agent who seems to get most of the listings in the area, you may have an uphill battle on your hands. It’s not easy to compete with someone else who has been working the area. It’s not impossible to cut into their business, but it’s much easier to work virgin territory.<\/p>\n<p>Consistency is key to a successful geographic farming campaign. If you let last year’s plan fall through the cracks, maybe this is the year to simply vow to stick to the plan and market consistently.<\/p>\n<p>Whether you need to beef up a current geographic farm campaign or start a new one, there’s no better time to start than right now.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Here we are in the new year, and if you’re anything like a lot of agents, you’re still not finished with your 2014 business plan. Because business plans are not one of Shakespeare’s “ever fixed marks,” and it’s perfectly acceptable to tweak them throughout the year, it’s OK if you’re among the tardy. In fact, [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[35],"tags":[92,106,396,397,398,87,272,273,390,169],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/24301"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=24301"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/24301\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=24301"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=24301"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=24301"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}