{"id":24371,"date":"2014-01-28T18:26:54","date_gmt":"2014-01-28T18:26:54","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=24371"},"modified":"2021-11-24T11:48:38","modified_gmt":"2021-11-24T19:48:38","slug":"what-was-hot-in-housing-in-2013","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/what-was-hot-in-housing-in-2013\/","title":{"rendered":"What Was Hot in Housing in 2013"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-24391\" title=\"What Was Hot in Housing in 2013\" src=\"\/wp-content\/uploads\/2014\/01\/Fotolia_49482892_XS-290x300.jpg\" alt=\"Real estate agents can make the most of their marketing efforts by knowing what homebuyers actually want in a home\" width=\"290\" height=\"300\" \/>One of the more interesting aspects of NAR’s Profile of Homebuyers and Sellers is what was hot, from a buyer’s perspective, in housing in 2013. Even more telling, at least for agents, is what they <em>didn’t<\/em> want in a home.<\/p>\n<p>The next time you sit down with a homebuyer to determine her wants and needs, or if you’re struggling for a great headline for one of your listings, keep in mind what turns homebuyers on – and off.<\/p>\n<h2>What’s <em>Not<\/em> Part of the Dream<\/h2>\n<p>According to a report from the National Association of Home Builders called “What Homebuyers Really Want,” homebuyers had some definite ideas about what they didn’t want in a new home in 2013. Number one on the list, with 70 percent of respondents replying in the negative, is an elevator. If you happen to list a home with one and consider it a hot selling point, the aforementioned statistic should keep you from promoting it in your marketing.<\/p>\n<p>Some of the other items on the list may surprise you:<\/p>\n<ul>\n<li>66 percent of respondents don’t want to live in a golf course community. This is a bit surprising considering how many listing headlines scream “Golf Course Community!”<\/li>\n<\/ul>\n<ul>\n<li>51 percent want a tub in the bathroom. A shower stall doesn’t cut it.<\/li>\n<\/ul>\n<ul>\n<li>48 percent don’t want to live in a gated community.<\/li>\n<\/ul>\n<ul>\n<li>40 percent of respondents eschew laminate countertops, yet 30 percent don’t want ceramic tile either.<\/li>\n<\/ul>\n<p>While you shouldn’t lie in your listing narrative, you might want to stay away from some of these items in your marketing. If you just listed a home in a golf course community that also happens to be gated and has no tub in the bathroom and laminate countertops in the kitchen, you have our sympathy.<\/p>\n<h2>What Homebuyers Want<\/h2>\n<p>The NAR profile breaks down not only the types of homes most people prefer, but their locations as well.<\/p>\n<p>Since a little over half of homebuyers chose to live in the suburbs, it’s no surprise that 80 percent of homebuyers chose a single-family home over a condo or townhome. Urban areas were more popular among first-time buyers.<\/p>\n<p>Some of the most surprising real estate statistics come from the NAHB report. Even though “green” was the buzzword in just about everything last year, energy- efficient features weren’t as important to buyers as you might think. In fact, over one-third of homebuyers claim they aren’t at all important, and less than a quarter say they are “very important.”<\/p>\n<p>According to the NAHB report, 67 percent of new-home buyers say that although they would like an environmentally friendly home, they are not willing to pay more for it.<\/p>\n<p>Yet, 94 percent of respondents claimed that Energy Star appliances were either essential or desirable. Whether this reflects a different mindset between existing homebuyers and new-home buyers isn’t clear.<\/p>\n<p>Here are a few other items that homebuyers state as either desirable or “must-haves”:<\/p>\n<ul>\n<li>Half of the homebuyers surveyed would like a wireless security system.<\/li>\n<li>Over half say a laundry room is a must.<\/li>\n<li>Almost 50 percent claim that a ceiling fan is essential.<\/li>\n<li>Over 50 percent of homebuyers want a bathroom linen closet.<\/li>\n<li>84 percent dream about a walk-in pantry in the kitchen.<\/li>\n<\/ul>\n<h2>The ‘Hood<\/h2>\n<p>When last year’s homebuyers were asked about their ideal neighborhood features, three things topped the list, with over half of respondents saying these items would influence their decision to purchase in the area:<\/p>\n<ul>\n<li>Walking or jogging trails.<\/li>\n<li>A park.<\/li>\n<li>An outdoor swimming pool.<\/li>\n<\/ul>\n<p>Since builders rely heavily on research into what homebuyers are looking for, expect for new-home developments to include some, if not all, of the above three features.<\/p>\n<h2>Who’s in the Buyer Pool?<\/h2>\n<p>There seem to be two schools of thought regarding who homebuyers will be in 2014 and what they’ll want in a home.<\/p>\n<p>While some real estate prognosticators claim that this year, both buyers and sellers will come from the younger generation, that doesn’t quite jive with the facts: In both 2012 and 2013, the average buyer was 42 years old, according to NAR.<\/p>\n<p>The second group of forecasters sees 2014 as the year of the baby boomer, for both sellers and buyers. Boomers, who this year will range in age from 50 to 68, made up the largest buyer pool last year, with a 30 percent share and the average age of 57.5 years.<\/p>\n<p>Somewhere in those two forecasts is your 2014 buyer pool and, judging by the statistics, it’s safe to say that the average buyer will be between the ages of 37 and 57. The lower age range will be your first-time buyers, and the older folks will be repeat buyers.<\/p>\n<h2>What Do Boomers Want?<\/h2>\n<p>While boomers left their mark on the nation in many ways, look out for the Millennials. According to a Better Homes and Gardens survey, this group may just put the “curb appeal” mantra to rest.<\/p>\n<p>Over half of Millennials think that a home’s technological amenities are more important than how it looks from the street. Not only is it more desirable, 84 percent say that technology in their new home is “an absolute necessity.”<\/p>\n<p>They’ll be looking for home automation, such as the ability to control the security system, heating and cooling and other home features by phone or laptop. If a home lacks these features, the majority of Millennials surveyed by Better Homes and Gardens say they won’t consider purchasing the home.<\/p>\n<p>Baby boomers may be a little easier to satisfy. Most of these folks have money or the ability to obtain credit more easily than the younger generation. With tightening lending standards, this will be an important factor in real estate transactions in 2014.<\/p>\n<p>You may hear that Boomers want to downsize. You may also hear that they intend to age in place. This is a generation that prided itself in individuality, letting it “all hang out,” and reminding one another to “do your own thing.” Naturally, then, there is no one-size-fits-all when it comes to the types of houses this generation wants.<\/p>\n<p>With millions of Americans still out of work, the as-yet unknown impact of higher health insurance costs for the middle class, and stricter lending standards, one thing is certain: It will be an interesting year for real estate agents.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>One of the more interesting aspects of NAR’s Profile of Homebuyers and Sellers is what was hot, from a buyer’s perspective, in housing in 2013. Even more telling, at least for agents, is what they didn’t want in a home. The next time you sit down with a homebuyer to determine her wants and needs, [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[83],"tags":[399,400,254,256,382,245,87,401],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/24371"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=24371"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/24371\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=24371"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=24371"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=24371"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}