{"id":24591,"date":"2014-02-03T15:29:08","date_gmt":"2014-02-03T15:29:08","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=24591"},"modified":"2022-08-09T18:58:03","modified_gmt":"2022-08-10T01:58:03","slug":"agent-spotlight-jerimiah-taylor-of-tucson-ariz","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/agent-spotlight-jerimiah-taylor-of-tucson-ariz\/","title":{"rendered":"Agent Spotlight: Jerimiah Taylor of Tucson, Ariz."},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-24601\" title=\"Agent Spotlight - Jerimiah Taylor\" src=\"\/wp-content\/uploads\/2014\/02\/Jerimiah-Taylor-218x300.jpeg\" alt=\"Jerimiah Taylor is a real estate agent in Tucson, Arizona and San Diego, California\" width=\"218\" height=\"300\" \/>Although he’s been kicking around the real estate business for 13 years, <a href=\"https:\/\/nobodydoesmore.com\/\">Jerimiah Taylor<\/a>, a Keller Williams recruiter and trainer, is just now hitting the decade mark as a licensed real estate salesperson. As he jets between his home base in San Diego and the site of his team in Tucson, it’s safe to say that Taylor has hit his stride.<\/p>\n<p>An El Paso, Texas native, Taylor got a job as a copy clerk in a Tucson mortgage firm and from there worked his way up the chain of command until he was the one giving the commands. “I started as essentially a copy clerk, packaging files,” he recalls. “Then I became a loan processor and then a loan officer, and then in 2005 I actually bought the company.”<\/p>\n<p>He ran his company for about five years, and although he says he learned a lot about real estate and enjoyed what he was doing, he also learned he has an innate antipathy to paperwork and the numbers side of the mortgage industry. Since relationships were his hot button, the transition to selling residential real estate was natural.<\/p>\n<h2>6 Years of Trying<\/h2>\n<p>Taylor had obtained his real estate license in 2004, although at that time it wasn’t required of mortgage agents in Arizona. When he finally got to use his license he spent the next couple of years performing between 10 and 30 transactions a year. In the middle of 2010, Taylor met with his broker and asked how he could grow his business. “I was getting frustrated because no matter how hard I worked, I still made the same amount of money,” he recalls. “I wanted to do more and I didn’t know how.” It turned out that his broker didn’t know how either, so Taylor hit the streets, interviewing other brokers.<\/p>\n<p>After meeting with managing brokers of all the major players in town, he decided on Keller Williams. “The only company that told me, ‘Yes, here’s step one, here’s step two and three, and this will lead to your result,’ was Keller Williams.<\/p>\n<p>He did 50 transactions his first year with Keller Williams and 100 during his second year. He attributes that increase in production to joining Keller Williams and following their proven system.<\/p>\n<h2>Another Proven System<\/h2>\n<p>His association with Keller Williams provided Taylor with what he calls a “natural step” to adopting Market Leader products in his business. “Just like Keller Williams, Market Leader has a proven system,” he affirms. “When we added in that component, last year we did almost $200,000 in commission income &#8211; just off our Market Leader website.”<\/p>\n<p>Taylor calls his Market Leader products a “leveraged form of lead generation. There are a million ways to find clients,” he says, “but the nice thing about Market Leader is that it’s fairly hands-free. You tell them what zip code you want to work within, and they do all the heavy lifting and deliver you people who are either looking to buy or sell in those zip codes, depending on what you want. Life’s pretty easy.”<\/p>\n<h2>Biggest Challenge<\/h2>\n<p>We know that Keller Williams and Market Leader make Taylor’s working life easier. So, what challenges does he face at the decade-mark in his career?<\/p>\n<p>“Finding talent,” he says without hesitation. “The thing that the public and most people don’t realize about the real estate industry is that most of the agents that you see out there are very unproductive. They’re selling one, two or three houses a year, and that’s why our industry gets such a bad rap. They’re not super professional because they don’t get a lot of practice,” Taylor continues.<\/p>\n<p>“So for an agent to go beyond 30 houses a year it takes leverage through the right people. You have to have people on your team to help you with buyers, to help get listings online and in management. It really becomes this whole independent small business rather than just a personal services sales job,” he continues. “The key to that is finding talented people. It’s just like any other small business; your people will either make you or break you.”<\/p>\n<p>The bigger challenge, he concludes, is creating enough opportunity to retain the talent he recruits, which is his goal every day.<\/p>\n<h2>The Taylor Team<\/h2>\n<p>Though Taylor is a recruiter and trainer at his home office in San Diego, he runs a well-oiled real estate team in Tucson. The team includes an executive assistant whom he refers to as the “air traffic controller,” a listing coordinator, a short sale manager, and six buyer agents. Then, there’s Veronica, his team CEO. Taylor credits her with running the team while he goes back and forth between Arizona and Southern California.<\/p>\n<p>Yes, it’s a large team, but Taylor compares the way he does real estate to a doctor’s practice. “When you walk in, it’s not your doctor that greets you at the front desk and then turns around and takes your blood pressure &#8211; and then he’s running around doing the accounting and taking out the trash in between seeing patients,” he said.<\/p>\n<h2>Time Off<\/h2>\n<p>Madison &#8211; that’s who Taylor says he spends 90 percent of his time with when he’s not at the office. She’s only four, so she keeps Dad hopping during his off-time. Taylor also enjoys flying airplanes and racing cars and motorcycles. “If it has an engine and you can hurt yourself in it, I’m in,” he said, laughing.<\/p>\n<h2>The Best Advice<\/h2>\n<p>I asked Taylor about the best advice he received as a rookie. “As a rookie I was given no advice or else I’d be a lot more successful now!” he said, chuckling. “Throughout the entire time I’ve been an agent probably the best advice I’ve received is that growth is nothing,” Taylor claims. As is his habit, he pulls in an aviation analogy.<\/p>\n<p>“When a pilot is sitting on the runway, he actually has to give it 100 percent throttle to get up to speed to take off or else the plane will never leave the ground,” Taylor begins. “But then once he’s at cruising altitude, he can maintain 100 or 200 or 500 miles an hour at 45 or 50 percent throttle. But, then again, if he wants to climb or go faster, he’s got to give it 150 percent the effort. That’s true in the real estate business and really any time you’re going to grow.”<\/p>\n<h2>A Peek Into the Future<\/h2>\n<p>Taylor’s long-term career goals include building the San Diego office to be the No. 1 office in the Southern California region, then shooting for the No. 1 office in the Keller Williams system.<\/p>\n<p>“Beyond that, I look forward to doing more coaching and teaching and giving back to people,” he says. “You know, 10 years from now the key to success for me is that when I wake up in the morning, it’s my choice what I do that day. I’m living my agenda.”<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Although he’s been kicking around the real estate business for 13 years, Jerimiah Taylor, a Keller Williams recruiter and trainer, is just now hitting the decade mark as a licensed real estate salesperson. As he jets between his home base in San Diego and the site of his team in Tucson, it’s safe to say [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[78,83],"tags":[190,106,275,56],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/24591"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=24591"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/24591\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=24591"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=24591"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=24591"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}