{"id":24731,"date":"2014-02-06T20:19:59","date_gmt":"2014-02-06T20:19:59","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=24731"},"modified":"2021-12-02T09:28:51","modified_gmt":"2021-12-02T17:28:51","slug":"are-you-a-networking-pro","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/are-you-a-networking-pro\/","title":{"rendered":"Are You a Networking Pro?"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-24751\" title=\"Are You a Networking Pro?\" src=\"\/wp-content\/uploads\/2014\/02\/Fotolia_50735435_XS-300x272.jpg\" alt=\"Real estate agents need to become adept at networking in order to build relationships with potential clients\" width=\"300\" height=\"272\" \/>Gone are the days when real estate professionals considered themselves salespeople. Sure, they sell houses, land and commercial opportunities. But more and more, agents are learning that their industry is centered on relationships, and that the key to success is the proper feeding and maintenance of these relationships.<\/p>\n<p>First, however, you need to find people to build relationships with, and one of the best ways to put yourself in front of large groups of people is by networking.<\/p>\n<p>In a strong real estate market, agents should focus 40 percent of their marketing time on seeking people to build relationships with, according to a Baylor University Keller Center research study.<\/p>\n<h2>Diversify Your Networking<\/h2>\n<p>To increase your networking success, diversify the types of networking events you attend. New York Times bestselling author and networking expert Dr. Ivan Misner suggests the following mix:<\/p>\n<ul>\n<li><strong>Casual contact networks<\/strong> – An example of this would be a Chamber of Commerce mixer or any opportunity that is attended by people from a variety of different industries.<\/li>\n<\/ul>\n<ul>\n<li><strong>Community service networks<\/strong> – Join the Lion’s Club or any association that serves your local community.<\/li>\n<\/ul>\n<ul>\n<li><strong>Industry-specific networks<\/strong> – This category includes any real estate-specific groups that you belong to or annual conventions or other events you attend.<\/li>\n<\/ul>\n<h2>Demonstrate Value<\/h2>\n<p>It’s not enough to merely announce to people what you do for a living, so handing out your real estate business cards while networking is just a baby step in the process. You need to also provide value. What do real estate consumers value in a real estate agent? Trust – a quality that is only evident after getting to know someone.<\/p>\n<p>Misner breaks the process into three parts that he calls “VCP”:<\/p>\n<ul>\n<li><strong>Visibility<\/strong> – Letting people know who you are and what you do for a living.<\/li>\n<\/ul>\n<ul>\n<li><strong>Credibility<\/strong> – Demonstrating that you’re good at what you do.<\/li>\n<\/ul>\n<ul>\n<li><strong>Profitability<\/strong> – When you earn their trust, they are more willing to do business with you.<\/li>\n<\/ul>\n<h2>Visibility<\/h2>\n<p>You won’t get new business unless the people with whom you’ve chosen to network know what you do. This is where the exchange of business cards comes in, but even that must be done carefully.<\/p>\n<ul>\n<li>Never approach someone with your business card already in hand, ready to thrust it upon him as you introduce yourself. Misner calls this “coin-operated networking.” It’s pushy, rude and predictably “salesy.” Try not to look at others as potential commissions, but as people you can’t wait to get to know.<\/li>\n<\/ul>\n<ul>\n<li>Develop an unquenchable thirst for knowledge about those you come into contact with. Curiosity may have killed the cat, but it is the easiest way to break the ice and get people to let their guards down. Sure, introduce yourself, but then put all the attention on the other person. That way, before the conversation concludes, there will be a moment that comes up naturally for you to ask for a business card and, yes, in return proffer your own.<\/li>\n<\/ul>\n<ul>\n<li>Learn how to work the room. If the event is being attended by people you know, ensure that you reach out and connect with them. If the room is full of strangers, start by approaching anyone who is standing alone. Chat with this person for a few minutes and then take “your new contact with you to meet another loner, and another, until you have a group that everyone else in the room wants to join,” suggests K. MacKillop, writing for the National Business Association.<\/li>\n<\/ul>\n<p>Networking isn’t a spectator sport, and it’s the agent that becomes involved and engaged in an event that will be remembered.<\/p>\n<h2>Credibility<\/h2>\n<p>While it may be possible to pay lip service to how great you are by explaining your expertise to a total stranger, it’s rather pushy, so it’s not effective. Demonstrating credibility takes time and will happen as a result of following up consistently with those you meet at networking events.<\/p>\n<h2>Profitability<\/h2>\n<p>When you’ve established credibility, you’ve earned trust and folks are more likely to do business with you – <em>if<\/em> you’ve maintained the relationship over time. To keep top-of-mind with your networking contacts:<\/p>\n<ul>\n<li>Send notes or an article detailing something of interest to your contact.<\/li>\n<li>Make a quick phone call to check in.<\/li>\n<li>Reach out on social media or invite someone for coffee.<\/li>\n<\/ul>\n<p>Sure, it takes time to network like a pro. But if you show up and keep your word – under promise and over deliver – it will become second nature.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Gone are the days when real estate professionals considered themselves salespeople. Sure, they sell houses, land and commercial opportunities. But more and more, agents are learning that their industry is centered on relationships, and that the key to success is the proper feeding and maintenance of these relationships. First, however, you need to find people [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[83],"tags":[106,124,170,126,171,117,56,405],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/24731"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=24731"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/24731\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=24731"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=24731"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=24731"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}