{"id":25231,"date":"2014-02-10T15:22:20","date_gmt":"2014-02-10T15:22:20","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=25231"},"modified":"2016-02-04T16:47:26","modified_gmt":"2016-02-05T00:47:26","slug":"agent-spotlight-pablo-lopez-of-pine-brook-nj","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/agent-spotlight-pablo-lopez-of-pine-brook-nj\/","title":{"rendered":"Agent Spotlight: Pablo Lopez of Pine Brook, NJ"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-25241\" title=\"Agent Spotlight - Pablo Lopez\" src=\"\/wp-content\/uploads\/2014\/02\/Pablo-Photo-295x300.jpg\" alt=\"Pablo Lopez is a real estate agent in Pine Brook, New Jersey\" width=\"295\" height=\"300\" \/>Next time a boom car drives by your house, shattering the town’s noise ordinance, rattling the china in your cabinet and bending your plate glass windows, wag your forefinger at <a href=\"http:\/\/propertylistingscliftonnj.com\">Pablo Lopez<\/a>, real estate agent with Century 21 in Pine Brook, N.J.<\/p>\n<p>In fact, Lopez brags that as former owner of Auto Sales Plus, he was one of the folks responsible for the boom-boxes-in-cars craze that first swept the nation decades ago. “The boom boxes in cars? I started that,” he said, laughing. “We customized cars. We did stereo and alarm systems and other things to personalize cars to individuals.”<\/p>\n<p>It’s a bit of poetic justice then that Lopez, born and raised in balmy, tropical Puerto Rico, now finds himself “battling against 24 inches of snow.”<\/p>\n<h2>Back to the Past<\/h2>\n<p>Lopez arrived in the contiguous United States at the age of 21. “I came to the United States in 1980, chasing the dream,” he said. “Recently married, with one child on the way, I felt that the opportunities were very slim in Puerto Rico as far as income and being able to excel in life and provide for my family.”<\/p>\n<p>He got a job in the Bronx as an automotive technician two days after his arrival. “My dream was always to own my own shop, and I did that,” he recalls. “They loved me so much that I went from technician to assistant manager to manager to owner. It took 14 years to get there, but that was my dream – I always wanted more,” Lopez said.<\/p>\n<h2>Turning Points<\/h2>\n<p>Four years after buying the shop, in 1998, Lopez shut it down. Cars were coming off the factory line with bigger and better sound and alarm systems. He realized that the auto aftermarket industry had changed to the point where what he offered was no longer a viable business. After 18 years, he gave it all up and ended up at a turning point in his life.<\/p>\n<p>“I found myself at a crossroads where I said, ‘Wow, what am I going to do?’ I just happened to know a little bit about business, from actually being in business, and so I landed in commercial lending,” Lopez recalls.<\/p>\n<p>That venture only lasted about 18 months, but it was a year and a half packed with adventure. He was a South American liaison for the lending company, working on “some really big projects and managing a team of architects and attorneys,” he recalls.<\/p>\n<p>After that adventure, Lopez settled into a career in residential lending, spending the next decade as a senior loan officer. “I did very well and I liked that business,” he recalls. His wife was several years into a real estate sales career at the time, and by 2005, Lopez was licensed; by 2007 he was a full-time agent.<\/p>\n<h2>Marketing His Business<\/h2>\n<p>Lopez relies almost exclusively on Internet marketing both to keep his lead funnel full and to nurture relationships with past clients.<\/p>\n<p>“I have probably the best program there is,” Lopez says of his marketing program. “I have the best platform there is to stay in touch with my clients, which is Market Leader. In the past, I tried a couple other platforms. They were more work to maintain and not as efficient as what I use now. Market Leader is easy to use; it’s amazing how efficient it is,” he affirms.<\/p>\n<h2>A Life-Changing Event<\/h2>\n<p>We asked Lopez how he was introduced to Market Leader products and he laughed.<\/p>\n<p>“Well, that’s a funny story, actually,” he begins. “At the end of 2011 I was at the end of my wits. Everything that I tried was pretty much not working 100 percent the way I wanted it to work.”<\/p>\n<p>He attended a Century 21 event and “there was a Market Leader representative, doing their first presentation for Century 21,” he recalls.<\/p>\n<p>“As I watched the presentation, I couldn’t wait for him to finish speaking. I thought, ‘This is what I want, this is what I need. This is what I envisioned. It’s got all the tools. It’s got everything I want to provide my clients when they visit my website.’ There it was, right in front of me,” he said, laughing.<\/p>\n<p>“Immediately I wanted to sign up. I think I had to wait another three or four weeks. I don’t know if I was one of the first hundred or so Century 21 agents to use Market Leader, but I just couldn’t get it fast enough! Sure enough, it was a life-changing experience,” Lopez said.<\/p>\n<p>We asked Lopez how his business has been impacted by the use of Market Leader products.<\/p>\n<p>“Let me put it to you this way,” he began. “Since I got licensed as a real estate agent, I never made it into the Circle of Excellence. I was trying and trying. After my first year using Market Leader, I made it into the Circle of Excellence. That tells you, the system works. It gives me that edge. Market Leader gave me that edge.”<\/p>\n<h2>Outside Interests<\/h2>\n<p>When he isn’t working, Lopez enjoys family time, especially time spent with his three grandkids. “I always say I should’ve had the grandkids before the kids,” he said, chuckling. “We have them here every now and then and the house is just full of joy when they’re here.” When they aren’t there, Lopez enjoys fishing and getting away on his motorcycle.<\/p>\n<p>Lopez has led a full professional life. We asked him where he sees himself 10 years from now. “My goal is to own my own brokerage here in New Jersey. I’ll continue to work hard and to provide the best service I can.”<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Next time a boom car drives by your house, shattering the town’s noise ordinance, rattling the china in your cabinet and bending your plate glass windows, wag your forefinger at Pablo Lopez, real estate agent with Century 21 in Pine Brook, N.J. In fact, Lopez brags that as former owner of Auto Sales Plus, he [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[83],"tags":[190,106,275,56],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/25231"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=25231"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/25231\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=25231"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=25231"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=25231"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}