{"id":25431,"date":"2014-02-13T17:16:23","date_gmt":"2014-02-13T17:16:23","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=25431"},"modified":"2021-11-24T12:05:17","modified_gmt":"2021-11-24T20:05:17","slug":"is-instagram-worth-your-time","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/is-instagram-worth-your-time\/","title":{"rendered":"Is Instagram Worth Your Time?"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-25461\" title=\"Should Real Estate Agents use Instagram for Marketing?\" src=\"\/wp-content\/uploads\/2014\/02\/Fotolia_54740429_XS-300x300.jpg\" alt=\"Instagram has a large number of users, but they may not be the target audience for real estate agents who want to use social media as a marketing tool\" width=\"300\" height=\"300\" \/>Quick! What comes to mind when we say “social media”? Facebook and Twitter, right? Those are the go-to sites for most agents looking to promote their real estate businesses via social media. But promoting a real estate business and marketing listings require two different sets of parameters, which is why many agents use online photo and video sharing sites as well.<\/p>\n<p>The two most popular of these platforms are Pinterest and Instagram. With Facebook’s purchase of the latter almost two years in the rearview mirror, let’s take a look at where Instagram is today and whether it’s worth your consideration as a means to promote both yourself and your listings.<\/p>\n<h2>Diversify Your Social Media<\/h2>\n<p>Although using just one social media platform does not make an effective online campaign, more than two may be too distracting, according to some social media experts. Agents have a finite amount of time every day, and for those who lack assistance, the job of posting to the sites can become overwhelming.<\/p>\n<p>The careful choice of a second platform, then, becomes imperative. Agents want – and clients expect them – to promote their listings online. While Facebook is great for getting the word out about open houses and interesting listing tidbits, an over-reliance on pushing your listings there will do nothing but reduce your number of friends.<\/p>\n<p>It only makes sense, then, that agents seeking to branch out from the standard social media platforms in their quest to compete for market share typically consider adding an online photo and video sharing site to the mix. The most popular of these sites is YouTube, followed closely by Instagram and Pinterest.<\/p>\n<h2>The Allure of Instagram<\/h2>\n<p>Within two months of its birth in 2010, Instagram had grown to 1 million users, and in less than one year that number grew to 10 million. In April of 2012 <a href=\"https:\/\/about.instagram.com\/blog\">Facebook acquired Instagram<\/a> for $1 billion in cash and stock.<\/p>\n<p>With a reach today of 150 million active monthly users, at first blush, Instagram looks mighty attractive. Add in the fact that <a href=\"https:\/\/www.fastcompany.com\/3001670\/instagram-now-bigger-twitter-us-mobiles\">Instagram surpassed Twitter<\/a> last year in mobile users and you’ll find it being touted by real estate advisors all over the Internet.<\/p>\n<p>What’s not to like? Agents can upload photos and videos and connect their Instagram accounts to Facebook and other social networking platforms. One feature, in particular, has many agents scrambling to get an Instagram page: Instagram Direct. This allows the agent to send photos to a predetermined group of users, such as buyers, rather than making available to all.<\/p>\n<p>Overall, so far, Instagram appears custom-made for real estate agents.<\/p>\n<h2>Is It Worth Your Time?<\/h2>\n<p>Before adding anything to a marketing plan, agents need to dig deeper than learning the quantity of visits a site receives. After all, it’s the quality that counts. When one sticks that shovel into the ground next to Instagram, here’s what is dug up: “We find that Instagram is largely made up of urban, youthful (18 to 34) demographics,” says <a href=\"https:\/\/www.businessinsider.com\/instagram-demographics-2013-12\">Business Insider’s<\/a> Cooper Smith.<\/p>\n<p>Instagram’s actual demographics look like this, according to Pew Internet’s 2013 research:<\/p>\n<ul>\n<li>The majority of Instagram users are between the ages of 18 and 29. In fact, twice as many users fall into that age group as the next largest group, 30 to 49 year olds (18 percent).<\/li>\n<\/ul>\n<ul>\n<li>The majority of Instagram users make less than $49,999 a year. Most make less than $30,000.<\/li>\n<\/ul>\n<ul>\n<li>Most users are city dwellers.<\/li>\n<\/ul>\n<p>These statistics are great news if you’re selling Michael Jordan sneakers or iTunes. But you’re selling houses, and your typical buyer, according to NAR’s 2013 Profile of Home Buyers and Sellers, is 49 years old and makes $83,300. Your first-time homebuyer pool has a median household income of $64,400.<\/p>\n<p>Clearly, Instagram users are not a real estate agent’s target audience.<\/p>\n<h2>The Alternative<\/h2>\n<p>If you’re looking for a photo-sharing platform, Pinterest hits a more desirable real estate audience than Instagram.<\/p>\n<ul>\n<li>Pinterest has a larger overall share of Internet users than Instagram – 21 percent versus 18 percent.<\/li>\n<\/ul>\n<ul>\n<li>Most Pinterest users are 30 to 49 years old.<\/li>\n<\/ul>\n<ul>\n<li>Pinterest’s highest user pool comes from those earning in excess of $75,000 a year &#8211; the same income as the average Facebook user, and closest to the average income of a real estate consumer.<\/li>\n<\/ul>\n<ul>\n<li>More Pinterest users live in the suburbs than the inner city, making it more likely that they own a home, thus providing a larger pool of possible sellers.<\/li>\n<\/ul>\n<p>From the demographics alone, it appears that Pinterest is the logical choice for an agent seeking a photo and video sharing platform to add to the social media mix. If you’ve never used the site, NAR has a list of helpful articles on how to get started and how to use Pinterest effectively.<\/p>\n<p>Social media site demographics change over time. Remember, Facebook used to be a mecca for teenagers. Keep an eye on Instagram because it, too, may change enough to be worthy of inclusion in your marketing plan. Until then, it appears to be a waste of time and energy for real estate agents.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Quick! What comes to mind when we say “social media”? Facebook and Twitter, right? Those are the go-to sites for most agents looking to promote their real estate businesses via social media. But promoting a real estate business and marketing listings require two different sets of parameters, which is why many agents use online photo [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[104],"tags":[17,406,87,171,117,197,103,57,329],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/25431"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=25431"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/25431\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=25431"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=25431"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=25431"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}