{"id":25501,"date":"2014-02-17T17:56:08","date_gmt":"2014-02-17T17:56:08","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=25501"},"modified":"2016-02-04T16:46:49","modified_gmt":"2016-02-05T00:46:49","slug":"agent-spotlight-sandra-rangel-of-san-antonio-texas","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/agent-spotlight-sandra-rangel-of-san-antonio-texas\/","title":{"rendered":"Agent Spotlight: Sandra Rangel of San Antonio, Texas"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-25521\" title=\"Agent Spotlight - Sandra Rangel\" src=\"\/wp-content\/uploads\/2014\/02\/Sandra5x7-214x300.jpg\" alt=\"Sandra Rangel is a real estate agent in San Antonio, Texas\" width=\"214\" height=\"300\" \/>It’s no secret that the state of Texas’ economy is the envy of most other states in the U.S. The real estate market, especially, is trending ahead of national figures. From January 2013 to January 2014, for instance, San Antonio median home prices increased 15 percent. It’s safe to say, the real estate agents of Alamo City are a happy bunch.<\/p>\n<p>Among the happiest is RE\/MAX agent and native San Antonian <a href=\"http:\/\/homesinnorthsanantoniotx.com\">Sandra Rangel<\/a>. With a finely tuned real estate team to back her up, she has time to spend with her favorite guy, Cody, born one year ago. As he chattered away in the background, I got to know Rangel over the phone.<\/p>\n<p>Rangel attended San Antonio’s University of the Incarnate Word where she graduated with a business degree. Right out of college she snagged a job in banking, but quickly moved on to a position as a buyer with the local Toyota Plant. She remained with the auto giant for four years.<\/p>\n<p>There are those of us who look forward to our evenings with nothing to do and then there are people like Rangel who crave busyness. With her husband working nights, and Cody still just a glimmer in her eye, she decided she needed something to fill that time alone, and real estate fit the bill.<\/p>\n<p>“One day [at the Toyota plant] we had a new boss, and after the third time I tried to offer help and got shot down and put in my place, I said to myself, ‘Obviously, my services here are no longer needed, so it’s time to move on,” she said, laughing.<\/p>\n<p>So, in 2007 she decided to get her real estate license and held down a part-time real estate practice while continuing the job at Toyota.<\/p>\n<p>“It was pretty easy for me because my husband worked evenings, so I was showing houses in the evenings and on weekends. Since most of the buyers worked during the day, it worked out fine.” Rangel went full-time in the real estate industry in April of 2009.<\/p>\n<h2>Intro to Market Leader<\/h2>\n<p>Rangel was introduced to Market Leader through a colleague and says that, more than anything, Market Leader gives her peace of mind. “Before I went full-time, I invested in Market Leader and have been using it since,” she explains. “My business has been impacted a lot because I get so many leads a month that my database keeps growing. I feel that I always have security in that I always have leads coming in.” Rangel continues.<\/p>\n<p>“I don’t have to worry. I may not convert the leads right away, but I typically have two or three that are looking, or maybe two or three that are interacting with me &#8211; and that’s potential right there.”<\/p>\n<h2>Challenges<\/h2>\n<p>With Market Leader taking the pressure off Rangel to constantly be rounding up leads, what challenges <em>does<\/em> she face at the nine-year mark in her real estate career.<\/p>\n<p>“Right now my biggest challenge is trying to double my business and still spend time with my son,” she begins. “The whole point of me starting a team [was] because I knew I wanted to have a child. Not because I wanted to make all this money and I didn’t want to work. I love working. I love showing houses. I’ll never be the broker that has my agents do all the work,” she continues.<\/p>\n<p>“But I always felt that if I can’t go meet a client, I can’t just rely on anybody in the office and say, ‘Hey, can you help me with my client?’ I needed a team that was going to basically meet every challenge. That was my whole idea behind starting a team. I now have four agents and one assistant working for me,” Rangel concludes.<\/p>\n<p>She built the team gradually, starting with the assistant who worked five hours a week. She found that hiring an assistant helped her grow her business. “It helped me alleviate the tedious stuff. I needed to be out there doing business. I needed to be out there connecting with clients.”<\/p>\n<p>And, connect she did. Last year, Rangel and Associates was listed among the San Antonio Business Journal’s “Top 25 Residential Teams.”<\/p>\n<h2>What Does the Future Hold?<\/h2>\n<p>A decade from now Rangel sees herself steering a power real estate team in San Antonio. “I also want to do more things to be involved in the community. I’m hoping that this year or next year I can find a balance with work and my son and still be able to give my time to the community and not just my money.” My toddler chatter translating skills are a little rusty, but I do believe Cody agrees with Mom on that.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>It’s no secret that the state of Texas’ economy is the envy of most other states in the U.S. The real estate market, especially, is trending ahead of national figures. From January 2013 to January 2014, for instance, San Antonio median home prices increased 15 percent. It’s safe to say, the real estate agents of [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[78,83],"tags":[190,106,275,56],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/25501"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=25501"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/25501\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=25501"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=25501"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=25501"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}