{"id":25571,"date":"2014-02-19T19:11:15","date_gmt":"2014-02-19T19:11:15","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=25571"},"modified":"2021-11-16T10:31:51","modified_gmt":"2021-11-16T18:31:51","slug":"what-is-email-drip-marketing","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/what-is-email-drip-marketing\/","title":{"rendered":"Email Drip Marketing for Real Estate Agents"},"content":{"rendered":"<p>Chinese water torture is a way to drive someone insane by slowly dripping water on the person’s forehead.<\/p>\n<p>Drip email marketing is a communication strategy that slowly drips email messages to prospects’ inboxes over time.<\/p>\n<p>Folks on the receiving end of either may feel tortured.<\/p>\n<p>There is a positive way to drip that may even be welcomed by the recipient. Compare it to drip irrigation &#8211; those bubblers that deliver metered amounts of nourishing water to the roots of your garden plants. If your drip marketing is more nurturing and less crazy-making, it may actually turn a lead into a sale.<\/p>\n<h2>The Benefits of Drip Email Marketing<\/h2>\n<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-25591\" title=\"What is Email Drip Marketing?\" src=\"\/wp-content\/uploads\/2014\/02\/Fotolia_41341726_XS-300x300.jpg\" alt=\"Real estate agents can use email drip marketing to reach out to clients and convert leads into sales\" width=\"300\" height=\"300\" \/>Probably the biggest benefit of drip email marketing is that, if done right, it is hands-off. Sure, it requires time and effort to determine what your goals are, plan the drip campaign, write your emails and determine a suitable schedule. But from there, it can be completely automated to do all the work while you spend time on more important tasks.<\/p>\n<p>These campaigns also reduce sales funnel leakage. A certain percentage of the leads you stuff into the top of the funnel will leak out at some point as they move down, but a campaign of consistent contact reduces that number significantly. It may even prompt some to leak out earlier rather than later.<\/p>\n<h2>Drip Marketing Tools<\/h2>\n<p>To set up an effective system that will save you time in the long run requires a customer relationship management platform (CRM). This is the air traffic controller, in a sense, for all leads. It clears new ones to land in the system and guides them to their spot within the database. It determines outgoing flights <em>to<\/em> the leads as well, depending on criteria that you set forth.<\/p>\n<p>A robust CRM has the ability to group your leads and contacts for targeted marketing campaigns and to set up automated email campaigns. The right platform will create, schedule and track your drip email campaign. In other words, it makes it effortless.<\/p>\n<hr \/>\n<p><a href=\"\/products\/professional-for-agents\/\"><img class=\"alignleft size-medium wp-image-44201\" src=\"https:\/\/www.marketleader.com\/wp-content\/uploads\/2016\/02\/Blog-CTA-arrows-2.png\" alt=\"Learn more about Market Leader Professional\" \/><\/a><strong><em>NEED MARKETING HELP? Agents can create automated email or direct mail campaigns from thousands of customizable templates using Market Leader Professional&#8217;s marketing center. <\/em><a href=\"\/products\/professional-for-agents\/\">LEARN MORE &gt;&gt;<\/a><\/strong><\/p>\n<hr \/>\n<h2>Content<\/h2>\n<p>One of the biggest problems agents have with email drip campaigns revolves around the content of the emails. Avoiding being impersonal and inappropriate (for where recipients are in the sales cycle) and determining the right content for the campaign can be a challenge.<\/p>\n<p>Here are a few things to keep in mind when thinking about content:<\/p>\n<ul>\n<li><strong>Keep it simple<\/strong>. Forget the HTML and the photos of yourself – that stuff screams “SPAM!” Sometimes the best email is one that is only three to four sentences in length. Longer content should be scannable. For instance, break your newsletters up into chunks with subheads that are easy to scan.<\/li>\n<\/ul>\n<ul>\n<li><strong>Make it engaging<\/strong>. Drip emails aren’t the place for heavy pitches. Write in plain English and have fun.<\/li>\n<\/ul>\n<ul>\n<li><strong>Be relevant<\/strong>. Unless you have only one type of client, you’ll need content targeted to each group of clients. This way, buyers don’t receive information about selling their houses, and sellers don’t get new listings (unless they want them). Then there are prospects and leads – each requires two different approaches.<\/li>\n<\/ul>\n<p>A good way to determine what subjects to write about is to segment your recipients into buyers, sellers, past clients, sphere of influence, or whoever is populating your CRM. Then, make a list of each group’s needs.<\/p>\n<p>For instance, think about the information that buyers need. This will include mortgage information, a walk-through of the home-buying process, inspection information, and explanations of the more confusing topics (closing, contingencies, etc.).<\/p>\n<p>Coming up with content ideas is far easier for past clients – if you took the time to get to know them. Links to items of interest, greetings for special occasions, and current market conditions to keep them abreast of the value of their investment are always welcome topics.<\/p>\n<p>The most important content to include in all emails is links to your social media pages, your blog and your website.<\/p>\n<h2>Track It<\/h2>\n<p>Drip email campaigns don’t have to remain static, and should especially be changed if you track your results and they turn out to be dismal. Play with your subject text, format and content until you receive the desired number of opens, you reach your click-through rate goals and, most important, the number of appointments generated by the campaign increases.<\/p>\n<p>With any drip campaign, it’s important to keep an eye on that fine line between driving leads and prospects crazy and nurturing them. Straddle that line and you can’t help but build a full pipeline.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Chinese water torture is a way to drive someone insane by slowly dripping water on the person’s forehead. Drip email marketing is a communication strategy that slowly drips email messages to prospects’ inboxes over time. Folks on the receiving end of either may feel tortured. There is a positive way to drip that may even [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[35],"tags":[106,101,124,201,407,44,126,87,208],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/25571"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=25571"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/25571\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=25571"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=25571"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=25571"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}