{"id":25761,"date":"2014-02-25T16:53:21","date_gmt":"2014-02-25T16:53:21","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=25761"},"modified":"2021-11-19T11:08:08","modified_gmt":"2021-11-19T19:08:08","slug":"dont-let-your-real-estate-newsletters-end-up-in-the-trash","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/dont-let-your-real-estate-newsletters-end-up-in-the-trash\/","title":{"rendered":"Improve Email Subject Lines to Prevent Your Newsletters From Getting Deleted"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-25811\" title=\"Don't Let Your Real Estate Newsletters End Up in the Trash\" src=\"\/wp-content\/uploads\/2014\/02\/Fotolia_56369910_XS-300x198.jpg\" alt=\"Using catchy headlines in an email newsletter can help real estate agents capture the attention of clients\" width=\"300\" height=\"198\" \/>&#8220;If you want a 100 percent open rate, send one email to your mother,&#8221; says Dela Quist, CEO of Alchemy Worx. If you just want to improve your real estate newsletter&#8217;s open rate, on the other hand, create better subject lines.<\/p>\n<p>Think about your favorite magazine and what compels you to purchase it. Sure, the cover photo has a lot to do with it, but the headlines typically sell the magazine. Studies of online headlines for blog posts and other content also bear that out.<\/p>\n<p>Why, then do so many agents ignore the importance of the email’s subject line, which is, in effect, its headline? Just like blog posts and articles, content that is being sent electronically deserves to be treated with decades of journalistic best practices and proven methods for success.<\/p>\n<p>That is, <em>if<\/em> you want people to read what you write.<\/p>\n<h2>Think of Subject Lines as Headlines<\/h2>\n<p>Think of the subject line of an email as the headline of the content within the email. It should be concise, descriptive and compelling. Yes, it’s a big job for just a few words to accomplish.<\/p>\n<p>Some of the most effective subject lines have to do with helping, not selling. For instance, if your real estate newsletter contains stories about interest rates and home improvement projects, headlines like “3 Ways to Increase your Home’s Value” or “Spice up your Kitchen in 5 Easy Steps” are much more enticing subject lines than “Weekly Real Estate Newsletter” or “Interest Rates Drop.”<\/p>\n<p>Since numbered lists are one of the most popular forms of content, and <a href=\"https:\/\/moz.com\/blog\/5-data-insights-into-the-headlines-readers-click\">numbered list headlines<\/a> – such as “3 Steps to Win a Bidding War” – get the most clicks, according to Nathan Safran at Moz, it only stands to reason that agents should consider using them in their email subject lines.<\/p>\n<p>Keep the list short. Although potential buyers may be looking for ways to raise their FICO scores, few will click on “101 Ways to Improve your Credit Score.” Shorten the list to five or seven ways and you may grab their interest.<\/p>\n<p>Abreena Tompkins, instruction specialist at Surry Community College, confirms this with the results of a meta-analysis of more than 300 articles. Her analysis finds that “The brain can process no more than nine items in a sequence, and it actually does this much more efficiently with three or five. Odd numbers work better than even numbers,” Tompkins concludes. So, skip the “50 Ways to Leave Your Money Pit” and go with “3 Amazingly Simple Tricks to Sell Your Home.”<\/p>\n<p>The Moz study also finds that powerful adjectives in newsletter headlines get more clicks than the use of no adjectives. For instance, which menu item are you more likely to order – “cheese omelet” or “omelet of 3 freshly-cracked eggs loaded with tangy, smoked Vermont cheddar?”<\/p>\n<p>Consider using emotion-rich adjectives such as powerful, exciting, amazingly (simple), surprising, and startling, to name a few.<\/p>\n<p>Then, plug them into Safran’s template: “(odd number) (adjective) (mistakes\/tips\/insights\/shortcuts) for (achieving\/avoiding) (desired outcome\/disaster). The result for a real estate agent may be: “3 Disastrous Homebuyer Mistakes.”  Number one is, of course, not hiring you as their agent.<\/p>\n<p>Don’t be hard on yourself if your open rate for your drip email or newsletter campaign isn’t as high as you’d like it to be. Concentrate more on beefing up the subject line and your stats will improve.<\/p>\n<p>Think of those few critical words as bait. They get your email recipients on the hook and lured in to the email’s content and purpose. Whether that purpose is a specific call to action or merely to keep you top-of-mind, the headline is everything.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8220;If you want a 100 percent open rate, send one email to your mother,&#8221; says Dela Quist, CEO of Alchemy Worx. If you just want to improve your real estate newsletter&#8217;s open rate, on the other hand, create better subject lines. Think about your favorite magazine and what compels you to purchase it. Sure, the [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[35],"tags":[86,44,408,87,88],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/25761"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=25761"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/25761\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=25761"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=25761"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=25761"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}