{"id":26691,"date":"2014-03-03T23:20:27","date_gmt":"2014-03-03T23:20:27","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=26691"},"modified":"2022-01-26T14:34:22","modified_gmt":"2022-01-26T22:34:22","slug":"remax-r4-convention-2014-why-go","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/remax-r4-convention-2014-why-go\/","title":{"rendered":"RE\/MAX R4 Convention 2014: WHY Go?"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-thumbnail wp-image-26711\" src=\"\/wp-content\/uploads\/2014\/03\/ebc29bb292a447cf9f50aba8d0795dab1-150x150.jpg\" alt=\"\" width=\"150\" height=\"150\" \/>It is event season for all those who live and breathe real estate transactions. And you know what that means: busy airports, flight delays, crowded hotel lobbies, packed break-out sessions, noisy convention halls, sales pitches, late night networking parties, and much more that make your head spin, your toes cramp and your back ache.<\/p>\n<p>So I ask: WHY go?<\/p>\n<p>Here are my top reasons WHY going will positively change your life and real estate business:<\/p>\n<p><span style=\"font-size: medium\"><span style=\"font-size: large\"><strong>R<\/strong><\/span><span style=\"font-size: small\">EAL CONNECTIONS<\/span><\/span><\/p>\n<p>As I mentioned in a previous blog post on <a href=\"\/blog\/why-real-estate-conferences-conventions-are-important-for-business\/\">networking at conventions<\/a>, face-to-face connections are worth their weight in GOLD. Helping people and networking is your passion. Seeing old friends and meeting new ones is the joy of your profession. Pass your business card to a new associate and shake hands with a colleague who lives in Brazil. Trust me, those real conversations you have and real people you meet will help to grow your business two-fold. Your colleague in Brazil just might think of you the next time he has the perfect client who wants to move to Denver.<\/p>\n<p><span style=\"font-size: small\"><strong><span style=\"font-size: large\">E<\/span><\/strong>DUCATION<\/span><\/p>\n<p>RE\/MAX® International Inc. has rolled out the red carpet again this year with an outstanding lineup of nationally recognized speakers, authors, celebrity athletes, heroes, fellow colleagues and business consultants. Some must-sees include: RE\/MAX Technology Director Jeb Griffin (@JebGriffin), social media consultant Katie Lance (@KatieLance), Charis Moreno from Trulia (@TruliaPro), Steve Murray from REAL Trends (@StephenHMurray), Valerie Garcia from RE\/MAX® Ontario (@Valeriegarcia1), and Bob Stewart from ActiveRain (@ActiveBob).<\/p>\n<p>Learn from the best. Attend break-out sessions. Visit the <strong>RE\/MAX Approved Supplier MarketPlace<\/strong>. Download the RE\/MAX R4 Convention App. Ask questions. Watch demos. Go to workshops. Read the brochures. Listen to vendors. Challenge them to show you how their solution will help you succeed in real estate. Get there early, get educated and you’ll get results.<\/p>\n<p><span style=\"font-size: small\"><span style=\"font-size: large\"><strong>M<\/strong><\/span>OTIVATION<\/span><\/p>\n<p>Over 4,000 fellow RE\/MAX® agents and brokers from around the WORLD will be in attendance this year at the <strong>R4 convention (#remaxR4)<\/strong>. It’s exciting to know that you’re part of what makes the RE\/MAX brand so strong. Listen to the leaders like Darren Hardy (@DARRENHARDY), the Publisher and Founding Director of SUCCESS magazine, and Simon Sinek (@simonsinek), who wrote “Leaders Eat Last” and “Start with WHY,” on how to succeed in business and grow teams. They will inspire you, push you and move you to expect more out of yourself. People like basketball league Earvin “Magic” Johnson (@MagicJohnson) and financial editor for NBC’s “Today” show, Jean Chatzky (@JeanChatzky), will make a difference. And those are just a few of the many speakers who will be participating. Be there, be present, and be ready to be inspired.<\/p>\n<p><span style=\"font-size: small\"><strong><span style=\"font-size: large\">A<\/span><\/strong>CCELERATE PROFITS<\/span><\/p>\n<p>Don’t forget your ABCs: Always be closing. Remember, you’re there for business. Learn which online tools and technology will accelerate your real estate sales and make your brokerage profitable. Listen to your leaders and your peers, including real estate broker Nina Hollander from RE\/MAX Executive Realty in Charlotte, N.C., who will be sharing her secrets to online leads at the Market Leader booth #123. Come by and join Market Leader’s <a href=\"https:\/\/learn.marketleader.com\/display\/coaching\/Million+Dollar+Pipeline+Program\">Million Dollar Pipeline Program<\/a>. Wake up early and don’t miss the chance to accelerate your profits in 2014!<\/p>\n<p><span style=\"font-size: large\"><strong>X<\/strong><\/span><span style=\"font-size: small\">TREME FUN<\/span><\/p>\n<p>Come on folks, we’re talking sin city, where “what happens in Vegas, stays in Vegas.” The Mandalay Bay hotel is gorgeous, and if the weather is warm, they might even open the pool for you. But if not, you can have fun shopping, walking down the strip, riding the roller coaster at night (no, you’re not too old), or simply spending time with colleagues and vendors. R4 wraps up with a party and concert you won’t want to miss, thanks to Keith Urban (@KeithUrban), country singer superstar. So grab your comfy shoes and have FUN!<\/p>\n<p>If you are attending RE\/MAX R4 convention this year, I’d love to hear your feedback and key takeaways!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>It is event season for all those who live and breathe real estate transactions. And you know what that means: busy airports, flight delays, crowded hotel lobbies, packed break-out sessions, noisy convention halls, sales pitches, late night networking parties, and much more that make your head spin, your toes cramp and your back ache. So [&hellip;]<\/p>\n","protected":false},"author":26,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[27],"tags":[409,410,411,230,56,412,413,375,414],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/26691"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/26"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=26691"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/26691\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=26691"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=26691"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=26691"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}