{"id":26941,"date":"2014-03-05T17:28:06","date_gmt":"2014-03-05T17:28:06","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=26941"},"modified":"2016-02-04T16:46:09","modified_gmt":"2016-02-05T00:46:09","slug":"robo-agents-and-their-tools","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/robo-agents-and-their-tools\/","title":{"rendered":"Robo Agents and Their Tools"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-26961\" title=\"Google Glass\" src=\"\/wp-content\/uploads\/2014\/03\/Fotolia_54823111_XS-200x300.jpg\" alt=\"Some real estate agents are using Google Glass and drones to record listings and share information with clients\" width=\"200\" height=\"300\" \/>There was a long period when the real estate industry stubbornly refused to change with the times. Agents and brokers had to be dragged – kicking and screaming – into the age of technology. They faced a steep learning curve and scaled it admirably.<\/p>\n<p>Today, agents are not only technological whizzes, but some are at the forefront of using technology in real estate. Two of the newest tech gadgets being utilized by agents to photograph or take videos of their listings are the stuff of sci-fi dreams.<\/p>\n<h2>Google Glass<\/h2>\n<p>As the debate rages over whether Google Glass is legal to wear while driving, in movie theatres, and – soon, I’m sure – in Vegas casinos, the real estate industry is wholeheartedly embracing the technology.<\/p>\n<p>Google Glass looks like a pair of glasses with a rectangular projection on one side. That projection is actually a small Android computer that includes a screen, camera and microphone.<\/p>\n<p>Google Glass owners, at this point, are an exclusive, by-invitation only bunch, ponying up $1,500 for a pair. In other words, it’s not available to the general public right now.<\/p>\n<p>Real estate agents across the country have been given access to the beta version of the technology, however, and some of them are finding an amazing variety of ways it contributes to their businesses – others, not so much.<\/p>\n<p>South Bay Residential’s Greg Geilman thinks the technology is a bit lacking at this point. “Google Glass was my latest project, and while I think the device is evolutionary (and pretty entertaining), ultimately it&#8217;s got a long way to go before it becomes part of my everyday life in real estate,” he says on his blog.<\/p>\n<p>What needs improvement is the streaming feed, according to Geilman. “During the showing, it was nice to be &#8220;hands free&#8221; to open doors and keep the camera pointed in the right direction, but the live video feed was blurred at times for my client, so I had to stop and wait for the streaming feed to adjust.” What he found helpful about this feature, though, was that his client had the opportunity to give him feedback in real time. Unlike with a video tour, the client could ask him to return to different rooms to get a closer look at some of the features.<\/p>\n<p>Others, like Ed Cummings of The Telegraph, appreciate the streaming feature as well. Cummings, in fact, thinks that Google Glass will revolutionize the real estate business. “Glass creates the possibility of an agent giving a tour of a new home live to viewers around the world, who would be able to ask them the kind of questions you normally need a viewing for: Is the house noisy, what does it smell like; could you just check round that corner,” he explains.<\/p>\n<p>Google has been busily adding to the Google Glass line with fashion frames and even Glass for prescription eyeglass wearers. And there are also apps for it.<\/p>\n<p>Trulia’s <a href=\"http:\/\/www.youtube.com\/watch?v=XXlfxcqZheU&amp;feature=youtu.be\">Google Glass app<\/a>, for instance, notifies the wearer that she is in close proximity to a property that meets her search criteria. She’s able to flip through the property’s photos and, in a somewhat robotic voice, Glass will read the property’s description and price. If the buyer wants to see the house, the app will utilize Google Maps to provide directions.<\/p>\n<h2>Drones<\/h2>\n<p>The last thing most agents want is for their clients to think of them as robotic.<\/p>\n<p>Using a drone to capture images and video of a client’s property is &#8211; while highly automated and robotic &#8211; something that enhances an agent’s business and impresses the daylights out of clients.<\/p>\n<p>If you think you need a crane or a helicopter to get a certain shot, get a drone: They’re much less expensive and can go places cranes and helicopters can’t.<\/p>\n<p>The drone used by Kris Lindahl, an agent with Edina Realty Minnesota, is just the latest addition to his already-stuffed tech toolbox. The camera-equipped UAV (unmanned aerial vehicle) weighs less than 3 pounds and resembles a remote-control airplane, as opposed to the military’s spy or bomber drones.<\/p>\n<p>Lindahl’s drone soars to 1,000 feet in the air &#8211; although the FAA has tethered civilian drones to a 400-foot limit &#8211; at a snappy 35 miles per hour. The photo or feed is sent directly to Lindahl’s iPhone. The only things lacking, he quips, are speakers that blast out Wagner&#8217;s &#8220;Ride of the Valkyries&#8221; as it zips through a house or hovers over neighborhoods.<\/p>\n<p>Not all drones look like little airplanes. Bob Sokoler, a RE\/MAX agent in Louisville, Ky., prefers the helicopter-type UAV. “It basically looks like a helicopter, but instead of one blade it’s got four blades,” he said. He attached a camera to the contraption and let it fly. “My thinking was that I would attach a camera to it, fly the camera in and shoot video of our listings to see what the house looks like from the air,” he explained.<\/p>\n<p>As a former TV newsman, Sokoler is picky about the quality of his videos and felt that his drone didn’t have the power to get the shots he needed. As a self-described techno-geek he decided to have a new copter custom-made. “I get excited about what this technology can do. I can combine my passions of photography and technology with real estate and provide another wow factor to our clients,” he said.<\/p>\n<p>Drones aren’t just for the exterior aerial shots. Lindahl uses his to record the interiors of homes, especially those with high ceilings. Liability is something always top-of-mind, so humans and pets aren’t allowed in any room where the drone is working.<\/p>\n<p>Google Glass and UAVs probably aren’t for every agent. But for luxury agents especially, who can easily spend thousands to charter aircraft to video their listings, drones may just be indispensable in the future.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>There was a long period when the real estate industry stubbornly refused to change with the times. Agents and brokers had to be dragged – kicking and screaming – into the age of technology. They faced a steep learning curve and scaled it admirably. Today, agents are not only technological whizzes, but some are at [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[35],"tags":[415,416,304,245,87,277,279,32,56,417,375,329],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/26941"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=26941"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/26941\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=26941"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=26941"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=26941"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}