{"id":27051,"date":"2014-03-10T14:27:09","date_gmt":"2014-03-10T14:27:09","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=27051"},"modified":"2017-08-10T13:00:56","modified_gmt":"2017-08-10T20:00:56","slug":"5-marketing-strategies-for-new-agents","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/5-marketing-strategies-for-new-agents\/","title":{"rendered":"5 Marketing Strategies for New Agents"},"content":{"rendered":"<p>Welcome to the real estate industry, rookie! You are joining a group of people from diverse backgrounds yet they have one thing in common: They all want to make it in real estate.<\/p>\n<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-27071\" title=\"Marketing Strategies for New Agents\" src=\"\/wp-content\/uploads\/2014\/03\/Fotolia_61921347_XS-300x240.jpg\" alt=\"There are five important marketing strategies for real estate agents to implement when just starting their careers\" width=\"300\" height=\"240\" \/>The first months in the business are the toughest. Where will you get clients? How will you make money? Unless you have a huge sphere of influence, you’ll need to market yourself and your business.<\/p>\n<p>A lot of real estate agent advisors recommend that new agents set a marketing budget. We feel it’s a bit early for that. After all, you have nothing coming in and won’t until you round up some clients. Luckily, some real estate marketing techniques require no money &#8211; while others are worth every penny you spend and will be with you throughout your career.<\/p>\n<p>Let’s take a look at five essential marketing tips for a new agent to hit the ground running in the early days of his or her career.<\/p>\n<h2>1. Get a Website<\/h2>\n<p>Every agent needs a website, complete with IDX &#8211; a way for consumers to search current listings. IDX stands for “Internet Data Exchange,” the software that brings MLS listings to agents’ websites.<\/p>\n<p>Aside from IDX, the three most important elements of your website are:<\/p>\n<ul>\n<li>A lead-capture system.<\/li>\n<li>A blog.<\/li>\n<li>Winning content.<\/li>\n<\/ul>\n<p>While search engine optimization is important in the long run, new agents should concentrate on developing a professional website that includes the basics. Give potential clients a place to find you on the Internet. The pricey bells and whistles can come later, after you have a few deals under your belt.<\/p>\n<h2>2. Tell the World<\/h2>\n<p>Hey, you got your real estate license! It’s time to let everyone know about this milestone, so get on your social media sites and tell the world. Be sure to include your website’s URL in all posts initially.<\/p>\n<p>Of course, you’ll be blogging, right? Blog posts and other content from your website should be pushed out to your social media network. Don’t be overly “salesy” about it: Just post the link with a compelling headline to get people to click on it.<\/p>\n<p>Online blabbing isn’t enough, however. You need to tell every person you know that you’re now in real estate. This includes people you don’t know well, but see frequently, such as the barista who makes your morning coffee, the lady at the supermarket checkout stand, and the teller at your bank. Take plenty of business cards with you when you leave the house in the morning and pass out as many as possible.<\/p>\n<p>Consider sending mailers out to your community to spread the word that there&#8217;s a new agent in town. <\/p>\n<p>Ask these people to join you on Facebook and Twitter. If possible, get their email addresses to load into your database.<\/p>\n<h2>3. Choose a Farm Area<\/h2>\n<p>Farming is a tried and true real estate lead generation technique that involves targeting a small geographic market. Sure, it’s an old technique, but it works. It is especially good for a new agent because it forces you to focus on one area and learn all you can about it, thus allowing you to be an expert quickly.<\/p>\n<p>Farms can be any size, but for newbies it’s probably best to choose a smaller area &#8211; about 200 homes to start. You can always add to your target area later on.<\/p>\n<p>To determine which neighborhood or area to target, consider the following:<\/p>\n<ul>\n<li>Your own neighborhood is always a good place to start farming. You’re familiar with it, you may know some of the neighbors, and it’s convenient.<\/li>\n<\/ul>\n<ul>\n<li>Some new agents choose an area with a desirable price range. When you know how much you need to make per commission check, you can choose a farm area based on average sales price in the area.<\/li>\n<\/ul>\n<ul>\n<li>If you plan to choose a niche market, build your farm around that. Niches to consider include golf course homes, condos, waterfront properties, luxury homes and ranch properties.<\/li>\n<\/ul>\n<p>Not only is it important to know the prices of all homes currently on the market, but the history of the farm area’s sales as well. You can get this information from your MLS. Go back at least 12 months and study all the sold properties in the area.<\/p>\n<p>You simply must preview every home for sale, as they come on the market. The only way you can speak intelligently to area residents and buyers shopping in the area is by seeing the inside of each home. Take your time when you tour the homes, making note of interesting features and aspects.<\/p>\n<p>“I go through every house that comes on the market so that I’m not just looking at comps on paper,” says David Kean of Teles Properties in Beverly Hills, Calif. “I have actually been through each house and I know the layout; I know if there’s a telephone pole blocking the view,” he concludes.<\/p>\n<p>Think of how much credibility you’ll build when a buyer mentions a home at 123 Main Street and, off the top of your head, you can tell her about the oversized closet in the master bedroom and how the current owners use the den.<\/p>\n<p>Once you have a list of addresses for your farm area, it’s time to get the homeowners’ information into a database and the homeowners integrated into a marketing campaign. Unsure of where to start? Real estate farming postcards are a surprisingly effective way to turn prospects into clients.<\/p>\n<hr \/>\n<p>\n<a href=\"http:\/\/www.marketleader.com\/products\/professional-for-agents\/\"><img class=\"alignleft size-medium wp-image-44201\" src=\"http:\/\/www.marketleader.com\/wp-content\/uploads\/2016\/02\/Blog-CTA-arrows-2.png\" alt=\"Learn more about Market Leader Professional\"><\/a><strong><em>NEED MARKETING HELP? Agents can create automated email or direct mail campaigns from thousands of customizable templates using Market Leader Professional&#8217;s marketing center. <\/em><a href=\"http:\/\/www.marketleader.com\/products\/professional-for-agents\/\">LEARN MORE &gt;&gt;<\/a><\/strong><\/p>\n<hr \/>\n<h2>4. Build Your CRM<\/h2>\n<p>Scraps of paper get lost. Index cards are just plain old-school. Start your real estate business right with a robust customer relationship management (CRM) solution. This is the tool you’ll use most frequently and rely on the most in your real estate practice, so get the best that money can buy.<\/p>\n<p>The best CRMs come equipped with contact management tools, making it easy to maintain communication with potential and past clients. You’ll also need the ability to set up automated marketing campaigns. If the software offers templates &#8211; for newsletters, flyers, postcards and other marketing pieces &#8211; you’ve hit the jackpot.<\/p>\n<h2>5. Start an Email Drip Campaign<\/h2>\n<p>There is probably no worse moment in real estate than finding out a friend, associate or past client has used another agent. If you do your job right and provide excellent customer service, the only reason this might happen is that the person forgot you are in real estate. It happens all too frequently.<\/p>\n<p>It doesn’t happen to agents who work hard at remaining top-of-mind with those in their sphere of influence. With an automated email campaign you can be out pounding the pavement while your email software reminds everyone in your sphere that you’re in the real estate business.<\/p>\n<p>Taking the real estate licensing courses and sitting for the state exam were the first and easiest steps to becoming a real estate agent. You’re now a business owner, wearing many hats. The most important hat of all is that of marketer, and, fortunately, the marketer’s tasks can be done on a shoestring when you’re just starting out.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Welcome to the real estate industry, rookie! You are joining a group of people from diverse backgrounds yet they have one thing in common: They all want to make it in real estate. The first months in the business are the toughest. Where will you get clients? How will you make money? Unless you have [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[35],"tags":[190,106,101,275,267,407,44,268,87,56,136],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/27051"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=27051"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/27051\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=27051"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=27051"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=27051"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}