{"id":27261,"date":"2014-03-17T15:52:32","date_gmt":"2014-03-17T15:52:32","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=27261"},"modified":"2021-11-30T10:38:46","modified_gmt":"2021-11-30T18:38:46","slug":"agent-spotlight-cathy-daniel-of-brentwood-calif","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/agent-spotlight-cathy-daniel-of-brentwood-calif\/","title":{"rendered":"Agent Spotlight: Cathy Daniel of Brentwood, Calif."},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-27281\" title=\"Agent Spotlight - Cathy Daniel\" src=\"\/wp-content\/uploads\/2014\/03\/CathyDanielPhoto080418-1-258x300.jpg\" alt=\"Cathy Daniel is a real estate agent in Brentwood, California\" width=\"258\" height=\"300\" \/>Cathy Daniel, an <a href=\"https:\/\/www.facebook.com\/Cathy-Daniel-Realtor-543567616106309\/\">agent in Brentwood, Calif.<\/a>, had a childhood dream of becoming Party Barbie. With both parents in the real estate industry, however, her destiny ran more to Real Estate Barbie, or so said her first broker.<\/p>\n<p>“I studied for my license in 1979 and got my first license in 1980. At the time I worked for Century 21 in Ontario, Calif., and I was so young and so naïve,” Daniel recalls. “The manager there told me that I was too young, too blonde and to come back when I was older.”<\/p>\n<p>So, she did – eventually. First, Daniel worked in the grocery business, in a variety of positions. “I was kind of a jack of all trades in the grocery business. I actually loved it, but it’s not a very loyal business to people that wanted to be loyal to it,” she said. The union and employee problems eventually took their toll, and Daniel found herself in Northern California helping to open a Keller Williams office.<\/p>\n<p>She sat once again for her real estate license exam and hasn’t looked back over the past 11 years. “Realty is such a part of who I am, my culture,” Daniel explained. “My mom and step dad are in the business. My stepdad is a commercial broker in Phoenix and my mom is a residential broker in Phoenix, and that’s all we talk about all the time; it’s all-consuming,” she concluded.<\/p>\n<h2>Challenges<\/h2>\n<p>Daniel is raising her grandchildren, ages 6 and 8, so her biggest challenges revolve around running a business while simultaneously raising a family. “Starting over, being on call 24-7 &#8211; because you really are on call 24\/7 &#8211; it takes a toll on your psyche, on your mental well-being,” she explains. “Right now, at this point in time, I consciously make an effort to not work as much. Yet, if I don’t work, I don’t get paid. So, right now, my biggest challenge is that I’m not getting paid because I’m not able to work as much.”<\/p>\n<p>Lucky for Daniel, she found Market Leader about six years ago. Instead of hitting the pavement every day trying to drum up leads, she gets them from Market Leader, freeing up time for her to spend with the girls.<\/p>\n<p>“About 99 percent of my business is from Market Leader,” Daniel said. “I don’t think I’d <em>be<\/em> in business without them.”<\/p>\n<h2>Life Outside of Real Estate<\/h2>\n<p>Daniel, a recipient of U.S. Congressional recognition for her work with veterans, always finds time to volunteer. She’s on the board of the Brentwood Police Activity League, is in the Rotary and participates in several other civic organizations.<\/p>\n<p>“If you’re not volunteering in your community, you’re doing your neighborhood a disservice,” she said. “If I won Mega Millions tomorrow, I’d be a professional volunteer.”<\/p>\n<p>Motherhood the second time around keeps Daniel busy, and the tug of war between family and work is challenging. “My biggest challenge is wrapping my head around the fact that I don’t have to be everything to everybody,” she explains. “In fact, my new favorite word is “next.”<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Cathy Daniel, an agent in Brentwood, Calif., had a childhood dream of becoming Party Barbie. With both parents in the real estate industry, however, her destiny ran more to Real Estate Barbie, or so said her first broker. “I studied for my license in 1979 and got my first license in 1980. At the time [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[78,83],"tags":[190,106,275,56],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/27261"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=27261"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/27261\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=27261"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=27261"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=27261"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}