{"id":27461,"date":"2014-03-19T17:10:16","date_gmt":"2014-03-19T17:10:16","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=27461"},"modified":"2022-01-26T14:34:04","modified_gmt":"2022-01-26T22:34:04","slug":"3-stats-to-evaluate-your-email-effectiveness","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/3-stats-to-evaluate-your-email-effectiveness\/","title":{"rendered":"3 Stats to Evaluate Your Email Effectiveness"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-27481\" title=\"3 Stats to Evaluate Your Email Marketing\" src=\"\/wp-content\/uploads\/2014\/03\/Fotolia_58744078_XS-300x300.jpg\" alt=\"Email is a great marketing tool for real estate agents, but it's important to follow certain stats to ensure your emails are helping turn leads into clients\" width=\"300\" height=\"300\" \/>You probably already use email to communicate with your leads and clients. But do you know how your emails are performing? Are you sending the right message to your leads? Are they even reading your emails?<\/p>\n<p>As with any investment, you need to measure your ROI. In the case of email marketing, the main cost is the time you’re investing, but you still need to make sure you’re getting a good return. As your database of leads grow, email marketing is a great way to automate some of your communication and stay in touch in a meaningful way. But you want to make sure your emails are being read and helping your leads to become your clients.<\/p>\n<p>Don’t worry &#8211; you don’t have to spend tons of time with metrics to evaluate your email. By simply tracking three metrics, you can get a good sense of your email ROI:<\/p>\n<h2>1. Open Rate<\/h2>\n<p><strong><\/strong>This is the percentage of prospects that open your emails. This percentage tells you how many people viewed and potentially read your email. The subject line of an email and how often you send emails to your contacts heavily influence open rates. If you send too many emails, especially when the content and subject lines are not interesting to your audience, the open rate will be low.<\/p>\n<p><strong>Ways to improve open rate: <\/strong>Focus on <a href=\"\/blog\/dont-let-your-real-estate-newsletters-end-up-in-the-trash\/\">subject lines<\/a> and content that is relevant and interesting to your audience. For example, a first-time homebuyer is not likely to be interested in home staging tips. Listings appeal to buyers and sellers, but make sure the listings you send are relevant to your leads based on the searches they did on your site. Subject lines should pique readers’ interest and describe the content of the email, but don’t let it get too long. Limit the subject line to less than 150 characters.<\/p>\n<h2>2. Click-Through Rate<\/h2>\n<p><strong><\/strong>The CTR is the percentage of prospects that click through your email to whatever content you’re promoting (your blog, a featured listing, etc.). In order to track this metric, you will need to include a clickable link in all your emails. This is a best practice to ensure your leads are interacting with you and your website, instead of going elsewhere.<\/p>\n<p>Click-through rate is an important metric to track because it measures what percentage of the total audience is consuming your content. This lets you know if the people who opened your email found it interesting enough to continue on to your site.<\/p>\n<p><strong>Way to improve CTR:<\/strong> Include a link to your website in all emails. Segmenting your lead database according to their interests and interactions, and then sending targeted messages to each segment is the best way to increase click-through rate. This will ensure that relevant content reaches the prospects that find it most interesting.<\/p>\n<h2>3. Conversions<\/h2>\n<p><strong><\/strong>This refers to the number of people that do the call to action from your email. The conversion rate is a percentage of people that complete the conversion action. For example, if you send a link to listings, a conversion could be saving the listing or replying to ask for more information. If you send a link to a blog article, a conversion could be viewing additional blog posts or signing up for your newsletter. Conversions are the goal of your email. Tracking them will let you know if people are responding to your emails with the actions you would like.<\/p>\n<p><strong>Ways to improve conversions: <\/strong>The best way to improve conversions is to have a clear call to action for your email. Tell your audience what you would like them to do and how to do it. Provide links to direct readers right to the content you would like them to see, and make the process to complete the conversion as simple as possible. If your conversion rate isn’t good, make sure your website landing page (the part of the site you linked to in your email) also displays the call to action clearly and that it can be completed easily.<\/p>\n<p>By taking a look at whether people are opening your emails, clicking through to your website, or completing your desired conversion, you can determine how effective your email campaigns are. This will help identify which leads are interacting the most with your email and site.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>You probably already use email to communicate with your leads and clients. But do you know how your emails are performing? Are you sending the right message to your leads? Are they even reading your emails? As with any investment, you need to measure your ROI. In the case of email marketing, the main cost [&hellip;]<\/p>\n","protected":false},"author":29,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[35],"tags":[106,423,124,201,86,424,425,426,44,126,87,427,160],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/27461"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/29"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=27461"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/27461\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=27461"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=27461"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=27461"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}