{"id":27551,"date":"2014-03-24T16:20:06","date_gmt":"2014-03-24T16:20:06","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=27551"},"modified":"2022-09-02T11:23:43","modified_gmt":"2022-09-02T18:23:43","slug":"agent-spotlight-rick-hogue-of-louisville-ky","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/agent-spotlight-rick-hogue-of-louisville-ky\/","title":{"rendered":"Agent Spotlight: Rick Hogue of Louisville, Ky."},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-27561\" title=\"Agent Spotlight - Rick Hogue\" src=\"\/wp-content\/uploads\/2014\/03\/Rick-Hogue-273x300.jpg\" alt=\"Rick Hogue is a real estate agent in Louisville, Kentucky\" width=\"273\" height=\"300\" \/>If it’s true that people with a lot of interests are interesting people, then you’ll be fascinated by <a href=\"https:\/\/www.linkedin.com\/in\/rick-hogue-920940a\/\">Rick Hogue<\/a>, an agent in Louisville, Ky. We certainly are, and we’d love to share what we’ve learned about him and his growing real estate practice with Keller Williams.<\/p>\n<p>Hogue is a native Kentuckian, and although he attended the University of Kentucky with an eye toward engineering, he ended up in the U.S. Marine Corps, where he remained for six years.<\/p>\n<h2>The Path to Real Estate<\/h2>\n<p>Hogue kicked around a bit after his discharge from the Marines and ended up in culinary school in Chicago and New York, where he studied to be a pastry chef and proceeded to “gain way too much weight,” he said, laughing.<\/p>\n<p>In 1990 he met Holly, his current wife, and they started an advertising firm. &#8220;We did advertising set-up for companies and worked with corporations on their ad campaigns and full color work,” he said. Most of the companies, such as McDonnell Douglas and Boeing, weren’t local, so the Hogues became one of the first ad companies to utilize file transfer protocol or email to submit proofs.<\/p>\n<p>This experience put them on the leading edge of the World Wide Web, and they took advantage of the opportunity. “We developed websites for everyone from the federal government to a baseball team to banks and banking operations &#8211; we did back-ends for them,” Hogue explained. They also provided hosting. “Then, 2000 hit and we didn’t know it, but we were already out of business,” he continued.<\/p>\n<p>“When the technology bubble burst, people that we had been charging a large amount of money for hosting could all of a sudden get that same hosting for almost nothing,” he recalled. “We lasted until about 2007 when I finally looked at my wife and said, ‘Hey, I haven’t been getting a paycheck for a while &#8211; I’m going to go do something else.’”<\/p>\n<p>So in December of 2008, with a brand new real estate license, Hogue joined Keller Williams Louisville East, and he’s been with them ever since.<\/p>\n<h2>It’s About Time<\/h2>\n<p>Every business has its challenges. They never go away, but evolve over time. We asked Hogue what he’s facing at the six-year mark in his career.<\/p>\n<p>“Right now my biggest challenge is time management, more than anything else. I want it done now and I want it done my way,” he said, laughing. “Time is my nemesis.” He is finally at that point many agents get to when they decide they need help, and 2014 is the year he plans on putting together a team.<\/p>\n<h2>Marketing the Hogue Way<\/h2>\n<p>Having practically cut his teeth on the Internet before the rest of us knew what it was, Hogue depends heavily on online marketing. “I have 27 websites and various blogs, along with my eEdge – which is the biggest one I market,” he explained. “We get roughly 9,000 people a month at that website.” He pushes the site through social media, Craigslist, blogs, and he even has the site’s URL on his car.<\/p>\n<p>“We were averaging 200 to 300 signups a month at the site during its peak. Then Craigslist changed and we lost thousands of visitors every month,” he said. Last year, 38 percent of his business came from Craigslist.<\/p>\n<h2>When He’s Not Working<\/h2>\n<p>Hogue and his wife do a lot of charity work with the local zoo and 15Thousand Farmers, a group that teaches folks how to become sustainable backyard farmers and then provides them with everything they need to get started. “We donate rain barrels and other items every year.”<\/p>\n<p>He also has a horse-crazy, 9-year-old granddaughter who gets a lot of his attention when he’s not working.<\/p>\n<h2>Hogue and Market Leader<\/h2>\n<p>We’re always interested in how our clients became involved with Market Leader and how our products have impacted their businesses. Hogue was using Top Producer when he first got into the business. “It was the tool of choice,” he claimed.<\/p>\n<p>“It was a little clunky,” he continued, “so when Market Leader was first produced, I walked up to the booth at Family Reunion to see what they had. I took one look and told the guy I wanted to be an ambassador and wanted to go head over heels based just on what I saw,” Hogue said. “I dropped Top Producer within a week of when I took on eEdge.”<\/p>\n<p>He’s glad he did, too. His first year in the business he did a respectable 15 transactions. Once he started using Market Leader products, he did 37 transactions. “Considering the average agent in Louisville does about six transactions a year, to me, 37 is good,” he said.<\/p>\n<p>We asked Hogue about his most rewarding moments during a typical workweek. He didn’t hesitate before answering: “Smiling faces across the table when I hand them their keys.”<\/p>\n","protected":false},"excerpt":{"rendered":"<p>If it’s true that people with a lot of interests are interesting people, then you’ll be fascinated by Rick Hogue, an agent in Louisville, Ky. We certainly are, and we’d love to share what we’ve learned about him and his growing real estate practice with Keller Williams. Hogue is a native Kentuckian, and although he [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[78,83],"tags":[190,106,275,87,56],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/27551"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=27551"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/27551\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=27551"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=27551"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=27551"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}