{"id":28291,"date":"2014-05-01T09:00:08","date_gmt":"2014-05-01T09:00:08","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=28291"},"modified":"2022-01-26T14:33:03","modified_gmt":"2022-01-26T22:33:03","slug":"5-signs-you-are-a-happy-agent","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/5-signs-you-are-a-happy-agent\/","title":{"rendered":"5 Signs You Are a Happy Agent"},"content":{"rendered":"<p>In a recent survey called <a href=\"\/blog\/the-happiest-agent-on-the-block\/\">“The Happiest Agent on the Block,”<\/a> Market Leader asked over 3,000 real estate agents about how happy they are with their real estate careers, incomes, tasks they complete on a day-to-day basis, and life in general. Our analysis of the survey results revealed some interesting facts about the habits and traits of happy agents, offering insight into who agents are as people, not just professionals.<\/p>\n<h2>1. You&#8217;re Married<\/h2>\n<p><img src=\"\/wp-content\/uploads\/2014\/04\/tumblr_mr862tITZU1soja0jo1_500.gif\" alt=\"Married\" \/><\/p>\n<p>Married agents tend to be happy agents. The “Happiest Agent on the Block” survey revealed that married agents are more likely to be happy than single agents, especially those that have never tied the knot.<\/p>\n<p>The positive correlation between marriage and happiness in the real estate industry is <a href=\"https:\/\/freakonomics.com\/podcast\/why-marry-part-1-a-new-freakonomics-radio-podcast\/\">also found in the rest of the U.S.<\/a> Both of these correlations are mostly due to the fact that married people also possess qualities that are conducive for their happiness (e.g., they have good health, active social lives, and steady employment).<\/p>\n<h2>2. You Use an iPad<\/h2>\n<p><img src=\"\/wp-content\/uploads\/2014\/04\/dogipad.gif\" alt=\"dog ipad\" \/><\/p>\n<p>Real estate agents who use iPads are more likely be happy with their careers than agents who use Android tablets like the Samsung Galaxy Tab (although both groups are more likely to be happy than agents who do not use tablets at all).<\/p>\n<p>Other popular Apple products also seem to impact happiness. Agents who use iPhones and Mac computers are more likely to be happy with their real estate careers than agents who use Android phones and PCs. It is possible that agents who use Apple products perceive themselves as being more happy than they really are thanks to Apple’s hip, youth-oriented marketing campaigns.<\/p>\n<h2>3. You Wake Up Early<\/h2>\n<p><img src=\"\/wp-content\/uploads\/2014\/04\/cat-wake-up.gif\" alt=\"cat waking you up\" \/><\/p>\n<p>The adages “the early bird gets the worm” and “early to bed and early to rise, makes a man healthy, wealthy, and wise” both apply to the real estate industry. The earlier an agent goes to bed at night and wakes up each morning, the more likely he is to be happy with his real estate career. We found that agents who go to bed between 8 and 10 p.m. and wake up before 6 a.m. are most likely to be happy with their careers.<\/p>\n<h2>4. You Enjoy Meeting New People<\/h2>\n<p><img src=\"\/wp-content\/uploads\/2014\/04\/meeting-new-people.gif\" alt=\"meeting new people\" \/><\/p>\n<p>Of all the reasons real estate agents had for joining the industry, those who were interested in meeting new people are the most likely to now be happy with their careers. This isn’t surprising given that many day-to-day tasks, like following up with leads and going to client appointments, involve networking with new people.<\/p>\n<h2>5. You Make Bank!<\/h2>\n<p><img src=\"\/wp-content\/uploads\/2014\/04\/tumblr_mlom9lWR6h1qjfaqjo1_500.gif\" alt=\"money\" \/><\/p>\n<p>Of all the agent habits and traits touched on in the “Happiest Agent on the Block” survey, commission income had perhaps the most direct correlation with agent happiness. Simply put, the more money agents make, the more likely they are to be happy with their real estate careers. Agents who made over $150,000 in commission income in 2013 are a whopping 37 percent more likely to be happy with their careers than agents who made less than $10,000 that year!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>In a recent survey called “The Happiest Agent on the Block,” Market Leader asked over 3,000 real estate agents about how happy they are with their real estate careers, incomes, tasks they complete on a day-to-day basis, and life in general. Our analysis of the survey results revealed some interesting facts about the habits and [&hellip;]<\/p>\n","protected":false},"author":29,"featured_media":28831,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[83],"tags":[190,433,391,434,435,436,56,96],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/28291"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/29"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=28291"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/28291\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=28291"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=28291"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=28291"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}