{"id":28721,"date":"2014-04-07T16:37:33","date_gmt":"2014-04-07T16:37:33","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=28721"},"modified":"2021-11-30T10:39:37","modified_gmt":"2021-11-30T18:39:37","slug":"agent-spotlight-nancy-braun-of-charlotte-nc","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/agent-spotlight-nancy-braun-of-charlotte-nc\/","title":{"rendered":"Agent Spotlight: Nancy Braun of Charlotte, NC"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-28741\" title=\"Agent Spotlight - Nancy Braun\" src=\"\/wp-content\/uploads\/2014\/04\/Nancy-Braun-300x273.jpg\" alt=\"Nancy Braun is a real estate broker in Charlotte, North Carolina\" width=\"300\" height=\"273\" \/>Real estate agents typically don’t start their working lives in the industry, but rather hail from a broad array of businesses. For some, like <a href=\"https:\/\/showcaserealty.net\/\">Nancy Braun<\/a>, Showcase Realty Charlotte’s broker\/owner, real estate may be a third or even fourth career.<\/p>\n<p>Braun was born in New York and attended Cornell University, where she received a degree in industrial and labor relations. She went on to SUNY Buffalo Law School from there and, upon graduation, entered the world of corporate law.<\/p>\n<p>Act II finds Braun leaving that world behind and opening a restaurant in Buffalo. For five years, this chef\/owner thrived in the culinary world. As so many stories go, however, when the economy tanked, so did Braun’s restaurant.<\/p>\n<p>“I survived, but I didn’t make a living,” she recalled. “I didn’t see any future in it. It was a question of moving my restaurant or moving me, so I moved me,” she concluded. “I really don’t like the cold anyway,” she added, laughing.<\/p>\n<h2>To Charlotte<span style=\"font-size: 13px;\"> <\/span><\/h2>\n<p>So where does one go to escape the frigid winters in Buffalo, N.Y.? About 650 miles south would do the trick, according to Braun.<\/p>\n<p>“I didn’t really know much about Charlotte, but I heard it had a good economy, nice weather, nice people and that it would be open to newcomers. It lived up to all those dreams,” she said.<\/p>\n<p>With the new location chosen, all that was needed was a career focus. “I didn’t know what I wanted to do,” she explained. “I applied to law jobs, and I was looking for a restaurant.” Her dad stepped in, however, and encouraged her to get into real estate.<\/p>\n<h2>Challenges<\/h2>\n<p>We all have challenges at different points in our careers, and we wondered what Braun’s are at the almost-20-year mark.<\/p>\n<p>“My biggest challenge is changing up how we do business &#8211; implementing change &#8211; and getting a different mindset for the staff and the agents,” Braun said. “The world is changing, so implementing new systems and programs &#8211; new ways of generating new business &#8211; and getting people to understand that the old school doesn’t really work today with the Internet world and the fast pace. Just adapting to change is probably my biggest challenge.”<\/p>\n<p>As owner\/broker of her own real estate firm, Braun has her hands full. She has 50 people depending on her, including staff, agents and independent contractors. Obtaining leads for her agents takes up a large chunk of time, as does hitting the pavement every day as an active sales agent.<\/p>\n<h2>Marketing<\/h2>\n<p>Braun uses a mix of marketing methods to get the word out about Showcase Realty, its agents and listings. “We have a weekly radio show on a major news channel. We do a lot of postcard mailings, and we have very good Internet exposure – a strong social media presence and blogs,” she explained.<\/p>\n<p>The firm also uses an SEO coach. “She helps us with our SEO development and some of our Internet marketing initiatives,” Braun said. It was this coach that insisted the company go with a Market Leader site.<\/p>\n<p>“We have over 5,000 leads in our Market Leader system and they’re all assigned to a drip system,” Braun said. “It works well. I like that you can individualize them. You can have a basic drip campaign and then you can implement your own stuff within that campaign. It’s also easy-to-use for the consumer.”<\/p>\n<p>She gives her agents and staff a lot of credit for coming up with interesting marketing ideas. “I have a strong staff of very creative people, so that’s kind of fun. It’s a young and dynamic team of people, and I kind of give them a lot of freedom so they can grow and implement really cool marketing strategies.”<\/p>\n<h2>Where’s Nancy?<\/h2>\n<p>When she isn’t working you can find Braun with her two children, ages 8 and 9. “We had a big bake sale yesterday and we raised $104 for dogs and cats that are homeless,” she explained when we asked what sort of things the family enjoys doing. “It was my son’s idea and it was really special. I had to get up early in the morning and bake. Then we sat outside in our neighborhood and sold our baked goods and beverages, and it was really fun,” Braun continued.<\/p>\n<p>“I like the fact that he did it for charity – that was the whole point. He wanted to do it for dogs and cats. He first came up with the idea of making money for animals and then he said, ‘Mommy, you’re going to do a bake sale,’” she said, laughing.<\/p>\n<h2>Giving Back<\/h2>\n<p>As much as Braun loves the real estate business and enjoys running her own brokerage, it was when we asked her about her community work that she got excited. The Boys and Girls Club of Greater Charlotte has a huge fan in Nancy Braun.<\/p>\n<p>“I’m the chairperson of resource development, which means I’m in charge of all their fundraisers,” she explains. “They really save children’s lives; it’s not just a Band-Aid,” she continues. “Sixty percent of the kids in Boys and Girls Clubs say that it has saved their lives. It provides them with mentoring and love and support, and a place to go after school when they might not have anywhere else to go,” she continues.<\/p>\n<p>“They have people that care about them. It makes a big difference to be cared about.”<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Real estate agents typically don’t start their working lives in the industry, but rather hail from a broad array of businesses. For some, like Nancy Braun, Showcase Realty Charlotte’s broker\/owner, real estate may be a third or even fourth career. Braun was born in New York and attended Cornell University, where she received a degree [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[78,83],"tags":[190,307,106,275,87,56],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/28721"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=28721"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/28721\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=28721"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=28721"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=28721"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}