{"id":28851,"date":"2014-04-11T00:38:02","date_gmt":"2014-04-11T00:38:02","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=28851"},"modified":"2022-07-11T15:54:49","modified_gmt":"2022-07-11T22:54:49","slug":"takeaways-from-the-real-estate-barcamp-trenches-greater-seattle-2014","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/takeaways-from-the-real-estate-barcamp-trenches-greater-seattle-2014\/","title":{"rendered":"Takeaways From the Real Estate BarCamp Trenches – Greater Seattle 2014"},"content":{"rendered":"<p>On March 13, 2014, over 200 real estate professionals met in Tukwila, Wash., for REBarCamp (aka REBC) to spend the day making new connections, networking, listening, and learning from each other on how to master and grow their real estate businesses. The format and rules for the event were simple: share your advice, lean in, participate in conversations, no sales pitches or presentations, all thoughts and opinions are welcome, and utilize the “two-feet rule,” which means get up and walk out of the session if it doesn’t met your expectations or needs. And lastly, a reminder that this is an “unconference” – participants are to share and mastermind with attendees and walk home with actionable ideas.<\/p>\n<p>Since it was my first time attending and the first time Market Leader was an event sponsor at a unconference of this nature, I was on the edge of my seat with excitement. Upon check-in, I wrote down a few topics on index cards that I wanted to learn more about and felt I could contribute to. But I didn’t know until the final agenda was posted which ones would make the list.<\/p>\n<p>Once the agenda with room assignments was posted (see image to right), I realized I was in for a treat since many of my favorites made the list. Here are the big “a-has” that I walked home with from this event:<\/p>\n<h2>#1: Develop a Strategic Social Media Plan<\/h2>\n<p>You can’t reach an end goal unless you know where you currently stand. Same goes with growing your real estate practice. You must first develop a strategic plan that includes outlining and defining the following:<\/p>\n<ul>\n<li><strong>Plan Goal(s)\/Objective(s)<\/strong> – your business goals.<\/li>\n<li><strong>Strategies<\/strong> – Outline the steps you’ll take to achieve your goals.<\/li>\n<li><strong>Success Metrics<\/strong> – How will you measure your goals?<\/li>\n<li><strong>Conduct a SWOT analysis of your current social media efforts<\/strong> – Outline strengths, weaknesses, opportunities and threats and\/or benchmarks of other companies in your niche. Check out <a href=\"\/blog\/swot-analysis-for-real-estate-agents\/\">these tips for creating a real estate SWOT analysis<\/a> if you need help.<\/li>\n<li><strong>Audience(s)<\/strong> – Identify your key target market.<\/li>\n<li><strong>Core value messaging<\/strong> – Define your company’s mission statement, vision and core values*.<\/li>\n<li><strong>Timing<\/strong> – Create an editorial calendar or approach to your plan.<\/li>\n<li><strong>Action Plan<\/strong> – tactical steps.<\/li>\n<\/ul>\n<p><em><span style=\"color: #ff0000;\"><span style=\"color: #993300;\">*Tip: Click<\/span> <a href=\"http:\/\/d11consulting.com\/\">here<\/a> <span style=\"color: #993300;\">to download a free ebook, “Define Your Core Values,” by<\/span> <a href=\"https:\/\/twitter.com\/debra11\">Debra Trappen<\/a><span style=\"color: #993300;\">.<\/span><\/span><\/em><\/p>\n<h2><img loading=\"lazy\" class=\"alignleft  wp-image-28991\" src=\"\/wp-content\/uploads\/2014\/04\/Agent-Fishing2-300x200.jpg\" alt=\"Real estate agents use a lead generation solution to fish for leads \" width=\"240\" height=\"160\" \/>#2: Learn to Fish Using Your Own Bait &amp; Strong Lures<\/h2>\n<p>You’ve heard the Chinese Proverb: “Give a man a fish and you feed him for a day. Teach a man to fish and you feed him for a lifetime.” Same goes with generating leads in real estate, you could fish on your own, but you’ll be more successful having the right tools in your tackle box.<\/p>\n<p>One must learn how to attract and find online buyers and sellers and which tools to use to “hook” them as quickly as possible. As discussed at REBC, the secrets to catching or engaging an online lead include building <strong>TRUST<\/strong>, being <strong>RESPONSIVE<\/strong> preferably, being the first to respond to a lead within the first five minutes, and engaging your leads with listing alerts and campaigns using your business <strong>CORE VALUES<\/strong> in your marketing pieces, messaging, team culture and sales approach to attract your ideal target audience. You also want to be sure your bait is good – providing fresh, relevant <strong>CONTENT<\/strong> that pertains to your <strong>AUDIENCE<\/strong> will keep them coming back. Purchasing leads (aka lures) from companies like Trulia or Market Leader will provide you with opportunities and new leads to keep your sales pipeline full and teach you how to fish so your business is successful for a lifetime.<\/p>\n<p><span style=\"color: #993300;\"><em>Want to catch more fish? Download our free guide, “<a href=\"http:\/\/www.marketleader.com\/landing\/lead_generation_guide?lsr=AI-ROW-Organic-BLG-CompleteGuideToLeadGeneration&amp;del=CGLeadGeneration&amp;Brd=ROW&amp;Chl=Organic&amp;Cpgn=CompleteGuideToLeadGeneration&amp;SChl=BLG\">Complete Guide to Lead Generation,<\/a>” to learn key strategies to generate more online leads.<\/em><\/span><\/p>\n<h2>#3: Be Authentic &amp; Real<\/h2>\n<p>People love stories. Marketing messages via storytelling is trending these days. Why? Consumers are more likely to purchase based on an emotional response. Four reasons consumers most likely don’t buy from you: no trust, no need, no money, or no urgency. Stories evoke emotion and build trust. Test different mediums to showcase your authentic self – use video to share a welcome message, write a blog that shares your insights and knowledge, use an e-newsletter to stay in touch with customers. Make it engaging and human. After all, you’re working with people.<\/p>\n<p><span style=\"color: #993300;\"><em>“People don&#8217;t buy what you do; they buy why you do it. And what you do simply proves what you believe.” ― Simon Sinek, author of “Start with Why: How Great Leaders Inspire Everyone to Take Action”<\/em><\/span><\/p>\n<h2>#4: It’s Not About YOU<\/h2>\n<p>Don’t post an image of one of your current listings on your Facebook business page and expect your sphere of influence to like and share it. Instead, share stories, client testimonials or a link to a current real estate listing marketing video. The video can show how you hired a professional videographer, a drone, and professional actors – demonstrating your occupation as a Realtor®, your brand niche, your expertise and a taste of your passion.<\/p>\n<p><span style=\"color: #993300;\"><em>Tip: To WIN you’ve got to first GIVE. And Market Leader did just that by giving away a $50 Amazon gift card at this event. Congratulations again to <a href=\"https:\/\/twitter.com\/seattlecondo\">Ben Kakimoto<\/a> with Keller Williams Greater Seattle who was selected as our winner!<\/em><\/span><\/p>\n<h2>#5: Be Purposeful With Prospecting<\/h2>\n<p>Each social network has a different purpose and culture of socializing. The key to your success in growing fans and followers is to determine how to spin the same content for each platform that connects with your audience and initiates a conversation. Someone at <em>REBarCamp<\/em> described this well:<\/p>\n<ul>\n<li><strong> Facebook<\/strong> is for posting news about a family barbecue party, not for posting all the homes you sold last week or hope to sell next month.<\/li>\n<li><strong> LinkedIn<\/strong> is for posting your resume, researching companies and networking, not for sharing your daughter’s dance recital photo.<\/li>\n<li><strong> Google Plus<\/strong> is for building relationships, sharing knowledge, and building SEO.<\/li>\n<li><strong> Pinterest<\/strong> is for building brand identity with the use of photos and images.<\/li>\n<\/ul>\n<h2>#6: Be Consistent<\/h2>\n<p>It sounds rudimentary, but the key to any social media strategy is being consistent. Create an editorial calendar and action plan, and keep your content consistent. Start with just one channel and build upon that while staying true to the messaging you defined in your plan.<\/p>\n<p><em>Have you attended a REBarCamp lately? If so, please share your insights in the comment section below. I look forward to fishing with you again very soon!<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>On March 13, 2014, over 200 real estate professionals met in Tukwila, Wash., for REBarCamp (aka REBC) to spend the day making new connections, networking, listening, and learning from each other on how to master and grow their real estate businesses. The format and rules for the event were simple: share your advice, lean in, [&hellip;]<\/p>\n","protected":false},"author":26,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[27],"tags":[54,87,56,437,438,439,440,57,118],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/28851"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/26"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=28851"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/28851\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=28851"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=28851"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=28851"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}