{"id":29091,"date":"2014-04-11T09:00:42","date_gmt":"2014-04-11T09:00:42","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=29091"},"modified":"2016-01-30T01:03:59","modified_gmt":"2016-01-30T01:03:59","slug":"marketing-tips-from-marketmix-2014","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/marketing-tips-from-marketmix-2014\/","title":{"rendered":"Marketing Tips From MarketMix 2014"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-29231\" title=\"Marketing Concept\" src=\"\/wp-content\/uploads\/2014\/04\/Fotolia_59082866_XS-300x191.jpg\" alt=\"MarketMix 2014 Marketing Conference\" width=\"300\" height=\"191\" \/><\/p>\n<p>Last week the marketing managers from Market Leader went to a local conference called <a> MarketMix 2014<\/a>. This daylong event was put on by the local chapter of the American Ma<br \/>\nrketing Association. The event had a lot of great speakers and insights, and while the tips offered were not necessarily from the real estate industry, we translated them to help your real estate business.<\/p>\n<p>Let’s take a look at three key insights from the conference.<\/p>\n<h2>1. Be Able to Answer: Why Does My Business Exist?<\/h2>\n<p>In the session presented by Andrew Sherrard, senior vice president of marketing at T-Mobile, we learned that T-Mobile completely rethought their overall strategy. They wondered:<\/p>\n<ul>\n<li>Why do we exist?<\/li>\n<li>Would anyone miss us?<\/li>\n<li>Would anyone create a similar company to us?<\/li>\n<li>What do people like or not like about our business?<\/li>\n<\/ul>\n<p>After answering those questions, T-Mobile changed its marketing, product plans and fees to reflect a new philosophy of “fair, simple, great value, and customer-focused” which led to their “Un-carrier” campaign.<\/p>\n<h3>Sure, that’s great, but how does this relate to real estate?<\/h3>\n<p>Before starting your marketing plan, it is best to first figure out why your business exists. What is the mission statement for your business? For example, “My business exists to help residents in my community find their ‘comfort zone’ (aka new home).” What is your value proposition, or summary of all the benefits you provide to homebuyers and sellers? In other words, why should they choose you instead of the agent down the street?<\/p>\n<p>Being able to answer these questions is a crucial step in developing your unique selling points, and your ability to convert your leads into clients. As you contemplate what distinguishes you from other agents and why your business exists, your goal should be to stand out to potential clients. Think about what would appeal to potential buyers.<br \/>\nSome ideas to stand out:<\/p>\n<ul>\n<ul>\n<li>Do you respond quickly? Many homebuyers complain that agents are hard to get ahold of. Is that you, or do you respond to all communications within five minutes?<\/li>\n<li>Do you have special offers, such as a home-buying guide, home warranty, or home staging services?<\/li>\n<li>Are you an area expert?<\/li>\n<li>Are you a specialist with a certain type of homebuyer, such as first-time homebuyers, veterans, or international buyers?<\/li>\n<\/ul>\n<\/ul>\n<p>After you have come up with your selling points, use them in your marketing and when you speak to potential customers. This should help you convert more leads to clients.<\/p>\n<h2>2. Personalize Your Marketing to Your Leads<\/h2>\n<p>Another session Market Leader attended was “Seven Technology Trends” with the director of marketing and personalization technology from Nordstrom. There were seven technology trends to pay attention to, including facial recognition, marketing profiles, wearables, data experimentation, triggered automation, and content automation, but the most relevant one to agents was personalization. Using behavioral data to create profiles is the new way of marketing. For instance, tracking what your audience is doing when they interact with you, including pages visited, clicks, apps used, emails read, or social interactions.<\/p>\n<p>Personalizing your marketing to your audience is key. In retail, which email do you think is more likely to get customers to buy shoes, one that shows similar shoes to those they viewed on a retail site, or an email showing a selection of random shoes? It should be obvious that the email with similar shoes is likely to have a better outcome. In fact, Nordstrom mentioned that 41 percent of consumers buy more from retailers who provide personalized emails.<\/p>\n<h3>How does this relate to real estate?<\/h3>\n<p>This is directly applicable to how you should think about your leads and emails. Segment your leads by their behavior on your website. Your emails should be targeted to a lead’s interest. A buyer who is looking at all single-family homes in a suburb probably would not be interested in a listing alert for condos in the city. Make sure your listing alerts match a lead’s search history on your site. By sending personalized relevant messages, you will better engage your leads and make your emails a resource, instead of an annoyance.<\/p>\n<h2>3. Believe in the Impossible<\/h2>\n<p>We got inspiration from the session with Liftport Lunar Space Elevator.<\/p>\n<p>&#8220;There is a profound difference between difficult, very very hard, and impossible,&#8221; according to Michael Laine. He is building an elevator from the moon into space, which might seem impossible, but his company is making it possible and is on track to be operational by 2020.<\/p>\n<p>In other words, aim high and not just say something is impossible. Don’t take no for an answer. Instead, create a goal for your business that you believe is almost impossible, and create a plan to get there. Also called a “vision statement,” this should be the best possible outcome of all your hard work. You might aim to be a millionaire, or double your monthly transactions, or to reach whatever goal will push your business to another level.<\/p>\n<p>That is how you grow your career and accomplish more then you thought possible.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Last week the marketing managers from Market Leader went to a local conference called MarketMix 2014. This daylong event was put on by the local chapter of the American Ma rketing Association. The event had a lot of great speakers and insights, and while the tips offered were not necessarily from the real estate industry, [&hellip;]<\/p>\n","protected":false},"author":29,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[97,27],"tags":[372,94,256,126,87,441,56,375],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/29091"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/29"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=29091"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/29091\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=29091"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=29091"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=29091"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}