{"id":29881,"date":"2014-04-16T17:51:47","date_gmt":"2014-04-16T17:51:47","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=29881"},"modified":"2021-11-19T11:31:21","modified_gmt":"2021-11-19T19:31:21","slug":"top-5-ways-to-fail-at-email-marketing","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/top-5-ways-to-fail-at-email-marketing\/","title":{"rendered":"Top 5 Ways to Fail at Email Marketing"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-29901\" title=\"Email Marketing\" src=\"\/wp-content\/uploads\/2014\/04\/Fotolia_62966708_XS-300x225.jpg\" alt=\"There are five things in particular that real estate agents should avoid doing if they want a successful email marketing campaign\" width=\"300\" height=\"225\" \/>It’s probably safe to say that nobody sets out to fail. The old saying goes that “failing to plan is planning to fail,” but that’s an inadvertent blunder.<\/p>\n<p>If you’re looking, however, for ways to be an utter failure with your email marketing campaign, read on for the top five ways to do so.<\/p>\n<h2>1. Sending the Same Email to All Your Leads<\/h2>\n<p>Put yourself in someone else’s shoes for a minute. Suppose you are one of your former clients, on a drip email campaign. The idea behind your agent sending these emails is to remain top of mind with you.<\/p>\n<p>The emails you receive, however, contain content geared toward purchasing a home. While you may be interested in selling and purchasing another home in the future, the content she sends is irrelevant to you at this point. It is so useless that you either automatically send the emails to the trash or you opt out of receiving them.<\/p>\n<p>List segmentation is vital to a successful drip email campaign. Chopping up your contact database and then tailoring the content in your emails to different groups of contacts amps your marketing game to a new level.<\/p>\n<p>Once you narrow the focus of the content to targeted groups within your CRM, don’t allow that content to become set in stone. <strong><\/strong><\/p>\n<p>If your response rate isn’t where you want it to be, turn it around by switching up what you send. Too many market updates can become boring after a while. Newsletters are an ideal way to provide valuable content, provided the content is truly valuable.<\/p>\n<h2>2. Making Your Emails All About You<\/h2>\n<p>Your email content should not be about selling you, but aimed toward helping the recipients find their dream home, get their current home sold or save money during a real estate transaction. Think about how you feel in the following social situations:<\/p>\n<ul>\n<li>The person that starts every conversation with “I.”<\/li>\n<li>The person that whips out the baby pictures upon every meeting.<\/li>\n<li>The person that hands you a business card (without being asked) at a wedding, baptism or other event that is inappropriate for marketing.<\/li>\n<\/ul>\n<p>Those types of people make you roll your eyes, right? Now, consider how you feel about people who:<\/p>\n<ul>\n<li>Immediately ask about your family.<\/li>\n<li>Ask you what you do for a living, what part of town you live in or about your interests.<\/li>\n<li>Ask to see photos of your children.<\/li>\n<\/ul>\n<p>The idea is to be the second type of person, someone who is interested, engaged and curious about others. This type of person doesn’t need to sell himself because his approach to others does it for him. Your email should do the same; you’re likely to get better engagement by asking your contacts about their home search rather than just trying to sell yourself.<\/p>\n<h2>3. Not Using a CRM<\/h2>\n<p>To not use a CRM in today’s real estate business is downright crazy and does nothing but lead to marketing-plan failure. A robust CRM makes it a snap to automate your communication and keep track of each and every contact you’ve made with your leads. It allows you – figuratively, at least – to be in two places at once.<\/p>\n<p>A CRM may also help increase your income. According to Forbes, studies have shown that companies using a CRM product can <a href=\"https:\/\/www.forbes.com\/sites\/aileron\/2013\/05\/01\/why-your-small-business-needs-crm\/?sh=1d9dd2b26008\">increase their sales<\/a> by 29 percent.<\/p>\n<h2>4. Forgetting the Importance of a Clear Call to Action<\/h2>\n<p>What matters most in an email drip campaign is that recipients do what you want them to do, as urged in your call to action.<\/p>\n<p>A compelling call to action is a text link that is simple and that stands out. Begin with a command verb, such as “Sign up” “Download” or “View.” Put lots of white space around it so that it’s obviously different from the rest of the email’s content.<\/p>\n<p>Pay attention to your click-through rate as it indicates the effectiveness of your call to action. Monitor and tweak until you find one that works.<\/p>\n<h2>5. Overlooking Professionalism<\/h2>\n<p>Unless you have a proofreader or editor on staff, it’s important to proofread your work to ensure typos or other errors are corrected. Prospects looking for a professional agent won’t be impressed by grammatical errors, broken links, and misspelled words.  After all, they may wonder, if you rush through your marketing, what other part of your business are you negligent about?<\/p>\n<p>While not many of us plan to fail, by not planning to succeed, we do ourselves and our businesses a disservice. If you take the time to properly set up your CRM, segment your database, target your content, come up with a compelling call to action, and proofread before you send an email, you’ll be on your way to a successful drip email campaign.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>It’s probably safe to say that nobody sets out to fail. The old saying goes that “failing to plan is planning to fail,” but that’s an inadvertent blunder. If you’re looking, however, for ways to be an utter failure with your email marketing campaign, read on for the top five ways to do so. 1. [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[35],"tags":[267,44,126,87,56],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/29881"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=29881"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/29881\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=29881"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=29881"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=29881"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}