{"id":30411,"date":"2014-04-22T16:04:39","date_gmt":"2014-04-22T16:04:39","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=30411"},"modified":"2022-10-24T10:27:10","modified_gmt":"2022-10-24T17:27:10","slug":"earth-day-eco-friendly-tips-for-your-clients","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/earth-day-eco-friendly-tips-for-your-clients\/","title":{"rendered":"Earth Day Eco-Friendly Tips for Your Clients"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-30431\" title=\"Earth Day Eco-Friendly Tips for Your Clients\" src=\"\/wp-content\/uploads\/2014\/04\/Fotolia_57308701_XS-300x277.jpg\" alt=\"Adding eco-friendly and energy-efficient features to a home can help home sellers fetch top dollar, if they market the home effectively\" width=\"300\" height=\"277\" \/>If you live in an area with a high concentration of electric vehicles, you may want to advise your clients to green up their houses before putting them on the market. Trust us, you’ll all make more money and the house will sell faster. In fact, it will sell for at least 9 percent more than a home that isn’t <a href=\"http:\/\/www.washingtonpost.com\/realestate\/study-finds-that-energy-efficient-homes-often-command-higher-prices\/2012\/07\/19\/gJQAF4MiwW_story.html\">green-certified<\/a>, according to a 2012 study by the University of California.<\/p>\n<p>The study’s authors deem the phenomenon “the Prius effect,” and claim that there exists “a positive correlation between the value of green home labels and environmental ideology, as measured by the rate of hybrid registrations.&#8221;<\/p>\n<p>While the study concentrates on certain regions in California, the Prius effect may be working in any market with a high concentration of eco-minded folks, judged by the number of electric vehicles in the area.<\/p>\n<p>Similar results were found in two different studies conducted in the Pacific Northwest. Seattle green homes sold for 8.5 percent more per square foot and spent 22 percent fewer days on the market than homes that lacked green certification. Portland green homes sold for 12 percent more (in 2008 and 2009) than non-greenies.<\/p>\n<h2>What is a Green Home?<\/h2>\n<p>A “green” home is one that contains efficient features that help reduce energy and water usage. Not all green homes are alike, but they contain some of the following features:<\/p>\n<ul>\n<li>The home was built with an eye to minimize waste during the construction.<\/li>\n<\/ul>\n<ul>\n<li>Interior features are nontoxic.<\/li>\n<\/ul>\n<ul>\n<li>The builders use renewable resources, such as bamboo for floors.<\/li>\n<\/ul>\n<ul>\n<li>Green homes feature recycled components, such as glass tiles.<\/li>\n<\/ul>\n<ul>\n<li>Appliances are energy-efficient.<\/li>\n<\/ul>\n<ul>\n<li>The home may feature solar panels.<\/li>\n<\/ul>\n<ul>\n<li>The home is built to conserve water during landscape irrigation.<\/li>\n<\/ul>\n<ul>\n<li>The home may have a rainwater capture system.<\/li>\n<\/ul>\n<ul>\n<li>The builder strategically plants landscape trees to provide shade.<\/li>\n<\/ul>\n<ul>\n<li>The builder carefully considers window placement to maximize natural light.<\/li>\n<\/ul>\n<h2>Green Certification<\/h2>\n<p>Homebuyers in the market for sustainable and energy-efficient homes look for features such as Energy Star ratings and other certifications. While many companies claim to certify green homes, the ones to keep an eye out for are <a href=\"http:\/\/www.usgbc.org\/leed\">LEED<\/a> (Leadership in Energy &amp; Environmental Design) and the Residential Energy Services Network (<a href=\"http:\/\/www.resnet.us\/\">RESNET<\/a>) and its Home Performance Report.<\/p>\n<p>The Home Energy Rating System (HERS) Index, used by RESNET, measures a home’s energy efficiency. Clients that are considering upgrading a home for the market may want to get this report. The homeowner will receive a detailed report that lists options for making it more energy-efficient.<\/p>\n<p>For clients purchasing new construction, the HERS rating will allow them to compare ratings among new homes.<\/p>\n<h2>Marketing Tips for Green Homes<\/h2>\n<p>It’s difficult for a new homebuyer to consider that somewhere down the road he is going to want to sell the home, but chances are good that he will. If it’s a green home, or he’s talked about adding energy-efficient features, advise him to keep receipts, warranties and ratings for future use.<\/p>\n<p>In fact, “green homeowners” may be a suitable category for a chunk of clients in your CRM that you can target with green reminders, news and updates.<\/p>\n<p>Get basic with your marketing descriptors. The word “green” is vague to many Americans and doesn’t really explain the benefits of purchasing a certified home. Use “energy-efficient” or, as author Jim Simcoe suggests, “high-performance.”<\/p>\n<p>Use your flyers to sell the benefits of a green home:<\/p>\n<ul>\n<li>Lower utility bills.<\/li>\n<li>Less toxic environment.<\/li>\n<li>Leaving the planet a better place for future generations.<\/li>\n<\/ul>\n<p>Simcoe recommends listing the benefit and then the cost savings of it, such as “Benefit: Energy Star water heater. Value: Reduce water bill by 25 percent.” Do the same with the home’s typical energy bill by listing the monthly savings and then projecting that out to an annual savings. The latter will be a huge number and quite impressive.<\/p>\n<p>Use the figures on appreciated home value from the University of California study, mentioned earlier.<\/p>\n<p>List the federal tax credits available for energy efficient features (with a caveat, of course, to consult with an accountant). For example, from 2012 through 2016, homeowners that install solar energy systems receive <a href=\"https:\/\/www.energystar.gov\/index.cfm?c=tax_credits.tx_index\">tax credits<\/a> equal to 30 percent of the cost, according to the Energy Star website.<\/p>\n<p>Hang placards around the house to point out green features. If the walls are painted with non-toxic paint, hang a sign on them that lets homebuyers know. Hang them on your clients’ Energy Star appliances, sustainable flooring or super-efficient windows.<\/p>\n<p>Since green homes have a higher market value than non-greenies, it’s important to justify the additional price by proving the home’s benefits. Your marketing materials, pointing out the benefits to the buyer, are key to the successful and prosperous sale of a green home.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>If you live in an area with a high concentration of electric vehicles, you may want to advise your clients to green up their houses before putting them on the market. Trust us, you’ll all make more money and the house will sell faster. In fact, it will sell for at least 9 percent more [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[35],"tags":[453,454,455,456,457,458,87],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/30411"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=30411"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/30411\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=30411"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=30411"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=30411"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}