{"id":30611,"date":"2014-04-28T16:13:13","date_gmt":"2014-04-28T16:13:13","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=30611"},"modified":"2016-02-04T16:42:21","modified_gmt":"2016-02-05T00:42:21","slug":"agent-spotlight-scott-hum-of-jacksonville-fla","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/agent-spotlight-scott-hum-of-jacksonville-fla\/","title":{"rendered":"Agent Spotlight: Scott Hum of Jacksonville, Fla."},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-30621\" title=\"Agent Spotlight - Scott Hum\" src=\"\/wp-content\/uploads\/2014\/04\/SCOTT4-202x300.jpg\" alt=\"Scott Hum is a real estate agent in Jacksonville, Florida\" width=\"202\" height=\"300\" \/>What would you do if you had a client in your car who suddenly complained of chest pains? Suppose you were showing him rural property with no doctor and no hospitals nearby?<\/p>\n<p>Yes, it’s a scary thought and it’s something that actually happened to agent <a href=\"http:\/\/NEFloridaHomes4Sale.com\">Scott Hum<\/a> with RE\/MAX Specialists in Jacksonville, Fla. Thankfully, the client was experiencing an anxiety attack, Hum says.<\/p>\n<p>“He took a few deep breaths and everything was fine. But that worried me, so I went ahead and took an EMT class,” he explains. Now he’s certified and knows exactly what to do should he ever find himself in the situation again.<\/p>\n<p>Hum grew up in Lincoln, a small town in central Illinois, and remained there for the first 30 years of his life. The fact that he got to turn the air conditioning on in January was the deciding factor in moving from chilly Illinois to Florida. “I’ve lived here for 10 years and never once had to use an ice scraper,” he said, laughing.<\/p>\n<p>Prior to real estate, Hum worked in the automotive industry, something he dreamed of as a child. <strong>“<\/strong>I worked for automobile dealerships, for General Motors most of the time,” he explained. “I was a service technician, a shop foreman and then a service manager.”<\/p>\n<h2>From Cars to Houses<\/h2>\n<p>After almost two decades in the auto industry, the idea to switch to a real estate career came gradually. “Two of my close friends that I worked with in the automotive business decided that they were going to quit what they were doing and get into real estate,” Hum recalled.<\/p>\n<p>He watched his friends’ progress and liked what he saw. “I saw how much more flexibility they had and how their quality of life had changed since they got out of the automotive industry.” In 2002, Hum used his two week vacation from his job to study and sit for his real estate licensing exam. He left the automotive industry and went into real estate full time.<\/p>\n<p>The best advice he was given as a rookie?<\/p>\n<p>“It’s really kind of corny, but when I first started the couple that mentored me gave me a little girl’s mirror,” he said.<\/p>\n<p>They told him he had to look at it whenever he made calls. “When you’re looking in a little girl’s pink mirror, it’s hard not to smile.”<\/p>\n<p>When you’re first starting in the business, you’re so nervous you just blurt out the stuff you know you’re supposed to say. When you’re smiling, though, it comes out a lot better.<\/p>\n<h2>Marketing<span style=\"font-size: 13px;\"> <\/span><\/h2>\n<p>We were curious about how Hum markets himself and his business at the 12-year mark in the industry. “Over 12 years, I’ve tried everything,” he explains. “Right now I use a lot of word of mouth and I have a couple different websites. My Market Leader site has been the best for me so far. I think that 90 percent of people looking for houses are starting on the Internet, and you have to have a presence on the Internet and be able to reach out to them,” he concludes.<\/p>\n<p>Remaining in touch with past clients is important to him, and his efforts pay off. Hum estimates that at least 65 percent of his business comes from repeat business and referrals.<\/p>\n<h2>So, Why Market Leader?<\/h2>\n<p>We’re always interested in what brings our clients and our products together, so we asked Hum how he was introduced to Market Leader.<\/p>\n<p>“I had heard a presentation from another RE\/MAX agent about how good her results were with the products,” he begins. “I needed something different, and I’d been on other company’s websites and just couldn’t find what I needed.”<\/p>\n<p>“Market Leader has just been phenomenal for me,” Hum continues. “Right off the bat I started getting warm leads. Within the first month I had customers that actually answered the phone and wanted to buy and had real email addresses.”<\/p>\n<p>“Within two months I had two houses under contract &#8211; just off of my Market Leader website,” Hum said. “In less than six months with Market Leader I have closed five transactions and about $800,000 of real estate. My Market Leader website has paid for itself three times over,” he concludes.<\/p>\n<p>Hum also credits Market Leader webinars with giving him the training that other companies don’t provide. “The company has given me the training and the tools for the first time, to know what I&#8217;m doing with the website and what to say to new prospects on the phone. My website brings them to me, but it&#8217;s my job to keep them coming back,” he says.<\/p>\n<h2>The Future<span style=\"font-size: 13px;\"> <\/span><\/h2>\n<p>Hum is in love with the real estate industry &#8211; “everything about it,” he claims. “I would do this for free if my wife would let me,” he says, laughing. “I love what I do. I do not even think about the commission until the day of closing, and that is just to make sure all the numbers add up.”<\/p>\n<p>“This is one of those businesses that I feel I can do as long as they keep giving me a driver’s license. I just turned 50 and I see myself doing this for another couple of decades.”<\/p>\n","protected":false},"excerpt":{"rendered":"<p>What would you do if you had a client in your car who suddenly complained of chest pains? Suppose you were showing him rural property with no doctor and no hospitals nearby? Yes, it’s a scary thought and it’s something that actually happened to agent Scott Hum with RE\/MAX Specialists in Jacksonville, Fla. Thankfully, the [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[83],"tags":[190,106,275,87,56],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/30611"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=30611"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/30611\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=30611"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=30611"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=30611"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}