{"id":30791,"date":"2014-04-30T16:27:04","date_gmt":"2014-04-30T16:27:04","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=30791"},"modified":"2021-11-19T11:46:45","modified_gmt":"2021-11-19T19:46:45","slug":"should-you-hire-a-stager-for-your-listings","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/should-you-hire-a-stager-for-your-listings\/","title":{"rendered":"Should You Hire a Stager for Your Listings?"},"content":{"rendered":"<p>Hold on to your hats, real estate industry professionals, the caca is about to hit the fan.<\/p>\n<p>A new study, to be published in the Journal of Real Estate Research later this year, says that staging a home has no impact on the sales price. The academic study, “The Impact of Staging Conditions on Residential Real Estate Demand,” was conducted over the course of eight months and used virtual home tours with various scenarios.<\/p>\n<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-30811\" title=\"Should You Hire a Home Stager?\" src=\"\/wp-content\/uploads\/2014\/04\/Fotolia_52119176_XS-300x171.jpg\" alt=\"Real estate agents have a few options when it comes to working with home sellers to stage a house\" width=\"300\" height=\"171\" \/>A follow-up interview, however, shows that <em>homeowners<\/em> believe that buyers will pay more for a staged home &#8211; and that’s what matters. Our clients’ perceptions rule the day.<\/p>\n<p>For instance, <a href=\"https:\/\/www.investopedia.com\/articles\/personal-finance\/022416\/5-ways-open-house-can-actually-hurt-your-home-sale.asp\">NAR statistics tell us that open houses are generally a waste of time<\/a>, yet because homeowners perceive them as helpful in selling their homes, agents across the country are sitting in their listings every weekend.<\/p>\n<p>So it is with staging &#8211; unless and until your clients think staging is a waste of time and money, it’s something you will most likely suggest as a way to get some homes sold.<\/p>\n<h2>Who Needs It?<\/h2>\n<p>Have you ever noticed that your clients who need to stage their homes the most can least afford to do so? It’s generally not the luxury homeowners that need advice on where to place furniture, what to rid the house of before it goes on the market and how to decorate to make it attractive to the maximum number of buyers.<\/p>\n<p>These homeowners, though, are the bread and butter for agents who don’t specialize in listing luxury properties. We were curious to know how agents deal with this dilemma. Read on for some ideas that might work for you.<\/p>\n<h2>Agent Makes Suggestions<\/h2>\n<p>By far the most common answer we got to our question about how agents deal with the staging question is that they make suggestions to their clients. Hiring a professional stager topped the list of suggestions agents make.<\/p>\n<p>After that, agents advised their clients to clean, remove clutter and store overly large furniture. Those agents with a flair for interior decorating go further, suggesting furniture arrangements, the addition of decorative items and wall color.<\/p>\n<h2>Agent Pays for a Consultation<span style=\"font-size: 13px;\"> <\/span><\/h2>\n<p>Some agents feel that offering to pay for a professional staging consultation is a way to add value to their listing presentations. The stager will tour the home and recommend changes to the seller but won’t actually do any of the work.<\/p>\n<p>Adrienne Nugent, of Reliance Residential Realty San Antonio, employs her own stager. “I have a professional on my team that I pay to do a walk-through on my listings,” Nugent tells Trulia readers. “From the front door out the back, she writes a list of suggestions that will make your home showings go well. It makes a world of difference when you even do half of her suggestions.”<\/p>\n<h2>Agent Pays for the Staging<\/h2>\n<p>Visit any online real estate forum and you’ll find lively discussions about who should pay for a home staging. Some say that staging is a marketing expense and therefore falls to the agent, while others claim it is clearly a seller’s expense.<\/p>\n<p>That said, there are agents who offer to pay for all or a portion of the staging expense. These agents are typically the ones who carry more listings, make more money, or have a stager on their team.<\/p>\n<p>Very few agents we spoke with pick up the entire tab for an outside professional stager. Those who do typically employ their own designers as part of their marketing plan.<\/p>\n<p>Donna Kerr, an agent with Gerlach Real Estate in Silver Spring, Md., offers free full-home staging to each listing client. Clients do pay for any repair and renovation work that the designers recommend. Of course, it helps that she has two designers on her team and a 5,000 square-foot warehouse full of furniture, artwork and accessories.<\/p>\n<p>New Jersey agent Val Nunnekamp, with Prudential Fox &amp; Roach Realtors®, does a variation on Kerr’s theme. He calls it Home Prep and has used it to entice new clients since the 80s.<\/p>\n<p>“We’ll move furniture around, no charge,” he said. “If they need wallpaper torn up, rugs pulled out, hardwood floors polished, new appliances, we can do it, but there’s a charge.” Home Prep is such a popular service, 90 percent of his listing clients use it.<\/p>\n<h2>Agent Performs the Staging<\/h2>\n<p>Finding agents who also perform staging for their clients is a bit like looking for Sasquatch. We have a feeling they exist, but they’re a challenge to find.<\/p>\n<p><a href=\"https:\/\/www.remax.com\/real-estate-agents\/corey-young-coppell-tx\/100027499\">Corey Young<\/a>, with RE\/MAX DFW Associates, however, holds dual titles: Realtor® and Accredited Staging Professional. Naturally, she offers free staging to all of her listing clients.<\/p>\n<p>“I started off doing real estate 11 years ago and was always interested in interior design,” she said. In fact, she was staging her listings from the get-go, before the process was known as “staging.” When it became a trend, she decided to become certified and marry her two passions: real estate and design.<\/p>\n<p>The process takes about three days, she said, and unlike the new study’s findings, Young feels that staging not only helps the homes sell quicker, but for top dollar.<\/p>\n<p>Unless the aforementioned study is taken to heart by homeowners, staging will maintain its appeal to them. Whether agents go all-out in their efforts to get their clients’ homes ready for the market or offer suggestions on how best to meet that goal seems to vary according to agent.<\/p>\n<p>Do you agree? Share your thoughts and\/or recommendations on hiring a stager in the comment section below.<\/p>\n<hr style=\"height: 2px;\" \/>\n<h2>Home Staging Mistakes to Avoid<\/h2>\n<p>Regardless of whether you hire a stager for your listings, warn your seller clients against committing the following shockingly bad home staging decisions:<\/p>\n<ol>\n<li>Having an overload of collections littered throughout the home.<\/li>\n<li>&#8220;Echo chamber staging&#8221; &#8211; not listening to (or even having) the home staging advice of others.<\/li>\n<li>Failing to erase bad design decisions and the messiness of daily life.<\/li>\n<li>Over-doing home staging.<\/li>\n<li>Leaving your home with a &#8220;lived-in&#8221; look.<\/li>\n<li>Cramming closets full of junk.<\/li>\n<li>Failing to stage for all the senses &#8211; consider the nose and ears as well as the eyes.<\/li>\n<li>Not staging at all!<\/li>\n<\/ol>\n","protected":false},"excerpt":{"rendered":"<p>Hold on to your hats, real estate industry professionals, the caca is about to hit the fan. A new study, to be published in the Journal of Real Estate Research later this year, says that staging a home has no impact on the sales price. The academic study, “The Impact of Staging Conditions on Residential [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[83],"tags":[56,459,361],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/30791"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=30791"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/30791\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=30791"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=30791"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=30791"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}