{"id":30961,"date":"2014-05-15T09:00:42","date_gmt":"2014-05-15T09:00:42","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=30961"},"modified":"2022-01-26T15:31:00","modified_gmt":"2022-01-26T23:31:00","slug":"meet-the-happiest-agents","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/meet-the-happiest-agents\/","title":{"rendered":"Meet the Happiest Agents"},"content":{"rendered":"<p>After publishing the results of its “Happiest Agent on the Block” survey several weeks ago, Market Leader decided it would be best to introduce the happiest of the more than 3,000 real estate agents who participated in this survey. We hope doing so will help other, less cheerful agents learn how to increase their own happiness.<\/p>\n<p>Below are the three secrets to agent happiness that were most commonly cited by the survey’s happiest respondents. We also reveal how these agents have tapped these secrets to lead joy-filled lives.<\/p>\n<p>If you would like to know more about the survey or our findings (such as what marital status and commission split happy real estate agents are most likely to have), read <a href=\"\/blog\/the-happiest-agent-on-the-block\/\"><strong>“The Happiest Agent on the Block.”<\/strong><\/a> You’ll find both a complete summary of our survey findings and an infographic that highlights the most important facts we’ve discovered about agent happiness.<\/p>\n<h2>Family &#8211; A Cornerstone of Happiness<\/h2>\n<p><img loading=\"lazy\" class=\"alignright  wp-image-31001\" title=\"Kris Coutant professional\" src=\"\/wp-content\/uploads\/2014\/05\/Kris-Coutant-professional-239x300.jpg\" alt=\"Kris Coutant, Keller Williams real estate agent and mother of two\" width=\"191\" height=\"240\" \/>A real estate agent’s family life &#8211; and how much time an agent gets to spend with family &#8211; has as big of an impact on career happiness as their work life does. This is something Kris Coutant, a mother of two and a Keller Williams agent from Saratoga Springs, N.Y., is all too aware of.<\/p>\n<p>“For me it is all about my family,” Coutant said. “I work to enjoy my life with my family. I don&#8217;t live around my work.”<\/p>\n<p>Coutant’s family is so important to her that she made adjustments to her real estate business to be able to spend more time with them. While still a licensed real estate agent, Coutant now rarely works with clients. Instead, she prefers to do the marketing and administrative work for three other agents. This change has greatly improved Coutant’s ability to spend time with her family.<\/p>\n<p>“I am working less hours, limited nights and weekends, and am much happier,” Coutant said. “My family and I take long weekends away and plan on more traveling in the future.”<\/p>\n<h2>Client Happiness Leads to Agent Happiness<\/h2>\n<p>In many respects, a real estate agent’s job is to make their clients happy. The happiest agents understand this and always keep it in mind as they run their real estate businesses.<\/p>\n<p>Prescott, Ariz. Realtor® and Master Gardener Lesley Alward is a perfect example of an agent who puts her clients’ needs first.<\/p>\n<p>“I recognized early on that I am in a service-oriented business,” she said. “Real estate is <em>all<\/em> about the client and their goals, so I have to be a market expert, study area trends, and understand how outside influences are affecting the local market. I understand that my job is to serve my clients by honestly informing, educating, and advising them so that they have the tools and know-how to make informed decisions and succeed in their real estate goals.”<\/p>\n<p>Alward has good advice for agents who are unhappy with their careers:<\/p>\n<p>“Serve your clients well and honestly, even if the truth is hard to share, and their gratitude will lead to a constant stream of repeat and referral business,” she said. “[Receiving client] gratitude multiplies the joy of living as well as your income potential.”<\/p>\n<h2>Happiness Largely Comes from Within<\/h2>\n<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-31011\" title=\"Jo Ann Schlott photo\" src=\"\/wp-content\/uploads\/2014\/05\/Jo-Ann-Schlott-photo-242x300.jpg\" alt=\"Jo Ann Schlott, real estate agent and golfing and hiking enthusiast\" width=\"242\" height=\"300\" \/><\/p>\n<p>Perhaps Market Leader’s favorite discovery from the “Happiest Agent on the Block” survey is that the happiest real estate agents display a remarkable level of self-awareness and self-determination when it comes to their own happiness. These agents are acutely aware that they are largely responsible for making themselves happy, either through nourishing a positive mental attitude or having the foresight to remove themselves from situations where they could succumb to negativity and unhappiness.<\/p>\n<p>One such agent is Jo Ann Schlott, a golf and hiking enthusiast from Tucson, Ariz.<\/p>\n<p>“Happiness is taking responsibility for my own actions,” Schlott said. “I understood a long time ago that the only person responsible for my happiness is me. I don’t blame other people. My reaction to them causes me to be happy or sad or angry or disappointed.”<\/p>\n<p>“Life is good,” Schlott added. “Enjoy it.”<\/p>\n<p>Jessica Ward, a Keller Williams broker and amateur hockey player who lives and works in the Seattle area, has a similar perspective on happiness as Schlott.<\/p>\n<p>“Happiness is a life choice,” Ward said. “I choose to be happy; if I&#8217;m not, I need to adapt to something that will make me happier.”<\/p>\n<p><em>Want to learn more about agent happiness? <\/em><a href=\"\/blog\/the-happiest-agent-on-the-block\/\"><strong><em>Click here<\/em><\/strong><\/a><em> to read a summary of Market Leader’s “Happiest Agent on the Block” survey findings.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>After publishing the results of its “Happiest Agent on the Block” survey several weeks ago, Market Leader decided it would be best to introduce the happiest of the more than 3,000 real estate agents who participated in this survey. We hope doing so will help other, less cheerful agents learn how to increase their own [&hellip;]<\/p>\n","protected":false},"author":28,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[83],"tags":[190,163,460,442,461,56],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/30961"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/28"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=30961"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/30961\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=30961"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=30961"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=30961"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}