{"id":31031,"date":"2014-05-05T15:27:11","date_gmt":"2014-05-05T15:27:11","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=31031"},"modified":"2016-02-04T16:41:54","modified_gmt":"2016-02-05T00:41:54","slug":"agent-spotlight-mark-slade-keller-williams-mid-town-direct-realty","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/agent-spotlight-mark-slade-keller-williams-mid-town-direct-realty\/","title":{"rendered":"Agent Spotlight: Mark Slade, Keller Williams Mid-Town Direct Realty"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-31041\" title=\"Agent Spotlight - Mark Slade\" src=\"\/wp-content\/uploads\/2014\/05\/MarkSlade4-208x300.jpg\" alt=\"\" width=\"208\" height=\"300\" \/>As a student at Brandeis University, the one thing that <a href=\"http:\/\/www.goodhomesforgoodpeople.com\">Mark Slade<\/a> never imagined was that one day he would be unemployed, broke and receiving public assistance.<\/p>\n<p>After graduating from the respected private university with dual majors in economics and fine arts, Slade first became a buyer for Macy’s. He then “skipped to the other side of the fence and went from retail into wholesale,” he recalls.<\/p>\n<p>“I quickly worked my way up the ladder, and within two years I was made a vice president of sales.” After leaving Macy’s he worked as an executive vice president with different fashion industry biggies such as Calvin Klein and Swatch Watches.<\/p>\n<p>The year 2007 proved to be the start of what Slade calls “a strange stretch in my life.”<\/p>\n<p>It started with a divorce. “I had to sell a former marital home, which became a short sale,” he begins. “Then in 2008 it culminated in me losing my job and getting into a major car accident. Then, my unemployment ran out and I ended up on food stamps,” he admits. “It was a pretty big turn of events for me.”<\/p>\n<h2>The Road Back<span style=\"font-size: 13px;\"> <\/span><\/h2>\n<p>Recovering from setbacks isn’t easy, and it’s typically not a quick process. “I basically had nothing to lose, so I threw every last dollar that I had and every last bit of strength and fortitude I had into trying to build a real estate business,” he recalls.<\/p>\n<p>In addition to trying to build his business, he did odd jobs to pay housing expenses and put gas in his car. “In my first year I was putting in probably 80 hours a week in my business and sleeping no more than four hours a night,” he said. “I was doing odd jobs for people; I ripped out old carpeting, painted houses and did some personal shopping for a friend. I even drove people to the airport,” Slade said, laughing.<\/p>\n<p>The hard work paid off. Each year that he’s been in the real estate business, Slade has doubled the amount of transactions he did the previous year. “Last year, personally, I did 40 transactions for $20 million. At the end of the year I started to build a team.”<\/p>\n<h2>Challenges<\/h2>\n<p>Slade will hit the five-year mark in real estate in August and he now pays for his own groceries, but like all small-business people, he faces certain other challenges.<\/p>\n<p>Going from sole practitioner to finding the right people to build his real estate team is Slade’s biggest challenge right now.<\/p>\n<p>“Today I physically put a sign in the ground. I physically put a lock box on a property. It’s really not a big deal, but all told, it’s an hour of my time that I could’ve spent doing something perhaps more productive. Finding the person to put the sign in the ground and not keeping it in my car all the time would be nice,” Slade says.<\/p>\n<p>“Part of the challenge is letting go of some of those things. As you evolve from sole practitioner and jack of all trades to managing the business, it’s challenging to let go of some of those things,” he concludes.<\/p>\n<h2>Marketing<span style=\"font-size: 13px;\"> <\/span><\/h2>\n<p>As an agent who is relatively new to the business yet hit the ground running, Slade feels that the single most important marketing step he took was to embrace technology. Understanding that he needed to market to consumers the way they want to be marketed to led him to the idea of creating open-house websites. “After four years, they average between 1,000 and 2,000 hits a month. On weekends they generate 30 percent of the traffic into my website,” Slade says.<\/p>\n<h2>Giving Back<\/h2>\n<p>One thing that will forever remain in Slade’s memory is that stretch of time when he was unemployed and unable to put food on the table. When he got into real estate and started making money, he decided it was time to give back.<\/p>\n<p>“I made it a point to provide community service,” he says. “I am part of an organization to help distribute weekend lunch packs to underprivileged children that are in area schools on the hot lunch program. On weekends they don’t get fed, so we provide lunch packs that they can pick up on Friday and use to feed themselves on the weekends,” he explains.<\/p>\n<p>As a single dad Slade relied on the YMCA for grants to help him care for his son while hitting the streets as a rookie agent. As soon as he closed some deals, he started giving back to the Y. Eventually, he became a President’s Council member and he now helps the organization with their fundraising.<\/p>\n<h2>Slade and Market Leader<\/h2>\n<p>While it was Slade’s association with Keller Williams that led him to Market Leader products, it was the webinars that convinced him to stay.<\/p>\n<p>“I probably watched 10 hours of webinars a week – it gave me a lot of great ideas and great tools. The knowledge they provided was critical to the growth of my business,” he explains.<\/p>\n<p>“First and foremost, the training market leader provides was instrumental in giving me the inspiration and the spark to create my blog,” Slade continues. “The analytics package that comes with PRO has helped me to see the direct relationship between my social media endeavors and consumer traffic.”<\/p>\n<h2>Down the Road<strong style=\"font-size: 13px;\"> <\/strong><\/h2>\n<p>We asked Slade where he sees himself a decade from now.<\/p>\n<p>“Business isn’t simply about looking at one linear step,” he begins. “I want to build a few different types of businesses that are all related to real estate. I want build my team so that it can almost operate on its own. I want to build my presence as a speaker for social media and how people can resurrect their careers – give them hope. I’d like to buy distressed homes and flip them. I want to continue to build my open house websites and franchise those out.”<\/p>\n<h2>Make ‘em Smile<\/h2>\n<p>Slade loves all aspects of the business, but working with people is where he obtains the most satisfaction. “One of my favorite parts of the business is when I get to make buyers homeowners in the town that I live in, and then see their happy smiling faces at their favorite watering hole, at the town pool, just walking the streets of the downtown village or waiting for the train. Seeing what I call “happy homeowners” is a terribly rewarding experience,” he said.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>As a student at Brandeis University, the one thing that Mark Slade never imagined was that one day he would be unemployed, broke and receiving public assistance. After graduating from the respected private university with dual majors in economics and fine arts, Slade first became a buyer for Macy’s. He then “skipped to the other [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[83],"tags":[190,106,275,87,56],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/31031"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=31031"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/31031\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=31031"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=31031"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=31031"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}