{"id":31591,"date":"2014-05-09T15:59:44","date_gmt":"2014-05-09T15:59:44","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=31591"},"modified":"2021-11-22T13:28:12","modified_gmt":"2021-11-22T21:28:12","slug":"home-values-are-rising-americans-prefer-new-homes","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/home-values-are-rising-americans-prefer-new-homes\/","title":{"rendered":"Home Values Are Rising; Americans Prefer New Homes"},"content":{"rendered":"<h2 dir=\"ltr\">Home Values Spike<\/h2>\n<p dir=\"ltr\"><img loading=\"lazy\" class=\"alignright size-medium wp-image-31631\" title=\"Home Values Rising in Certain Markets\" src=\"\/wp-content\/uploads\/2014\/05\/Fotolia_63305734_XS-300x193.jpg\" alt=\"Home values and prices are rising in some real estate markets\" width=\"300\" height=\"193\" \/>So, here are some good indicators for the housing industry. Home values or prices have surpassed their housing boom peak numbers in many states. The good news is that it’s not another bubble that’s going to go pop.<\/p>\n<p dir=\"ltr\">According to mortgage firm CoreLogic, in March, Colorado, North Dakota, South Dakota, Texas, Wyoming and the District of Columbia all surpassed their previous price high records. According to Mark Fleming, CoreLogic’s chief economist, <a href=\"https:\/\/www.washingtonpost.com\/news\/wonk\/wp\/2014\/05\/06\/why-home-prices-are-reaching-bubble-era-prices-without-bubble-era-headaches\/\">rising home values<\/a> in those states were supported by improved economies in the region.<\/p>\n<p dir=\"ltr\">A tight inventory supply and increasing demand for homes has triggered the price rise.<\/p>\n<p dir=\"ltr\">“You only need a little positive price appreciation and strong demographics going in your favor in those areas to surpass the prior peak,” Fleming told the Washington Post. “None of those were bubble markets.”<\/p>\n<p dir=\"ltr\">States such as California and Nevada, which had the fastest price hike during the boom followed by the hardest dive during the bust, also registered an increase in home prices in March compared to a year-ago period. California saw a 17.2 percent gain and Nevada recorded a 15.5 percent jump. The double-digit spikes have happened because these were the hardest hit states and therefore there’s more room for recovery. CoreLogic estimates that prices will rise 6.7 percent in the coming year.<\/p>\n<h2 dir=\"ltr\">More American Homebuyers Prefer New Homes<\/h2>\n<p dir=\"ltr\">According to a new survey by Trulia, 41 percent of Americans said they would prefer a new home compared to 21 percent choosing existing homes and 38 percent who say they have no preference. The numbers are a good sign for the homebuilding industry.<\/p>\n<p style=\"text-align: center;\" dir=\"ltr\"><img loading=\"lazy\" class=\"aligncenter  wp-image-31601\" title=\"Americans Prefer New Homes\" src=\"\/wp-content\/uploads\/2014\/05\/Americans-Prefer-New-Homes.png\" alt=\"Trulia reports that more American homebuyers prefer new homes\" width=\"488\" height=\"540\" \/><\/p>\n<p dir=\"ltr\">“Why do more people prefer new homes? The top reasons are modern features and the chance to customize the home,” Jed Kolko, Trulia’s chief economist told HousingWire. “Fewer people prefer existing homes, but those who do point to traditional features and living in a more established neighborhood. For many people, the best of all worlds might be a newly built home in an older neighborhood.”<\/p>\n<p dir=\"ltr\">New homes tend to sell for more than similar older homes in the same neighborhood. So, affordability could be an issue, but not one that could hinder buyers long term. Buyers are getting more particular about their needs when it comes to investing in the most important purchase of their lifetime.<\/p>\n<p dir=\"ltr\">“Most people who say they strongly prefer a new home aren’t willing to pay the premium, and many regions of the country have little single-family construction,” Kolko said. “Still, as the housing market recovers, new homes will be a growing share of the national market.”<\/p>\n<p dir=\"ltr\">Texas and the Carolinas lead the numbers in construction of new homes. And new homes are now a growing trend in home sales, according to Trulia. Year-over-year, new-home inventory jumped 25 percent compared with 3 percent for existing homes. That means it’s easier to find a new home for sale than an existing home. Although existing home sales continue to hog the lion’s share of the market, it won’t be long before the new-home inventory takes over.<\/p>\n<p dir=\"ltr\">According to Kolko, buyers prefer new homes because they have modern features and also because buyers can customize the homes to suit their needs. New homes are also great for buyers who don’t want to embark on improvement projects.<\/p>\n<p dir=\"ltr\">Among those surveyed, 59 percent said they would prefer a new home equipped with features such as a kitchen island, open floor plan, walls wired for flat screen TVs, or radiant floor heating. Fifty-six percent of buyers said they like the idea of customizing their home, and 55 percent said they don’t want to spend money repairing and upgrading an existing home before moving in.<\/p>\n<div><\/div>\n","protected":false},"excerpt":{"rendered":"<p>Home Values Spike So, here are some good indicators for the housing industry. Home values or prices have surpassed their housing boom peak numbers in many states. The good news is that it’s not another bubble that’s going to go pop. According to mortgage firm CoreLogic, in March, Colorado, North Dakota, South Dakota, Texas, Wyoming [&hellip;]<\/p>\n","protected":false},"author":35,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[466],"tags":[355,464,465,388,56],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/31591"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/35"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=31591"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/31591\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=31591"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=31591"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=31591"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}