{"id":31901,"date":"2014-05-12T20:37:55","date_gmt":"2014-05-12T20:37:55","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=31901"},"modified":"2021-11-19T12:03:34","modified_gmt":"2021-11-19T20:03:34","slug":"the-ins-and-outs-of-eo-insurance","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/the-ins-and-outs-of-eo-insurance\/","title":{"rendered":"The Ins and Outs of E&amp;O Insurance"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-31921\" title=\"The Ins and Outs of E&amp;O Insurance\" src=\"\/wp-content\/uploads\/2014\/05\/Fotolia_62369270_XS-300x200.jpg\" alt=\"Real estate agents need E&amp;O insurance to help protect them from common mistakes\" width=\"300\" height=\"200\" \/>Doctors go through years and years of postgraduate medical school, internships, residencies and specialty training. And then they go to regular in-service training events to hone their skills and stay on top of the latest techniques and procedures in their profession.<\/p>\n<p>And they still make mistakes. That’s why they carry malpractice insurance.<\/p>\n<p>Yes, people look to you, as a real estate professional, for knowledge and expertise regarding real estate rules, regulations, laws and procedures. That’s why you’ve got the license. But if you’re in business as a real estate agent long enough, sooner or later you’re going to make professional mistakes too. Most of your goofs can be corrected with an apology and a signature. But some may not be so easily corrected. Someone may suffer some serious financial damages because of a mistake that you make as a real estate professional. Doctors need malpractice insurance. Real estate agents and other professionals need errors and omissions insurance, or E&amp;O.<\/p>\n<p>The good news for most rank-and-file agents is that your agency will often help subsidize the cost for you. However, if you’re an independent, or a franchise owner or manager, or you otherwise supervise the work of others, you may have to purchase coverage on your own.<\/p>\n<h2>The Costs of Defending Yourself<\/h2>\n<p>If you have a good errors and omissions policy, your insurance company will generally provide you with an attorney. Otherwise, you’ll have to pay an attorney out of your own pocket. Your attorney’s fees alone can easily amount to at least $10,000, and attorney costs of $100,000 or more are not unheard of in complex cases.<\/p>\n<p>If you lose, and you don’t have coverage, you’ll be on the hook not just for damages, but also for the plaintiff’s attorneys’ fees and court costs as well.<\/p>\n<p>Take a good look at the language of the policy. The more robust insurance policies will contain the phrase “right and duty to defend” or similar language – meaning that the insurance company must defend you in court. They don’t have the option of skipping the defense and settling on difficult cases, throwing your reputation overboard to cut their own losses!<\/p>\n<h2>Plan Out Coverage Transitions<\/h2>\n<p>Even if you have quality coverage in place now, that’s not the end of the issue. The most critical time for insurance agents’ risk exposure is before a policy begins and after it ends. For example, you started working at your current agency in January of last year, and you got errors and omissions insurance from your new agency when you signed on. Then, boom! In July, you get hit with a lawsuit over a deal you made last November, before you joined your current agency, and before your current errors and omissions policy became effective.<\/p>\n<h2>Are You Covered?<\/h2>\n<p>That depends on the policy you have now, and the policy, if any, that you had at the time of the transaction in question. Unlike homeowners insurance policies, there are no “standard forms” in the E&amp;O world. Each carrier can have very different policies. Frequently, the best solution is to layer two or more policies on top of one another, to plug any “gaps” in coverage that may occur during career changes, moves to another state or agency, etc., and after you retire or otherwise leave the industry.<\/p>\n<p>Note: Standard commercial liability policies do<em> not<\/em> cover errors and omissions made in your professional capacity as a real estate agent or broker.<\/p>\n<h2>What Does E&amp;O Cover?<\/h2>\n<p>Most insurance policies will cover damages awarded, over and above a certain deductible. They’ll also generally cover the cost of settlements, and the cost of mounting a defense. In cases that are lost, they’ll also generally pick up opposing attorneys’ fees as well – all over a certain deductible, which should be an amount that you can actually afford.<\/p>\n<p>What else might be covered? Some companies will cover lost earnings for any time you spend in court. One of Country Continental’s forms, commonly sold to agents through Victor O. Schinnerer &amp; Co., covers up to $250 per day if you are out of action because you have to be in court. <a href=\"https:\/\/www.victorinsuranceus.com\/industries\/real-estate\/Documents\/REO-PolicyForm.pdf\">Here’s their standard policy<\/a>, for reference.<\/p>\n<p>Schinnerer has worked out a deal with the National Association of Realtors®, but there are other brokers and carriers out there to choose from. Whatever you do, though, look for an insurance broker or agent who has extensive experience specifically selling E&amp;O insurance for real estate agents. This is a complex insurance niche and takes some experience to do well. You have too much at stake to risk a rookie error in your insurance coverage.<\/p>\n<h2>Considerations<\/h2>\n<ul>\n<li><strong>Settlements.<\/strong> Look for coverage that requires your consent before any settlement. Otherwise, again, your insurer could throw your reputation under the bus to minimize its own losses in a lawsuit.<\/li>\n<\/ul>\n<ul>\n<li><strong>Limit of liability.<\/strong> This is the maximum amount, overall, a policy will pay out, on your behalf. You may want to consider a liability umbrella policy to protect you against judgments or settlements over this limit.<\/li>\n<\/ul>\n<ul>\n<li><strong>Licensing Proceedings.<\/strong> Court costs are one thing. Will your E&amp;O coverage also cover the costs of representing you before your state’s real estate licensing board? Check your policy.<\/li>\n<\/ul>\n<h2>Exclusions<\/h2>\n<p>Look over this part carefully. Exclusions aren’t necessarily bad – it’s part of what keeps insurance affordable, though you may need to line up other insurance coverage to plug any risks that fall under your E&amp;O carrier’s exclusions.<\/p>\n<p>Common exclusions include:<\/p>\n<ul>\n<li>Claims arising out of activities that are beyond the normal scope of a real estate agent’s activities.<\/li>\n<li>Anything arising from a bodily injury or property damage claim.<\/li>\n<li>Improper commingling of funds or misappropriation of funds.<\/li>\n<li>Deals in which you, the agent, are also the buyer or seller.<\/li>\n<\/ul>\n<h2>Conclusion<\/h2>\n<p>Errors and omissions coverage doesn’t just protect you, the agent, broker, or franchise\/firm owner. It also protects your clients. Accidents happen, even at the best firms, with the best people. Mistakes are a part of life and can be minimized but never totally eliminated. Errors and omissions insurance ensures that even if you do make a costly mistake, there will be enough cash liquidity available to compensate your clients for any damages that may arise.<\/p>\n<p>Maintaining adequate coverage – and ensuring it doesn’t lapse – is part of your responsibility as a real estate professional.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Doctors go through years and years of postgraduate medical school, internships, residencies and specialty training. And then they go to regular in-service training events to hone their skills and stay on top of the latest techniques and procedures in their profession. And they still make mistakes. That’s why they carry malpractice insurance. Yes, people look [&hellip;]<\/p>\n","protected":false},"author":34,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[97],"tags":[23,106,467,468,469,56],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/31901"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/34"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=31901"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/31901\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=31901"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=31901"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=31901"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}