{"id":31961,"date":"2014-05-19T15:00:46","date_gmt":"2014-05-19T15:00:46","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=31961"},"modified":"2016-02-04T16:40:48","modified_gmt":"2016-02-05T00:40:48","slug":"agent-spotlight-debbie-king-of-newport-nc","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/agent-spotlight-debbie-king-of-newport-nc\/","title":{"rendered":"Agent Spotlight: Debbie King of Newport, NC"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-31971\" title=\"Agent Spotlight - Debbie King\" src=\"\/wp-content\/uploads\/2014\/05\/Debbie-2-210x300.jpg\" alt=\"Debbie King is a real estate professional in New Port, North Carolina\" width=\"210\" height=\"300\" \/>Retirement doesn’t come easy to some. After a lifetime of working as an administrative assistant, in direct sales and then in the real estate industry, <a href=\"http:\/\/www.searchcrystalcoasthomes.com\">Debbie King<\/a>, of King Realty, assumed she’d retire by age 55. That momentous date has come and gone and she’s still at it, selling Crystal Coast homes in Newport, N.C.<\/p>\n<h2>Real Estate – The Happiness Business<\/h2>\n<p>It’s happiness that gets King up in the mornings and keeps her coming back every day. “When clients are happy with their purchase, just the smile on their face – that just sounds really dorky – but the fact that I have had a huge part in making them happy is so rewarding,” she explains. “I know that every morning when they wake up they’re going to be grateful that they got that house, and that’s truly it for me.”<\/p>\n<p>King got her real estate license a decade ago and spent her initial years selling new homes with KB Homes. Today, she is the owner-operator of her own boutique brokerage.<\/p>\n<h2>Challenges<\/h2>\n<p>Something happens to a real estate practice at the 10-year mark. A lot of it is good – like the repeat business that typically starts rolling in at this time. We asked King about some of the challenges she faces at the decade anniversary of her business. “There’s not a huge challenge,” she replied, “just lots of little bitty ones. My biggest challenge would probably be getting people qualified for loans.”<\/p>\n<h2>Marketing<\/h2>\n<p>King credits her Market Leader website as the key to her team’s success. “Without it, real estate would be pointless,” she said. “What we do with Market Leader has just been phenomenal.”<\/p>\n<p>She became familiar with Market Leader accidentally. “I had a bad experience with another company. Somebody from Market Leader sales called in a moment of weakness and I said, ‘Sure, I’ll try it.’” She also says it’s the best business decision she has ever made.<\/p>\n<h2>Off the Clock<\/h2>\n<p>When King isn’t busy running a successful real estate brokerage you’ll find her in her own slice of heaven on earth. “We recently made a huge investment in our own backyard. We’ve pretty much got our own paradise there with an in-ground pool and everything we could want,” she explained.<\/p>\n<p>“Honestly, we would never just take some time to pack up and leave for the weekend, but with our own little paradise right in the backyard, I can go out there for two hours in the morning and feel like I‘ve just come back from a vacation. Same thing in the afternoon – my flexible schedule lets me do that. That’s what I do when I’m not working – just enjoy life.”<\/p>\n<h2>10 More Years<\/h2>\n<p>We asked King where she sees herself in 10 years. Without hesitation she said, “Cozumel, on the beach,” laughing. She added, however, that she has a sneaking suspicion she’ll be doing real estate deals from that beach chair.<\/p>\n<p>“I’m 59 years old and I had thought I’d be retired by 55,” King continued. “I think now that if I had retired I’d be one bored chick. I have my moments when I want to quit, but I have more where I say, ‘I just love it so much.’”<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Retirement doesn’t come easy to some. After a lifetime of working as an administrative assistant, in direct sales and then in the real estate industry, Debbie King, of King Realty, assumed she’d retire by age 55. That momentous date has come and gone and she’s still at it, selling Crystal Coast homes in Newport, N.C. [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[78],"tags":[190,307,106,275,87,56],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/31961"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=31961"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/31961\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=31961"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=31961"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=31961"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}