{"id":32051,"date":"2014-05-16T16:26:02","date_gmt":"2014-05-16T16:26:02","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=32051"},"modified":"2021-12-02T08:51:03","modified_gmt":"2021-12-02T16:51:03","slug":"a-look-at-phoenix-fannie-mae-and-the-top-brokerage-firm-in-the-u-s","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/a-look-at-phoenix-fannie-mae-and-the-top-brokerage-firm-in-the-u-s\/","title":{"rendered":"A Look at Phoenix, Fannie Mae and the Top Brokerage Firm in the U.S."},"content":{"rendered":"<h2 dir=\"ltr\"><img loading=\"lazy\" class=\"alignright size-medium wp-image-32121\" title=\"It's a Buyer's Market in Phoenix\" src=\"\/wp-content\/uploads\/2014\/05\/Fotolia_52717437_XS-262x300.jpg\" alt=\"Increased inventory in Phoenix, Arizona has helped create a buyer's market\" width=\"262\" height=\"300\" \/>A Buyer’s Market in Phoenix<\/h2>\n<p dir=\"ltr\">Homebuyers in the Phoenix market were exasperated last year, faced with a tight inventory, a reduction in homes for sale, and skyrocketing home prices.<\/p>\n<p dir=\"ltr\">Not anymore.<\/p>\n<p dir=\"ltr\">With more inventory in the market, home supply has stabilized and last month buyers had 64 percent more listings to choose from compared to a year-ago period.<\/p>\n<p dir=\"ltr\">Prices are also coming down a notch, according to Arizona State University’s monthly housing report.<\/p>\n<p dir=\"ltr\">What’s really hot in the market these days are luxury homes. Sales of homes priced at $500,000 and more jumped 11 percent in March compared to the same year-ago period.<\/p>\n<p dir=\"ltr\">So if your clients are looking to invest in the area, this may be the right time.<\/p>\n<h2 dir=\"ltr\"><\/h2>\n<h2 dir=\"ltr\">Fannie Mae, Freddie Mac Not Reducing Loan Limits<\/h2>\n<p dir=\"ltr\">Mortgage giants Fannie Mae and Freddie Mac will <a href=\"https:\/\/www.latimes.com\/business\/la-fi-fannie-freddie-20140514-story.html\">not reduce the limits on loans<\/a> they guarantee, contrary to what was reported last year.<\/p>\n<p dir=\"ltr\">Mel Watt, who assumed the office of director at the Federal Housing Finance Agency, reversed that decision to help the ongoing recovery in the market and to ensure the financial health of the industry.<\/p>\n<p dir=\"ltr\">&#8220;This decision is motivated by concerns about how such a reduction could adversely impact the current health of the housing finance market,&#8221; Watt said at a forum on the future of Fannie and Freddie hosted by the Brookings Institution think tank, according to the Los Angeles Times.<\/p>\n<p dir=\"ltr\">Watt’s decision was based on a public survey the agency conducted in December in which it asked for public reaction on a plan to reduce the loan limit to $400,000 from $417,000 in most parts of the country, and from $625,000 to $600,000 in the expensive markets.<\/p>\n<p dir=\"ltr\">Recipients of taxpayer bailout money, Freddie Mac and Fannie Mae played a crucial role in the housing recovery process. According to the Los Angeles Times, Fannie and Freddie buy or guarantee about 60 percent of new mortgages.<\/p>\n<p dir=\"ltr\">Watt also signalled a huge federal involvement in the mortgage markets in the foreseeable future. He said the agency will be working to make more credit available to homebuyers, while trying to reduce the risk to taxpayers.<\/p>\n<p dir=\"ltr\">&#8220;Housing finance is such a critical part of the economy,&#8221; Watt said. &#8220;To stop, or stand in place, is just not an option.&#8221;<\/p>\n<h2 dir=\"ltr\">Realogy Ranked First in Residential Real Estate Firms<\/h2>\n<p dir=\"ltr\">For the 17th consecutive year, NRT LLC, the parent company of Coldwell Banker Residential Brokerage in New Jersey and Rockland County, N.Y., was ranked the number one residential real estate brokerage firm in the U.S. by the REAL Trends 500 report.<\/p>\n<p dir=\"ltr\">The ranking was based on annual research that identifies the country’s largest and most successful residential real estate brokerage firms as ranked by transaction sides and sales volume, a release said. <a href=\"https:\/\/www.realogy.com\/\">Realogy<\/a> owns NRT LLC.<\/p>\n<p dir=\"ltr\">Coldwell Banker Residential Brokerage in New Jersey and Rockland County, combined with residential brokerage firms in the New York City Metro owned by Realogy, ranked highest on the REAL Trends 500 list for that region with approximately $29.4 billion in closed sales volume and 32,536 closed transactions sides, a release said.<\/p>\n<p dir=\"ltr\">Coldwell Banker Residential Brokerage in New Jersey and Rockland County alone accounted for a total of $8.3 billion in closed sales volume and 17,812 closed transaction sides in 2013.<\/p>\n<p dir=\"ltr\">“We are honored to have our company placed so high on this prestigious real estate industry ranking. It is a testament to the commitment and superior results that Coldwell Banker Residential Brokerage sales associates deliver to their clients every day,” said Hal Maxwell, president of Coldwell Banker Residential Brokerage in New Jersey and Rockland County.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>A Buyer’s Market in Phoenix Homebuyers in the Phoenix market were exasperated last year, faced with a tight inventory, a reduction in homes for sale, and skyrocketing home prices. Not anymore. With more inventory in the market, home supply has stabilized and last month buyers had 64 percent more listings to choose from compared to [&hellip;]<\/p>\n","protected":false},"author":35,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[466],"tags":[470,471,472,382,148,223,167,388,56,473],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/32051"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/35"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=32051"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/32051\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=32051"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=32051"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=32051"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}