{"id":32351,"date":"2014-05-26T15:00:53","date_gmt":"2014-05-26T15:00:53","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=32351"},"modified":"2016-02-04T16:40:11","modified_gmt":"2016-02-05T00:40:11","slug":"agent-spotlight-tammy-scheiter-lake-of-the-ozarks-mo","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/agent-spotlight-tammy-scheiter-lake-of-the-ozarks-mo\/","title":{"rendered":"Agent Spotlight: Tammy Scheiter, Lake of the Ozarks, Mo."},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-32361\" title=\"Agent Spotlight - Tammy Scheiter\" src=\"\/wp-content\/uploads\/2014\/05\/Tammy-Scheiter-169x300.png\" alt=\"Tammy Scheiter is a real estate agent with RE\/MAX in Lake of the Ozarks, Missouri\" width=\"169\" height=\"300\" \/>Imagine growing up in a resort area where life is centered on a 55,000-acre lake and you’ll get an idea of Tammy Scheiter’s childhood. Imagine selling lakefront homes and waterfront condos and you’ll have an idea of what her life is currently like.<\/p>\n<p>Tammy Scheiter is a <a href=\"http:\/\/www.yourlaketeam.com\/\">RE\/MAX agent<\/a> in a town where she’s spent her entire life. “I grew up living on the Lake of the Ozarks,” she begins. “My father was an excavator but we had a resort when I was younger. I was answering the phone and taking reservations when I was 10 and 11 years old, so I think that’s where the customer service thing came from.”<\/p>\n<p>That “customer service thing” is something Scheiter excels at. Anyone that’s grown up in a resort town understands that tourists are both a blessing and a curse. Scheiter prefers to concentrate on the former. “We appreciated tourists – that’s how we all made our living, was off the tourists,” she explains. “Everything we had came directly or indirectly from tourists.”<\/p>\n<h2>Before Real Estate<\/h2>\n<p>Scheiter held a variety of jobs before finally settling in the real estate industry. She worked on a gas dock, in restaurants, in banking and as a dental assistant. It was while working in the dental field, at the age of 30, that she was diagnosed with Stage 4 cancer. Not one to dwell on anything unpleasant, she sums up the experience by telling us, “Fifteen years later and I’m still here.”<\/p>\n<h2>The Big Decision<\/h2>\n<p>When she was well enough to work, Scheiter found herself working at a local radio station, selling time. While straight commission sales always scared her, this job paid a small salary plus commission, so she feels it was the ideal job to get her gradually accustomed to not relying completely on a salary.<\/p>\n<p>“I was getting more and more comfortable with that commission structure,” she recalls. By 2005 she was comfortable enough to make a break from the salaried world and took on real estate full time.<\/p>\n<h2>Challenges at the 10-Year Mark<\/h2>\n<p>Scheiter will celebrate a decade in the industry next year, and we were curious to know what kind of challenges she faces at this point in her career.<\/p>\n<p>“This is a really tough year,” she said. “It’s a really tough market. This year I think I’ve shown more property than in any year I’ve been in real estate, and I have less to show for it. There’s a big discord between buyers and sellers right now and our inventory is really down. We’ve really had to change the dialog and how we present what’s in our market,” Sheiter concluded.<\/p>\n<h2>The Second-Home Niche<\/h2>\n<p>Scheiter estimates that 70 percent of her clients are second-home buyers. To reach these clients she relies heavily on the Internet. “We do a little bit of print, but 98 percent of our buyers start on the Internet, so we have to have a presence there. You can’t just be out there on the Internet, though, you also have to look good on the Internet,” she suggests.<\/p>\n<h2>Scheiter and Market Leader<\/h2>\n<p>We’re always curious how agents learn about Market Leader products, so we asked Scheiter what led her to us.<\/p>\n<p>“I started looking for some different lead generating systems,” she recalls. She found Market Leader during her research, and after speaking with a representative she was sold.<\/p>\n<p>“It was a significant investment, but it wasn’t something that, if it didn’t work, it would break me, so I signed up for six months,” she explained. “Then, all of a sudden, I had three or four transactions that closed just before the six months was up. I think it generated me 30 or 40 thousand dollars. So I kept with it, because it obviously works,” she said, laughing.<\/p>\n<p>We asked Scheiter what she likes best about her Market Leader products. “All the automatic things that go out are really kind of cool because people tell me I’ve been sending them stuff,” she said. “The system sent them, but people thought it was me,” she said, laughing. “It gives me a different rapport on the first phone call. People feel like they know me a little and are more comfortable. You’re already on that level because of what the system is sending out,” Scheiter concludes.<\/p>\n<h2>The Love of Real Estate<\/h2>\n<p>Scheiter’s favorite part of going to work every day is showing houses. More important, she says, are her clients’ reactions when they find that just-right house. “I love it when I open the door and I know they’ve found <em>that<\/em> house – just seeing them light up is everything.”<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Imagine growing up in a resort area where life is centered on a 55,000-acre lake and you’ll get an idea of Tammy Scheiter’s childhood. Imagine selling lakefront homes and waterfront condos and you’ll have an idea of what her life is currently like. Tammy Scheiter is a RE\/MAX agent in a town where she’s spent [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[78],"tags":[190,106,275,56],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/32351"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=32351"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/32351\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=32351"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=32351"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=32351"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}