{"id":3241,"date":"2012-03-20T06:00:17","date_gmt":"2012-03-20T14:00:17","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=3241"},"modified":"2021-11-12T09:12:31","modified_gmt":"2021-11-12T17:12:31","slug":"tapping-into-the-real-estate-social-network-of-facebook","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/tapping-into-the-real-estate-social-network-of-facebook\/","title":{"rendered":"Tapping Into the Real Estate Social Network of Facebook"},"content":{"rendered":"<p><img loading=\"lazy\" src=\"\/wp-content\/uploads\/2012\/03\/Nblog_facebook1.jpg\" alt=\"\" title=\"Tapping into Facebook\" width=\"300\" height=\"400\" class=\"alignleft size-full wp-image-6701\" \/>As of September 2011, Facebook has more than 800 million active users that also encompass a strong real estate social network.According to facebook.com, of those active users, over 50% log in to Facebook on any given day. And, the average user is connected to 80 community pages, groups and events, and creates an average of 90 pieces of content each month. It’s clear that Facebook is one of the most influential and viral communication engines of our time, providing a real estate social network that every real estate agent can leverage to drive their business.<\/p>\n<p>In the real estate industry, targeted and consistent communication makes the difference between market leaders and those who work too hard, yet achieve less-than-desirable results. Let Facebook’s real estate social network be an additional tool in your toolkit of online real estate marketing helping your communication with clients past, present and future.<\/p>\n<p><strong style=\"color: #7a003c;\"><span style=\"font-size: 13.0pt; line-height: 115%; font-family: 'Calibri','sans-serif';\">Creating a great Facebook page <\/span><\/strong><\/p>\n<p>Just like your real estate website, you want your Facebook page to be visually appealing, clean and uncluttered, easy to navigate, and full of information so that visitors want to stay a while and look around. Consider these tips:<\/p>\n<p><strong>1. Take control of your Timeline Cover Photo.<\/strong> With the rollout of the new Facebook Timeline, this will be the most eye-catching component of your real estate marketing on this page. 850 pixels by 315 pixels are the most ideal size for your photo. Your photo should avoid promotions and text-based pictures, but staying relevant with how you appear in your real estate social network.<\/p>\n<p><strong>2. Use your entire profile picture space.<\/strong> The ideal dimensions for your profile picture are 180 pixels by 180 pixels. Most businesses are using this space for their business logo to appear.<\/p>\n<p><strong>3. Create customized tabs.<\/strong> Figure out the two most relevant tabs that you would like to share on your homepage. The new Facebook Timeline feature allows for more tabs, but only two will be shown without clicking to see more. Also, be sure that the display picture for your apps is the picture you would like with sizing of 810 pixels.<\/p>\n<p><strong>4. Address your milestones.<\/strong> Another perk to the new Facebook layout is the milestone feature which allows you to physically “go back in time” on your profile and add large events or moments. Great examples of this are your founding date, goals that were hit, new employees, etc.<\/p>\n<p><strong>Pinning.<\/strong> Pinning isn’t just for Pinterest anymore. Another great feature to your new Facebook profile is the ability to keep an announcement or important story at the top of your timeline for up to a week.<\/p>\n<p><strong>5. Be interactive.<\/strong> Visitors in your real estate social network will keep coming back to your page if you create a dialogue and provide useful information. Create a conversation with past clients, current clients, and prospects. Answer any and all questions, comments, or complaints efficiently and professionally.<\/p>\n<p><strong>6. Ask for “Likes”.<\/strong> It’s crucial that visitors to your page click the “Like” button so that your content shows up in their news feed. Don’t be shy about pointing them in the right direction.<\/p>\n<p><strong style=\"color: #7a003c;\"><span style=\"font-size: 13.0pt; line-height: 115%; font-family: 'Calibri','sans-serif';\">Optimize your Facebook profile <\/span><\/strong><\/p>\n<p>Creating a great Facebook page is just the beginning in building your real estate social network. Next, you’ll want to optimize your page, find the right tools to increase your real estate web traffic, and create a real estate social network that works for you. Then, start watching the leads roll in!<\/p>\n<p>Most agents understandably focus on driving traffic to their real estate website. But what about driving traffic to your Facebook page? Sure, Facebook does a pretty good job of that on its own by giving users the ability to post just about anything, any time. Your friends can repost, friends of friends can view it—the possibilities are endless. But how can you maximize Google to drive traffic to your Facebook page?<\/p>\n<p>Can your agent or brokerage Facebook fan page be indexed in Google? Sure! Over 3.5 trillion Facebook pages are currently indexed on Google simply by unlocking all privacy controls. That’s the easy part. Getting your fan page to rank in Google? That’s trickier. The same basic search engine optimization (SEO) principles apply, but the question to ask is this: how does Google weigh user experience on Facebook pages?<\/p>\n<p>Let’s look at the SEO elements for a Facebook page:<\/p>\n<p><strong>1. What is the name of your Facebook profile?<\/strong> Be sure to pick a hyperlocal focus to your Facebook name and page. You might cover an entire city, but choosing one hyperlocal area you know really well is a better bet to getting organic search traffic. Competition for hyperlocal main phrases and tail phrases (very specific searches) is much lower than city, state, or metro real estate keyword phrases. For example, www.facebook.com\/SeattleQueenAnneHill is an example of a hyperlocal real estate Facebook page that would likely rank well in Google.<\/p>\n<p><strong>2. What is the URL of your Facebook page?<\/strong> Be sure that your URL is succinct and contains the hyperlocal area you are targeting. Covering a bunch of different cities, suburbs, or neighborhoods will dilute the focus of the page and likeliness of your Facebook page to show up in search engine result pages.<\/p>\n<p><strong>3. Number of overall Facebook “Shares.”<\/strong> One of SEO’s most important metrics is the raw number of “Shares” that any given posting on your page garners. Ensure that your Facebook friends are re-posting or “Sharing” your posts by making sure they are interesting, timely, and relevant.<\/p>\n<p><strong>4. Include photo albums on your Facebook page.<\/strong> Not only do clients engage with great photos, but Facebook ranks engaging with photos higher than engaging with text. The more engagement your page has, the more your posts become visible to Facebook users who liked your page. Make sure to include descriptive captions that contain your hyperlocal keyword phrases and update regularly. Posting or even just sharing very unique photos is a great way to increase engagement on your Facebook page.<\/p>\n<p><strong>5. Don’t forget the “About” section.<\/strong> Be sure to completely fill out each section of your profile. Once again, use your hyperlocal keyword phrases. This area is also your chance to tell about the full area your cover, in addition to being the local expert in the hyperlocal area you chose for your Facebook page. Tell visitors exactly what they can do on your Facebook page, and why they should “like” your page and engage with your page.<\/p>\n<p>Building your real estate social network and increasing your real estate website traffic and sales can be even easier when you use the right tools. Whether you are currently using Market Leader’s sales tools, or you are a broker or agent exploring social media marketing on your own, Facebook is a powerful, convenient, and economical choice for generating leads, expanding your brand, and ensuring success. For additional tips, watch our webinar on generating real estate leads using Facebook.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>As of September 2011, Facebook has more than 800 million active users that also encompass a strong real estate social network.According to facebook.com, of those active users, over 50% log in to Facebook on any given day. And, the average user is connected to 80 community pages, groups and events, and creates an average of [&hellip;]<\/p>\n","protected":false},"author":16,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[34,35,36],"tags":[68,72,65],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/3241"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/16"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=3241"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/3241\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=3241"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=3241"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=3241"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}