{"id":32451,"date":"2014-05-23T15:00:57","date_gmt":"2014-05-23T15:00:57","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=32451"},"modified":"2021-11-19T10:19:59","modified_gmt":"2021-11-19T18:19:59","slug":"real-estate-news-roundup","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/real-estate-news-roundup\/","title":{"rendered":"Real Estate News Roundup"},"content":{"rendered":"<h2>Homebuilding Surges in April<\/h2>\n<p>Warmer weather is bringing good news for the home building industry. With the harsh winter behind us, builders broke ground on new homes at the fastest pace in 2014, according to the U.S. Census Bureau. That means more new homes to choose from for your clients.<\/p>\n<p>Home starts jumped to a seasonally adjusted annual rate of 1.07 million. That’s up from 947,000 in March. Economists were expecting a rate of 980,000, according to an Action Economics survey.<\/p>\n<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-32491\" title=\"Home Starts Jumped in April\" src=\"\/wp-content\/uploads\/2014\/05\/Fotolia_48201655_XS-300x300.jpg\" alt=\"Home starts increased in April, boosting the homebuilding industry\" width=\"300\" height=\"300\" \/>Much of the gain in numbers was contributed by construction of multifamily units. For that segment alone, starts skyrocketed 40 percent compared to March. New construction for single-family homes was up 0.8 percent to an annual rate of 649,000, another positive for the industry.<\/p>\n<p>The even better news is that building permits, a measure for future construction, jumped 8 percent to a seasonally adjusted annual rate of 1.08 million. Last month was the third consecutive month when permits surpassed a 1 million annual rate. Permits for single-family homes increased 0.3 percent to an annual pace of 602,000. The rise in permits indicates that the homebuilding industry is upbeat about the future, and it creates a great momentum for the industry going forward.<\/p>\n<p>April construction numbers were up from March nationwide. According to USA Today, the <a href=\"http:\/\/www.usatoday.com\/story\/money\/business\/2014\/05\/16\/april-housing-starts\/9134725\/\">housing starts<\/a> report, along with better employment numbers, could be a sign that the economy will rebound in the second quarter.<\/p>\n<p>&#8220;After weighing on economic growth over the past two quarters residential construction now appears poised to positively contribute in Q2,&#8221; said economist Andrew Labelle, of TD Economics, in a research note Friday, according to the paper.<\/p>\n<h2>Home Prices Spike in Central Indiana<\/h2>\n<p>Tightening inventory has led to a price hike in the Central Indiana market. Home prices jumped  5.5 percent in April when compared to a similar year-ago period.<\/p>\n<p>The news is exciting for homeowners looking to move up. But, for agents this means advising your clients to brace themselves to pay more and act fast if they chance upon their dream home.<\/p>\n<p>According to the Metropolitan Indianapolis Board of Realtors®, the average sales price in April increased from $163,275 to $172,291 when compared to a year-ago period. In terms of listing price, sellers are fetching 93.7 percent of what they are quoting. That’s up from 89.8 percent two years ago.<\/p>\n<p>Dwindling inventory is the main reason for the price hike, and it  looks like the uptick in price will continue for a while. The current monthly inventory supply in the market is for five months.<\/p>\n<p>Many homeowners are still waiting to fetch a good price on their homes and are holding off from putting their homes out in the market.<\/p>\n<p>Tracy Hutton, a broker with Century 21 Scheetz, told the Indianapolis Star that people who want to move into larger homes may be skeptical about finding what they want on the market. As a result, they’re <a href=\"http:\/\/www.indystar.com\/story\/money\/2014\/05\/20\/april-housing-market-brings-higher-prices-fewer-sales\/9330609\/\">waiting to list their homes<\/a>.<\/p>\n<p>“People don’t feel confident they can find what they want,” she said. “They are fearful of putting their homes on the market, the house selling quickly and then having nothing to move into.”<\/p>\n<p>Hopefully, new housing starts will kick in during the coming months and solve some of the problem.<\/p>\n<h2>Housing Fundamentals are Strong<\/h2>\n<p>Despite some reports about a slowdown in sales, housing fundamentals are sound, according to Federal Reserve Bank of Philadelphia President Charles Plosser.<\/p>\n<p>“Some express concern that the <a href=\"http:\/\/blogs.wsj.com\/economics\/2014\/05\/20\/plosser-fundamentals-of-u-s-housing-market-remain-sound\/\">housing recovery<\/a> in recent months is waning. I’m actually more optimistic,” Plosser said, according to the Wall Street Journal. “I think the fundamentals of housing are still sound, even though sales have leveled off. More importantly, prices … are still rising, even over the last three months.”<\/p>\n<p>Plosser said that the industry will have to wait and watch how the market unfolds in late spring and early summer.<\/p>\n<p>The housing market has been on a great recovery track in the last few years, but rising interest rates and a hike in home prices slowed down some of the momentum.<\/p>\n<p>Plosser is optimistic about the future.<\/p>\n<p>“The fundamentals of the housing market remain sound, including stronger household formation, better job growth and consumers with stronger balance sheets,” he said.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Homebuilding Surges in April Warmer weather is bringing good news for the home building industry. With the harsh winter behind us, builders broke ground on new homes at the fastest pace in 2014, according to the U.S. Census Bureau. That means more new homes to choose from for your clients. Home starts jumped to a [&hellip;]<\/p>\n","protected":false},"author":35,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[466],"tags":[475,382,167,388,56,476],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/32451"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/35"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=32451"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/32451\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=32451"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=32451"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=32451"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}