{"id":32761,"date":"2014-05-30T12:00:40","date_gmt":"2014-05-30T12:00:40","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=32761"},"modified":"2021-11-19T09:52:34","modified_gmt":"2021-11-19T17:52:34","slug":"leadership-lessons-from-a-former-u-s-president","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/leadership-lessons-from-a-former-u-s-president\/","title":{"rendered":"Leadership Lessons From a Former U.S. President"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright  wp-image-33421\" title=\"IanMorris-caption\" src=\"\/wp-content\/uploads\/2014\/05\/IanMorris-caption-230x300.png\" alt=\"Ian Morris, President of Market Leader, at the Gathering of Eagles conference of real estate industry leaders\" width=\"184\" height=\"240\" \/>Last week I travelled to Dallas to join over 370 leaders of the real estate industry at the annual Gathering of Eagles conference.<\/p>\n<p>Sponsored by REAL Trends, the event is something I look forward to with great anticipation, but this year it was more amazing than I envisioned.<\/p>\n<p>While REAL Trends sponsored the keynote speaker, former President George W. Bush, Trulia and Market Leader hosted a special, private session with him.<\/p>\n<p>Whether the attendees agreed with President Bush’s politics or not, I think Steve Murray, president of REAL Trends and the moderator of the question-and-answer session, summed up how many of us felt after the session: “The President shared some deeply personal thoughts and convictions of what great leaders do when confronted with unexpected challenges.”<\/p>\n<p>In a nutshell, the former president identified three things that effective leaders do:<\/p>\n<ul>\n<li>Surround themselves with the right advisors.<\/li>\n<li>Benchmark all decisions around the mission or core values of the organization.<\/li>\n<li>Be prepared to make the right decisions, even if they might not be popular.<\/li>\n<\/ul>\n<p>The key takeaway for me and several other attendees was how we can apply the former president’s leadership style to our individual circumstances.<\/p>\n<h2>Making Decisions Based on Core Values<\/h2>\n<p>Shortly after the election, President Bush very quickly figured out what was going to define his presidency. He walked in with an agenda – as any leader does – and he had a vision. This is a trait shared by all leaders: having a vision of where you want to take an organization, a department or, for real estate brokers or agents, where you want to take your office or your personal book of business.<\/p>\n<p>Visions, however, can shift unexpectedly and you must rise to the occasion. President Bush pointed this out when he contrasted his original vision against the events of 9\/11. His mission then became one of protecting the people of the United States. He became what he’d never envisioned: a wartime president. Adjusting the vision to the reality was a challenge, but one he rose to.<\/p>\n<p>One of the most challenging aspects of the situation was determining a litmus test for making the huge decisions that were required of him.<\/p>\n<p>For example, he talked about sitting in that third-grade classroom and finding out what was taking place on 9\/11. From that moment forward, he based every single decision on core values, with the safety of the American people paramount among them.<\/p>\n<p>I think this tactic can apply to business as well. If you’re just making decisions based on the situation, without benchmarking them against your (or the company’s) values, you run the very real risk of making a decision that is less than ideal.<\/p>\n<p>While many of the decisions that confronted President Bush were far weightier than those we face at work, the former president explained that having this benchmark made decision-making much easier.<\/p>\n<h2>Leadership Isn’t a Popularity Contest<\/h2>\n<p>One of my favorite George W. Bush quotes came from an appearance on Oprah’s show to promote his book, “Decision Points.” He said, “One of my proudest moments is I didn&#8217;t sell my soul for the sake of popularity.”<\/p>\n<p>Some media pundits chose to call this a joke &#8211; and it may have been, partially, as he is known for his sense of humor and his ability to poke fun at himself. There is a kernel of truth encapsulated in that comment, however, and it is one of the foundations of the former president’s leadership philosophy: remaining steadfast in his decisions, no matter what.<\/p>\n<p>From a leadership perspective, that’s something I took away as well. Make the right decision, based on the information you have. Benchmark it against your core values and then, more importantly, realize that some of your decisions aren’t going to be popular &#8211; you’re never going to make everyone happy.<\/p>\n<p>Even in my own organization, I try to do the right thing. That’s a value that I live by. If you’re doing the right thing, your decisions may not be popular &#8211; and you may not get credit for them &#8211; but that’s OK, as long as you’ve done the right thing.<\/p>\n<h2>Life Lessons<\/h2>\n<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-33431\" title=\"NickBaileywithAlexLange-caption\" src=\"\/wp-content\/uploads\/2014\/05\/NickBaileywithAlexLange-caption-300x291.png\" alt=\"Nick Bailey and Alex Lange, Market Leader executives, at the Gathering of Eagles conference for leaders in the real estate industry\" width=\"300\" height=\"291\" \/>One final takeaway is more of a life lesson than a leadership lesson.<\/p>\n<p>President Bush spoke about his last day in the White House and how, when he walked out the door for the last time, he had no idea what to do with himself.<\/p>\n<p>When one is accustomed to moving at light speed, the sudden slowdown can be a challenge. A highly intelligent man, George W. Bush realized that the presidency was but one stage in his life and he needed to find something else to motivate him and help feed the drive and ambition that still remained. That urge to stay young and keep his mind fresh drove him to find other interests that held value for him.<\/p>\n<p>So, he took up painting. Actually, he immersed himself fully into painting, hiring a coach who would come to the house to teach him how to paint. It has become a great passion for him. In fact, he had been painting in the car on the way over to meet with us and bore paint under his fingernails as proof.<\/p>\n<p>The takeaway from this is that no matter what stage of life you’re in, find something that you’re passionate about so that it continues to drive and motivate you.<\/p>\n<h2>Lasting Impressions<\/h2>\n<p>I was curious to learn what other attendees considered takeaways from the conversation with the former president. The following day, I had a chance to find out.<\/p>\n<p>Jack Kreider, vice president of regional development with RE\/MAX LLC, was taken aback by how engaging President Bush is. “He is far more dynamic, charismatic, funny, engaging, and intelligent in person than he appeared as president (or maybe it was the media’s presentation of him),” he said.<\/p>\n<p>Kreider also mentioned how easy it was to forget about Bush’s foreign relations expertise and enjoyed the former president’s insight into other countries and their leaders.<\/p>\n<p>Bob McAdams, president of Real Living Real Estate, agreed, saying that President Bush’s view on world affairs was fascinating.<\/p>\n<p>Sherry Chris, president and CEO of <a href=\"https:\/\/bhgrefranchise.com\/\">Better Homes and Gardens® Real Estate<\/a>, mentioned how she’d had the privilege of meeting President Clinton as well. She described the parallels between the two men, such as their commanding presence and how adept they are at interfacing with people, whether they know them well or not.<\/p>\n<p>Rich Rector, CEO of Realty Executives International and co-author of “The E-Myth Real Estate Brokerage,” thanked Trulia and Market Leader for the opportunity to be included in such an intimate setting with a past president, saying that it was a once-in-a-lifetime opportunity.<\/p>\n<p>Leadership involves making hard choices, whether choosing between two good options or two distasteful options. Having a touchstone of core values is paramount when faced with both situations. Decisions that are anchored in a coherent set of principles allow a leader the confidence to remain steadfast.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Last week I travelled to Dallas to join over 370 leaders of the real estate industry at the annual Gathering of Eagles conference. Sponsored by REAL Trends, the event is something I look forward to with great anticipation, but this year it was more amazing than I envisioned. While REAL Trends sponsored the keynote speaker, [&hellip;]<\/p>\n","protected":false},"author":30,"featured_media":33321,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[27],"tags":[480,481,482,483,484,56,485],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/32761"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/30"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=32761"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/32761\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=32761"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=32761"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=32761"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}