{"id":32801,"date":"2017-11-04T16:09:56","date_gmt":"2017-11-04T23:09:56","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=32801"},"modified":"2022-01-26T13:12:20","modified_gmt":"2022-01-26T21:12:20","slug":"the-5-principles-of-sales-pipeline-management","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/the-5-principles-of-sales-pipeline-management\/","title":{"rendered":"The 5 Principles of Sales Pipeline Management"},"content":{"rendered":"<p>The key to longevity in the real estate world is never a single deal: <em>It’s a disciplined, rational and systematic approach to developing future deals.<\/em><\/p>\n<p>You can do that without having had much previous good luck. But it’s really hard to do that and stay unlucky! Here’s how to build and manage a sales pipeline that should help you generate not just one deal, but a steady stream of future deals.<\/p>\n<h2>1. Put a System in Place<\/h2>\n<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-32831\" title=\"Sales Pipeline Management\" src=\"\/wp-content\/uploads\/2014\/05\/Fotolia_52547423_XS-300x225.jpg\" alt=\"One of the keys to success for real estate pros is effectively managing a sales pipeline\" width=\"300\" height=\"225\" \/>The most important thing is to take action <em>now.<\/em><\/p>\n<p>In the past, agents and salespeople of all stripes used a variety of paper systems.<\/p>\n<p>A legendary insurance salesperson named Al Granum systematized his lead management system with index cards and a small metal file box he kept in the front seat of his car. Much of the success of Northwestern Mutual was built on Al’s low-tech system and training. Since then, Northwestern digitized their system, which became very widely admired and emulated all over the insurance industry. Al Granum died in 2014, at the age of 91. But his legacy is immense: The system he developed has become the backbone of many a successful salesperson, both in and out of the insurance industry.<\/p>\n<p>Fast forward to today: Computer programmers have built on the successful OneCard system that Al Granum pioneered in the insurance agency and adopted the sales pipeline concept for their own industries. Naturally, the unique marketing and sales processes of the real estate industry call for their own solution, designed specifically for the real estate business.<\/p>\n<p>The decision is easy for today’s real estate agents: a fully integrated sales pipeline management system designed especially for real estate professionals.<\/p>\n<p>A great <a href=\"http:\/\/www.marketleader.com\/products\/professional-for-agents\/\">CRM <\/a>makes it a snap to import your business contacts and to sort them into the appropriate categories within a fully integrated solution. In addition to lead management, a solid CRM system should offer the following benefits:<\/p>\n<ul>\n<li>Easy integration with MLS.<\/li>\n<li>A personally branded website – designed specifically to capture leads.<\/li>\n<li>“Market Insider” reports designed to highlight you as the neighborhood expert.<\/li>\n<li>Marketing Design Center with professionally-designed resources to power your brand.<\/li>\n<li>Professional education and training programs.<\/li>\n<li>Activity tracking with alerts and reminders.<\/li>\n<li>Fast property flyer editing and creation.<\/li>\n<li>Professional printing from Shutterfly.<\/li>\n<li>Seamless<a href=\"\/blog\/market-leader-partners-with-dotloop-to-create-a-seamless-lead-to-close-experience-for-real-estate-professionals\/\"> lead-to-close<\/a> experience with dotloop integration.<\/li>\n<li>Mobile access, so you can work your system from anywhere.<\/li>\n<\/ul>\n<p>For managing brokers and franchise owners, the tools available are even more robust, including lead capture and distribution, tracking tools, ROI measurements, and much more.<\/p>\n<h2>2. Feed the Beast <strong>       <\/strong><\/h2>\n<p>Now that you have a backbone in place, it’s time to flesh it out with contacts from your marketing efforts. This can be a time-consuming process, because at a minimum you’ll want to key in a phone number, an email address, and some notes about how you know this prospect and what you’ve talked about.<\/p>\n<p>Where are these contacts going to come from?<\/p>\n<ul>\n<li>Your own existing natural market.<\/li>\n<li>Satisfied clients.<\/li>\n<li>Referrals.<\/li>\n<li><a href=\"http:\/\/www.marketleader.com\/products\/real-estate-leads\/\">Real estate leads services<\/a><\/li>\n<li>Contacts acquired from your own marketing and prospecting efforts on top of these:\n<ul>\n<li>Advertising<\/li>\n<li>Networking<\/li>\n<li>Direct mail<\/li>\n<li>Phone prospecting<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<p>You want to have a single, organized software backbone to feed all of these contacts into. Eliminate “leakage.” Leakage is any name that you struggled or paid for that became a contact and then fell through the cracks. Any leak is wasted time or wasted money.<\/p>\n<p>There is no such thing as a bad lead &#8211; All contact are viable, if you work them.<\/p>\n<h2>3. Work Your System<\/h2>\n<p>The great part about having a fully developed sales pipeline is that all of a sudden, every day, when you arrive at your office or start your day, <em>you have a track to run on!<\/em><\/p>\n<p>Many agents and other sales professionals get overwhelmed by the sheer vastness of the potential market and all the things that need to be done – as well as all the things the agent <em>thinks<\/em> need to be done that aren’t really that important.<\/p>\n<p>Don’t get tunnel vision with one aspect of the pipeline. Yes, you should prioritize moving prospects from “qualified” to “paid.” That’s what will get you operating capital to stay in the business. But you can’t spend all your time there. You’ll wind up with a few deals paid and no idea where your next commission check is coming from. You have to spend a substantial amount of time adding new names to the pipeline through your real estate prospecting and marketing efforts.<\/p>\n<p>Remember that it will probably take at least 10 appointments to get to three proposals, and of these you may eventually get one sale. The 10:3:1 ratio seems to be fairly constant in all kinds of sales environments. So let that be a guide to how much time you spend on expanding and working with your pipeline.<\/p>\n<p>Another advantage to a well-developed pipeline management program is it allows you to reverse engineer your business to meet target commission earnings over the next year. If you know your average commission rate, and you know you will close an average of 2 to 3 percent of leads, and you have an idea of the average price of homes in your market, you can figure out how many leads you need to have to meet your income goals.<\/p>\n<p>Confused? Don’t be. Our <a href=\"http:\/\/www.marketleader.com\/leadcalculator\/\" target=\"_blank\" rel=\"noopener\">Lead Calculator<\/a> will walk you through it.<\/p>\n<h2>4. Manage It<\/h2>\n<p>This one is for you, managers and mentors out there. Insist that your agents put in the elbow grease in maintaining a good sales pipeline document. This can go a long way toward helping you help them.  Agents, help your manager help you!<\/p>\n<p>Go down your list. Are there deals that you think are dying? This is where you can get help resurrecting them. Your manager may be able to help you develop a strategy or tool to keep a deal moving forward.<\/p>\n<p>Agents should be prepared to discuss every name in their pipeline. Managers should expect agents to have a plan for every name in their pipeline. Managers should compare their agents’ pipelines week-to-week and month-to-month. If there’s not much movement, you have a problem. The agent may not have the skills to keep the names flowing, or may not have the will. Either situation requires an energetic response from leadership.<\/p>\n<h2>5. Upgrade It<\/h2>\n<p>If you’re on paper already, or you’re using an outdated, legacy CRM program, upgrade as soon as possible.<\/p>\n<p>Struggling agents can quickly have a benchmark to improve against by comparing their early-stage lead capture and appointment metrics to those who are more successful. For example, when you show a struggling agent that they are averaging one appointment per day and compare it with a successful agent’s report that shows three kept appointments most days, that can be a powerful motivator and learning tool.<\/p>\n<p>Of course, I’m a big believer in tracking metrics and their trends over time, but these tools are only as good as the effort with which agents input their data into the system. That’s why it’s important to invest in the best program, with an intuitive interface that makes it easy for agents to keep up their stats.<\/p>\n<p>Market Leader Professional is an all-in-one software solution that helps agents attract, capture, and convert more leads. It includes a branded website with MLS listings that is extensively customizable, a professionally-designed marketing center, and <a href=\"\/blog\/market-leader-partners-with-dotloop-to-create-a-seamless-lead-to-close-experience-for-real-estate-professionals\/\">integrations <\/a>that allow for end-to-end transaction and relationship management. <a href=\"http:\/\/www.marketleader.com\/products\/professional-for-agents\/\">Learn more about Market Leader Professional.<\/a><\/p>\n<p>This post has been updated as of 11\/9\/2017.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The key to longevity in the real estate world is never a single deal: It’s a disciplined, rational and systematic approach to developing future deals. You can do that without having had much previous good luck. But it’s really hard to do that and stay unlucky! Here’s how to build and manage a sales pipeline [&hellip;]<\/p>\n","protected":false},"author":34,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[97],"tags":[106,267,126,486,142,199,487,143],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/32801"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/34"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=32801"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/32801\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=32801"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=32801"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=32801"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}