{"id":32921,"date":"2014-05-30T15:16:39","date_gmt":"2014-05-30T15:16:39","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=32921"},"modified":"2021-11-22T13:32:52","modified_gmt":"2021-11-22T21:32:52","slug":"new-home-sales-are-up-deals-abound-in-nantucket-and-cape-cod","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/new-home-sales-are-up-deals-abound-in-nantucket-and-cape-cod\/","title":{"rendered":"New Home Sales are Up; Deals Abound in Nantucket and Cape Cod"},"content":{"rendered":"<h2 dir=\"ltr\">Buyers Find Bargains on Massachusetts Vacation Homes<\/h2>\n<p dir=\"ltr\"><img loading=\"lazy\" class=\"alignright size-medium wp-image-32941\" title=\"Bargains Abound in Nantucket and Cape Cod Markets\" src=\"\/wp-content\/uploads\/2014\/05\/Fotolia_17893488_XS-300x200.jpg\" alt=\"Buyers can find great deals on homes in Nantucket and Cape Cod real estate markets\" width=\"300\" height=\"200\" \/>If your clients are sweating over the price hikes on homes in the Boston market and its surrounding communities, advise them to widen their search. Chances are they will find very good deals.<\/p>\n<p dir=\"ltr\">There are still<a href=\"https:\/\/www3.bostonglobe.com\/business\/2014\/05\/26\/with-slow-cape-housing-recovery-summer-home-bargains-still-had\/ukdYKRdWKnkuZfLynozbkL\/story.html?arc404=true\"> bargains galore on Cape Cod<\/a> and the islands, according to data from the Massachusetts Association of Realtors®.<\/p>\n<p dir=\"ltr\">According to the trade group, prices have achieved their prerecession peak only in Edgartown, on Martha’s Vineyard. The median home price in Edgartown touched $801,500 in 2013, according to the Boston Globe. That’s an 11.7 percent jump from the 2005 peak levels, the paper said. But, in Nantucket, which is considered an exclusive summer getaway for the rich, prices are nearly 30 percent off the peak level of $1.49 million. So, that’s one place to consider, along with communities such as Hyannis, where prices are down 34 percent from the peak level of $327,000; Oak Bluffs, where they’re down 25 percent from $595,000; and Yarmouth, where prices are down 20.4 percent from $327,000.<\/p>\n<p dir=\"ltr\">So, tell your clients that now may be the right time to invest in that vacation home or rental property. These sweet deals aren’t going to last forever. Prices are already beginning their upward climb. The median prices for single-family homes on the Cape increased 0.6 percent in March to $327,000 when compared to the previous year. According to the Massachusetts Association of Realtors®, Barnstable, Brewster, Centerville, Chatham, Cotuit, Harwich, Hyannis, Falmouth, Osterville, Provincetown, and Wellfleet experienced a hike in median prices, compared with the same period in 2013.<\/p>\n<p dir=\"ltr\">In Osterville, the median single-family home price skyrocketed 42 percent, while in Falmouth prices shot up nearly 20 percent, according to the Boston Globe.<\/p>\n<h2 dir=\"ltr\">New Home Sales Increase<\/h2>\n<p dir=\"ltr\">New home prices in April inched upward for the first time in three months, climbing 6.4 percent to a 433,000 annualized rate, according to data from the Commerce Department.<\/p>\n<p dir=\"ltr\">What triggered the increase was a demand for homes in the Midwest.<\/p>\n<p dir=\"ltr\">“The deep freeze is over, and I think we can expect <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2014-05-23\/sales-of-new-u-s-homes-increased-6-4-in-april-to-433-000-pace\">new home sales<\/a> to continue to rise,” David Berson, chief economist at Nationwide Insurance in Columbus, Ohio, who projected a 432,000 rate of April sales, told Bloomberg. “It’s better; it’s still not strong.”<\/p>\n<p dir=\"ltr\">In the Midwest, home sales increased 47.4 percent to an 84,000 annual rate. That’s the fastest since November 2007. Home sales also climbed 3.1 percent in the South.<\/p>\n<p dir=\"ltr\">There are other indicators that prices are on the upswing. According to the National Association of Realtors®, sales of previously occupied homes increased 1.3 percent.<\/p>\n<h2 dir=\"ltr\">Toll Brothers Reaping Profits<\/h2>\n<p dir=\"ltr\">Here’s another positive indicator for the industry. Strong buyer demand triggered an increase in profits for homebuilder Toll Brothers. Second-quarter profits more than doubled for the company compared to a year ago. The company predicted that it will continue to fetch <a href=\"https:\/\/www.usatoday.com\/story\/money\/business\/2014\/05\/28\/toll-brothers-earnings\/9661173\/\">higher prices for its luxury homes<\/a> the rest of the year, according to USA Today.<\/p>\n<p>In the most recent quarter ended April 30, the company earned $65.2 million, or 35 cents per share, compared with $24.7 million, or 14 cents per share, in last year’s second quarter. Analysts were expecting earnings of 27 cents per share.<\/p>\n<p dir=\"ltr\">The company readied 1,218 homes for the market in the second quarter. That’s a 36 percent jump. It wasn’t just  the quantity that increased. The average price on new homes delivered was up 22 percent at $706,000, compared to a year ago. The company said it expects an average price of $690,000 to $720,000 for all homes delivered this year.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Buyers Find Bargains on Massachusetts Vacation Homes If your clients are sweating over the price hikes on homes in the Boston market and its surrounding communities, advise them to widen their search. Chances are they will find very good deals. There are still bargains galore on Cape Cod and the islands, according to data from [&hellip;]<\/p>\n","protected":false},"author":35,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[466],"tags":[488,355,241,167,489,490,388,56,395],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/32921"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/35"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=32921"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/32921\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=32921"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=32921"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=32921"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}