{"id":32981,"date":"2014-06-02T15:00:24","date_gmt":"2014-06-02T15:00:24","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=32981"},"modified":"2022-01-26T13:26:48","modified_gmt":"2022-01-26T21:26:48","slug":"5-things-productive-agents-do-every-day","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/5-things-productive-agents-do-every-day\/","title":{"rendered":"5 Things Top Agents Do Every Day"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-33301\" title=\"Increasing Productivity\" src=\"\/wp-content\/uploads\/2014\/06\/Fotolia_36582503_XS-300x216.jpg\" alt=\"There are five things that highly productive agents do on a daily basis\" width=\"300\" height=\"216\" \/>The differences between productive agents and average agents are stark. Top-producing agents tend to start work earlier and end later in the day than other agents. They aren’t afraid to spend the money required to promote their businesses – money that average agents cling to for dear life. Agents making less than $30,000 a year never <a href=\"\/blog\/a-portrait-of-the-agent-realtor-habit-survey\/\">socialize with clients<\/a> and never give gifts to clients, whereas successful agents claim to “always” do both.<\/p>\n<p>If your aim is to join the ranks of the super producers, adopting some of their habits is a good way to get started. Perform these five tasks every day and you’ll be on your way!<\/p>\n<h2>1. Lead Generation<\/h2>\n<p>Leads are the holy grail of every real estate business; without them, there is no business. Productive agents get this and spend time every day capturing leads.<\/p>\n<p>Unlike their counterparts of the past, however, this task doesn’t need to be labor-intensive. Sure, agents still call FSBOs, knock on doors and hang flyers, but today’s technology allows them some powerful lead generation tools that are almost completely hands-off.<\/p>\n<p>Start with a website. A site designed to capture prospects is a must and may just turn into your most valuable tool. Debbie King, an agent in Newport, N.C., claims that without her website, “real estate would be pointless.”<\/p>\n<p>Throw in an integrated MLS search function, some compelling neighborhood data, and you’ve got a potential gold mine full of leads.<\/p>\n<h2>2. Follow-Up<\/h2>\n<p>Of course it isn’t enough to just capture leads; the win is in the follow-up. Cultivating leads is another task that productive agents turn their attention to during a typical workday. Whether this is the immediate follow-up of a website contact or spending time putting your leads on email campaigns, follow-up is critical.<\/p>\n<p>A robust CRM can automate the email campaign process, freeing up time for other tasks.<\/p>\n<p>What other tasks? On a day or two per week, take a few minutes to call your sphere, take a former client out for coffee, or email an item of interest to a contact. Remaining top-of-mind is essential if you hope to keep the pipeline full.<\/p>\n<hr \/>\n<p>\n<a href=\"\/products\/professional-for-agents\/\"><img class=\"alignleft size-medium wp-image-44201\" src=\"https:\/\/www.marketleader.com\/wp-content\/uploads\/2016\/02\/Blog-CTA-arrows-2.png\" alt=\"Learn more about Market Leader Professional's customizable marketing campaigns\"><\/a><strong><em>Market Leader Professional makes lead follow-up simple. Use thousands of customizable email and direct mail templates to stay in touch with your prospects. <\/em><a href=\"\/products\/professional-for-agents\/\">LEARN MORE &gt;&gt;<\/a><\/strong><\/p>\n<hr \/>\n<h2>3. Service Current Clients<\/h2>\n<p>Don’t be the agent who disappears after he takes the listing or signs up a buyer client.  Productive agents take the time every day to communicate with at least one active client.<\/p>\n<p>Call a listing client to check in, or communicate with one of your buyers. Maintain that relationship to foster future referrals.<\/p>\n<p>Coach Rich Levin claims that, “There is more business in good service than in most forms of good prospecting.” His team counsels their agent clients to reserve an hour out of every workday &#8211; known as a “Service Hour” &#8211; to call their sellers, their buyers and their hottest leads. Even one hour a week devoted to this task will boost your productivity and assure future business.<\/p>\n<h2>4. Network<\/h2>\n<p>Interacting with other people, face-to-face, is not only important for your <a href=\"\/blog\/the-happiest-agent-on-the-block\/\">professional happiness<\/a>, it’s essential if you hope to garner referrals.<\/p>\n<p>Make a plan to get out of the office with the sole aim of building relationships. Whether you socialize with clients, former clients or other industry professionals, the time spent doing so will pay off.<\/p>\n<p>“A Portrait of the Agent,” Market Leader’s <a href=\"\/blog\/a-portrait-of-the-agent-realtor-habit-survey\/\">Realtor® habit survey<\/a> – shows that high-earning agents are more than 100 percent more likely to socialize with their clients than the average agent.<\/p>\n<p>But don’t restrict your networking efforts only to those you’ve done business with. Even close friends need to be reminded that you run a real estate business and can always use new clients. Past and present co-workers, neighbors, folks you meet in community organizations, parents of your children’s schoolmates, people at the gym, those you meet on your morning coffee run and people in your religious community are all a part of your network.<\/p>\n<h2>5. Delegate<\/h2>\n<p>The most productive agents in the country share two business traits: They use technology to maximize their time and they hire assistants, according to the National Association of Realtors®.<\/p>\n<p>In fact, agents who hire assistants consistently tell us that they would never have been able to move to the next level in their business had they not hired help. This makes sense when one considers that an assistant helps increase your efficiency, thereby freeing you up to perform the important tasks outlined above.<\/p>\n<p>“Think of success as a game of chance in which you have control over the odds,” suggests Bo Bennett, self-made millionaire and author of “Year to Success.” Take control of the game, master the habits of productive agents, and you’ll increase your odds of achieving their same level of success.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The differences between productive agents and average agents are stark. Top-producing agents tend to start work earlier and end later in the day than other agents. They aren’t afraid to spend the money required to promote their businesses – money that average agents cling to for dear life. Agents making less than $30,000 a year [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[97],"tags":[106,124,156,54,117,491,159,56],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/32981"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=32981"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/32981\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=32981"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=32981"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=32981"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}