{"id":33101,"date":"2014-06-04T15:00:40","date_gmt":"2014-06-04T15:00:40","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=33101"},"modified":"2022-09-26T13:27:51","modified_gmt":"2022-09-26T20:27:51","slug":"15-networking-secrets-of-successful-real-estate-agents","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/15-networking-secrets-of-successful-real-estate-agents\/","title":{"rendered":"15 Networking Secrets of Successful Real Estate Agents"},"content":{"rendered":"<p><em>This post was updated on 4\/19\/2018.<\/em><\/p>\n<p>Okay, well, most of these shouldn’t exactly be secrets. But given how important networking is in the real estate business, it’s still amazing how many agents don’t make the most out of their networking opportunities. Here are some of the best practices I’ve gathered over the years.<\/p>\n<p><img loading=\"lazy\" class=\"alignright wp-image-33201 size-medium\" title=\"Networking Secrets\" src=\"\/wp-content\/uploads\/2014\/05\/Fotolia_57482566_XS-300x212.jpg\" alt=\"Ultimately, these 15 best practices for real estate networking can lead to more closings.\" width=\"300\" height=\"212\" \/><strong>1.<\/strong> Be a card taker, not just a card giver. Always be thinking about ways you can partner with the people you&#8217;ve met.<\/p>\n<p><strong>2.<\/strong> <a href=\"https:\/\/www.fbi.gov\/file-repository\/elicitation-brochure.pdf\/view\">Elicitation<\/a> is the craft of gathering intelligence simply by getting people to talk, and listening. It’s a skill, and intelligence, counterintelligence and law enforcement officials train hard to become good at it. Try to master the art of listening and asking the right questions.<\/p>\n<p><strong>3.<\/strong> Don’t be talking on the phone during networking events and trade shows if you don’t have to. When you’re networking, network. Otherwise, the people who trust their voicemail or have staff taking care of routine inquiries will walk away with all the contacts you should be making.<\/p>\n<p><strong>4.<\/strong> Paid networking events are better deals than unpaid ones. People who pay to join a network are generally more serious. Unpaid networking groups are too frequently broke people trying to sell to other broke people. The only ones that will make money are the debt counselors.<\/p>\n<p><strong>5.<\/strong> See another real estate agent? Smile, say hello, shake hands, and be as friendly as possible. Having a strong network that includes other agents can offer shared best practices, lessons, and even lead to referrals. Not to mention you might end up working with an agent you&#8217;ve met networking and having a good professional relationship with make the process that much easier.<\/p>\n<p><strong>6.<\/strong> Take the initiative. Be the first to follow up with your contacts. Just give them a call and get permission to “stay in touch.” That’s all you need at first.<\/p>\n<p><strong>7.<\/strong> Enter all contacts into your <a href=\"\/solutions\/crm\/\">contact relationship management system<\/a> immediately. Be sure to note where you met them, their line of business, and something about your interaction so you can easily recall the interaction.<\/p>\n<p><strong>8.<\/strong> Have a plan. You should keep a list of people you want to meet – people you want to transform into customers, mentors and referral sources. These are community leaders, trusted professionals, and the like.<\/p>\n<p><strong>9.<\/strong> Try to create your own “events.” Seminars can take a lot of planning, but people will line up to speak with you after the event if you do it well – and the crowds will usually be relatively free of competing agents.<\/p>\n<p><strong>10.<\/strong> Have a marketing plan to soften up new acquaintances between your phone calls. Your marketing plan should establish you as an expert while maximizing your top-of-mind awareness. If you don’t have a marketing plan, you are wasting too much of your prospecting effort. Marketing is what makes your networking effective. And over time, networking is what will make your prospecting effective.<\/p>\n<hr \/>\n<p><a href=\"\/products\/real-estate-leads\/\"><img class=\"alignleft size-medium wp-image-44201\" src=\"https:\/\/www.marketleader.com\/wp-content\/uploads\/2016\/02\/Blog-CTA-arrows-2.png\" alt=\"Learn how Market Leader can generate more buyer and seller leads for you\" \/><\/a><strong><em>NEED MORE LEADS? Market Leader can generate a guaranteed number of exclusive buyer and seller leads for you each month. <\/em><a href=\"\/products\/real-estate-leads\/\">LEARN MORE &gt;&gt;<\/a><\/strong><\/p>\n<hr \/>\n<p><strong>11.<\/strong> Give more than you get. Go into every event looking to help people. Give referrals. If you are a giver, you’ll get more than your share in return.<\/p>\n<p><strong>12.<\/strong> Don’t hang out with familiar people too much. Make a pact with them that you will both move on to meet new people after five minutes. Make an appointment to get together later, if you must.<\/p>\n<p><strong>13.<\/strong> Keep notes. Talk about their families, needs, professional concerns, etc. The more you know about them, the better you can serve them as an agent. For example, you will know if they have a baby on the way they may be looking for more space in the future. If they just moved into town they may be shopping. If your contact is shortly getting transferred to another city, they may soon be listing a house. If you have an idea when that will occur, you can deliver a well-timed mailer and phone call.<\/p>\n<p><strong>14.<\/strong> Have fun. Seriously. If you’re having fun, people around you will too.<\/p>\n<p><strong>15.<\/strong> Don’t get drunk. You don’t have to be that much fun. Save it for after the closing. With people who aren’t prospects.<\/p>\n<p>In closing, remember that networking is important, but it isn’t the only link in the chain of activities that will make you successful. Everything you do should combine in synergies to make everything else you do more effective. Here is an example of how networking sits in your cycle.<\/p>\n<p style=\"text-align: center;\"><img loading=\"lazy\" class=\"aligncenter wp-image-33111\" title=\"Networking and Sales Success\" src=\"\/wp-content\/uploads\/2014\/05\/Networking-and-Sales-Success.png\" alt=\"In real estate, networking is the first step in the prospecting cycle.\" width=\"720\" height=\"431\" \/><\/p>\n<p>Networking is only one element of your sales success. But it won’t be effective unless you have a system that reinforces your networking conversation; establishes yourself as an expert via your marketing, advertising and PR efforts; leads to further follow-ups, and ultimately to closing sales.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>This post was updated on 4\/19\/2018. Okay, well, most of these shouldn’t exactly be secrets. But given how important networking is in the real estate business, it’s still amazing how many agents don’t make the most out of their networking opportunities. Here are some of the best practices I’ve gathered over the years. 1. Be [&hellip;]<\/p>\n","protected":false},"author":34,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[34],"tags":[23,106,126,171,117,56],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/33101"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/34"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=33101"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/33101\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=33101"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=33101"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=33101"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}