{"id":33541,"date":"2014-06-11T15:00:37","date_gmt":"2014-06-11T15:00:37","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=33541"},"modified":"2017-08-10T12:43:15","modified_gmt":"2017-08-10T19:43:15","slug":"5-tips-for-successful-open-houses","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/5-tips-for-successful-open-houses\/","title":{"rendered":"5 Tips for Successful Open Houses"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-33561\" title=\"5 Tips for a Successful Open House\" src=\"\/wp-content\/uploads\/2014\/05\/Fotolia_7684169_XS-199x300.jpg\" alt=\"Real estate agents can follow these five tips to help make an open house successful\" width=\"199\" height=\"300\" \/>Whether you swear by open houses or consider them a waste of time, if you’re going to hold one, it only makes sense that your goal is to be successful. However, agent opinions on what makes for a successful open house differ widely.<\/p>\n<p>Certain elements of open houses, however, find almost complete agreement among agents. Let’s take a look at those and also some of the more controversial aspects of the open house process.<\/p>\n<h2>1. Timing<\/h2>\n<p>My first open house as a rookie was attended by a whopping zero people. I sat there for three hours waiting, but nobody came. It wasn’t until I got home and turned on the news that I realized I’d held an open house, in a San Francisco suburb, on the very day the 49ers were in the playoffs. Not a football fan, I had no idea that the locals who weren’t soaking in the game at Candlestick Park were watching it on TV.<\/p>\n<p>Check a schedule of local events before choosing a date for your open house. Holding a home open on the first day of the county fair or any other highly attended local event may spell doom for your open house.<\/p>\n<p>Schedule the hours the home is open so that you either start or end one hour earlier or later than is customary in the area. For instance, if most agents hold their listings open from 1 p.m. to 3 p.m., hold yours from either noon to 3 p.m. or 1 to 4 p.m. This gives your listing undivided attention from either early birds or late stragglers.<\/p>\n<h2>2. Prep the Home<\/h2>\n<p>We have yet to meet an agent who doesn’t feel that his or her listing needs to be clean, deodorized, uncluttered and sometimes staged for an open house. In fact, many of them have told us they supply their listing clients with a checklist of what must be done before the home is held open.<\/p>\n<p>Part of preparing the home is securing items that seem to grow legs and walk away during open houses. These include:<\/p>\n<ul>\n<li>Valuables, such as jewelry and coin collections.<\/li>\n<li>Prescription medications.<\/li>\n<li>Weapons.<\/li>\n<\/ul>\n<p>Ask your clients to remove anything with identification numbers and other personal information from counters and drawers. One seller, blogging at Trulia, tells a story about his open house and the attendee who walked off with a seldom-used credit card he found while snooping through drawers. The perpetrator called the bank and changed the address on the account to a FedEx office and requested a new card. The homeowner had no idea that someone else was using the card until sometime later when he happened to check the balance.<\/p>\n<h2>3. Should They Stay or Should They Go?<\/h2>\n<p>Most agents that I spoke with agree that sellers need to make themselves scarce during the open house. Some, however, disagree – and vehemently. Who better to explain the home’s attributes than the very people who have lived in the home? Only the homeowner can explain that crack in the basement wall or where the perennials are planted when the landscape is currently covered in a foot of snow, these agents insist.<\/p>\n<p>Shades of gray, however, exist between the two extremes. Experienced agents know the common questions most buyers ask. Have your client make a list of the answers to these questions. Some of them include:<\/p>\n<ul>\n<li>How long have they lived in the house?<\/li>\n<li>Why are they moving? (Some sellers may be resistant to answering this question.)<\/li>\n<li>What is the average monthly utility bill?<\/li>\n<li>How much does it cost to maintain the pool?<\/li>\n<li>How old are the appliances and systems? How old is the roof?<\/li>\n<li>Then, of course, there are usually questions about the neighbors and the neighborhood.<\/li>\n<\/ul>\n<p>Some agents will videotape their sellers talking about what it’s been like to live in the home, and leave the video running during the open house.<\/p>\n<hr \/>\n<p>\n<a href=\"http:\/\/www.marketleader.com\/products\/real-estate-leads\/\"><img class=\"alignleft size-medium wp-image-44201\" src=\"http:\/\/www.marketleader.com\/wp-content\/uploads\/2016\/02\/Blog-CTA-arrows-2.png\" alt=\"Learn how Market Leader can generate more buyer and seller leads for you\"><\/a><strong><em>NEED MORE LEADS? Market Leader can generate a guaranteed number of exclusive buyer and seller leads for you each month. <\/em><a href=\"http:\/\/www.marketleader.com\/products\/real-estate-leads\/\">LEARN MORE &gt;&gt;<\/a><\/strong><\/p>\n<hr \/>\n<h2>4. Simple or Elaborate?<\/h2>\n<p>Whether you hire a full orchestra to serenade invited attendees as they sip 1990 Cristal Brut champagne, or you set a pitcher of ice-cold lemonade and plastic cups on the kitchen counter depends, obviously, on the type of home you’ve listed. Just as you wouldn’t send engraved invitations to view a $150,000 tract home, we hope you wouldn’t dream of holding open to the public a multimillion-dollar estate.<\/p>\n<p>Again, there are shades of grey between the two extremes, and how far you decide to go in either direction is pretty much dependent on the market. If homes are selling within weeks of going into the MLS and you’re holding your listing open to appease your client, then less is more when it comes to what you offer attendees.<\/p>\n<p>If homes are languishing on the market, on the other hand, you may need to get creative to call attention to your listing and bring in buyers.<\/p>\n<h2>5. Let the World Know<\/h2>\n<p>Start by letting the neighbors know about the event. This can either be done in person or by written invitation or a flyer stuck on their door. Not only may the neighbors have a friend that wants to live in the area, they’re potential clients as well, so invite the entire neighborhood.<\/p>\n<p>Don’t forget the open house sign rider. Put it up five or six days before the open house is scheduled.<\/p>\n<p>Advertise the open house online. Even if it’s just a Craigslist ad, get some online exposure for the event.<\/p>\n<p>From requiring attendees to remove their shoes before entering the house, to never dreaming of doing such a thing, the open house process is as variable as the number of agents holding them. Get back to the basics, however, and your open house should go off without a hitch.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Whether you swear by open houses or consider them a waste of time, if you’re going to hold one, it only makes sense that your goal is to be successful. However, agent opinions on what makes for a successful open house differ widely. Certain elements of open houses, however, find almost complete agreement among agents. [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[35],"tags":[240,87,492,56,459],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/33541"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=33541"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/33541\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=33541"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=33541"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=33541"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}