{"id":33731,"date":"2021-06-18T09:00:49","date_gmt":"2021-06-18T16:00:49","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=33731"},"modified":"2022-11-07T11:14:45","modified_gmt":"2022-11-07T19:14:45","slug":"working-with-investors-real-estate-agent","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/working-with-investors-real-estate-agent\/","title":{"rendered":"How to Work With Investors as a Real Estate Agent"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-33821\" title=\"Real estate investor\" src=\"\/wp-content\/uploads\/2014\/06\/investor-200x300.jpg\" alt=\"Tips for real estate agents on how to work with investors\" width=\"200\" height=\"300\" \/>Many new real estate agents dream of tapping into a network of investors who constantly buy and sell homes, imagining that it will provide an easy route to commissions and repeat business.<\/p>\n<p>But when they actually hook an investor client—or<em> think<\/em> that they have—then, it’s often a different story.<\/p>\n<p>Here’s the deal: The investment property sale is a very different process than a residential sale to an owner-occupant. With owner-occupants, you are selling the dream. You’re selling the home-sweet-home, the pitter-patter-of-little-feet, the cinnamon-in-the-kitchen, hearth-and-home fantasy ideal. Tap into that dream and the client’s bought it.<\/p>\n<p>With investors, it’s a whole different ballgame. The successful investor has ice water in his or her veins. You’re not selling a dream; you’re selling ROI. If the number is there and it beats the investor’s hurdle rate, <em>and<\/em> you get the timing right, then you should have a sale.<\/p>\n<p>But hitting that hurdle rate is <em>hard—<\/em>especially with an agent’s full commission thrown in the mix.<\/p>\n<p>What’s more, lots of people will blow smoke, calling themselves “investors.” They will get you to do a ton of unpaid legwork for them, when in reality they’re all hat and no cattle. They either don’t have the capital to do the deal, or they are looky-loos and tire-kickers, or they’re just emotionally unable to pull the trigger on a property, no matter how much financial sense it makes.<\/p>\n<p>Yes, investors can be lucrative clients for some. But it isn’t a market for everybody. Here are 10 success strategies for working with investors as a real estate agent:<\/p>\n<h2 class=\"BlogH2\">1. Know the Basics<\/h2>\n<p>The investor market is all about efficiency. Margins are compressed and commissions are frequently squeezed in the process. This isn’t the market for agents who need a lot of handholding, or for those who take a lot of time at each point of the transaction to get it right. You should come into the game already knowing how to block, tackle, throw and catch.<\/p>\n<h2 class=\"BlogH2\">2. Learn the Language<\/h2>\n<p>Investors speak a different language than folks in the conventional residential real estate world, where you’re marketing houses to owner-occupants. You need to understand terms like “<a href=\"http:\/\/www.investopedia.com\/terms\/h\/hurdlerate.asp\">hurdle rate,”<\/a> “<a href=\"http:\/\/www.investopedia.com\/terms\/c\/capitalizationrate.asp\">cap rate<\/a>,” “<a href=\"http:\/\/www.investopedia.com\/terms\/i\/irr.asp\">internal rate of return”<\/a> and “income vs. capital gains,” and have a solid understanding of how 1031 exchanges work. Your knowledge of real estate math has to be deeper than just a mortgage calculator.<\/p>\n<h2 class=\"BlogH2\">3. Speed Is Essential<\/h2>\n<p>Time is money. Investor clients want answers quickly and they want their paperwork done quickly. You should have the bandwidth available to get the paperwork done fast, or have the staff available to do a first rate job.<\/p>\n<h2 class=\"BlogH2\">4. Limit Engagement on the Front End<\/h2>\n<p>The best investors probably don’t need you to send them MLS listings—they’re beating the streets to find properties and motivated buyers <em>before<\/em> they come up on the MLS! For this reason, some investors will just need to hand you the football for the offer process. Since your front-end work is reduced, it may make sense to give up something in commissions.<\/p>\n<h2 class=\"BlogH2\">5. Never Offer too Much<\/h2>\n<p>Never give away the store just to get an investor deal. <strong>Get something in return.<\/strong> If you give up commission percentage in order to get a deal, make sure to get a commitment to represent the investor on the other side when he or she lists the house.<\/p>\n<h2 class=\"BlogH2\">6. Prequalify the Investor<\/h2>\n<p>Where is the money coming from? Do they have their own money? Are they preapproved? It’s best to have a business meeting up front. You don’t have to be too nosy, but you do have the right to ensure that you won’t get caught doing a lot of legwork for nothing because they can’t get financing for the properties they bid on.<\/p>\n<h2 class=\"BlogH2\">7. Leverage Your E&amp;O Policy<\/h2>\n<p>Don’t forget that you have a card to play, too. Whether they realize it or not, sellers benefit from your errors and omissions insurance policy. That policy doesn’t just protect you; it also protects the owners you work with. If nothing else, that coverage is worth a percent or two. It can be a powerful argument against a seller who is flirting with the idea of a for-sale-by-owner approach. Owners looking to circumvent using a licensed real estate professional may pocket the commission—but they are taking on <em>all <\/em>of the liability, too.<\/p>\n<h2 class=\"BlogH2\">8. Only Work With Pros<\/h2>\n<p>Make sure you’re working with mature individuals—not just some yahoos who want to alienate the market by making ridiculously low-ball offers on property after property, hoping to find a desperate seller by pure luck. They may succeed, but only by making you go through a lot of time and hassle on the front end, and possibly souring the market—not just for them, but for you as well, because you become associated with low-balling clients.<\/p>\n<h2 class=\"BlogH2\">9. Ask “How, Exactly, can I Help?”<\/h2>\n<p>An investor client may have some tasks in mind that are quite different than your traditional role. He may want to handle offers and have you strictly handling paperwork. He may want your broker’s license to handle renting and leasing. He may just want you as a consultant—especially if he’s a new investor. It may be something different altogether. It’s much better to establish the scope of the engagement at the beginning of the process than at the end of it. Concentrate on finding sustainable, win-win solutions up front. The best investors want that, too, and will appreciate finding a reliable partner in their real estate practice.<\/p>\n<h2 class=\"BlogH2\">10. Present Listings the Proper Way<\/h2>\n<p>Don’t give an investor client the same glossy presentation binder you give to everyone else. They’ll throw it in the trash. Those things are designed for the retail buyer, not the investor who buys wholesale. Investors would rather work things out on the back of a bar napkin with someone who “gets it” than receive a 30-page, glossy computer-generated “proposal” on the agency’s house software program with someone who doesn’t.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Many new real estate agents dream of tapping into a network of investors who constantly buy and sell homes, imagining that it will provide an easy route to commissions and repeat business. But when they actually hook an investor client—or think that they have—then, it’s often a different story. Here’s the deal: The investment property [&hellip;]<\/p>\n","protected":false},"author":34,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[36],"tags":[190,331,163,499,495,500,501,56,263],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/33731"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/34"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=33731"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/33731\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=33731"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=33731"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=33731"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}