{"id":34341,"date":"2014-06-13T18:00:10","date_gmt":"2014-06-13T18:00:10","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=34341"},"modified":"2022-10-24T10:28:45","modified_gmt":"2022-10-24T17:28:45","slug":"this-week-in-real-estate-rising-asking-prices-cool-off-millennials-waiting-to-buy-could-spur-market","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/this-week-in-real-estate-rising-asking-prices-cool-off-millennials-waiting-to-buy-could-spur-market\/","title":{"rendered":"This Week in Real Estate: Rising Asking Prices Cool Off; Millennials Waiting to Buy Could Spur Market"},"content":{"rendered":"<h2>Home Price Gains Slow Down, Indicating Good Time to Buy<\/h2>\n<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-34361\" title=\"home prices\" src=\"\/wp-content\/uploads\/2014\/06\/home-prices-300x200.jpg\" alt=\"Home price gains are slowing down across much of the United States\" width=\"300\" height=\"200\" \/>Here’s some good news for clients looking to buy: For the first time in almost two years, none of the 100 largest U.S. metropolitan areas saw asking prices increase more than 20 percent last month, according to San Francisco-based <a href=\"http:\/\/www.trulia.com\/?sem=1.2.1.5.7.1.0.14&amp;gclid=CjgKEAjw2dqcBRC2q-LXjpfxjnQSJAAeYF5LsC1oe4BC3MmycDm4QbFty_yUCSY2wBnWqH3R4pk0Z_D_BwE\">Trulia<\/a> Inc.<\/p>\n<p>“Big price increases mean there are fewer bargains to be found, and the closer prices get to where they should be, the less prices will rise,” Jed Kolko, chief economist at the property-data provider, told <a href=\"http:\/\/www.bloomberg.com\/news\/2014-06-05\/home-price-gains-of-20-vanish-as-hottest-markets-cool.html\">Bloomberg<\/a>. “I’d be surprised if we see markets getting back to 20 percent-plus gains. More inventory should be coming onto the market, investor activity is declining and affordability is worsening.”<\/p>\n<p>Asking prices increased 8 percent in May nationwide, compared to a year-ago period. In Las Vegas and the California cities of Sacramento and Oakland, prices jumped about 15 percent.<\/p>\n<p>With price gains gradually decreasing, there’s more opportunity for buyers to catch a better deal. For a while now, many potential first-time home buyers have found themselves locked out of the market because of affordability issues. That particular demographic will be encouraged by the slowdown in price hikes.  At the same time, rents are accelerating, providing first-time buyers even more reason to start entering the market soon. Rents have gone up 5.1 percent nationally, according to the latest reports.<\/p>\n<h2>The Pent-Up Demand in the Housing Market<\/h2>\n<p>For real estate agents all around the U.S., it seems there could be a huge number of potential buyers waiting to descend upon the market.<\/p>\n<p>As a result of the economic slowdown, starting sometime in 2006, the number of individuals ages 18-34 living with their parents began to climb. Many have been saving rent money and waiting for the right moment to move out and invest in a home.<\/p>\n<p>According to Deutsche Bank’s Torsten Slok, a third of 18-34 year olds now live with their parents. This indicates there’s a substantial pent-up demand for housing, he told <a href=\"http:\/\/www.businessinsider.com.au\/us-housing-pent-up-demand-2014-6\">Businessinsider.com<\/a>.<\/p>\n<p>This looming population of buyers could result in a big hurrah for the housing market at some point in the near future. According to Slok, if the number of individuals per household returns to levels seen in 2000-2003, it could translate to more than 4 million new households. Agents should keep that demographic in mind when developing marketing strategies.<\/p>\n<h2>Inventory Rises in the Baltimore Market<\/h2>\n<p>If you are in the Baltimore region, chances are your clients have more homes to choose from now than they did before. The number of homes on the market in the area rose to the highest level in more than two years in May.<\/p>\n<p>According to newspaper reports, in Baltimore and its five surrounding counties, there were more than 13,000 active listings last month. That’s up 18.6 percent compared to a year-ago period. Compared to the previous month, inventory levels are up 8.7 percent.<\/p>\n<p>With interest rates still hovering around the 4 percent range, and inventory levels increasing, now would be a good time to actively encourage buyers to enter the market. Odds are in their favor to find a better deal now.<\/p>\n<h2>Home Prices Continue to Rise in Washoe County, Nev.<\/h2>\n<p>There are still regions of the country that are experiencing price bumps. Washoe County, home to Reno in Nevada, is one of them. According to a Reno\/ Sparks Association of Realtors®, the median sales price in the Truckee Meadows region climbed 9 percent in May to $236,500, when compared to a year earlier.<\/p>\n<p>The housing market is currently &#8220;attractive&#8221; for buyers with good, stable jobs and stellar credit, Mark Ashworth, president of the Realtors® association, <a href=\"https:\/\/www.realtor.com\/realestateagents\/56d6d1cede071e0100642591\">told the Reno-Gazette journal.<\/a><\/p>\n<p>The sales price jump wasn&#8217;t just confined to Washoe County. May home sales rose 6 percent over the year in the Fernley area, with the median sales price rising to $149,900. That’s a 31 percent increase from a year-earlier period, according to the report.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Home Price Gains Slow Down, Indicating Good Time to Buy Here’s some good news for clients looking to buy: For the first time in almost two years, none of the 100 largest U.S. metropolitan areas saw asking prices increase more than 20 percent last month, according to San Francisco-based Trulia Inc. “Big price increases mean [&hellip;]<\/p>\n","protected":false},"author":35,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[466],"tags":[506,507,503,356,244,56],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/34341"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/35"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=34341"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/34341\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=34341"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=34341"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=34341"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}