{"id":34401,"date":"2014-06-16T09:00:25","date_gmt":"2014-06-16T09:00:25","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=34401"},"modified":"2016-01-30T00:45:35","modified_gmt":"2016-01-30T00:45:35","slug":"agent-spotlight-jo-ann-schlott-tucson-ariz","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/agent-spotlight-jo-ann-schlott-tucson-ariz\/","title":{"rendered":"Agent Spotlight: Jo Ann Schlott, Tucson, Ariz."},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-34411\" title=\"Jo Ann Schlott Realtor\" src=\"\/wp-content\/uploads\/2014\/06\/Jo-Ann-Schlott-Realtor-200x300.jpg\" alt=\"Jo Ann Schlott - Tucson, Arizona real estate agent with Tierra Antigua Realty\" width=\"200\" height=\"300\" \/>Jo Ann Schlott spent her entire life living just outside of Detroit before she decided to follow the sunshine and move to Arizona. There, she settled into her life as a stay-at-home mom of three kids.<\/p>\n<p>All was well, until her divorce in 1997. “I had to find a way to make a living at the ripe age of 40-something,” she recalls.<\/p>\n<p>She worked briefly as a legal secretary for a real estate attorney when she came up with a plan to get her real estate license. That was 13 years ago, and though she’s spent time working with several national brokerages, she’s now found that a locally-owned boutique firm—Tierra Antigua—is the best fit for her.<\/p>\n<p>Schlott has built up a large roster of past clients. She figures that those folks and referrals make up about 80 percent of her business. Even with that edge, she says her biggest challenge at the 13-year mark in her career is trying to get friends and acquaintances to remember that she’s a real estate agent.<\/p>\n<p>“I had that happen recently,” she explained. “I just found out that an acquaintance got a divorce and he sold his house and bought another one, all within the last nine months.”<\/p>\n<p>Because she gets so much business from past clients and referrals, Schlott is at a stage in her business where she doesn’t need to do a lot of marketing for new clients.<\/p>\n<p>“I am mostly using Market Leader, social media and occasionally sending out just-listed and just-sold cards. I’m lazy. I don’t do a lot of marketing,” she said, laughing.<\/p>\n<h2>The Market Leader Edge<\/h2>\n<p>Schlott was introduced to Market Leader products during a brief stint with Keller Williams Realty. “I’ll tell you, Market Leader offers one of the best websites out there,” she said. “They also have the nicest people that work there; you can ask questions and watch webinars. They do their best to educate you on how to use the website.”<\/p>\n<p>But it’s no magic bullet, she cautions. “You need to learn how to use the site and how to work the contacts,” she said.<\/p>\n<h2>Just for Newbies<\/h2>\n<p>The best advice Schlott received as a rookie was that there’s enough business for everyone. “You’re not in an adversarial position with other agents,” Schlott continues. “Some agents forget that,” she said. “Those agents are your associates, not your adversaries<strong>—<\/strong>they’re the ones who are going to sell your listings.”<\/p>\n<p>She also wants to warn new agents that what they learn to pass the real estate exam has nothing to do with the day-to-day practice of real estate. Schlott suggests that new agents take any continuing education classes that come along, and she highly recommends the GRI classes. “The GRI classes taught me more about doing business than anything else. They were a really big help to me.”<\/p>\n<h2>The Best Part of Working in Real Estate<\/h2>\n<p>Schlott’s favorite aspect of her career is the ability to be an independent contractor. “I enjoy most that I am right now sitting in my own house, in my office, setting my own hours,” she explained. “I go to work by getting up in the morning, making some coffee and walking into my office.”<\/p>\n<p>“I think it’s true of a lot of people in this business that we’re control freaks and we don’t always play well with others,” Schlott continued. “I would die in the typical office situation, I really would.”<\/p>\n<h2>There <em>Is<\/em> Life Outside of Real Estate<\/h2>\n<p>We asked Schlott what she enjoys doing when she isn’t working.<\/p>\n<p>“I enjoy golfing, I enjoy travelling,” she replied. In fact, Schlott has her next trip planned: A two-week African safari.<\/p>\n<p>Schlott see herself as semi-retired a decade from now. “Old Realtors® die hard,” she said. “I’m going to be 80 years old and still driving clients around. I’ll probably scare them and they’re going to offer to drive me around,” she said, laughing.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Jo Ann Schlott spent her entire life living just outside of Detroit before she decided to follow the sunshine and move to Arizona. There, she settled into her life as a stay-at-home mom of three kids. All was well, until her divorce in 1997. “I had to find a way to make a living at [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[78],"tags":[190,508,509,59,87,56],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/34401"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=34401"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/34401\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=34401"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=34401"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=34401"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}