{"id":34461,"date":"2014-06-25T09:00:40","date_gmt":"2014-06-25T09:00:40","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=34461"},"modified":"2016-01-30T00:36:17","modified_gmt":"2016-01-30T00:36:17","slug":"get-the-most-out-of-your-youtube-analytics","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/get-the-most-out-of-your-youtube-analytics\/","title":{"rendered":"Get the Most Out of Your YouTube Analytics"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright  wp-image-34491\" title=\"YouTube\" src=\"\/wp-content\/uploads\/2014\/06\/YouTube-300x300.jpg\" alt=\"What real estate agents can get out of YouTube Analytics\" width=\"270\" height=\"270\" \/>If there’s one word that would win a popularity contest among real estate agents, it would have to be “free.” From free sandwiches served on a broker’s tour to free advertising on Craigslist, real estate agents love their freebies.<\/p>\n<p>It’s no wonder that websites like Facebook, Pinterest and YouTube are so popular with agents. You just can’t beat free marketing.<\/p>\n<p>YouTube videos, whether they are neighborhood or listing focused, can be especially effective at driving traffic to your website. Of course, your real estate video probably won’t be the next “Gangnam Style,” with two billion views—but it doesn’t need to be. It just needs to hit the right group of select people.<\/p>\n<h2>The Stats<\/h2>\n<p>YouTube can be a powerful tool for real estate agents because of its reach. YouTube’s stats are impressive, to say the least.<\/p>\n<ul>\n<li>YouTube has more than one billion unique users each month.<\/li>\n<li>More than six billion hours of video are watched on the site each month. As the folks at YouTube like to say, “That&#8217;s almost an hour for every person on Earth.”<\/li>\n<li>People upload 100 hours of video to YouTube every minute.<\/li>\n<li>International agents will love the fact that 80 percent of YouTube traffic comes from outside of the U.S.<\/li>\n<li>According to Nielsen, YouTube reaches more U.S. adults ages 18–34 than any cable network.<\/li>\n<\/ul>\n<p>That last stat is especially impressive, considering the difference in what it costs to advertise on YouTube versus on cable TV.<\/p>\n<h2>The Basics<\/h2>\n<p>You can access your analytics at www.youtube.com\/analytics or from within your YouTube account. Click on the down arrow to the right of “Upload” at the top of the page, then click “Analytics.” Use the menu on the left to navigate through the various reports offered.<\/p>\n<h2>YouTube Analytics Questions &#8211; Answered<\/h2>\n<h3>Why Should I Bother with YouTube Analytics?<\/h3>\n<p>Once you have some videos up and running, Youtube’s analytics section can be especially helpful. Why bother? For the same reason you bother with analytics on your website—the data helps you learn what works and what doesn’t, shows you your traffic sources, demographics and more.<\/p>\n<p>You should be using keywords in your video tags, titles and descriptions to help drive traffic. These keywords are what you’ll play around with, according to your analytics results, to try to increase traffic and reach more viewers.<\/p>\n<h3>Who Is Watching My YouTube Videos?<\/h3>\n<p>The “Demographics” section is the place to go to learn the gender, age and location of your viewers. While demographics aren’t quite as critical in real estate as in other businesses, at the very least, you’ll learn more about who watches which type of videos.<\/p>\n<h3>Where Do My Videos&#8217; Viewers Come From?<\/h3>\n<p>The “Traffic Sources” metric lets you know where these viewers come from. This is important information because it helps you concentrate future marketing efforts on platforms that bring you the most traffic.<\/p>\n<h3>What Are My Viewers Choosing to Watch?<\/h3>\n<p>The “Views” statistics are invaluable because they show you which videos are the most popular. Be sure to break down the data to find out the estimated minutes a video was watched. If you are experimenting with different styles of video, this metric will help you learn which ones are winning.<\/p>\n<h3>What Makes My Viewers Stick Around?<\/h3>\n<p>YouTube analytics include two metrics that are especially useful for real estate agents. These are “Absolute Audience Retention” and “Relative Audience Retention.”<\/p>\n<p>This is where the rubber meets the road on YouTube: When are people deciding to leave your videos? Knowing at which point during a video your audience clicks out helps you avoid whatever it is that is turning them off in the future.<\/p>\n<p>Are your intros weak? This section of the analytics will let you know.<\/p>\n<h2>Video Ratings and Rankings<\/h2>\n<p>At least some viewers will like you—others, not so much. To know for sure, check out the user video ratings, such as favorites, likes and dislikes.<\/p>\n<p>Viewer feedback is akin to client testimonials, so pay close attention to it. What content does your audience like and what do they dislike?<\/p>\n<p>By the way, YouTube uses this feedback when determining where to rank your videos in its search engine results.<\/p>\n<h2>Optimize Those Videos for SEO<\/h2>\n<p>If you’re going to use YouTube as part of your content marketing plan, you’ll need to optimize the SEO of your videos to maximize views.<\/p>\n<p>In a nutshell, choose a keyword phrase to describe the video. If you haven’t a clue on how to do this, make a list of phrases you would search for if you were looking for an agent or a home in your market. The longer and more specific you make the phrase, the better your chances of ranking well in search results.<\/p>\n<p>For example, if you use “Denver real estate” as your keyword phrase, you’ll be competing against content from all the big real estate portals. If you use something more specific like “Five Points Victorian Homes in Denver,” you will have a crack at a higher ranking.<\/p>\n<p>Understanding the performance of your YouTube videos is critical to figuring out how to engage your audience more effectively. It’s only through engagement that you can drive people to your website and convert them to potential clients.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>If there’s one word that would win a popularity contest among real estate agents, it would have to be “free.” From free sandwiches served on a broker’s tour to free advertising on Craigslist, real estate agents love their freebies. It’s no wonder that websites like Facebook, Pinterest and YouTube are so popular with agents. You [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[97],"tags":[510,511,56,329,512,513,330],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/34461"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=34461"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/34461\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=34461"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=34461"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=34461"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}