{"id":34561,"date":"2014-06-23T09:00:33","date_gmt":"2014-06-23T09:00:33","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=34561"},"modified":"2022-01-26T13:24:08","modified_gmt":"2022-01-26T21:24:08","slug":"agent-spotlight-jon-ellen-snyder-livingston-mont","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/agent-spotlight-jon-ellen-snyder-livingston-mont\/","title":{"rendered":"Agent Spotlight: Jon Ellen Snyder, Livingston, Mont."},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-34571\" title=\"Jon Ellen Snyder Realtor\" src=\"\/wp-content\/uploads\/2014\/06\/Jon-Ellen-Snyder-Realtor-214x300.jpg\" alt=\"Jon Ellen Snyder, a real estate agent from Livingston, Montana\" width=\"214\" height=\"300\" \/>Somewhere along the line, between the hospital and the Kalamazoo County clerk’s office, someone misspelled baby Jan Ellen’s name and she became Jon Ellen Snyder. Mom and Dad bore no hard feelings, however, and the family remained in Kalamazoo for Jon’s entire childhood.<\/p>\n<p>From there, it was fashion school in Los Angeles followed by a career as a department manager for large department stores.<\/p>\n<p>Snyder met her husband in Denver and they travelled the world for his job as an architect, living for a time in Pakistan, Chicago, London, and finally, Montana.<\/p>\n<p>“We landed in Livingston, population 7,500,” she recalled. “Luckily, we had lived in Jackson Hole (Wyo.) before we moved here, which also has a very small local population, so I got a taste for living in a small town,” she continues.<\/p>\n<p>“If I hadn’t had that taste I don’t know if we would’ve lasted here. But it’s a wonderful small town. It’s 50 miles from Yellowstone Park and we enjoy camping and outdoor activities. There’s a lot of beauty around here, plus the people are awesome. It’s not the typical small town.”<\/p>\n<h2>From World Traveler to Small-Town Agent<\/h2>\n<p>When the couple first got to Livingston, Snyder was doing secretarial work. “I enjoyed that job. Even to be a legal secretary in Livingston at the time, though, you were only making seven bucks an hour,” Snyder said. “I quickly learned that if you were going to make it in Montana you needed some sort of self-employment.”<\/p>\n<p>“I happened to work with a woman who was doing a lot of real estate investing…and with my husband being an architect, I just thought, well, why not get my real estate license?”<\/p>\n<p>That was 18 years ago, so at this point Snyder is a longtime Livingston local and knows her market very well.<\/p>\n<h2>Challenges for an Industry Veteran<\/h2>\n<p>When asked what kind of challenges she faces at the 18-year mark, Snyder shared that she struggles with finding the time for everything.<\/p>\n<p><strong>“<\/strong>I think the biggest challenge for me is trying to find a work-life balance,” Snyder said. “Market Leader did <a href=\"\/blog\/the-happiest-agent-on-the-block\/\">that interesting survey<\/a> where it found that people that went into real estate because they wanted to make their own hours were the least happy,” she continued.<\/p>\n<p>“When you’re a successful Realtor® you have flexibility, but you don’t make your own hours. If you are dedicated to your job and somebody wants to write a buy-sell at 9 p.m. on Sunday, and it’s Christmas, you’re going to do it. So, that’s why you have to look for a way to find balance in your life,” Snyder concluded.<\/p>\n<h2>Marketing with Market Leader<\/h2>\n<p>When Snyder started her real estate career in this small town, she didn’t know a soul. So, like most new entrepreneurs, she started throwing everything possible at the wall to see what would stick.<\/p>\n<p>“I did things like joined the Rotary, I got on different boards, joined the Chamber of Commerce and did some newspaper advertising.  I also did a lot of direct mail,” she explains. “I looked for every place I could stick my face, really.”<\/p>\n<p>Today, she relies on her Market Leader website for new leads and on past clients for referrals. She stays in touch with former clients with a drip email campaign that is so effective, she says, that 80 percent of her business comes from people she’s worked with over the past 18 years.<\/p>\n<p>“I have the Market leader website, which has been great at bringing in new clients,” Snyder continues. “The thing that enticed me about Market Leader was before I had a website where I had to personally keep it up and that was a pain,” she said. “I also like that Market Leader has a mobile product and how easy it is to put people on drip campaigns.”<\/p>\n<p>“At first I was very leery about people having to sign up in order to continue to see information,” she said. “But they do it. I find that people who are super serious about wanting to buy a house will sign up.”<\/p>\n<h2>Out of the Office, Into the Field (Literally)<\/h2>\n<p>We asked Snyder what she likes best about being in real estate. “Probably what I did this morning,” she replied. “We drove up to the mountains to see a beautiful little cabin and we saw a moose along the way. All the wildflowers are out,” she said.<\/p>\n<p>“The thing I enjoy most is when I’m out in the field showing property in this beautiful area. It’s the best part of my job.”<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Somewhere along the line, between the hospital and the Kalamazoo County clerk’s office, someone misspelled baby Jan Ellen’s name and she became Jon Ellen Snyder. Mom and Dad bore no hard feelings, however, and the family remained in Kalamazoo for Jon’s entire childhood. From there, it was fashion school in Los Angeles followed by a [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[78],"tags":[190,275,59,519,56,187],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/34561"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=34561"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/34561\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=34561"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=34561"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=34561"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}