{"id":34861,"date":"2014-07-09T09:00:14","date_gmt":"2014-07-09T09:00:14","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=34861"},"modified":"2016-01-30T00:34:51","modified_gmt":"2016-01-30T00:34:51","slug":"3-essential-networking-tips-for-agents","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/3-essential-networking-tips-for-agents\/","title":{"rendered":"3 Essential Networking Tips for Agents"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-34881\" title=\"networking real estate\" src=\"\/wp-content\/uploads\/2014\/06\/networking_real_estate-300x200.jpg\" alt=\"Essential networking tips for real estate agents\" width=\"300\" height=\"200\" \/>If you think that networking is merely a word that belongs between “social” and “site”— think again. While networking online is a valuable tool for real estate agents, it should not replace face-to-face, belly-to-belly interaction.<\/p>\n<p>Whether at your next real estate-related convention or a local chamber mixer, follow these three basic networking tips to build successful business relationships.<\/p>\n<h2>1. Get There Early<\/h2>\n<p>If you dread the thought of walking into a room full of strangers, be one of the first to arrive at the event. Park yourself near the food or the bar (the places most attendees head to first) and wait for people to trickle in.<\/p>\n<p>Even if you love interacting with large numbers of people, being early on the scene allows you quality time with other early arrivals.<\/p>\n<p>Networking isn’t like speed dating, where the object is to speak to as many potential dates in the shortest amount of time. When you arrive early to an event, even if you only chat with one or two people, the lack of distractions and the time you’ll be able to devote to these conversations will make them richer and more valuable than those you’ll have later on, when the room is noisy and everyone is laden with business cards.<\/p>\n<h2>2. Bring Your Cards but Don’t Be Pushy<\/h2>\n<p>Don’t be the guy or gal that runs out of business cards on the scene—stock up before the event. Carry a small pad of paper and a pen in your purse or pocket to jot down the info of people you meet that did run out of cards.<\/p>\n<p>Even though you’ve arrived well-equipped with a steady supply of cards, hand them out judiciously. Nobody likes a pushy salesperson that approaches with card already in hand.<\/p>\n<p>Wayne Baker, a professor of management at the University of Michigan Ross School of Business, calls this tactic “coin-operated networking.” He says that people who network in this manner view the process as a transaction, not a relationship.<\/p>\n<p>Relationships require nurturing—don’t expect to get the instant gratification provided when you put a quarter in the slot and out pops a gumball.<\/p>\n<h2>3. Master the Art of the Follow-Up<\/h2>\n<p>Whether you have Internet leads or in-person networking contacts, the fortune is in the follow-up. Use the back of each business card to jot down notes about your conversation. Focus on information you can use in your follow-up.<\/p>\n<p>Load the information from all of those business cards into your CRM and follow up immediately with each one.<\/p>\n<p>Networking gurus <a href=\"http:\/\/www.commerce.virginia.edu\/careerservices\/Documents\/Networking%20The%20Art%20of%20the%20Follow%20Up%20Final.pdf\">suggest<\/a> that you follow up with these contacts within 24 to 48 hours. With the event still fresh in your mind and using your notes about each conversation, craft a short email expressing your pleasure over meeting the person and your hopes that you can meet again in the future.<\/p>\n<p>Next, add the new contacts to your social media sphere of influence, friending them on Facebook and connecting with them on LinkedIn.<\/p>\n<p>The follow-up shouldn’t end there, however. To nurture the relationship you’ll need to continue contacting these people further down the line. Look for interesting articles that address their challenges or interests and attach them to emails.<\/p>\n<p>Consider yourself a farmer, not a hunter, suggests Ivan Misner, a networking expert and author. Instead of the shotgun approach (one shot and it’s done), plant the seeds, nurture them, and in due time you’ll enjoy a bountiful harvest.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>If you think that networking is merely a word that belongs between “social” and “site”— think again. While networking online is a valuable tool for real estate agents, it should not replace face-to-face, belly-to-belly interaction. Whether at your next real estate-related convention or a local chamber mixer, follow these three basic networking tips to build [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[36],"tags":[190,526,125,117,56,527,452],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/34861"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=34861"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/34861\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=34861"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=34861"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=34861"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}