{"id":34941,"date":"2014-06-27T18:04:56","date_gmt":"2014-06-27T18:04:56","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=34941"},"modified":"2021-11-19T09:56:44","modified_gmt":"2021-11-19T17:56:44","slug":"this-week-in-real-estate-home-resales-inventory-new-home-sales-all-jump-in-may","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/this-week-in-real-estate-home-resales-inventory-new-home-sales-all-jump-in-may\/","title":{"rendered":"This Week in Real Estate: Home Resales, Inventory, New Home Sales All Jump in May"},"content":{"rendered":"<h2>Existing Home Sales Climb in May, Exceeding Estimates<\/h2>\n<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-34971\" title=\"new home sales\" src=\"\/wp-content\/uploads\/2014\/06\/new-home-sales-200x300.jpg\" alt=\"New home sales - as well as inventory and existing home sales - jumped in May 2014\" width=\"200\" height=\"300\" \/>The warmer weather is heating up the real estate market.  Existing home sales increased more than expected in May, and the inventory of homes for sale was the highest in more than one and a half years, according to a report from the National Association of Realtors.<\/p>\n<p>And summer is just beginning.<\/p>\n<p>Home resales jumped 4.9 percent to an annual rate of 4.89 million units. The increase was the largest since August 2011, the NAR said. That’s encouraging news for clients who may still be anxious about investing in the housing market because of the slump. The rise in home sales means a rise in equity for homeowners, too. Better numbers also bolster consumer confidence and encourage more people to enter the market.<\/p>\n<p>&#8220;The housing market has quite some ways to go to recover its recent sluggishness, but positive momentum in the sector suggests that housing has begun to show signs of life,&#8221; Gennadiy Goldberg, an economist at TD Securities in New York, told Reuters.<\/p>\n<p>The new home resale numbers beat analysts’ estimates for May; they were only expecting an increase of 2.2 percent to a 4.73 million-unit pace.<\/p>\n<p>Much of the trend was driven by an increase in the single-family home segment, in all four regions of the country. The report was a source of delight for everyone because it ended the slump seen in the second half of last year, which was triggered by interest rate increases, price hikes and a dwindling supply of inventory.<\/p>\n<p>Wall Street celebrated the news. Housing stocks increased after the data became available, Reuters said. Shares for homebuilders rose, with KB Home up 1.6 percent, Toll Brothers climbing 1.3 percent, and PulteGroup gaining 1.6 percent.<strong> <\/strong><\/p>\n<h2>Home Inventory Also Increases in May<\/h2>\n<p>In May, the inventory of unsold homes also <a href=\"https:\/\/www.cnbc.com\/2014\/06\/23\/existing-home-sales-hit-49-million-in-may-vs-expectations-of-473-million-units.html#.\">increased 6 percent<\/a> from a year-ago period to 2.28 million. That’s the highest level since August 2012.<\/p>\n<p>Supply of existing homes in May <strong>increased to<\/strong> 5.6 months from 5.7 months in April. Six months of supply is considered to be a healthy balance between supply and demand, according to industry measures.<\/p>\n<p>Improving supply means your clients have a bigger pool of homes to choose from. It also ensures that drastic price increases are held at bay.  The median home price jumped 5.1 percent compared to a year-ago period.<\/p>\n<h2>Consumer Confidence Up as New Home Sales Soar<\/h2>\n<p>New home sales <a href=\"https:\/\/www.rismedia.com\/2014\/06\/25\/new-home-sales-skyrocket-in-may\/\">skyrocketed 18.6 percent<\/a> in May to a seasonally-adjusted annual rate of 504,000. That’s the highest level since May 2008, according to the U.S. Department of Commerce. The increase in sales was the highest since January 1992.<\/p>\n<p>The numbers surged well past analysts’ expectations. Economists were only predicting home sales to rise to a pace of 440,000 units. Compared to a year-ago period, sales were up 16.9 percent, indicating a good momentum in the new homes market.<\/p>\n<p>Perhaps that’s part of the reason consumer confidence in June also picked up, rising to its highest level in more than six years. According to the Conference Board, consumer confidence rose to 85.2 from 82.2 in May.<\/p>\n<h2>Manufacturing Making Gains in June<\/h2>\n<p>In more positive news for the industry, manufacturing activity is increasing strongly this month, a report shows.  According to financial data firm Markit, its preliminary U.S. Manufacturing Purchasing Managers Index <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2014-06-23\/markit-manufacturing-index-in-u-s-increases-to-57-5-from-56-4\">rose to 57.5 in June from 56.4<\/a> the previous month. That’s the highest reading since May 2010.<\/p>\n<p>A reading above 50 signals expansion in economic activity, according to Reuters.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Existing Home Sales Climb in May, Exceeding Estimates The warmer weather is heating up the real estate market.  Existing home sales increased more than expected in May, and the inventory of homes for sale was the highest in more than one and a half years, according to a report from the National Association of Realtors. [&hellip;]<\/p>\n","protected":false},"author":35,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[466],"tags":[520,521,479,244,522,167,523,56],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/34941"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/35"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=34941"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/34941\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=34941"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=34941"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=34941"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}