{"id":35091,"date":"2014-07-04T21:21:01","date_gmt":"2014-07-04T21:21:01","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=35091"},"modified":"2021-11-19T10:19:31","modified_gmt":"2021-11-19T18:19:31","slug":"this-week-in-real-estate-housing-market-avoids-bubble-novel-luxury-home-marketing-and-more","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/this-week-in-real-estate-housing-market-avoids-bubble-novel-luxury-home-marketing-and-more\/","title":{"rendered":"This Week in Real Estate: Housing Market Avoids Bubble; Novel Luxury Home Marketing and More"},"content":{"rendered":"<h2>Housing Bubble Worries Are Evaporating<\/h2>\n<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-35131\" title=\"real estate bubble\" src=\"\/wp-content\/uploads\/2014\/07\/real-estate-bubble-290x300.jpg\" alt=\"Fears of another real estate bubble are disappearing\" width=\"290\" height=\"300\" \/>All that news about another bubble threatening the housing market is fizzling out. The upside for the industry is that prices now seem to be rising at a slower, steadier pace, stemming bubble fears.<\/p>\n<p>The last two years recorded some of the highest price hikes in the country. Prices were rising at a pace that reminded many of the housing bubble of the last decade. It made the industry a bit anxious, and some buyers were intimidated and may have stayed away from making that most important purchase of their lifetime.<\/p>\n<p>But, things began to change this year and the pace of price increases started slowing down. If this trend continues, homes will stay affordable and more buyers will be able to jump onto the homeownership bandwagon, according to <a href=\"http:\/\/www.businessweek.com\/articles\/2014-07-01\/the-re-explosion-of-u-dot-s-dot-house-prices-is-over\">Businessweek.com<\/a>.<\/p>\n<p>“That means that the housing market will avoid becoming overvalued, allowing the recovery in sales activity and housing starts to continue,” Capital Economics property analyst Paul Diggle said in a research note, according to Businessweek.<\/p>\n<p>Home prices in May increased 8.8 percent compared to a year-ago period, according to a recent CoreLogic report.  Although still a big gain, that number is almost 3 percentage points lower than the growth rate reported three months prior. It’s also the lowest annual change seen in 18 months. And, that rate is going to continue to slide as more new homes enter the market.<\/p>\n<p>“We are still under-building compared to population growth,” homebuilding analyst Stephen Kim of Barclays wrote in a recent report, according to Businessweek.<\/p>\n<p>Barclays anticipates housing starts will increase by 200,000 annually, rising to 1.7 million by 2017.<\/p>\n<p>So, you can tell your clients that now is a good time to buy, while prices will remain affordable. Also, with inventory levels expected to increase, they will have more homes to choose from in the coming months.<\/p>\n<h2>Models, Private Planes and Other Luxury Marketing Strategies<\/h2>\n<p>How far are you willing to go to sell a luxury home?  Would you be willing to offer your clients a private plane or boat ride?<\/p>\n<p>Believe it or not, real estate agents in some markets are doing just that—and more—to sell the luxury lifestyle. One agent even utilized a strategically-placed lingerie model in a photo shoot for a property, according to <a href=\"http:\/\/money.cnn.com\/2014\/07\/02\/luxury\/buying-million-dollar-homes\/index.html\">CNN Money<\/a>.<\/p>\n<p>Jack Cotton, a real estate agent in Cape Cod, Mass., takes potential buyers out on his powerboat. &#8220;That&#8217;s kind of our secret weapon,&#8221; he told CNN Money, referring to his boat. The rides allow his clients to get a feel for the nearby waterways in order to &#8220;experience the lifestyle of being here.&#8221;<\/p>\n<p><img loading=\"lazy\" class=\"alignleft  wp-image-35121\" title=\"real estate drone\" src=\"\/wp-content\/uploads\/2014\/07\/real-estate-drone-300x256.jpg\" alt=\"Luxury real estate agents now using drones, lingerie models and private jets to sell homes\" width=\"240\" height=\"205\" \/><\/p>\n<p>Many real estate agents are adapting their marketing strategies based on their location. Some Manhattan agents in the high-end market offer clients limo rides, while their counterparts in Colorado will take clients out skiing.<\/p>\n<p>An agent in Atherton, Calif., which is the highest-earning zip code in the state, recently bought a private plane and uses it to give his clients an aerial view of their potential backyards.<\/p>\n<p>Some agents are also using drone technology to help with aerial photos for their marketing strategies.<\/p>\n<p>&#8220;The high-end market is very competitive,&#8221; Colette Harron, a real estate agent in Essex, Conn., told CNN Money. &#8220;So whatever it takes.&#8221;<\/p>\n<h2>Signed Home Contracts Shoot Up<\/h2>\n<p>Signed contracts for homes jumped in May, according to the National Association of Realtors. The NAR said that its seasonally adjusted pending home sales index increased 6.1 percent to 103.9. That’s the biggest month-over-month gain since April 2010.<\/p>\n<p>This is a positive sign for the housing industry. Pending sales indicate future purchases. Usually, there’s a lag of one or two months between a contract and a completed sale. The uptick in the numbers was triggered by low mortgage rates and increased inventory, according to the <a href=\"http:\/\/www.dailyfinance.com\/2014\/06\/30\/housing-market-springs-into-shape-as-contracts-surge\/\">Associated Press<\/a>.  Signed agreements increased in all four regions of the country, the AP said.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Housing Bubble Worries Are Evaporating All that news about another bubble threatening the housing market is fizzling out. The upside for the industry is that prices now seem to be rising at a slower, steadier pace, stemming bubble fears. The last two years recorded some of the highest price hikes in the country. Prices were [&hellip;]<\/p>\n","protected":false},"author":35,"featured_media":35121,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[466],"tags":[524,499,356,241,87,388,56,487],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/35091"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/35"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=35091"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/35091\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=35091"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=35091"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=35091"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}