{"id":351,"date":"2010-04-28T12:44:59","date_gmt":"2010-04-28T20:44:59","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=351"},"modified":"2021-11-29T15:18:36","modified_gmt":"2021-11-29T23:18:36","slug":"a-lead-by-any-name-is-still-a-lead","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/a-lead-by-any-name-is-still-a-lead\/","title":{"rendered":"A “Lead” By Any Name Is Still a “Lead”"},"content":{"rendered":"<p>A recent article by <a href=\"https:\/\/www.rismedia.com\/\">Michael Parker on RIS Media<\/a> posed the question: “Is It Time to Retire the Word ‘Lead?’” The author made some interesting comments, concluding essentially: no, it’s not time yet, but you need to define the word correctly.<\/p>\n<p>Because Market Leader is a company that provides technology and marketing services for real estate professionals, I am always interested in how people talk about what we do—which often includes the word “lead” to describe it: lead generation, lead management, or lead cultivation.<\/p>\n<p>It’s only natural that “lead” evokes reactions in real estate professionals, because whether they generate leads themselves or count on a broker or another company to do it, their livelihood depends on them. That’s true whether it’s called a “lead,” “prospect,” “customer-initiated contact”, or any other name.<\/p>\n<p>No matter what you call them or where you get your leads from, they are necessary for your business to prosper and grow.   I have always advised our customers to constantly seek out more leads and then to treat them all equally.  This is easy to do when technology does the hard work for you, by emailing listings to the contacts in your database. Technology builds the relationship until they have immediate need for your services and expertise. At that time, you’re alerted when it’s time for personal assistance—that is, when the consumer signals they’re ready.   This is when the lead becomes an “opportunity.”<\/p>\n<p>Because relationships are key in this industry, leads generated by yourself—through your sphere or referrals, etc.—are always going to have greater chances of yielding a transaction than those from a third-party. That’s why Market Leader focuses on giving brokers and agents the tools to generate leads themselves—<strong><em>through their own website<\/em><\/strong>. <\/p>\n<p>A consumer is naturally going to feel more comfortable being contacted when they know exactly who they are providing their information to. Today’s technology makes it easy to build direct relationships between real estate professionals and consumers. And as long as technology continually offers new ways to do that, we’ll continue to innovate on behalf of our customers.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>A recent article by Michael Parker on RIS Media posed the question: “Is It Time to Retire the Word ‘Lead?’” The author made some interesting comments, concluding essentially: no, it’s not time yet, but you need to define the word correctly. Because Market Leader is a company that provides technology and marketing services for real [&hellip;]<\/p>\n","protected":false},"author":33,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[34,36],"tags":[],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/351"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/33"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=351"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/351\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=351"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=351"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=351"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}