{"id":35331,"date":"2014-07-08T18:12:18","date_gmt":"2014-07-08T18:12:18","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=35331"},"modified":"2022-09-06T17:55:44","modified_gmt":"2022-09-07T00:55:44","slug":"agent-spotlight-jasmine-blue-lincoln-calif","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/agent-spotlight-jasmine-blue-lincoln-calif\/","title":{"rendered":"Agent Spotlight: Jasmine Blue, Lincoln, Calif."},"content":{"rendered":"<p><img loading=\"lazy\" class=\" wp-image-35341 alignright\" title=\"Jasmine Blue Realtor\" src=\"\/wp-content\/uploads\/2014\/07\/Jasmine-Blue-real-estate-agent-300x300.jpg\" alt=\"Jasmine Blue Lincoln, California real estate agent\" width=\"240\" height=\"240\" \/>It’s easy to assume that all real estate agents’ business models are pretty much the same. Now, consider an agent who has spent the bulk of her career dealing with REO (real estate owned) properties. When she decides to make the switch to traditional residential real estate sales, the differences are striking.<\/p>\n<p>Jasmine Blue, an agent with RNB Homes in Lincoln, Calif., is discovering this contrast as she winds up her first year in non-REO sales. “The biggest challenge for me is working with real people again,” she disclosed.<\/p>\n<p>“I shifted from REO, which is very black and white, and you’re working with banks and not dealing with people so much, to short sales, where I still worked with banks, to cracking the traditional sales nut,” she explained. “It’s quite challenging for me.”<\/p>\n<p>Blue grew up in the San Jose, Calif., area and moved to Lincoln as a teenager. “Cow Town,” she described it, laughing. It’s no longer really a cow town—in fact, Lincoln was described by the U.S. Census Bureau as the fastest growing city in the state back in 2011.<\/p>\n<h2>Pre-Real Estate Enterprise<\/h2>\n<p>Blue was a cook in a retirement community, and kicked around in the jewelry business for a time, before fate stepped in and steered her into the real estate industry.<\/p>\n<p>One of her co-workers at the jewelry store was dating a member of a top-producing real estate team in the area. “I happened to pick up the phone one day and got to know him and he said ‘Do you want to get into real estate?’” she recalled. “I said ‘Sure, where do I sign up?’”<\/p>\n<p>Blue started as an admin with an REO agent, where she was “doing property management, turning on utilities, kicking out tenants—all the fun stuff,” she said. That was seven years ago, when she was just 19 years old. Today, she has more than 2,000 distressed sales under her belt, and she and her partner oversee a team of seven.<\/p>\n<h2>Building Blocks for Success<\/h2>\n<p>When it comes to ramping up her traditional real estate practice, Blue believes that consistency is the key to success. “I think a lot of Realtors® look for that magic wand to make their business thrive, and it just comes down to being consistent and finishing your projects and sticking with something. What works best is what works for you,” she advised.<\/p>\n<p>Blue primarily uses traditional marketing methods. “I do the standard stuff when I get a listing,” she said. “I go door knocking. I do the just-listeds. I call my database.”<\/p>\n<p>She also uses Craigslist. We asked her about any challenges she faces with <a href=\"\/blog\/navigating-the-new-rules-of-craigslist\/\">the recent changes made to the listing service<\/a>. “You have to adapt to the Craigslist changes,” she said. “It’s definitely gone down in quality, but it still works and it’s a free tool to use.”<\/p>\n<p>Blue was introduced to Market Leader products when she was with Keller Williams, and she decided to continue using them after she left the company. Her Market Leader website is what actually helps bring in new clients, she said.<\/p>\n<p>“It works really well for lead capture,” she shared. “It’s definitely impacted me in a positive way. It probably accounts for 25 to 30 percent of my business, on the buyers side.”<\/p>\n<h2>It’s Not All About Work<\/h2>\n<p>Blue gives back to the community by volunteering with The Glass Slipper, an organization that works with girls who have experienced abuse. One feature of the organization is a mentorship program, and Blue uses her experience as a cook to help out as a mentor in the cooking program.<\/p>\n<p>When she isn’t working or mentoring, Blue enjoys being outdoors, fishing and hiking. “Also, anything to do with wine, I’m definitely there,” she added.<\/p>\n<p>In fact, when we asked her where she sees herself a decade from now, she said she’d like to open a winery. Will it include a café with Jasmine Blue cuisine? She laughed, “That will be at the top of my list.”<\/p>\n","protected":false},"excerpt":{"rendered":"<p>It’s easy to assume that all real estate agents’ business models are pretty much the same. Now, consider an agent who has spent the bulk of her career dealing with REO (real estate owned) properties. When she decides to make the switch to traditional residential real estate sales, the differences are striking. Jasmine Blue, an [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[78],"tags":[190,106,37,56,187,525,487],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/35331"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=35331"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/35331\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=35331"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=35331"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=35331"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}