{"id":35521,"date":"2014-07-11T09:00:50","date_gmt":"2014-07-11T09:00:50","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=35521"},"modified":"2021-11-29T16:13:57","modified_gmt":"2021-11-30T00:13:57","slug":"this-week-in-real-estate-chinese-investors-spur-sales-outlook-promising-for-summer-mortgage-applications-up","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/this-week-in-real-estate-chinese-investors-spur-sales-outlook-promising-for-summer-mortgage-applications-up\/","title":{"rendered":"This Week in Real Estate: Chinese Investors Spur Sales; Outlook ‘Promising’ for Summer; Mortgage Applications Up"},"content":{"rendered":"<h2>Chinese Buyers Snapping Up U.S. Real Estate<\/h2>\n<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-35551\" title=\"Chinese real estate \" src=\"\/wp-content\/uploads\/2014\/07\/chinese-real-estate-300x200.jpg\" alt=\"Chinese nationals are still buying up billions of dollars worth of U.S. real estate\" width=\"300\" height=\"200\" \/>The U.S. housing market recovery is going gangbusters—much of it being fueled by foreign investors, many of whom are Chinese. So, keep an eye out for those out-of-town buyers. They often have deep pockets and even deeper interest in owning a home on American soil.<strong><\/strong><\/p>\n<p>According to a <a href=\"https:\/\/money.cnn.com\/2014\/07\/08\/real_estate\/home-sales-to-chinese\/\">CNN report<\/a>, Chinese nationals purchased $22 billion in American homes in the year-long period ending in March, which is up 70 percent from the same period a year earlier.<strong><\/strong><\/p>\n<p>Chinese buyers are particularly attractive because more than three-quarters of their purchases are made in cash and they buy expensive homes priced, on average, at $591,000.<\/p>\n<p>Much of the buying activity is happening in California, which accounts for a third of Chinese real estate investments, followed by Washington State, with 9 percent of the total home sales.<\/p>\n<p>According to the report, most Chinese buyers intend to use their American properties as an investment, and not as their primary place of residence. Some are buying property for their children, who are attending U.S. universities, while others are buying in bulk and making money from the rent. Others still are using their newly-purchased real estate investments as vacation homes.<\/p>\n<p>The Chinese are not the only foreign nationals jumping into the U.S. housing market. Buyers from Canada, Mexico, India, and the United Kingdom are also snapping up U.S. real estate.<\/p>\n<h2>Housing Market Outlook ‘Promising’ for Summer<\/h2>\n<p>With the summer now in full swing, things have definitely warmed up in the housing market. According to a report from KKCO 11News, the outlook for the rest of the season looks “promising.”<\/p>\n<p>More and more people are getting ready to buy or sell their homes and inventory is up nearly 3 percent compared to a year-ago period, and that’s very encouraging for buyers.<\/p>\n<p><img loading=\"lazy\" class=\"alignleft size-medium wp-image-35561\" title=\"summer real estate\" src=\"\/wp-content\/uploads\/2014\/07\/summer-real-estate-300x200.jpg\" alt=\"The U.S. housing market is heating up this summer - there is more inventory but homes aren't staying on the market as long\" width=\"300\" height=\"200\" \/>The enthusiasm can be seen in the recent rush in buying activity. On average, homes for sale have sat on the market for 122 days. That’s down from 160 days last year, according to the report. That’s an indication that buyers are moving faster.<\/p>\n<p>“We&#8217;ve got an increase in the average sale price over a year ago, it&#8217;s gone up about 24 percent compared with last year,&#8221; said Mike Burkhard, a Remax broker. He also said the fact that the number of houses on the market has also gone up since this time last year could make sellers anxious, since buyers now have more options to choose from.<\/p>\n<p>Despite the increase in inventory, it’s still a good time for sellers to put their homes on the market. The interest rates are still relatively low to lure in buyers, and prices are still in an affordable range. Also, it’s all about timing—so encourage your clients to take the plunge now.<\/p>\n<p>&#8220;This is a great time for sellers to sell their house, and also the time buyers start moving… A lot of families are getting ready to put the kids back in school, so their thinking is now’s the time to move,&#8221; Burkhard said.<\/p>\n<h2>Rising Mortgage Rates Not Hurting Mortgage Applications<\/h2>\n<p>Mortgage rates increased last week, but so did mortgage applications. Both trends together indicate that buyers aren’t too intimidated by the rate hikes.<\/p>\n<p>Mortgage applications jumped by 4 percent last week, according to the Mortgage Bankers Association. The MBA&#8217;s seasonally-adjusted index of mortgage application activity rose 1.9 percent in the week ended July 4, according to DailyFinance. This is another positive sign that the housing industry is on its way up.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Chinese Buyers Snapping Up U.S. Real Estate The U.S. housing market recovery is going gangbusters—much of it being fueled by foreign investors, many of whom are Chinese. So, keep an eye out for those out-of-town buyers. They often have deep pockets and even deeper interest in owning a home on American soil. According to a [&hellip;]<\/p>\n","protected":false},"author":35,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[466],"tags":[382,244,530,531,56,487,505],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/35521"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/35"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=35521"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/35521\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=35521"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=35521"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=35521"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}