{"id":35631,"date":"2014-07-14T19:59:40","date_gmt":"2014-07-14T19:59:40","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=35631"},"modified":"2016-01-30T00:33:58","modified_gmt":"2016-01-30T00:33:58","slug":"agent-spotlight-kevin-meyer-bellevue-wash","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/agent-spotlight-kevin-meyer-bellevue-wash\/","title":{"rendered":"Agent Spotlight: Kevin Meyer, Bellevue, Wash."},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-35651\" title=\"Kevin Meyer Realtor\" src=\"\/wp-content\/uploads\/2014\/07\/Kevin-Meyer-Realtor-200x300.jpg\" alt=\"Bellevue Washington real estate agent Kevin Meyer is Market Leader's agent of the week - and a former Market Leader employee!\" width=\"200\" height=\"300\" \/>If you’re a longtime Market Leader customer, the name <a href=\"http:\/\/www.youreastsidehome.com\/\">Kevin Meyer<\/a> may be familiar to you. Although he’s now a sales agent with Coldwell Banker in Bellevue, Wash., Meyer was once an ace account executive with us for two years before being promoted to team leader and, finally, sales manager.<\/p>\n<p>After eight years of dealing with agents’ marketing needs, he decided to cross over and become a real estate agent himself.<\/p>\n<p>It takes a bit of courage to quit a well-paying job to go into commission-based sales—even more so for an agent with a wife and newborn baby at home—but Meyer did it, and has come out happily on the other side.<\/p>\n<p>Meyer was born in Columbus, Ohio, and is a self-described Buckeye fan. His family moved to the Kirkland, Wash., area when he was a small child, and there he has remained.<\/p>\n<h2>Life Before Real Estate<\/h2>\n<p>Meyer worked in sales for Qwest Communications (now CenturyLink) before joining Market Leader as an account executive. Entering the real estate industry had always been in the back of his mind.<\/p>\n<p>“I’d already been drawn to real estate, even before I worked for Market Leader,” he recalled. “I’ve always had goals to build a portfolio of properties, and I’ve always kind of followed the market.”<\/p>\n<p>“Once I started working at Market Leader, I was learning more about the industry,” he continued. “Talking with agents, I understood and realized the earning potential. My goals were to leave Market Leader and build a team of agents. I let them know my intentions, of course,” he concluded.<\/p>\n<h2>Challenges for a New Agent<\/h2>\n<p>Meyer is now in his third year in the real estate industry. We were curious to know what challenges he is facing at this point in his career.<\/p>\n<p>“I thought I knew everything when I got into the business,” he began. “I had a list of 18 names. I was 100 percent confident that those people were going to be buying or selling a home from me, quickly. Every single day, I found myself erasing one of those names,” he recalled.<\/p>\n<p>“Everything I thought I knew about real estate was completely wrong. It’s definitely a lot harder than I thought, and a lot different than I thought,” Meyer admitted.<\/p>\n<p>His biggest overall challenge, however, has been in making the transition from employee to self-employed. “It’s really hard to not have anyone give you direction or tell you what to do. Figuring out what I was supposed to be doing was a challenge,” he said.<\/p>\n<h2>Finding Clients<\/h2>\n<p>Meyer figures that he closes 26 transactions a year, at just the three-year mark in his career. He credits both Market Leader and some tried-and-true prospecting techniques for his success.  In fact, the telephone is his best friend.<\/p>\n<p>“A lot of agents are afraid of the phone—afraid of picking up the phone and calling somebody and being rejected. I’m not. I’ve been in phone sales since I was 18,” he said. “Somebody says ‘no,’ I move on to the next one until I find somebody that says ‘yes.’”<\/p>\n<p>“The Market Leader system is great,” he continued. “I use it to attract clients and get people registered, so I have their contact information. Then I use the system to cultivate those relationships. I close a lot of deals through the leads I get from Market Leader.”<\/p>\n<p>Meyer says that he frequently hears agents complain that online leads are “bad” leads. “Everybody complains about leads and how crummy they are from x, y, or z company. The problem isn’t the leads. It’s the agent. They think about them as leads that should be transacting right now. You have to cultivate online leads,” he explained.<\/p>\n<h2>Life Beyond Real Estate<\/h2>\n<p>Meyer has his practice and two toddlers running his life, so he doesn’t have a ton of extra time to follow his volunteer spirit. When the kids get a little older, he plans on making volunteerism a family affair by working with a cause that helps “kids and\/or pets.” In what little spare time he does have, he and the family hit the closest park, ride bikes and generally spend as much time together as possible.<\/p>\n<p>We asked Meyer what he enjoys most about his real estate career. “There are many things I enjoy and very little that I don’t,” he said. “The flexibility of my schedule that lets me be more involved with my family is a big deal for me.  From a client perspective, I absolutely love helping people achieve their goals.”<\/p>\n","protected":false},"excerpt":{"rendered":"<p>If you’re a longtime Market Leader customer, the name Kevin Meyer may be familiar to you. Although he’s now a sales agent with Coldwell Banker in Bellevue, Wash., Meyer was once an ace account executive with us for two years before being promoted to team leader and, finally, sales manager. After eight years of dealing [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[78],"tags":[190,275,460,126,59,56,532],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/35631"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=35631"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/35631\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=35631"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=35631"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=35631"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}