{"id":36011,"date":"2014-07-18T09:00:06","date_gmt":"2014-07-18T09:00:06","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=36011"},"modified":"2021-11-19T10:18:38","modified_gmt":"2021-11-19T18:18:38","slug":"this-week-in-real-estate-once-dismal-areas-now-profitable-in-new-york-homebuilder-confidence-up","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/this-week-in-real-estate-once-dismal-areas-now-profitable-in-new-york-homebuilder-confidence-up\/","title":{"rendered":"This Week in Real Estate: Once-Dismal Areas Now Profitable in New York; Homebuilder Confidence Up"},"content":{"rendered":"<h2>Investors Making Money in Once-Neglected New York Neighborhoods<\/h2>\n<p>Harlem. Bedford-Stuyvesant. The South Bronx. These neighborhoods were once shunned by real estate developers and home buyers alike, as they were known for high crime rates and poverty.<\/p>\n<p>Not anymore. Home values have skyrocketed in these New York neighborhoods that were once looked down upon. And developers who invested early are now making hefty profits.<\/p>\n<p>According to the <a href=\"http:\/\/online.wsj.com\/articles\/uptown-manhattan-maintains-upside-1405467545?mod=residential_real_estate\">Wall Street Journal,<\/a> Springhouse Partners’ Adam Verner recently bought two Harlem apartment buildings with 59 mostly-rent-regulated units and seven retail spaces. The price was $15.4 million. The seller, Treetop Development, a New Jersey investment company, bought them for $8.8 million in 2012.<\/p>\n<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-36031\" title=\"New York City real estate\" src=\"\/wp-content\/uploads\/2014\/07\/new-york-city-real-estate-300x167.jpg\" alt=\"Formerly crime and poverty-ridden New York City neighborhoods are now booming housing markets\" width=\"300\" height=\"167\" \/>What’s more: Treetop bought the buildings, one on West 116th, the other on West 125<sup>th<\/sup>, from Hosford &amp; Poteat Realty, which paid only $1 through a city program in 1991. Back then it was a depressed area and “few thought multimillion-dollar price tags were a possibility,” the paper said.<\/p>\n<p>&#8220;Nothing was trading in Harlem in 1991. It was a war zone,&#8221; Matthew Sparks of broker Eastern Consolidated told the Wall Street Journal. Now, he says, &#8220;people definitely believe in this market.&#8221;<\/p>\n<p>The rising price tags on residential buildings in formerly notorious neighborhoods such as Harlem, the South Bronx and Bedford-Stuyvesant in Brooklyn are perhaps a testimony to the city’s success in pumping up employment. The city has made itself more attractive to working people. According to the article, rent and occupancy rates are on the uptick in these areas, much to the delight of investors.<\/p>\n<p>Between 2011 and 2013, the value of multifamily properties sold in northern Manhattan nearly quadrupled, from $440 million to $1.65 billion, according to broker Ariel Property Advisors. The firm represented Treetop in its recent sale and tracks properties in Morningside Heights, Harlem, Washington Heights and Inwood, according to the Journal.<\/p>\n<p>Price tags for multifamily apartments in these areas topped $257 a square foot in the first half of this year. That exceeds their prerecession high of $239 in 2007, the article said.<\/p>\n<h2>Homebuilder Confidence Soars to Highest Level in Months<\/h2>\n<p>Homebuilder confidence in the housing market climbed this month to the highest level since January, according to the National Association of Home Builders. The boost was triggered by a jump in new home sales and also because of expectations of increased sales in the second half of the year.<\/p>\n<p>These rosy confidence levels indicate that home construction could increase in the coming months, according to <a href=\"http:\/\/www.dailyfinance.com\/2014\/07\/16\/homebuilder-confidence-surges-july\/\">DailyFinance<\/a>. That should be a boon for buyers, who may be struggling because of tight inventory levels.<\/p>\n<p>The National Association of Home Builders\/Wells Fargo builder sentiment index increased to 53 this month, up four points from a revised reading of 49 last month. Any reading above 50 indicates that sales conditions are good in the market, the article said. Three areas taken into consideration by this index—current sales conditions for single-family homes, sales outlook over the next six months and traffic by prospective buyers—showed gains.<\/p>\n<p>Home sales soared 18.6 percent in May to a seasonally-adjusted rate of 504,000. That’s the highest level in six years.<\/p>\n<p>&#8220;An improving job market goes hand-in-hand with a rise in builder confidence,&#8221; said David Crowe, the NAHB&#8217;s chief economist. &#8220;As employment increases and those with jobs feel more secure about their own economic situation, they are more likely to feel comfortable about buying a home.&#8221;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Investors Making Money in Once-Neglected New York Neighborhoods Harlem. Bedford-Stuyvesant. The South Bronx. These neighborhoods were once shunned by real estate developers and home buyers alike, as they were known for high crime rates and poverty. Not anymore. Home values have skyrocketed in these New York neighborhoods that were once looked down upon. And developers [&hellip;]<\/p>\n","protected":false},"author":35,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[466],"tags":[504,533,534,535,150,56],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/36011"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/35"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=36011"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/36011\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=36011"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=36011"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=36011"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}