{"id":36341,"date":"2022-06-30T09:00:53","date_gmt":"2022-06-30T16:00:53","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=36341"},"modified":"2022-10-26T15:16:20","modified_gmt":"2022-10-26T22:16:20","slug":"real-estate-interns","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/real-estate-interns\/","title":{"rendered":"Real Estate Internships—What to Know Before You Hire"},"content":{"rendered":"<p>If there is one thing real estate agents dislike, it’s parting with money. Low or no cost approaches are thus highly treasured, such as the use of social media as a marketing tool and the heavy reliance on do-it-yourself photography.<\/p>\n<p>There’s nothing wrong with being frugal. Even wealthy people know this—many are actually quite thrifty, pinching pennies and living beneath their means. So, in the spirit of helping you hang on to every possible commission dollar, here’s the skinny on hiring an intern.<\/p>\n<h2 class=\"BlogH2\">What Exactly Is an Intern?<\/h2>\n<p>An intern is a person who works primarily to gain experience in a field. Some work for free. It may sound crazy, but they have their reasons for offering their services without receiving compensation in return.<\/p>\n<p>Most interns are young and usually in college. In fact, around 40 percent of college students work as unpaid interns, according to the <a href=\"https:\/\/www.cnbc.com\/2021\/08\/17\/more-than-40percent-of-interns-are-still-unpaidwhy-thats-legal.html\">National Association of Colleges and Employers<\/a>.<\/p>\n<p>If you hope to hire an intern to assist you with various duties for your real estate practice, however, you will most likely need to pay them. (More on that in a minute.)<\/p>\n<h2 class=\"BlogH2\">The Duties of a Real Estate Intern<\/h2>\n<p>The <a href=\"https:\/\/realestate.business.uconn.edu\/career-opportunities\/intern-program\/\">University of Connecticut School of Business<\/a> offers a well-structured intern program. While they acknowledge that intern responsibilities will vary from firm to firm, some general duties they suggest include:<\/p>\n<ul class=\"BlogUL\">\n<li class=\"BlogLI\">Participating in the preparation of market analyses<\/li>\n<li class=\"BlogLI\">Researching records and real estate statistics<\/li>\n<li class=\"BlogLI\">Attending appraisals, to gain experience in assigning value to real property<\/li>\n<li class=\"BlogLI\">Using the MLS to find properties that match a buyer’s criteria<\/li>\n<li class=\"BlogLI\">Preparing and maintaining lists of FSBO properties and expired listings<\/li>\n<li class=\"BlogLI\">Updating and maintaining your <a href=\"\/solutions\/crm\/\">real estate CRM<\/a><\/li>\n<li class=\"BlogLI\">Assisting in transaction coordination<\/li>\n<li class=\"BlogLI\">Assisting with the open house process<\/li>\n<li class=\"BlogLI\">Website development and\/or maintenance<\/li>\n<li class=\"BlogLI\">Writing copy for ads, your website, and <a href=\"\/solutions\/marketing-automation\/\">email marketing campaigns<\/a><\/li>\n<li class=\"BlogLI\">Maintaining the agent’s presence on Facebook, Twitter, and other social media accounts<\/li>\n<\/ul>\n<p>Of course, the tasks you assign the intern will be based in large part on the intern’s talents, knowledge, experience and what he or she hopes to learn while working with you.<\/p>\n<h2 class=\"BlogH2\">Your Commitment to Your Interns<\/h2>\n<p>Hiring an intern may not be the ideal situation for a time-pinched agent with no staff. Providing a valuable hands-on experience for the intern will require direct training from you or a staff member. Remember, an unpaid intern is trading labor for real-life training and experience.<\/p>\n<p>This might be hard to hear, but if you’re a busy solo agent, you should probably hire an experienced assistant instead, either an in-house or <a href=\"\/blog\/is-there-roi-in-virtual-assistants-for-real-estate-agents\/\">virtual assistant<\/a>.<\/p>\n<h2 class=\"BlogH2\">Do Real Estate Interns Get Paid?<\/h2>\n<p>Unpaid labor is the dream of many small business owners. Who wouldn’t want someone that comes to work, contributes to the business, and expects nothing in return except the ability to gain knowledge and experience?<\/p>\n<p>It doesn’t quite work that way, however. There are legal requirements for unpaid internships that you must follow if you want to hire someone who will work for free. And, similarly, there are federal laws you must follow if you hire a paid intern.<\/p>\n<p>Federal guidelines clearly define what you must do if you hope to hire unpaid interns. In fact, there are <a href=\"https:\/\/www.dol.gov\/agencies\/whd\/fact-sheets\/71-flsa-internships\">six criteria<\/a>, and you must abide by all of them, otherwise the intern will be considered an employee.<\/p>\n<p>To hire an unpaid intern, all of the following must apply:<\/p>\n<ol class=\"BlogOL\">\n<li class=\"BlogLI\">You must provide an educational environment. This means that the training you supply must be similar to what the intern would receive at a vocational school or academic institution.<\/li>\n<li class=\"BlogLI\">What the intern experiences must directly benefit him or her. The law requires that “the intern does not perform the routine work of the business on a regular and recurring basis, and the business is not dependent upon the work of the intern.”<\/li>\n<li class=\"BlogLI\">The intern is not hired as a replacement for a regular employee, “but works under close supervision of existing staff.”<\/li>\n<li class=\"BlogLI\">You do not derive an advantage from the intern’s work. The guidelines even go on to say that, on occasion, the business’s operations “may actually be impeded” by the intern’s activities. The law states that if the intern is performing routine productive work, such as filing or other clerical work or assisting customers, “then the fact that they may be receiving some benefits in the form of a new skill or improved work habits will not exclude them from the Fair Labor Standards Act’s (FLSA) minimum wage and overtime requirements, because the employer benefits from the interns’ work.”<\/li>\n<li class=\"BlogLI\">The internship is for a fixed period, and there is no expectation that the intern will be given a job after the internship is completed. Otherwise, it appears that you are hiring unpaid interns for a trial period, after which you will hire them permanently—a condition the FLSA considers employment.<\/li>\n<li class=\"BlogLI\">There is an understanding between you and the intern that he or she is not entitled to wages for the work performed.<\/li>\n<\/ol>\n<p>Number four will be the clincher for most real estate agents. After all, the whole idea of hiring an intern for a real estate practice is to get some help with routine business tasks.<\/p>\n<p>That brings us to a more likely scenario: hiring a paid intern. This creates an employment relationship, with the attendant <a href=\"https:\/\/www.forbes.com\/sites\/theyec\/2013\/04\/19\/6-legal-requirements-for-unpaid-internship-programs\/?sh=71c0ca8f6bf1\">responsibilities<\/a> for worker’s compensation, employee benefits, discrimination laws, state labor laws and unemployment insurance coverage. Agents who require assistance with the day-to-day tasks of running their business rarely have time to deal with the intricacies of hiring and paying employees.<\/p>\n<p>Assuming that you still want to hire an intern: Think it’s okay to pay minimum wage? Think again, oh frugal real estate agent. The average hourly wage for interns at the bachelor’s degree level is $15.07 in 2022, <a href=\"https:\/\/www.ziprecruiter.com\/Salaries\/Intern-Salary-per-Hour\">according to ZipRecruiter<\/a>.<\/p>\n<h2 class=\"BlogH2\">Where to Find Real Estate Internships<\/h2>\n<p>You can find interns looking for work at local colleges and universities. An ad on Craigslist will most likely pique some interest as well, especially if it’s a paid internship.<\/p>\n<p>Finally, online sites such as <a href=\"https:\/\/www.internships.com\/employer\/resources\/recruit\">Internships.com<\/a> accept recruitment posts.<\/p>\n<p>Internships may seem like an easy way to get free or cheap labor. However, the federal government—and the interns themselves—feel otherwise. If you truly require help, but lack the funds to hire an assistant, consider a piecemeal approach. Outsource your marketing, writing or database tasks. Even one duty taken off your plate frees up time for you to spend on more important aspects of your business.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>If there is one thing real estate agents dislike, it’s parting with money. Low or no cost approaches are thus highly treasured, such as the use of social media as a marketing tool and the heavy reliance on do-it-yourself photography. There’s nothing wrong with being frugal. Even wealthy people know this—many are actually quite thrifty, [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":61711,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[97],"tags":[190,536,537,538,56,539,540],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/36341"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=36341"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/36341\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media\/61711"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=36341"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=36341"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=36341"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}