{"id":36401,"date":"2014-07-25T17:20:55","date_gmt":"2014-07-25T17:20:55","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=36401"},"modified":"2021-11-17T08:13:20","modified_gmt":"2021-11-17T16:13:20","slug":"this-week-in-real-estate-home-sales-lift-forecasts-for-growth-more-homeowners-refinancing","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/this-week-in-real-estate-home-sales-lift-forecasts-for-growth-more-homeowners-refinancing\/","title":{"rendered":"This Week in Real Estate: Home Sales Lift Forecasts for Growth; More Homeowners Refinancing"},"content":{"rendered":"<h2>Existing Home Sales Reach Eight-Month High<\/h2>\n<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-36421\" title=\"home sales\" src=\"\/wp-content\/uploads\/2014\/07\/home-sales-300x201.jpg\" alt=\"U.S. home sales are at an eight-month high, greatly helping the housing market's growth\" width=\"300\" height=\"201\" \/>Existing home sales touched an eight-month high in June. That’s an indication that the housing market may be going gangbusters.<\/p>\n<p>Sales increased 2.6 percent to an annual rate of 5.04 million units last month. That’s not the only number that improved: The median home price hit its highest level since 2007.<\/p>\n<p>It’s the third straight month with an increase in home sales, according to the National Association of Realtors. If anything, that shows a consistent growth path recently. The report also bodes well for the overall economy.<\/p>\n<p>&#8220;The economy is normalizing from whatever went wrong in the first quarter. Growth is up and running,&#8221; Chris Rupkey, chief financial economist at Bank of Tokyo-Mitsubishi UFJ in New York told <a href=\"http:\/\/money.msn.com\/business-news\/article.aspx?feed=OBR&amp;date=20140722&amp;id=17795723\">Reuters<\/a>.<\/p>\n<p>The housing market tripped in the latter part of last year. High mortgage rates, low inventory and employment issues played spoilsport for the industry. For many, the trend created rising concern that the economy at large could be dealt another blow if housing went sour. These new numbers show that the economy could get a fresh lease on life.<\/p>\n<h2>With Low Rates, Homeowners Are Refinancing in Increasing Numbers<\/h2>\n<p>Last week, mortgage rates stayed stagnant. But still, many borrowers made applications to refinance their home loans, according to the Mortgage Bankers Association. There was a 2.4 percent increase in week-to-week total mortgage applications, with a 4 percent spike in applications related to refinancing.<\/p>\n<p>That shows that homeowners are taking advantage of current low rates and want to get a better deal on their existing loans. It also means that refinancing may be freeing up capital for them to invest in other things. The increase is a cause for optimism.<\/p>\n<p>With mortgage rates increasing a full percentage point last spring, refinancing has lagged for more than a year. Overall, refinancing application volume is still down more than 40 percent compared to a year-ago period. But recent growth shows that we are on the right track again.<\/p>\n<p>New loan applications to buy homes are still lagging. They are only up 0.3 percent week-over-week, on a seasonally adjusted basis. The refinance-related share of mortgage activity increased to 54.4 percent of total applications, the highest level since March, <a href=\"http:\/\/www.dailyfinance.com\/2014\/07\/23\/refinancings-push-mortgage-applications-higher\/\">according to DailyFinance<\/a>.<\/p>\n<p>There’s hope that mortgage application numbers will rise again. As noted above, existing home sales rose 2.6 percent last month, compared to a year ago. Builder confidence is on the rise and new home sales have also registered gains. The disconnect between mortgage applications and these other measures may be because many cash buyers are driving the market. In June, one third of buyers closed with cash.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Existing Home Sales Reach Eight-Month High Existing home sales touched an eight-month high in June. That’s an indication that the housing market may be going gangbusters. Sales increased 2.6 percent to an annual rate of 5.04 million units last month. That’s not the only number that improved: The median home price hit its highest level [&hellip;]<\/p>\n","protected":false},"author":35,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[466],"tags":[504,356,541,531,388,56],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/36401"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/35"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=36401"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/36401\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=36401"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=36401"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=36401"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}