{"id":36471,"date":"2014-08-06T09:00:29","date_gmt":"2014-08-06T09:00:29","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=36471"},"modified":"2021-11-29T16:00:37","modified_gmt":"2021-11-30T00:00:37","slug":"why-you-should-be-marketing-to-millennials-and-how-to-do-it-better","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/why-you-should-be-marketing-to-millennials-and-how-to-do-it-better\/","title":{"rendered":"Why You Should Be Marketing to Millennials (and How to Do It Better)"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright  wp-image-36491\" title=\"millennial real estate marketing\" src=\"\/wp-content\/uploads\/2014\/07\/millennial-real-estate-marketing-300x300.jpg\" alt=\"Why you should market real estate to Millennials - and how to market it well!\" width=\"210\" height=\"210\" \/>We’ve seen a number of reports in recent years about how <a href=\"https:\/\/www.usatoday.com\/story\/money\/personalfinance\/2013\/07\/17\/young-adult-home-ownership-rates-decline\/2456845\/\">Millennials have had a hard time breaking into the homeownership market<\/a>. After all, this cohort graduated into a devastating recession and has largely been putting off homeownership. They even delay certain cultural rites of passage that have historically led to homeownership, such as getting married and starting a family.<\/p>\n<p>Some recent research from Trulia, however, indicates that the economic barriers to homeownership for those in their 20s and early 30s may be starting to crumble. That’s great news for young real estate agents – and for those who market to them.<\/p>\n<h2>Changing Times, Changing Metrics<\/h2>\n<p>First, a bit of background: Historically, economists have used the number of households, rather than the number of adults, to define the homeownership rate. And by that metric, the homeownership rate among 18- to 34-year-olds is now around 37 percent – its lowest ebb by far since 1983. (Trulia’s data doesn’t go back before that point.)<\/p>\n<p>However, when you convert the data to reflect the number of adults in that age group, rather than the number of households, Trulia’s figures indicate that we may finally be turning the corner.<\/p>\n<p>And yet, the homeownership rate may never recover to earlier levels. American adults of age 34 or younger are far less likely to be married than in earlier generations – a drop from 47 percent in 1983 to 30 percent in 2013. (Yes, less than one in three Millennials is married.) Though, if you break things down and account for demographic shifts, the current homeownership rate for married, white couples is in line with historic averages.<\/p>\n<p>The Millennial generation’s age group is more racially diverse than it was in prior years, with Hispanics accounting for much of the change – and Hispanics are less likely to own homes than non-Hispanic whites. Regardless, there is still a market in this age group for starter homes for minorities, and indications show that it’s starting to grow.<\/p>\n<h2>Why Millennials Are Clients with High Long-Term Value<\/h2>\n<p>Now, here’s the hook for savvy real estate agents: The net present value of the Millennial client is extremely high. Why? Because many Millennials will soon want to upgrade their starter homes. They may even want to buy investment properties in their own cities. They have their entire careers in front of them. A skilled agent who can retain a Millennial’s business has a chance at not just one transaction, but many over the course of a real estate career.<\/p>\n<p>So, here are some tips on how can you establish yourself in the Millennial and Generation-Y markets.<\/p>\n<ol>\n<li>Coach sellers to present their homes well. These younger homebuyers grew up with HGTV. They expect homes to look like the “after” photos on home-makeover shows, and frequently don’t want to do the upgrades themselves. They often prefer to pay up on the front end rather than handling extensive renovations.<\/li>\n<li>Know young people’s tastes. Those of us who grew up in the 70s tend to like shag carpeting, for example, but younger homebuyers prefer wood floors.<\/li>\n<li>Have an active social media marketing strategy. Your marketing should involve Facebook, Twitter, and at least one other social media platform, such as Tumblr or Instagram.<\/li>\n<li>Blog. Young people love them some blogs. Actually, cutting across a wide variety of industries, younger people tend to conduct far more research online than older consumers. You want to be in front of them, early and often.<\/li>\n<li>Make your marketing as informative as possible. Millennials hate being “pitched,” but they do respond to, and appreciate, education and information.<\/li>\n<li>Do a “vanity search.” Google your own name and see what comes up. Do you look like a real estate expert? If not, it’s time for a Web makeover.<\/li>\n<li>Don’t rely on cold-calling as a strategy for this demographic. You will run into big do-not-call-list problems. Nearly half of Millennials don’t even have a landline. The rest screen their calls.<\/li>\n<li>Professional home staging may be a better investment when selling to younger homebuyers than it is to Gen-X people (ages 36 to 49 or so) or to baby boomers.<\/li>\n<li>Millennials are frequently Internet workers and they often work from home. Take that into account when selling or staging.<\/li>\n<li>Good cell and Internet service is crucial.<\/li>\n<li>Consider bolder colors for interior paint. Today’s younger buyers tend to gravitate to darker colors that combine well with track lighting, rather than the old egg-white walls and ordinary lamps most of us grew up with. If the lighting is there, younger buyers tend to bite at olive and dark red shades.<\/li>\n<li>Ramp up marketing efforts in gentrifying areas. These are areas that attract younger homeowners because they are close to urban jobs, and properties can be had at a reasonable price. Gentrifying areas also tend to be in close proximity to activities and community features that Millennials value, such as restaurants, cafes, a lively arts and cultural scene, etc.<\/li>\n<li>Know the Post-9\/11 GI Bill, inside and out. A substantial chunk of Millennials are in a position to buy precisely because of the GI Bill. Know and understand the veterans market.<\/li>\n<\/ol>\n<p>Remember, the overall price point for young adults may be lower than their parents are buying at these days. But they are potential lifelong clients who can provide many transactions over the course of a real estate career.  Once a couple has a few children in their starter home, for example, a larger home in the suburbs is frequently not far behind. Take good care and stay in touch with Millennial clients, and you will be the first person they think to call when they want to move to a bigger home (with a bigger commission) outside of town.<\/p>\n<p>Furthermore, younger adults are big on social media. They are potentially a rich source of referrals to their peers, who are also looking for their own first homes. An investment in this market can pay dividends for many years to come.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>We’ve seen a number of reports in recent years about how Millennials have had a hard time breaking into the homeownership market. After all, this cohort graduated into a devastating recession and has largely been putting off homeownership. They even delay certain cultural rites of passage that have historically led to homeownership, such as getting [&hellip;]<\/p>\n","protected":false},"author":34,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[35],"tags":[190,215,419,87,435,403,56],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/36471"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/34"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=36471"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/36471\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=36471"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=36471"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=36471"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}