{"id":37301,"date":"2014-08-01T23:45:28","date_gmt":"2014-08-01T23:45:28","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=37301"},"modified":"2021-11-17T08:13:14","modified_gmt":"2021-11-17T16:13:14","slug":"this-week-in-real-estate-home-price-gains-slow-developers-break-ground-in-urban-areas","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/this-week-in-real-estate-home-price-gains-slow-developers-break-ground-in-urban-areas\/","title":{"rendered":"This Week in Real Estate: Home Price Gains Slow; Developers Break Ground in Urban Areas"},"content":{"rendered":"<h2>Home Value Gains Slower, but Still Strong<\/h2>\n<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-37331\" title=\"home values\" src=\"\/wp-content\/uploads\/2014\/08\/home-values-300x239.jpg\" alt=\"Home values jumped in May 2014 by 9.3% year-over-year\" width=\"300\" height=\"239\" \/>Good news for sellers and homeowners alike: Home values continued to rise in Spring, although the pace of these increases is smaller, compared to late last year.<\/p>\n<p>With the pace slowing down, this may be the time to take the plunge for those looking to jump into homeownership. So, encourage your clients to buy now while homes are affordable and sticker prices aren’t that scary.<\/p>\n<p>According to the S&amp;P\/Case-Shiller home price index, home values in May registered a 9.3 percent annual jump. That’s down from 10.8 percent in the previous month, and considerably lower than the 13.7 percent high in November. Home values have continued to slow down since.<\/p>\n<p>Industry experts say that the current steady growth is better for the market’s health than rapid spikes that can scare off buyers from the market.<\/p>\n<p>“It’s a healthy slowdown for the housing market,” Aneta Markowska, chief U.S. economist at Societe Generale in New York, told Bloomberg. “The sooner we correct to a more sustainable growth rate, the better it is for the price outlook in the medium-term.”<\/p>\n<p>All 20 cities tracked by the index registered a price increase in May. Nine of the cities experienced double digit growth. San Francisco led with a 15.4 percent year-over-year jump, while Cleveland registered the smallest increase with prices rising only 2.4 percent. Cities in California and Florida, the latter of which took the biggest hit during the housing downturn, registered the biggest gains. Low mortgage rates, shrinking foreclosures, decreasing unemployment and accelerating job growth have helped keep prices on a steady upward climb.<\/p>\n<h2>Suburban Homebuilders Breaking Ground on Condos in Urban Areas<\/h2>\n<p>Some major homebuilders, traditionally known for constructing single-family homes in the suburbs, are now eyeing a new growth market: urban areas, according to an article by the <a href=\"http:\/\/online.wsj.com\/articles\/home-builders-venture-into-urban-areasdeal-of-the-week-1406663662?mod=residential_real_estate\">Wall Street Journal<\/a>.<\/p>\n<p><img loading=\"lazy\" class=\"alignleft size-medium wp-image-37341\" title=\"Condo builders\" src=\"\/wp-content\/uploads\/2014\/08\/condo-builders-300x211.jpg\" alt=\"Suburban homebuilders are now building urban condos\" width=\"300\" height=\"211\" \/><\/p>\n<p>The report cited Lennar Corp.’s newest condominium complex, called The Avenue Collection, a 74-unit luxury building across the Hudson River from New York City. The building apparently will feature amenities such as concierge services, a lobby lounge with a fireplace, gyms and yoga rooms, gathering areas and catering kitchen.<\/p>\n<p>Many buyers these days prefer the comforts of condo living in and near urban areas. So speak to your clients about the options available in your market. If they prefer condos, they may soon have more inventory to choose from than in the past.<\/p>\n<p>The popularity of condos has been growing for some time now. Craig Klingensmith, Lennar&#8217;s Northeast division president, told the Journal that international buyers and Manhattan&#8217;s resurging real-estate prices have helped trigger a demand for multi-family units close to the city. In 2011, Lennar built 35 new luxury units at another condo community in Weehawken, N.J., called Henley on the Hudson, to gauge the market. &#8220;We sold that building relatively quickly, and it gave us confidence to start on the Avenue [Collection] project,&#8221; he said.<\/p>\n<p>Lennar says its core business continues to be single-family homes in suburbia, but the company is getting aggressive in multifamily housing.<\/p>\n<p>Others are also joining in. Luxury builder Toll Brothers Inc. reported that revenue from its multifamily and high-rise tower segment constituted more than 20 percent of the company&#8217;s total sales last year. That’s a significant jump from less than 3 percent in 2000. And there seems to be no stopping anytime soon.<\/p>\n<p>&#8220;We are currently looking to expand our urban for-sale business into Boston, San Francisco and Miami,&#8221; Fred Cooper, a senior vice president told the paper. &#8220;We&#8217;ve also been expanding our high-end rental business in both suburban and urban markets in the Boston to D.C. corridor and are exploring the metro San Francisco area as well.&#8221;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Home Value Gains Slower, but Still Strong Good news for sellers and homeowners alike: Home values continued to rise in Spring, although the pace of these increases is smaller, compared to late last year. With the pace slowing down, this may be the time to take the plunge for those looking to jump into homeownership. [&hellip;]<\/p>\n","protected":false},"author":35,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[466],"tags":[254,542,503,464,543,167,56],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/37301"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/35"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=37301"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/37301\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=37301"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=37301"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=37301"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}