{"id":37391,"date":"2014-08-13T09:00:17","date_gmt":"2014-08-13T09:00:17","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=37391"},"modified":"2022-09-27T13:22:59","modified_gmt":"2022-09-27T20:22:59","slug":"youre-outta-here-when-and-how-to-fire-a-client","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/youre-outta-here-when-and-how-to-fire-a-client\/","title":{"rendered":"You’re Outta Here! When and How to Fire a Client"},"content":{"rendered":"<p>In the early days of a real estate career, when every lead is precious, to actually fire a client would be unthinkable. But as agents grow into their careers by working with more and more clients, and as they actually start making money, letting a client go is not only imaginable – sometimes it’s the best approach for all involved.<\/p>\n<h2>Identifying Time Wasters<\/h2>\n<p><img loading=\"lazy\" class=\"alignright wp-image-37411 size-medium\" title=\"firing bad real estate clients\" src=\"\/wp-content\/uploads\/2014\/08\/firing-real-estate-clients-287x300.jpg\" alt=\"When and how to fire bad real estate clients - those who are dishonest money- and time-wasters\" width=\"287\" height=\"300\" \/>“As a whole, we’re too overly eager,” says broker\/agent Ken DeLeon of DeLeon Realty in Silicon Valley.<\/p>\n<p>“What a seller is telling you when he wants to overprice a listing is, ‘I’m going to demand that you spend 100-plus hours working on marketing the home, you’ll spend a huge amount of money, the house won’t sell, and I’ll badmouth you all over town.’”  DeLeon advises agents to be selective “and don’t be afraid to turn down a listing.”<\/p>\n<p>As an agent, you can suggest a list price until you’re blue in the face but, ultimately, that list price is up to your client. When a client stubbornly insists on overpricing, despite evidence to the contrary, that should be your cue to evaluate the eventual profitability of the listing.<\/p>\n<p>You should know what your time is worth and – after considering the time it will take to cajole the homeowner for price reductions – calculate the total time it will take to eventually sell the home. Also consider the impact on your reputation, and if chances are good that you’ll end up on the losing end of the arrangement, your best course of action may be to terminate the relationship.<\/p>\n<p>Experienced buyer agents would also do well sending time wasters packing. Unless your buying clients have very specific needs and wants, plan on spending an average of 12 weeks with them and looking at about 10 homes, according to <a href=\"http:\/\/www.realtor.org\/sites\/default\/files\/Highlights-NAR-HBS-2013.pdf\">NAR’s 2013 Profile of Home Buyers and Sellers<\/a>.<\/p>\n<p>If it gets past the 15-week mark, or you’ve looked at way more than 10 homes, you may want to consider if the wasted time and the toll on your energy and sanity that the bad real estate client is taking is worth continuing the relationship.<\/p>\n<h2>Dishonest Clients<\/h2>\n<p>Ricky and Janet Sedgwick bought a home in Iowa. Shortly after moving in, they discovered that every time it rained, water would seep through the walls or intrude into the house where the walls meet the floor. They even experienced mud oozing from the walls.<\/p>\n<p>It turns out that the previous homeowner had built an addition to the home that caused rainwater to be diverted toward the home’s foundation.  Some additional investigating turned up evidence that the previous homeowner experienced the very same water intrusion problems.<\/p>\n<p>Yet, when a disclosure form was put in front of them, and they got to the part that asked: “Basement\/Foundation:  Any Known water or other problems?” – the previous homeowners circled “No.”<\/p>\n<p>The <a href=\"http:\/\/caselaw.findlaw.com\/ia-supreme-court\/1402653.html#sthash.vBrgpD5O.dpuf\">case<\/a> landed in front of the Supreme Court of Iowa where the Sedgwicks finally prevailed.<\/p>\n<p>It’s easy to understand how telling the truth about a home’s flaws could be difficult for a homeowner. After all they’ve gone through to sell the home, they must now “unsell” it, at least in their minds.<\/p>\n<p>So, they may try to hide defects – lying, if you will – to get the home sold. Sometimes, as in the above court case, homeowners are even dishonest with their agent.<\/p>\n<p>If, on the other hand, a listing client admits that he or she will be lying on the disclosures, and you’ve done everything you can to convince them otherwise, it’s time to make like <a href=\"http:\/\/en.wikipedia.org\/wiki\/Donald_Trump\">“The Donald”<\/a> and fire the client.  Regardless of how bad you need the deal, or how lucrative it may be, the risk of liability is too great.<\/p>\n<h2>Breaking Up Is Hard to Do<\/h2>\n<p>Take heart in knowing that the first time you jettison a client will be the hardest. Once it’s done, however, memories of the relief you feel will help you in future break-ups.<\/p>\n<p>Before you speak with your client, speak with an attorney, Arizona attorney Robert Bass told Realty Times. “Contracts between real estate professionals and real estate clients are called personal services contracts. Check with a lawyer familiar with your state laws on canceling contracts,” he cautioned. Bass goes on to say that if an agent has a bad feeling about a client, he advises them to “go with your gut. It is OK to fire a client.”<\/p>\n<p>So, how best to break the news? Author and coach Larry Easto <a href=\"http:\/\/activerain.com\/blogsview\/1179036\/how-to-fire-a-client-\">recommends<\/a> that you stick to the facts, don’t get personal and do provide options. If you’ve shown a buyer 55 homes that match his criteria and he hasn’t made an offer on any of them, point out that fact and suggest that perhaps you aren’t the right agent to help him.  Then, Easto suggests, offer him an option: “May I have my broker assign this to another agent in our office, or would you prefer to find a new agent on your own?”<\/p>\n<p>When it’s done, drop it. Don’t badmouth the client. In fact, follow up with a phone call down the line to see how he fared with the new agent.<\/p>\n<p>Freeing yourself of dishonest, exhausting or unprofitable client relationships may help boost your bottom line. Especially if you use the time you would have wasted to bring in new business or nurture past client relationships.<\/p>\n<p>Years ago, Kenny Rogers sang about the importance of learning when to hold our cards and when to fold them. It was good advice then, and it still works today. Know when to walk away –  and when to run.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>In the early days of a real estate career, when every lead is precious, to actually fire a client would be unthinkable. But as agents grow into their careers by working with more and more clients, and as they actually start making money, letting a client go is not only imaginable – sometimes it’s the [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[83],"tags":[190,163,544,545,499,260,56,546],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/37391"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=37391"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/37391\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=37391"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=37391"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=37391"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}