{"id":37841,"date":"2014-08-20T09:00:38","date_gmt":"2014-08-20T09:00:38","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=37841"},"modified":"2016-01-30T00:29:13","modified_gmt":"2016-01-30T00:29:13","slug":"why-agents-should-pay-no-attention-to-the-financial-media","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/why-agents-should-pay-no-attention-to-the-financial-media\/","title":{"rendered":"Why Agents Should Pay No Attention to the Financial Media"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"size-medium wp-image-37861 alignright\" title=\"real estate media\" src=\"\/wp-content\/uploads\/2014\/08\/real-estate-media-300x199.jpg\" alt=\"How agents should consume real estate news and financial media\" width=\"300\" height=\"199\" \/>The good news is that media sources are calling real estate a “<a href=\"http:\/\/www.entrepreneur.com\/article\/235807\">prudent investment<\/a>.” The bad news is that media sources are calling real estate a “prudent investment.”<\/p>\n<p>That’s one of the weird things about the financial media: By the time they sit up and notice something happening, the smart money folks have already made their moves.<\/p>\n<p>The truth is that real estate has been a prudent investment for years. It’s been stellar, in fact. And it may have been at its most stellar in 2009 and 2010, <a href=\"http:\/\/www.fool.com\/investing\/small-cap\/2007\/05\/02\/buy-when-theres-blood-in-the-streets.aspx\">when blood was running in the streets.<\/a><\/p>\n<p>The Entrepreneur author, Brenton Hayden, makes his case ably, and as founder of Renter’s Warehouse, he’s probably been making a bullish case for real estate for some time. His points are valid:<\/p>\n<ul>\n<li>Interest rates are cheap and financing is relatively easy to come by.<\/li>\n<li>Rent prices are high – increasing both cap rates for owners and opportunity cost for renters.<\/li>\n<li>Property is relatively affordable when you compare mortgage payments to income levels.<\/li>\n<\/ul>\n<p>But the fact is that the best time to buy was when most of the reporters in the financial media were running around screaming, “The sky is falling! The sky is falling!”<\/p>\n<h2>How the Financial Media Doesn&#8217;t Understand the Real Estate Industry<\/h2>\n<p>Enter the “<a href=\"http:\/\/www.fa-mag.com\/news\/the-curse-of-the-magazine-cover-indicator-15539.html\">Magazine Indicator.<\/a>”  Long known to contrarian stock investors, this particular little metric is less followed among the real estate crowd. But the theory is this: The more enthusiastic the media gets about a given asset class (stocks, bonds, gold, real estate, etc.), the more likely it is that the end is nigh.<\/p>\n<p>Take a look at this 2007 study from the Financial Analysts Journal called <a href=\"http:\/\/www.cfapubs.org\/doi\/pdf\/10.2469\/faj.v63.n2.4520\">Are Cover Stories Effective Contrarian Indicators?<\/a>  The researchers looked at the covers of major financial magazines and found that a fawning spot on the cover of BusinessWeek, Fortune or Forbes<em> <\/em>generally meant that the end of that vaunted outstanding outperformance was, in fact, nigh.<\/p>\n<p>Book publishers are also subject to the same phenomenon: Media consumers like to have their biases reinforced. When stocks are booming, and investors are either flushed with profits or hoping to join the party, they will buy books that reach investment conclusions by looking in the rear view mirror.<\/p>\n<p>I have, in my own personal collection, a hardcover copy of “<a href=\"http:\/\/www.amazon.com\/Dow-36-000-Strategy-Profiting\/dp\/0609806998\">Dow 36,000: The New Strategy for Profiting from the Coming Rise in the Stock Market,<\/a>”<em> <\/em>published in November of 2000 – at the height of the heady days of the Internet stock bubble. For bonus points, my copy sports author James Glassman’s autograph – dated March 1, 2001 – just nine days before the market peaked and finally exacted its rough justice on overleveraged, overexposed technology stock investors. <em> <\/em><\/p>\n<p>Furthermore, though the the authors of the Financial Analysts Journal study mentioned above could not have known it for certain at the time, real estate as an asset class was quickly approaching its spectacular implosion.<\/p>\n<p>Meanwhile, publishers were running titles like the spectacularly mistimed “<a href=\"http:\/\/www.amazon.com\/Real-Estate-Boom-Will-Bust\/dp\/0385514352\">Why the Real Estate Boom Will Not Bust – And How You Can Profit From It: How to Build Wealth in Today’s Expanding Real Estate Market<\/a>,” published in 2006.<\/p>\n<p>That book was written, as it happens, by David Lereah, who at the time was the head economist for the National Association of Realtors. Here’s a guy who did nothing all day but crunch numbers and look at the best forecasting he could get his hands on. And even he got blindsided by the collapse in real estate and mortgage-backed asset financing.<\/p>\n<h2>How Agents Should React to Real Estate News<\/h2>\n<p><strong>So what does this mean now for the shoe-leather real estate agents in the field?<\/strong><\/p>\n<ol>\n<li><strong>Don’t get too attached to what the media is saying – for good or for ill.<\/strong> If the media is bashing real estate across the board, call your contacts. Chances are quite good there are values to be had. Likewise, if the media is waxing rhapsodic about what a wonderful and foolproof investment real estate is, call your contacts again. Now may be a good time to pick up some sale listings. When real estate is overpriced, you can still make money by helping your clients move down in house and deleverage.<\/li>\n<li><strong>Learn to function in market-neutral ways.<\/strong> Good real estate agents don’t need to rely on continually rising prices to make money. There are transactions in both rising and falling markets.<\/li>\n<li><strong>Property experts aren’t foolproof.<\/strong> (Nor is the media, as we’ve seen.) Far from it. Concentrate on assessing values – and coaching your clients to assess values – one property at a time.<\/li>\n<li><strong>Help investor clients make money when they buy, not when they sell!<\/strong> They will become successful real estate investors who will come back to you with many more transactions.<\/li>\n<li><strong>With owner-occupant buyers, don’t worry about the market.<\/strong> At all. Really, as long as they maintain some reasonable equity in the home, the market won’t matter much, because they will be selling and buying in the same market. Sell the lifestyle, not the numbers – assuming they can afford the payments in the first place!<\/li>\n<\/ol>\n<p>Now, that said, we all know that real estate prices don’t happen in a vacuum. Recently it was reported that the U.S. economic growth rate clocked a robust <a href=\"http:\/\/www.oregonlive.com\/business\/index.ssf\/2014\/07\/us_economy_rebounds_strongly_h.html\">4 percent over the spring.<\/a> Further, the U.S. unemployment rate has fallen from <a href=\"http:\/\/data.bls.gov\/timeseries\/LNS14000000\">6.7 percent to 6.1 percent over the last six months<\/a>. That gives the Federal Reserve a lot more freedom to raise interest rates – which could take mortgage rates with them.<\/p>\n<p>Mortgages aren’t going to stay at the current near-historic lows forever. Now’s a good time to go after those fence-sitters and get them to pull the trigger on buying.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The good news is that media sources are calling real estate a “prudent investment.” The bad news is that media sources are calling real estate a “prudent investment.” That’s one of the weird things about the financial media: By the time they sit up and notice something happening, the smart money folks have already made [&hellip;]<\/p>\n","protected":false},"author":34,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[83],"tags":[23,547,102,421,548,56],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/37841"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/34"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=37841"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/37841\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=37841"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=37841"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=37841"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}