{"id":38071,"date":"2014-08-27T09:00:04","date_gmt":"2014-08-27T09:00:04","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=38071"},"modified":"2021-11-29T16:38:02","modified_gmt":"2021-11-30T00:38:02","slug":"why-every-agent-should-get-real-estate-coaching","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/why-every-agent-should-get-real-estate-coaching\/","title":{"rendered":"Why Every Agent Should Get Real Estate Coaching"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-full wp-image-38141\" title=\"real estate coach\" src=\"\/wp-content\/uploads\/2014\/08\/real-estate-coach-2.jpg\" alt=\"Even top-producing agents need real estate coaching\" width=\"207\" height=\"256\" \/>Ask any aspiring thespian about the “movement classes” their acting coaches and schools suggest they take. You’ll get a universal groan – much like the one real estate agents emit when they describe what they were taught in real estate school as “useless.”<\/p>\n<p>Then, ask Joe Manganiello, an actor who landed a plum role as a werewolf on the HBO show “True Blood.” He’ll be happy to explain how even seemingly silly aspects of acting training, such as those “pretend you&#8217;re an animal” exercises, can really pay off.<\/p>\n<p>The next time you sit in front of a telephone, and dread picking it up to chant, “When do you plan on moving? How long have you lived at this address?” think about Manganiello and how you, too, might end up howling at the moon over all the money you’ve made – if you hire the right real estate coach.<\/p>\n<h2>How to Know If You Need a Real Estate Coach<\/h2>\n<p>If you are listing and selling real estate, chances are good you would benefit from coaching. Yes, even veterans can get something out of it. Of course the ideal time to hook up with one, though, is when you are freshly-licensed.<\/p>\n<p>If you don’t have any idea of your production numbers from the past three years, you don’t have a business plan, you don’t understand your weaknesses and how to overcome them, or you are merely trying to figure out how to raise your production – you need a coach.<\/p>\n<p>Even if you don’t think you’d benefit from coaching, you may be surprised at how much it can help. “I have an awesome coach,” claims Lisa Ludlow Archer, an agent with Keller Williams in Charlotte, N.C.<\/p>\n<p>“Last summer I started working with Darin Persinger with Productivity Junkies. I think I am one of his prize students, only because if you could ever have an anomaly that would be me,” she said, laughing. “I often considered myself un-coachable but it seems I am, after all.”<\/p>\n<h2>The Benefits of Real Estate Coaching<\/h2>\n<p>Not being able to see the forest for the trees isn’t just a real estate personality quirk, but many agents seem to excel at it. Many become so involved in the details of their real estate practices that they fail to see the whole picture. An outsider – especially one that is intimately familiar with how to achieve success in the field – can see it all.<\/p>\n<p>Spencer Krull, with Teles Properties in Beverly Hills, Calif., remembers meeting Steve Shull of Performance Training years ago, when he was with Coldwell Banker. “Steve talks about the obvious,” Krull recalled. “Real estate agents always like to complicate things and we love getting in our own way. Steve simplified the process for me,” he said.<\/p>\n<p>He also got Krull to door-knock, something he’d resisted in the past. “I door-knocked three times a week. It worked,” Krull said. “Real estate coaching is only of value if you’re going to do what your coach tells you to do.”<\/p>\n<p>Beginner agents can learn goal setting and other basic business skills from a coach. “Mid-level real estate agents find incredible value in real estate coaching as they learn to break down the barriers that impede their success, open up more time in their schedules for fun, and convert more prospects into sales,” Carol Mazur, a real estate trainer with Top Pro Group, says on <a href=\"https:\/\/activerain.com\/profile\/carolmazur\">her ActiveRain blog<\/a>.<\/p>\n<p>From helping you come up with a business plan to showing you ways to kick your production into a higher gear, a real estate coach can bring a lot to your business.<\/p>\n<h2>Types of Real Estate Coaching<\/h2>\n<p>When considering the type of coaching you need, think about how you best learn. Are you a visual learner? If so, you may want to pursue e-courses, webinars and live workshops.<\/p>\n<p>If you’re overly busy and need to cut to the chase, many trainers offer phone support, advice and mentoring.<\/p>\n<h2>Choosing a Real Estate Coach<\/h2>\n<p>Deciding who to bare your real estate business’s soul to is probably the most challenging aspect of this process. While all of the well-known trainers have their share of fans, what works for one agent may bring dismal results to another.<\/p>\n<p>Then, there is the little matter of personalities, and the type that you mesh with.<\/p>\n<p>“I’ve worked with tons of coaches,” says Dano Sayles with Hawaii Life Real Estate on Maui. “The first was Howard Brinton, and then I trained with Bob Corcoran of Corcoran Consulting and Coaching. I’m now working with Ken Goodfellow of CKG International to come up with a strategic plan for our business.”<\/p>\n<p>Coldwell Banker Chicago’s Jennifer Ames chose CKG International as well, to help structure her team. She speaks with her real estate coach every week about “strategic issues such as hiring a manager to manage my team, and various other ever-changing challenges in my business,” she explained.<\/p>\n<p>The right coach can save a lagging real estate career. “I almost got out of real estate until I found Jennifer Allen-Hagedorn,” said Debb Janes, an agent with the Carl Group in Camas, Wash. “Jennifer made it okay for me to not want to cold call clients or bug them with drip campaigns,” she said.  Hagedorn’s “Sell with Soul” training meshed with Janes’s personality and business philosophy.<\/p>\n<p>Speak with other agents in your office about their trainers to find the perfect fit for you.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Ask any aspiring thespian about the “movement classes” their acting coaches and schools suggest they take. You’ll get a universal groan – much like the one real estate agents emit when they describe what they were taught in real estate school as “useless.” Then, ask Joe Manganiello, an actor who landed a plum role as [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[36],"tags":[23,62,550,56,551,552],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/38071"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=38071"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/38071\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=38071"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=38071"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=38071"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}