{"id":38211,"date":"2014-08-15T09:00:48","date_gmt":"2014-08-15T09:00:48","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=38211"},"modified":"2021-11-17T08:11:20","modified_gmt":"2021-11-17T16:11:20","slug":"this-week-in-real-estate-foreclosures-down-dramatically-mortgage-rates-vary-wildly-locally","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/this-week-in-real-estate-foreclosures-down-dramatically-mortgage-rates-vary-wildly-locally\/","title":{"rendered":"This Week in Real Estate: Foreclosures Down Dramatically, Mortgage Rates Vary Wildly Locally"},"content":{"rendered":"<h2>Report Finds Local Mortgage Rates Vary Greatly<\/h2>\n<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-38251\" title=\"local mortgage rates\" src=\"\/wp-content\/uploads\/2014\/08\/local-mortgage-rates-300x273.jpg\" alt=\"mortgage rates vary wildly from state to state - some states have higher interest rates than others\" width=\"300\" height=\"273\" \/>Tell your clients, a stellar credit record isn’t the only factor determining what rate you get on your mortgage.<\/p>\n<p>Where in the United States you buy the house can also have a dramatic affect on how much you pay on interest rates, according to a CNN <a href=\"https:\/\/money.cnn.com\/2014\/08\/05\/real_estate\/state-mortgage-rates\/index.html\">story<\/a>.<\/p>\n<p>Rhode Island buyers are the luckiest in that regard, according to a survey by loan information sites GoBankingRates and RateWatch. At 3.4 percent, Rhode Island borrowers paid about 0.35 percentage points below the national average. Nebraska residents paid an average of 4.1 percent on the mortgages, which is the highest rate in the country.<\/p>\n<p>Although the difference may seem minimal, over the lifetime of a mortgage these seemingly-small interest rate differences add up. For example, a 30-year loan would cost a borrower $28,800 more in Nebraska than it would in Rhode Island, CNN said.<\/p>\n<p>It may be surprising to many that mortgage rates aren’t more or less the same everywhere. Nationally, mortgage rates rise and fall with U.S. bond yields. But there are many other variables, such as property values, employment numbers and competition and risks that influence rates locally.<\/p>\n<p>Here are several factors that affect local mortgage rates:<\/p>\n<h3>Strength of the Local Economy<\/h3>\n<p>If the local economy is struggling, chances are you will have more competitive rates. Lenders in those areas lower the rates to attract more customers. But, if your local economy is going gangbusters, then financial institutions can afford to bump rates as well.<\/p>\n<h3>Local Home Prices<\/h3>\n<p>If your clients are shopping for a cheaper deal in rates, tell them to look into areas where home prices are higher. According to CNN, lenders incur many fixed transaction costs and because it can be as expensive to process a $100,000 loan as a $300,000, lenders make up the difference by charging more on smaller loans.<\/p>\n<h3>Local Average Credit Scores<\/h3>\n<p>The average credit score in an area also determines interest rates. The lower the credit score, the higher the rates in that area.<\/p>\n<h2>U.S. Foreclosures Have Fallen Dramatically Since June 2013<\/h2>\n<p>The number of homes in the foreclosure process dropped by about one third in the year ending in June.<\/p>\n<p>According to CoreLogic, a California-based analysis company, about 648,000 homes were in some stage of the foreclosure process in June. That’s significantly down from 998,000 a year ago. The share of homes with mortgages in the foreclosure process also came down to 1.7 percent compared to 2.5 percent a year ago.<\/p>\n<p>“The number of state and local markets with persistent foreclosure problems is becoming fewer and farther between,” said Daren Blomquist, vice president at RealtyTrac told the Wall Street Journal. The three states with the largest drop in foreclosures compared to the same period last year are as follows:<\/p>\n<ul>\n<li>Arizona &#8211; 53.6 percent<\/li>\n<li>Utah &#8211; 51.5 percent<\/li>\n<li>Minnesota &#8211; 49.5 percent.<\/li>\n<\/ul>\n<h2>Homeowners Cautious in New York Suburbs<\/h2>\n<p>After the huge spikes in home prices last year across New York suburbs, buyers are getting cautious and holding on to their purse strings.<\/p>\n<p>The price tags on homes, however, did encourage a lot of sellers to put their homes in the market. Looks like the combination of buyer cautiousness and seller enthusiasm has had a direct impact on the market. According to the Wall Street Journal, sales across the region fell from last year&#8217;s strong pace, and prices have stopped climbing.<\/p>\n<p>When compared to the previous year, single family home sales fell 12.1 percent in Westchester County during the peak spring selling season. Median prices inched up 0.8 percent.<\/p>\n<p>The story was similar elsewhere. On Long Island, excluding the East End, sales dropped 6.3 percent. In New Jersey the median price of a home slipped 0.1 percent.<\/p>\n<p>The drop in sales is actually good news, according to analysts interviewed by the WSJ. According to these analysts, it’s a sign that the market is becoming normal. So encourage your clients in these markets to invest now and not wait or prices might start shooting up again.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Report Finds Local Mortgage Rates Vary Greatly Tell your clients, a stellar credit record isn’t the only factor determining what rate you get on your mortgage. Where in the United States you buy the house can also have a dramatic affect on how much you pay on interest rates, according to a CNN story. Rhode [&hellip;]<\/p>\n","protected":false},"author":35,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[466],"tags":[124,553,554,355,555,531,56],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/38211"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/35"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=38211"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/38211\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=38211"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=38211"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=38211"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}