{"id":38301,"date":"2014-08-18T21:54:13","date_gmt":"2014-08-18T21:54:13","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=38301"},"modified":"2016-01-30T00:29:32","modified_gmt":"2016-01-30T00:29:32","slug":"why-you-should-call-your-credit-challenged-prospects-now","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/why-you-should-call-your-credit-challenged-prospects-now\/","title":{"rendered":"Why You Should Call Your Credit-Challenged Prospects Now"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-38311\" title=\"real estate agent phone call\" src=\"\/wp-content\/uploads\/2014\/08\/real-estate-agent-phone-call-300x200.jpg\" alt=\"Changes are being made to the FICO credit score system, so real estate agents should call credit-challenged clients today to get their business\" width=\"300\" height=\"200\" \/>Agents! Brokers! Have you been working with someone who wants to buy a home, but has some credit issues? Anyone who was a borderline case and got denied for the credit terms they needed to make the deal work? Have any clients who backed out of buying when they saw their FICO score?<\/p>\n<p>The good news is that the rules are changing to the benefit of consumers. This gives you the all-important opportunity to call them back – this time as someone who is clearly in their court and has information that can help them!<\/p>\n<h2>Shifts in the FICO Score System<\/h2>\n<p>Last week, Fair Isaac Corp., the company that administers FICO, the most important measure of consumer creditworthiness in commerce today, announced that it is cutting people who have experienced past hardships a little slack when it comes to calculating credit scores.<\/p>\n<p>The new algorithm, called FICO Score 9, includes some key updates:<\/p>\n<ol>\n<li>If a consumer has had a debt that went to collection – and later paid it off or settled it – then that former debt will no longer count against them in their FICO score calculation.<\/li>\n<li>Debts related to medical bills will not be weighted so heavily against the consumer.<\/li>\n<li>The company is also rolling out some new methodologies to better assess the credit worthiness of people who don’t have an extensive credit history.<\/li>\n<\/ol>\n<h2>Medical Debt Considerations<\/h2>\n<p>In part, the changes come from pressure from the <a href=\"http:\/\/www.consumerfinance.gov\/newsroom\/cfpb-study-finds-medical-debt-overly-penalizes-consumer-credit-scores\/\">Consumer Financial Protection Bureau<\/a>, which has held that medical debts should belong in a different category than other consumer debt, because they are frequently not the result of irresponsible consumer behavior, but rather the result of fallout from disputes between health care providers and insurance companies.<\/p>\n<p>The medical debt provision alone could affect as many as 64.3 million Americans, according to data from Experian. The American Association of Credit and Collection Professionals indicates that medical debt accounts for about 38 percent of the debt that gets collected, according to a report from the <a href=\"http:\/\/www.tennessean.com\/story\/money\/2014\/08\/12\/big-changes-coming-fico-credit-scores\/13931125\/\">Associated Press.<\/a><\/p>\n<p>Further, The Commonwealth Fund reports that as of 2012, <a href=\"http:\/\/online.wsj.com\/articles\/fico-recalibrates-its-credit-scores-1407443549\">75 million people, had trouble paying medical bills,<\/a> up from 58 million in 2005. That’s 4 in 10 people. <em> <\/em><\/p>\n<p>The rule change associated with medical debt alone won’t be a total game changer – for consumers whose only major black mark is medically-related debt, the typical FICO score will probably increase by about 25 points, according to Fair Isaac.<\/p>\n<h2>Time to Pay Up on Old Debts<\/h2>\n<p>The first new provision provides consumers looking to finance homes or cars with a strong incentive to contact their creditors and settle up.<\/p>\n<p>And if they haven’t done so yet, a call from a real estate agent informing them of the new rules could give them the prompt they need to clear up outstanding debts.  It will cause red marks to disappear from credit scores, as far as FICO is concerned (though they may still show up in credit history reports from TransUnion, Experian and Equifax).<\/p>\n<p>This provision <a href=\"http:\/\/blogs.wsj.com\/totalreturn\/2014\/08\/08\/a-higher-fico-score-can-save-borrowers-thousands-of-dollars\/\">could make a 100 point difference<\/a>, John Ulzheimer, the president of consumer education at CreditSesame.com, told the Wall Street Journal. Now, that <em>is<\/em> a game changer for a lot of people.<\/p>\n<p>The effects won’t be immediate: The rollout of FICO 9 won’t be online until this fall. And even then, not every lender subscribing to FICO is going to buy the new version.<\/p>\n<h2>Credit Basics Still Apply<\/h2>\n<p>Naturally, agents should still remind clients and prospects that while the rules for calculating FICO scores have changed, the fundamentals of credit management have not changed at all.<\/p>\n<p>Once they pass the basic FICO thresholds, borrowers still have to show that they can afford the payments. That is, unless the loan is an asset-based loan, secured by collateral and made without regard to income.<\/p>\n<p>Homebuyers must still pay close attention to these important factors:<\/p>\n<ul>\n<li>Debt to income ratios (both front-end and back-end)<\/li>\n<li>Overall debt levels<\/li>\n<li>Age of average account<\/li>\n<li>Number and severity of delinquencies<\/li>\n<\/ul>\n<h2>Agents: Be an Industry Expert With This Information<\/h2>\n<p>Thinking more broadly, agents should never miss a good chance to call clients and prospects with valuable information like this. It doesn’t have to relate specifically to a particular property or deal to be effective. When you reach out to your contacts with this information, you make yourself look like an industry expert who knows what’s going on.  More importantly, you also establish yourself as the person who took the time to call.<\/p>\n<p>Maybe clients will take advantage of the new credit-scoring information, and will take steps to improve their scores, and maybe they won’t. In either case, when they are finally ready to buy or sell, guess who is going to get the call!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Agents! Brokers! Have you been working with someone who wants to buy a home, but has some credit issues? Anyone who was a borderline case and got denied for the credit terms they needed to make the deal work? Have any clients who backed out of buying when they saw their FICO score? The good [&hellip;]<\/p>\n","protected":false},"author":34,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[83],"tags":[190,124,478,556,557,558],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/38301"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/34"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=38301"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/38301\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=38301"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=38301"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=38301"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}