{"id":38371,"date":"2022-08-01T09:00:26","date_gmt":"2022-08-01T16:00:26","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=38371"},"modified":"2022-08-18T07:37:15","modified_gmt":"2022-08-18T14:37:15","slug":"door-knocking-real-estate","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/door-knocking-real-estate\/","title":{"rendered":"Don&#8217;t Knock It Until You Try It: Door Knocking Tips for Real Estate Agents"},"content":{"rendered":"<p>Real estate door knocking is by no means an outdated strategy. It remains both a relevant and effective means of generating leads even today.<\/p>\n<p>Take <a href=\"https:\/\/palmdalehomesforsale.wordpress.com\/2013\/09\/13\/real-estate-door-knocking-tips-from-a-mega-team\/\">Tom Mitchell’s story<\/a>, for example. During the tanking real estate market of 1990, he had two choices: quit (as many fellow agents did) or take the proactive approach. He chose the latter. He started door knocking. He knocked on 250 doors a day. It’s what kept him alive until the market heated up again. Fast forward to 2007 when the market crashed. Mitchell took up door knocking again. And again, it worked. In fact, it earned all $38.8 million of Mitchell’s 2013 closed volume.<\/p>\n<p>But simply “pounding the pavement” isn’t enough. Real estate door knocking is an art and a science—to get new business, you need to know what you&#8217;re doing. Here are the essential tips and ideas you need to get started.<\/p>\n<h2 class=\"BlogH2\">4 Objections to Door Knocking (And How You Can Overcome Them)<\/h2>\n<p>It doesn’t take much to imagine why some real estate agents shy away from the door knocking strategy. But taking the time to anticipate the obstacles you’ll inevitably face and to learn how to manage them is a worthwhile endeavor. And it can make all the difference in terms of the volume of new clients door knocking yields for you.<\/p>\n<h3 class=\"BlogH3\">Reason #1: The Fear of Rejection<\/h3>\n<p>Let’s be honest, the concern is valid. Door knocking often ends with a door in the face rather than a foot in the door. Getting ignored hurts, and hearing “no” over and over again can be even more painful. No one likes being rejected. Especially when it’s done rudely.<\/p>\n<p>But Business Insider’s Max Nisen recommends that you simply shake it off and move on. How? Remind yourself, Nisen says, that rejection is “specific and temporary.” In other words, the “no” is directed only toward their perception of your offer. It’s not a personal attack. And remember, the shake-it-off-and-move-on tactic is a skill that can be learned and developed with practice.<\/p>\n<h3 class=\"BlogH3\">Reason #2: It’s Time Consuming<\/h3>\n<p>To acknowledge the obvious, door knocking is the most physically demanding lead generation strategy, which also means it’s the most time consuming. Not only does the act of door knocking take a while, but the waiting period between first contact and ultimate reward can also be extensive.<\/p>\n<p>But there are two points to consider here. First, as we’ll see below, the time is well spent. If it’s done right, the return on investment can be extremely lucrative. And second, it will only be as time consuming as you make it. It doesn’t have to consume your work week. Focus on consistency and quality rather than an arbitrary quantity goal.<\/p>\n<h3 class=\"BlogH3\">Reason #3: It’s Not Fun<\/h3>\n<p>When we combine the first two reasons, we arrive at Reason #3: door knocking simply isn’t fun. It lacks the instant gratification we all want. That’s why so many agents are quick to quit this approach. There are too many other things we’d rather be doing, right?<\/p>\n<p>Granted. But when you start seeing the payoffs, you may just learn to love it. This begs the question…<\/p>\n<h2 class=\"BlogH2\">Does Door Knocking Really Work in Real Estate?<\/h2>\n<p>Yes, it is a tried-and-true lead generation method that still yields significant results. And it seems to be good enough for agents like <a href=\"https:\/\/www.benbacal.com\/\">Ben Bacal<\/a>, the Beverly Hills luxury real estate agent who has sold over $1 billion of property throughout his career so far. He and many other top performers are outspoken about the value of door knocking.<\/p>\n<p>In a sense, it’s no different than anything else a real estate agent does. Knocking on doors – metaphorically or otherwise – is what you do, from cold calling to <a href=\"https:\/\/www.marketleader.com\/products\/real-estate-leads\/\">buying online real estate leads<\/a> and from open houses to closings.<\/p>\n<h2 class=\"BlogH2\">Why Is (Literal) Door Knocking Effective?<\/h2>\n<p><strong>1. It allows you to bypass your competition and skip to the top.<\/strong> While many are waiting for clients to come to them, digitally or otherwise, you can be the one to put yourself in the way of your ideal clients by literally showing up at their doorstep. It’s a great way to tip the odds in your favor.<\/p>\n<p><strong>2. The cost is low.<\/strong> Sure, there’s an opportunity cost to weigh, and your time is expensive. But unless you’re driving long distances, the hard costs associated with the door knocking itself are minimal. It’s not quite free, of course, but almost. Especially when compared to the dividends that stream in after just one hot lead.<\/p>\n<p><strong>3. It’s as personal and relational as real estate prospecting can get.<\/strong> The face-to-face interactions you have are invaluable because of the major advantage it gives you over other agents.<\/p>\n<p>Okay, all of that sounds reasonable in theory. But let’s be more concrete about this: how effective is door knocking exactly?<\/p>\n<p>Of course, it’s impossible to pin down an exact conversion rate that every agent everywhere can bank on. Like many other lead generation strategies, there are many variables each agent needs to consider for themselves.<\/p>\n<p>But one thing is certain: it’s a reliable lead generation method.<\/p>\n<p>For example, <a href=\"https:\/\/hackingrealestatemarketing.com\/does-door-knocking-work-in-real-estate\/\">one recent study<\/a> showed that, in general, you can expect a “conversion rate or response rate of 20% and a sales conversion rate of 2%.” Going even further, it suggests that you can expect a cost per acquisition of $15.65 and a cost per contract\/sale of $156.55.<\/p>\n<p>Upon first glance, a 2% sales conversion rate might not raise any eyebrows. But think of it this way: An agent can generate two sales after just two hours of work (if he or she knocked on 100 doors). That’s a sizable return to which not even cold calling can compare.<\/p>\n<p>Are those figures going to be the same for everyone? Absolutely not. This isn’t an exact science. There’s no need to count every last penny as part of your own cost-benefit analysis. But even if we use these figures as ballpark estimates, door knocking seems to have an appealing potential.<\/p>\n<p>The key is, you have to know how to do it the right way. Here are the essential tips you need to get started.<\/p>\n<h2 class=\"BlogH2\">The Best Tips for Effective Real Estate Door Knocking<\/h2>\n<p><strong>Look the part.<\/strong> Dress professionally, but for your market. If you sell real estate in casual Manhattan Beach, California, you don’t want to wear a shirt and tie. But in Manhattan, New York, you might want to consider it. The point is, pick your outfit according to the neighborhood’s culture and style and what “I’m the agent you’ve been looking for” looks like for your particular area. Presentation is everything.<\/p>\n<p><strong>Think small.<\/strong> Set the ultimate goal aside for now and focus on being genuinely helpful. The immediate priority is far narrower. After all, contracts are never signed over the welcome mat anyway, right? No one wants to keep their door open to a shark who’s obviously just trying to make a sale, so keep relationship at the center.<\/p>\n<p><strong>Set goals and track your progress.<\/strong> For example, keep record of the number of homes you intend to visit for a certain time period, store your <a href=\"https:\/\/www.marketleader.com\/blog\/why-relationship-management-crm-is-crucial-in-real-estate-5-ways-to-maximize-roi\/\">leads’ contact information<\/a>, how many leads you’ve acquired, the number of listings, and the income you’ve generated. Give yourself a roadmap to success.<\/p>\n<p><strong>Bring something to leave behind.<\/strong> If it’s a marketing piece, make sure it’s branded with your information. If you really want to go the extra mile to create a lasting impression, bring a small gift to share – maybe a pastry from the bakery down the street or a simple-but-lovely potted plant.<\/p>\n<p><strong>Use a script.<\/strong> If you were one of the thousands of agents that took the old Mike Ferry productivity courses years ago, you might remember <a href=\"https:\/\/www.marketleader.com\/blog\/cold-calling-best-practices\/\">his cold-calling script<\/a>. Done right, the script was a business-changer for cold-callers. Get familiar enough with your script that you don’t sound canned but conversational. That way you can concentrate on listening and not on what you want to say.<\/p>\n<h2 class=\"BlogH2\">3 Conversation-Starter Door-Knocking Scripts<\/h2>\n<p>Here are three scripts you can use that will fit some of the most common situations you’ll encounter when door knocking.<\/p>\n<h3 class=\"BlogH3\">The Use-Anytime Script<\/h3>\n<div style=\"background-color: #f6f6f6; padding: 20px 40px 20px 40px;\">Hi, my name is <em>[your name]<\/em> and I’m a real estate agent with <em>[brokerage]<\/em>. I love your <em>[property feature]<\/em>! Are you planning on moving anytime soon? I was just curious because I’d be happy to connect you with a buyer.<\/div>\n<h3 class=\"BlogH3\">If You Recently Sold in the Area<\/h3>\n<div style=\"background-color: #f6f6f6; padding: 20px 40px 20px 40px;\">Hi, I’m <em>[your name]<\/em>. I recently helped your neighbors at <em>[street number]<\/em> sell their house for around <em>[price]<\/em>! Would you be interested in receiving a free valuation of your home?<\/div>\n<h3 class=\"BlogH3\">The Update Script<\/h3>\n<div style=\"background-color: #f6f6f6; padding: 20px 40px 20px 40px;\">Hi! Sorry to bother you. I’m a real estate agent from <em>[brokerage]<\/em> and I just wanted to stop by real quick with an update. I thought maybe you’d be interested to know that similar houses in your neighborhood have been selling for around <em>[price]<\/em>. Do you have any interest in moving?<\/div>\n<h2 class=\"BlogH2\">Overnight Success Is a Myth<\/h2>\n<p>Door knocking can be a great way to generate leads. But let’s be honest. It takes time. In a way, it’s similar to farming. It requires a high level of persistence, consistency, and wherewithal to “plant the seeds,” so to speak.<\/p>\n<p>But farmers don’t merely stand back and hope the seeds grow. They have to water and nurture the field. For you, that might include a thank you note a week later, a value-packed direct mail piece, a monthly email, or a quarterly call. The fortune is in the follow-up.<\/p>\n<p>After all, you’re going to be knocking on doors, not walls. And whether it feels like it or not, every open door presents a new opportunity. The sooner you get started, the sooner you’ll reap results.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Real estate door knocking is by no means an outdated strategy. It remains both a relevant and effective means of generating leads even today. Take Tom Mitchell’s story, for example. During the tanking real estate market of 1990, he had two choices: quit (as many fellow agents did) or take the proactive approach. He chose [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":61392,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[34],"tags":[23,559,260,54,126,529,56],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/38371"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=38371"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/38371\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media\/61392"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=38371"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=38371"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=38371"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}