{"id":38571,"date":"2014-09-03T09:00:22","date_gmt":"2014-09-03T09:00:22","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=38571"},"modified":"2022-10-03T14:55:00","modified_gmt":"2022-10-03T21:55:00","slug":"whats-in-a-name-the-real-deal-on-real-estate-designations","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/whats-in-a-name-the-real-deal-on-real-estate-designations\/","title":{"rendered":"What’s In a Name? The Real Deal on Real Estate Designations"},"content":{"rendered":"<p>There are a couple of things sure to fire up a group of real estate agents. For example, tell them that FSBOs <em>can<\/em> sell homes on their own, and can maybe even make top dollar (we <em>know<\/em> that isn’t true). Or tell them that open houses are a waste of time.<\/p>\n<p><img loading=\"lazy\" class=\"alignright wp-image-38591\" title=\"real estate designations\" src=\"\/wp-content\/uploads\/2014\/09\/real-estate-designations-300x199.jpg\" alt=\"How agents can get the most value out of real estate designations\" width=\"270\" height=\"179\" \/>Or try this one: Mention that the word “Realtor®” means the same thing as “real estate agent” to consumers.<\/p>\n<p>And, do you know what else? That alphabet string after your name on a business card doesn’t impress anyone, either. Well, at least according to a consumer panel at a Hear It Direct conference.<\/p>\n<p>If that is true, and since these real estate designations cost valuable time and money, what reason would an agent have to pursue them? Believe it or not, impressing clients isn’t the only reason to become certified or designated. Let’s take a look at some of the “whys” behind the pursuit.<\/p>\n<h2>Brushing Up for Business Building<\/h2>\n<p>Going back over the list of Certified Residential Specialist (CRS) courses required for that designation, you’ll find that most of them do hold value – for agents. Refresher courses on keeping in touch with your sphere, a class on social media or listing presentations are all worthwhile ways to help agents build their businesses or take them to the next level.<\/p>\n<p>Elective classes in the Accredited Buyer’s Representative (ABR®) program include Resort and Second Home-Markets, HAFA Short Sales, and a class on foreclosures, among others.<\/p>\n<p>The educational possibilities are almost endless once you start looking into various real estate designations and certifications. New agents, or agents trying to learn new tricks or build career momentum, place a high value on these courses.<\/p>\n<h2>A Referral Gold Mine<\/h2>\n<p>For many designations, the process first requires membership in the sponsoring organization. Most of the programs come with a referral network, and agents are typically diligent in referring clients to others within the network.<\/p>\n<p>San Diego agent George Alexiou obtained the e-PRO® designation, and two months later he took a referral from a Virginia agent that led to a $14,000 commission. “Do I like the networking part of being an e-PRO®? You bet I LOVE it,” Alexiou wrote in a Real Estate Webmasters forum.<\/p>\n<p>It may be a smart investment of both time and money to earn a designation if it leads to a pipeline of lucrative referrals. However, unless you’re learning something that particularly qualifies you as an expert, don’t position yourself as such. That is dishonest and may end up diluting your credibility.<\/p>\n<h2>How to Add Value to a Designation<\/h2>\n<p>Obviously, some certificates and designations do add value to a real estate consumer’s experience, but it’s really up to <em>you <\/em>to add value to your designation.<\/p>\n<p>Within the course offerings for most designations, you’ll likely find several courses that teach skills that will actually benefit the client. An agent that holds the ABR® designation, for instance, can opt to take Effective Negotiating for Real Estate Professionals as an elective, and learn a skill of high value to home-buying clients.<\/p>\n<p>Another example is Market Leader’s Internet Marketing Specialist Designation (IMSD) which teaches agents how to market themselves online. On the surface, it appears to be self-serving. The value for the consumer, however, is that the knowledge gained can be applied to all forms of Internet marketing – including marketing for their listings.<\/p>\n<p align=\"center\">&#8212;<\/p>\n<p>While someone with an MD or MBA after their name doesn’t need to explain what those letters mean to potential clients, real estate agents do. So slow down, take the time to explain not only what the letters stand for, but the time and effort required to be able to use them, and exactly how the designation will benefit the client.<\/p>\n<p>Explanations and communication build trust – and trust builds business.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>There are a couple of things sure to fire up a group of real estate agents. For example, tell them that FSBOs can sell homes on their own, and can maybe even make top dollar (we know that isn’t true). Or tell them that open houses are a waste of time. Or try this one: [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[36],"tags":[190,106,562,56,563,127],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/38571"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=38571"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/38571\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=38571"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=38571"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=38571"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}