{"id":39111,"date":"2014-09-10T09:00:31","date_gmt":"2014-09-10T09:00:31","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=39111"},"modified":"2022-11-04T09:50:14","modified_gmt":"2022-11-04T16:50:14","slug":"esign-real-estate-contracts","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/esign-real-estate-contracts\/","title":{"rendered":"How to e-Sign Real Estate Contracts"},"content":{"rendered":"<p>Signatures have been the bane of every real estate professional’s existence for generations. With purchase agreements and closings getting more complicated every year, with more and more layers of mandatory disclosures, regulations, title assurances, and anything else you care to name, it’s easy for people to miss a signature or initial.<\/p>\n<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-39131\" title=\"real estate e-signature\" src=\"\/wp-content\/uploads\/2014\/08\/real-estate-signature-300x200.jpg\" alt=\"Guide to e-signatures for real estate agents\" width=\"300\" height=\"200\" \/>Historically, this meant that the real estate agent winds up spending precious prospecting time driving across town to track down the parties, or spending money to prepare and send documents back to them via FedEx.<\/p>\n<p>No one wants to have a good deal delayed because of a paperwork snafu.<\/p>\n<p>Fortunately, there’s a better way, thanks to a miracle of modern information technology. It’s time to embrace the e-signature for real estate contracts.<\/p>\n<h2 class=\"BlogH2\">The History of E-Signature Technology<\/h2>\n<p>E-signatures are not exactly new. The first completely paperless house sale, using only electronic signatures, took place decades ago, <a href=\"http:\/\/www.washingtonpost.com\/realestate\/real-estate-in-the-digital-age-the-time-has-come\/2012\/08\/16\/8e777032-e64c-11e1-8741-940e3f6dbf48_story.html\">on July 25, 2000.<\/a> Both the sale and financing of a home were involved, and the entire transaction took five minutes to record.<\/p>\n<p>Some industry studies are showing that using digital signatures on documents can result in turnaround-time improvements of <a href=\"https:\/\/s3-us-west-1.amazonaws.com\/ombudcontent\/research\/Ombud+Open+Research+-+eSignature+Solutions_June_2013.pdf\">as much as 80 percent<\/a>. Yet many agents, sales support staff, and other real estate professionals are still stuck in the dark ages, almost 15 years later.<\/p>\n<p>We have a system where technology-challenged bureaucrats—including ones who happen to own brokerage companies—still have people standing in line for notary stamps and burning gas to track down that last signature.<\/p>\n<h2 class=\"BlogH2\">Real Estate’s Slow Shift to Digital<\/h2>\n<p>Yes, the industry is hidebound, in part because government and quasi-government agencies have been slow to adapt. The legal framework recognizing e-signatures as legally binding was set in 2000 with the federal <a href=\"http:\/\/www.law.cornell.edu\/uscode\/text\/15\/chapter-96\">Electronic Signatures In Global and National Commerce Act<\/a>. (E-SIGN… Get it?) But Fannie Mae didn’t begin accepting e-signatures on REO offers until 2012. Bank of America also dragged its feet until 2012, when it finally began accepting e-signatures on pre-approved short-sale documents.<\/p>\n<p>County governments are dragging, too. Apparently still struggling with the task of shoveling coal into the boiler rooms powering their CPUs, only about a third of Florida counties have adopted some level of electronic recordings, according to reporting from the Washington Post.<\/p>\n<h2 class=\"BlogH2\">How E-Signatures Work for Real Estate Agents<\/h2>\n<p>E-signature technology, when fully embraced at the government and broker level, allows clients to easily complete required purchase, sales and financing documents from their computers. The technology exists for tablets and smartphones as well.<\/p>\n<p>The agent simply brings up the document, or package of documents, enters the client’s email address, and clicks “send.”<\/p>\n<p>The client gets an email notice, and either sees the document as a PDF with the signature areas flagged, or a software program guides the client step-by-step through each signature and initial. The program can flag any missed signatures or initials. When done, the client simply hits “send,” and the completed document or documents is automatically sent back to the agent.<\/p>\n<p>So if the client has access to email, there’s no need to lick stamps, fill out FedEx envelopes, or drive all over creation pleading for him to fill in that one missed initial.<\/p>\n<p>Widely available software packages also support automatic notification of all parties when additional signatures are secured. They can even integrate the e-signature program with standard workflow programs – minimizing potential for errors and giving management the opportunity to monitor in-progress documents as they move to completion.<\/p>\n<p>Perhaps most importantly, the better programs out there provide PIN number access and independent, third-party verification of IP numbers to create an audit trail for every signature and to verify the signer’s identity. Finally, document storage and on-demand retrieval is relatively easy and cheap.<\/p>\n<p><strong>Pro-Tip:<\/strong> It won’t do you much good to have a stack of digitally-signed documents, only to find out a lender won’t accept them. Do your homework and ensure that upstream lenders and other stakeholders and transaction participants support e-signatures.<\/p>\n<h2 class=\"BlogH2\">Not All Real Estate E-Signature Vendors Are Alike<\/h2>\n<p>It’s one thing to allow a user to “paste” a crude signature on a document. But maintaining a digital chain of custody, with verification steps along the way to ensure that the validity of any signature can withstand a vigorous challenge in court, is quite another. So is providing the security of sensitive information and compliance with federal and state regulatory bodies.<\/p>\n<p>Here’s a simple test: Try using a digital signature on whatever document you like. Once it’s signed, can you now alter the document? If you can, so can anyone else. That sort of protocol won’t be much good for big dollar contracts, such as real estate deals. Not all vendors support mobile devices like tablets and smartphones, either.<\/p>\n<h2 class=\"BlogH2\">Top Real Estate E-Signature Options for Agents<\/h2>\n<h3>Adobe EchoSign<\/h3>\n<p>EchoSign, a property of Adobe, inked a deal with <a href=\"http:\/\/www.planetre.com\/index.html\">PlanetRE<\/a> to field an e-signature solution as part of a <a href=\"http:\/\/www.planetre.com\/Transact.html\">transaction management suite.<\/a> The PlanetRE program will support these features:<\/p>\n<ul>\n<li>Automatic logging of signatures<\/li>\n<li>Alerts when a client views and\/or signs a document<\/li>\n<li>Secure document sharing<\/li>\n<li>Compatibility with other e-signature vendors such as DocuSign and CIC<\/li>\n<li>Notes feature to facilitate auditor\/agent communication<\/li>\n<li>Branded CDs<\/li>\n<li>Integrated email<\/li>\n<li>iPad and iPhone support, among other devices<\/li>\n<\/ul>\n<h3 class=\"BlogH3\">Constellation1 eSign<\/h3>\n<p>Constellation1 eSign offers a simple, user-friendly interface, and allows users to access documents from any device at any time. You can quickly and easily create electronic documents, email those documents for signatures, and get confirmations as soon as they’ve been signed!<\/p>\n<h3 class=\"BlogH3\">Digital Ink<\/h3>\n<p>This one comes free for members of the California Association of Realtors. For everyone else not covered under a collective agreement, <a href=\"http:\/\/zipform.com\/digitalink\/\">Digital Ink<\/a> lets you choose between an unlimited annual subscription or pay-as-you-go pricing.<\/p>\n<p>This program synchronizes with your email address book, tracks signatures, allows for custom fields, and includes tablet support as well.<\/p>\n<h3 class=\"BlogH3\">DocuSign<\/h3>\n<p>If you’re an NAR member, you qualify for e-signature service from <a href=\"http:\/\/www.docusign.com\/\">DocuSign<\/a> as part of your member benefits. As a result of its relationship with NAR, DocuSign is the most frequently-used digital signature provider in real estate.<\/p>\n<p>NAR members can subscribe for $15 a month. If you don’t subscribe, you can sign documents, but you can only send out five documents per month for e-signatures. You can, however, get a 30-day free trial. So if money’s tight and you have a deal on the line, get the trial, use the program, and then use your commission to keep it going!<\/p>\n<h3 class=\"BlogH3\">dotloop<\/h3>\n<p>This option lets you set up small “communities” of individuals involved in a deal, and allows you to share documents amongst yourselves. Dotloop includes a robust e-signature program as part of its offerings, but they consider themselves something much more than a digital signature vendor.<\/p>\n<p>Dotloop is designed for the real estate industry specifically. You can see the <a href=\"https:\/\/www.dotloop.com\/agents\/\">agent’s page here<\/a>, while brokers can look <a href=\"https:\/\/www.dotloop.com\/brokers\/\">here.<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Signatures have been the bane of every real estate professional’s existence for generations. With purchase agreements and closings getting more complicated every year, with more and more layers of mandatory disclosures, regulations, title assurances, and anything else you care to name, it’s easy for people to miss a signature or initial. Historically, this meant that [&hellip;]<\/p>\n","protected":false},"author":34,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[97],"tags":[190,565,566,56,567,375],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/39111"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/34"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=39111"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/39111\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=39111"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=39111"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=39111"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}