{"id":39181,"date":"2014-08-29T17:50:52","date_gmt":"2014-08-29T17:50:52","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=39181"},"modified":"2021-11-17T08:15:23","modified_gmt":"2021-11-17T16:15:23","slug":"this-week-in-real-estate-foreclosures-plummet-home-price-gains-are-slowing-down","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/this-week-in-real-estate-foreclosures-plummet-home-price-gains-are-slowing-down\/","title":{"rendered":"This Week in Real Estate: Foreclosures Plummet; Home Price Gains Are Slowing Down"},"content":{"rendered":"<h2>Home Prices Increase at Slower Pace<\/h2>\n<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-39211\" title=\"increasing home prices\" src=\"\/wp-content\/uploads\/2014\/08\/increasing-home-prices-300x207.jpg\" alt=\"U.S. home prices increased year-over-year in 8.1% in June 2014\" width=\"300\" height=\"207\" \/>In June, U.S. home prices rose at a slower pace, perhaps signaling a future price trend. According to the Standard &amp; Poor&#8217;s\/Case-Shiller 20-city home price index report released this week, home prices increased 8.1 percent compared to a year-ago period. But, that rate is down from 9.4 percent the prior month. It’s also the smallest annual gain since December 2012, according to the <a href=\"https:\/\/www.mercurynews.com\/2014\/08\/26\/housing-market-seemingly-cooling-off\/\">Associated Press<\/a>.<\/p>\n<p>This is good news for many first-time buyers, who may have found themselves on the fence because of soaring prices. Some buyers have also been anxious about another bubble.<\/p>\n<p>Prices were making double-digit leaps in many cities in the country, scaring away buyers and making homes unaffordable. But the slowdown in prices indicates things might be returning to a sense of normalcy.<\/p>\n<p>Price growth slumped in all 20 cities on the index. In Cleveland, home values went up only 0.8 percent. In Las Vegas, Phoenix, Miami and Tampa, Fla., prices are at least 33 percent below their housing bubble peaks, the AP reported.<\/p>\n<p>Even in uber-expensive cities such as San Francisco, there are signs of a slowdown. Prices were up 12.9 percent in June, while back in April the annual growth rate was 18.4 percent.<\/p>\n<p>Economists believe that the Federal Reserve will raise long-term interest rates as the market slowly returns to a normal pace. That, in turn, could make mortgage rates go up. Some believe a change in rates won’t make a dent on recovery.<\/p>\n<p>&#8220;Rising mortgage rates won&#8217;t send housing into a tailspin, but will further dampen price gains,&#8221; David Blitzer, chairman of the index committee at S&amp;P Dow Jones Indices told the AP.<\/p>\n<h2>Foreclosures Plummet Again, for 18<sup>th<\/sup> Straight Month<\/h2>\n<p><img loading=\"lazy\" class=\"alignright  wp-image-39221\" title=\"foreclosures\" src=\"\/wp-content\/uploads\/2014\/08\/foreclosures-300x199.jpg\" alt=\"U.S. foreclosures fell 21.1% year-over-year in July 2014\" width=\"270\" height=\"179\" \/>U.S. foreclosures spiraled down in July, bringing in positive news for a housing market that took a massive beating during the real estate downturn.<\/p>\n<p>According to a report, the foreclosure rate slid 21.2 percent from the same month last year, falling to 45,000 last month. That’s the 18th straight month showing at least a 20 percent year-over-year decline, according to CoreLogic, a firm that tracks data for the housing industry.<\/p>\n<p>Completed foreclosures, which indicate the number of homes that have actually been foreclosed, were down 8.5 percent from June, another good sign.<\/p>\n<p>&#8220;The stock of distressed debt continues to rapidly decline, especially in Western states,&#8221; Sam Khater, deputy chief economist at CoreLogic told <a href=\"https:\/\/thehill.com\/policy\/finance\/216102-foreclosures-drop-sharply-in-july\">The Hill.<\/a>&#8220;The number of seriously delinquent loans fell by more than 25 percent from the prior year in 10 states, and seven of those states were in the West.&#8221;<\/p>\n<p>Foreclosures have been the biggest curse for the housing industry since the recession hit. Abandoned homes dragged down property values and prices all across the country, while also destroying credit and dashing dreams. There have been about 5.1 million completed foreclosures in the last six years.<\/p>\n<p>As of last month, approximately 640,000 homes in the U.S. were in some stage of foreclosure, compared with 976,000 in July 2013 – a year-over-year decrease of 34.4 percent, The Hill reported.<\/p>\n<p>This downward trend is a relief for all in the housing industry.<\/p>\n<p>&#8220;Based on current trends, the overall foreclosure inventory could trend down to as low as 500,000 homes by year-end, which is very positive news for the housing market,&#8221; Anand Nallathambi, president and CEO of CoreLogic told The Hill.<\/p>\n<p>&#8220;In total, there are now 36 states with an inventory of foreclosed homes lower than the national rate of 1.7 percent.&#8221;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Home Prices Increase at Slower Pace In June, U.S. home prices rose at a slower pace, perhaps signaling a future price trend. According to the Standard &amp; Poor&#8217;s\/Case-Shiller 20-city home price index report released this week, home prices increased 8.1 percent compared to a year-ago period. But, that rate is down from 9.4 percent the [&hellip;]<\/p>\n","protected":false},"author":35,"featured_media":39221,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[466],"tags":[564,503,479,382,388,56],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/39181"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/35"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=39181"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/39181\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=39181"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=39181"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=39181"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}