{"id":39281,"date":"2014-09-15T09:00:43","date_gmt":"2014-09-15T09:00:43","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=39281"},"modified":"2022-09-12T12:52:59","modified_gmt":"2022-09-12T19:52:59","slug":"lessons-from-the-worst-real-estate-photographers","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/lessons-from-the-worst-real-estate-photographers\/","title":{"rendered":"Lessons From the Worst Real Estate Photographers"},"content":{"rendered":"<p>I was hoping this column wouldn’t be necessary. But there’s a new book that recently came out that proves it is—“Terrible Real Estate Photos<em>” <\/em>by Andy Donaldson.<\/p>\n<p>I understand Andy didn’t take these bad photos. He just found and collected them from the Internet – from actual home listings. It’s depressing to think about: Some real estate agent or FSBO do-it-yourselfer actually looked at these rooms and thought to themselves, <a href=\"http:\/\/terriblerealestateagentphotos.com\/image\/83534585310\">“Oooh, selling point!”<\/a><\/p>\n<p>One lesson learned: Take the time to clean the shampoo and deodorant containers out before taking a bathroom shot. (And check out the plumbing thoroughly, too!)<\/p>\n<p>Ok, so that’s an extreme example. And it’s probably something you’re going to want to disclose to a potential buyer.<\/p>\n<p>And as for this photo:<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-39301\" title=\"terrible listing photo\" src=\"\/wp-content\/uploads\/2014\/09\/terrible-listing-photo.png\" alt=\"Example of a terrible real estate listing photo\" width=\"368\" height=\"275\" \/>That’s one of those things you’re probably going to want to paint over before listing the house. (Well, that and thoroughly check the attics and crawl spaces.)<\/p>\n<h2>The Importance of First-Rate Photography<\/h2>\n<p>These extreme cases aside, sometimes good photography can make the all difference between attracting one low-ball bidder and several interested buyers with competing offers – thus generating more choices for the client, and bigger commissions for you, the agent.<\/p>\n<p>In fact, photography has never been more important. <a href=\"http:\/\/www.mortgagenewsdaily.com\/01072013_home_buying_behaviors.asp\">Some 9 out of 10 homebuyers used the Internet to shop for a home last year.<\/a> If you don’t bother to ensure that your listing looks good to Internet users right off the bat, you are giving away 90 percent of the market before you even get started. As a real estate agent trying to make a career out of selling houses quickly, that sort of market disadvantage will murder you.<\/p>\n<p>So, as a working real estate agent, how can you get the most out of your photography efforts and help get that house sold? Here are a few pointers.<\/p>\n<h2>1. Get a Real Camera<\/h2>\n<p>No, the camera on your iPhone isn’t good enough. It might take photographs that are okay to view on other smartphones, but you want your camera to have a resolution that’s high enough to stand getting blown up on someone’s giant desktop screen at home. According to NAR, <a href=\"https:\/\/www.nar.realtor\/research-and-statistics\/research-reports\/real-estate-in-a-digital-age\">one in four home buyers only use desktop computers during the home search<\/a>. You wouldn&#8217;t use headshots that look bad to one in four people, would you? Of course not. The camera makes a huge difference.<\/p>\n<p>Going cheap on your camera <a href=\"http:\/\/terriblerealestateagentphotos.com\/post\/95110985161\">leads to this:<\/a><\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-39291\" title=\"awful real estate photography\" src=\"\/wp-content\/uploads\/2014\/09\/awful-real-estate-photography.png\" alt=\"Using a low-quality camera will result in terrible listing photos\" width=\"323\" height=\"241\" \/>You’re a professional. Invest in a professional camera.<\/p>\n<p>You’ll also want to invest in a wide-angle lens – and spend some time with it, so you know how to use it. The wide-angle lens makes a big difference when shooting interiors, and can help small spaces look bigger.<\/p>\n<h2>2. Pay Attention to Detail<\/h2>\n<p>Sadly, I’m not even talking about details like not including <a href=\"\/wp-content\/uploads\/2014\/09\/terrifying-listing-photo.png\">Nazi iconography<\/a> in the frame, or getting the lister to put away embarrassing items in the bathroom before you take the photos.<\/p>\n<p>I’m talking about basic things like making sure the picture is <em>right-side up<\/em> before you post the ad.<em> <\/em>Yes, you’d think agents would know that. But there’s a reason why agents get replaced: If you don’t remember to ensure the image is oriented correctly before you post a listing for a seller’s most valuable asset, then what does that say about your ability to handle the paperwork associated with the sale of a house?<\/p>\n<p>Some other small details to look out for in your real estate photography:<\/p>\n<ul>\n<li>Put a lid on the garbage can or move it.<\/li>\n<li>Trim all the blinds and shades to the same level.<\/li>\n<li>Use some work lights to fill in dark areas.<\/li>\n<li>If you have props or accessories on a table, odd numbers work best.<\/li>\n<li>Fluff the pillows. Better yet, <a href=\"http:\/\/terriblerealestateagentphotos.com\/image\/95385357936\">get any sleepers out of the bed before you shoot.<\/a><\/li>\n<li>Don’t show valuables. Valuables + a listing address = an invitation to burglars.<\/li>\n<\/ul>\n<h2>3. Use a Tripod<\/h2>\n<p>You can have the highest resolution camera in the world, but unless you’re on the Olympic shooting team, your hands aren’t perfectly steady and won’t have exact horizontal alignment all the time. Get a tripod and use it.<\/p>\n<h2>4. Get Video Capable<\/h2>\n<p>Moving video footage is getting more and more popular among both homebuyers and agents. Seventy percent of video users watched a video to tour the inside of a home. Thirty-eight percent used video to help them understand specific features. Eighty-six percent watched video content to find out more about a specific community.<\/p>\n<hr style=\"height: 2px;\" \/>\n<p><\/p>\n<p><strong><span style=\"color: #19398a; font-size: 18px;\">Learn about home staging for listing photos:<\/span><\/strong><\/p>\n<p>Watch this short clip to learn some simple listing photo tips from expert home stager Maureen Bray. This clip was taken from the Market Leader webinar <a href=\"http:\/\/learn.marketleader.com\/display\/learning\/Set+the+Stage+for+a+Successful+Home+Sale\">&#8220;Set the Stage for a Successful Home Sale.&#8221;<\/a><\/p>\n<div class=\"wistia_responsive_padding\" style=\"padding:75.0% 0 0 0;position:relative;\">\n<div class=\"wistia_responsive_wrapper\" style=\"height:100%;left:0;position:absolute;top:0;width:100%;\"><iframe loading=\"lazy\" src=\"\/\/fast.wistia.net\/embed\/iframe\/wfn4xp6dk1?videoFoam=true\" allowtransparency=\"true\" frameborder=\"0\" scrolling=\"no\" class=\"wistia_embed\" name=\"wistia_embed\" allowfullscreen mozallowfullscreen webkitallowfullscreen oallowfullscreen msallowfullscreen width=\"100%\" height=\"100%\"><\/iframe><\/div>\n<\/div>\n<p><script src=\"\/\/fast.wistia.net\/assets\/external\/E-v1.js\" async><\/script><\/p>\n<hr style=\"height: 2px;\" \/>\n<h2>5. Think Beyond Your Broker’s Site<\/h2>\n<p>Fifty-one percent of video users visited YouTube, compared to 41 percent for brokers’ websites, and only 33 percent for aggregator listing websites. You’re going to want a presence on YouTube, one way or another.<\/p>\n<p>Getting video capable also allows you to create short videos explaining real estate concepts to potential clients. It’s a good sign if they watch a video entitled something like “How to prep a house to sell.” If your video is helpful, you’re going to be on the shortlist of agents to call.<\/p>\n<h2>6. Consider the Timing of Your Shoot<\/h2>\n<p>Show up with your camera when the lighting is good – in the morning or afternoon when natural light shines in is best. Use the flash on your camera if needed. Take a non-flash shot as well, and compare the two. Failing that, have some lighting options of your own in your trunk, to fill in the dark areas. The photos can’t be dark or shadowy – that’s a big buyer turn-off. Be sure to check your photos before you leave the site.<\/p>\n<p>Also, try to shoot outdoor shots towards noon, when shadows on the ground are minimal. But remember that noon might not be the optimal time for interior shots, as you want a lot of natural sunlight coming in through the windows. Pick the best time of day for your ‘money shots’ of the interior, and come back when golden sunlight is pouring in the windows. It will add warmth and appeal like you won’t believe.<\/p>\n<p>Also, think like a fighter pilot. Try to keep the sun behind you.<\/p>\n<h2>7. Sell the Dream<\/h2>\n<p>Average real estate agents sell houses. <em>Good ones sell homes!<\/em><\/p>\n<p>Any knucklehead can take a photo of a bare table. But it takes a bit of artistry to sell the dream: Try setting the table before you take the shot. Don’t clutter it up, but have enough there to help a browser imagine his or her own family around the table. See if you can light the fireplace. You can’t make the photo smell like cinnamon and apple pie, but you can make it <em>look<\/em> like it does.<\/p>\n<h2>8. Consider Hiring a Professional<\/h2>\n<p>You can get a professional photographer to take some terrific photos for a few hundred dollars. High-end Architectural Digest-level professionals go for $1,000 per day of picture taking, or even more. Would I think about hiring someone at that level to sell a $3 million dollar home? You betcha. Because the commission easily justifies it, and because at that level, I really want to “wow” the client, so I get loads of referrals to his or her neighbors, friends and associates.<\/p>\n<p>Would I do it on a $100,000 home? Probably not. But I’d sure work on my own skills, and maybe take some classes on the side.<\/p>\n<p>Rule of thumb: If you can’t afford the house yourself, consider using a professional photographer. If your real estate practice focuses on houses that you <em>can<\/em> afford, then <em>become <\/em>a pro! Better photos will make you more money.<\/p>\n<p>Finally, enjoy Andy Donaldson’s book, which you can now pre-order on Amazon. You may also enjoy his hilarious photo blog: <a href=\"http:\/\/www.terriblerealestateagentphotos.com\/\">www.terriblerealestateagentphotos.com<\/a>. And don’t forget this blog as well, <a href=\"http:\/\/www.badmlsphotos.com\/\">www.badmlsphotos.com<\/a>. Remember, although experience is the best teacher, it is a fool who learns from no other.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>I was hoping this column wouldn’t be necessary. But there’s a new book that recently came out that proves it is—“Terrible Real Estate Photos” by Andy Donaldson. I understand Andy didn’t take these bad photos. He just found and collected them from the Internet – from actual home listings. It’s depressing to think about: Some [&hellip;]<\/p>\n","protected":false},"author":34,"featured_media":39321,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[36],"tags":[190,568,240,278,279,32,56,569],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/39281"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/34"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=39281"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/39281\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=39281"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=39281"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=39281"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}