{"id":39411,"date":"2014-09-05T18:00:17","date_gmt":"2014-09-05T18:00:17","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=39411"},"modified":"2021-11-29T16:03:12","modified_gmt":"2021-11-30T00:03:12","slug":"real-estate-news","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/real-estate-news\/","title":{"rendered":"This Week in Real Estate: More Chinese Builders Entering U.S. Market; Buyers Fall for Vacation Homes"},"content":{"rendered":"<h2>Chinese Buyers Are Making Way for Chinese Developers<\/h2>\n<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-39441\" title=\"chinese home builders\" src=\"\/wp-content\/uploads\/2014\/09\/chinese-home-builders-200x300.jpg\" alt=\"More Chinese builders are entering the U.S. housing market due to a tougher domestic market back home\" width=\"200\" height=\"300\" \/>For the past couple of years, Chinese investors have been flocking to the U.S. housing market and buying up thousands of homes – even helping the recovery of home prices in some areas.<\/p>\n<p>After a successful run buying up affordable U.S. real estate, some Chinese nationals are now shifting their gaze into the home-building business. According to <a href=\"https:\/\/www.msn.com\/en-us\/money\">MSN Real Estate<\/a>, Chinese nationals are investing in some of the priciest parcels of land.<\/p>\n<p>&#8220;The Chinese real estate market is very competitive, and the U.S. housing market is recovering and expanding rapidly, so for us as a company to invest a certain amount in the U.S. makes a lot of sense for us,&#8221; Tian Ming, chairman of Landsea, a China-based developer, told CNBC.<\/p>\n<p>Landsea, which calls itself China&#8217;s &#8220;pre-eminent green builder,&#8221; is pouring $1 billion into the U.S. housing market, the report said. They are starting with three new developments, including a condominium project in the New York City area, townhouses in San Francisco and single-family homes in the Los Angeles area.<\/p>\n<p>They are targeting both Chinese and American buyers. &#8220;Our primary customer is still here domestically in the U.S., but because of our background and who we are and our brand in China, we will get Chinese customers who will want to buy our homes,&#8221; Tian told CNBC through an interpreter.<\/p>\n<p>According to American developer Lennar, who is working with Landsea, Chinese parents are racing to California especially, and investing in homes so their children can attend American high schools and universities.<\/p>\n<p>The spike in interest from Chinese buyers couldn’t have come at a better time. Since the massive downturn, the housing industry has been looking for saviors. Chinese buyers have been a huge boon for the market, especially because they are buying up homes with cash.<\/p>\n<p>&#8220;China&#8217;s investment is spiking now because there is a fear by many Chinese nationals that their capital is not secure in China itself, and so they are looking for other places to invest,&#8221; Ben Thypin, director of market analysis at Real Capital Analytics, told CNBC.<\/p>\n<p>The numbers are pretty telling. According to Real Capital Analytics, Chinese developers invested close to $3 billion in U.S. commercial real estate in 2013. At the very least, they are expected to meet the same numbers this year.<\/p>\n<h2>Mountain Vacation Homebuyers House Hunt in Autumn<\/h2>\n<p>The beginning of the school year marks the end of the traditional homebuying season. But, it turns out, fall is actually the start of another type of buying season.<\/p>\n<p>According to Jed Kolko, Trulia’s chief economist, there are a handful of local markets where autumn is actually the prime house-hunting season – mostly vacation areas that are in the mountains and forests.<\/p>\n<p>Nationally, home searches slow down in the fall, especially near beaches. They take the biggest dip in Hawaii and Florida, where home searches fall 10 percent below the national average. But in the mountainous states of Vermont, Maine and Wyoming, search activity registers above the annual average in September and October. Real estate agents there are still busy meeting clients’ demands.<\/p>\n<p>“Outside the largest metros, there are some smaller markets where autumn is prime house-hunting season,” Kolko wrote in his blog.<\/p>\n<p>The 10 counties where search activity is highest in autumn, compared with the rest of the year, are all vacation areas, he said. Most of them are in mountain or forest areas, and several are near ski resorts, including Lincoln, N.M.; Teton, Wyo.; and Watauga, N.C.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Chinese Buyers Are Making Way for Chinese Developers For the past couple of years, Chinese investors have been flocking to the U.S. housing market and buying up thousands of homes – even helping the recovery of home prices in some areas. After a successful run buying up affordable U.S. real estate, some Chinese nationals are [&hellip;]<\/p>\n","protected":false},"author":35,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[466],"tags":[254,570,571,356,388,56,395],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/39411"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/35"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=39411"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/39411\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=39411"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=39411"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=39411"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}