{"id":39581,"date":"2014-09-12T09:00:47","date_gmt":"2014-09-12T09:00:47","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=39581"},"modified":"2021-11-17T08:12:39","modified_gmt":"2021-11-17T16:12:39","slug":"this-week-in-real-estate-south-tops-most-affordable-housing-list-builders-construct-soaring-condo-towers","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/this-week-in-real-estate-south-tops-most-affordable-housing-list-builders-construct-soaring-condo-towers\/","title":{"rendered":"This Week in Real Estate: South Tops Most Affordable Housing List; Builders Construct Soaring Condo Towers"},"content":{"rendered":"<h2>Southern States Lead Most Affordable U.S. Housing Markets<\/h2>\n<p>Buying a home is one of the most expensive investments most people will make in their lifetime. But, some buyers get away with a smaller price tag than others. The price of a home depends on a variety of factors, including location.<\/p>\n<p>RealtyTrac calculated income-to-price affordability ratios for 2,270 counties across the country to determine the most affordable housing markets. Based on that data, residents of Chattooga County, Georgia, have the most affordable houses in the nation.<\/p>\n<p>The good news for buyers is that a majority of the most affordable markets have become even more affordable in the last decade, according to <a href=\"http:\/\/www.usatoday.com\/story\/money\/personalfinance\/2014\/09\/06\/24-7-wall-st-affordable-housing-markets\/15136003\/\">USA Today<\/a>. So now may the time to snag that good deal.<\/p>\n<p>The five most affordable housing markets in America all fall in Southern states. They are: Chattooga County, Ga.; Lake County, Tenn.; Edgecombe County, N.C.; Upson County, Ga. and Barnwell County, S.C.<\/p>\n<h2>Developers Racing to Build Condo Towers<\/h2>\n<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-39601\" title=\"condo tower construction\" src=\"\/wp-content\/uploads\/2014\/09\/condo-tower-construction-300x198.jpg\" alt=\"U.S. builders constructing condo towers in increasing numbers\" width=\"300\" height=\"198\" \/>If your clients like condo living and sweeping views, they are in luck. Builders these days are trying to attract deep-pocketed condo buyers with taller buildings.<\/p>\n<p>According to <a href=\"http:\/\/money.cnn.com\/2014\/09\/04\/real_estate\/builders-develop-sky-high-luxury-condo-buildings\/index.html\">CNN<\/a>, in Midtown Manhattan alone, four such sky-kissing towers are going up within blocks of each other.  Right now, the almost completed One57, at 1,005 feet, is New York’s tallest residential building.<\/p>\n<p>But it won’t have that honor for too long. According to the CNN report, both 432 Park Avenue and 111 West 57th Street are expected to tower over One57 when they are completed.  Then in 2018, the Nordstrom Tower will open at 225 West 57th Street. Expected to stand at 1,775 feet (including its spire), it will be just one foot shorter than the new One World Trade Center.<\/p>\n<p>&#8220;It&#8217;s happening all over. I describe this as luxury real estate becoming the new global currency,&#8221; real estate appraiser Jonathan Miller of Miller Samuel told CNN.<\/p>\n<p>Cities that struggle for space, such as Hong Kong, London, Chicago, San Francisco and New York, are sprouting towering condos, Brian O&#8217;Looney, an architect with Torti Gallas and Partners in Maryland, told CNN. Most available lots in cramped cities are small, thus buildings are growing taller and skinnier.<\/p>\n<p>The demand for these skyscrapers is mostly being fueled by international buyers, big business houses, Chinese businessmen, hedge fund managers, and Russian oil billionaires, among others, who are looking for a place to invest – and a way to earn bragging rights.<\/p>\n<p>&#8220;The taller it is, the more prestigious it is. People want trophy homes,&#8221; Eric Trump, executive vice president for Donald&#8217;s Trump&#8217;s Trump Organization, told CNN.<\/p>\n<p>Another reason we are seeing taller, skinnier buildings is because new materials and engineering techniques have allowed developers to build higher without making residents seasick on windy nights, Timothy Johnson, an architect with NBBJ in New York and Chairman of the Council on Tall Buildings and Urban Habitat, told CNN.<\/p>\n<p>But, it’s not cheap or easy to erect these enormous buildings. Developers have to splurge even before breaking ground and deal with city regulations. High-rise condo builders also spend big on hiring skilled trade-union workers to erect these tall structures.<\/p>\n<p>&#8220;These developers have to build at the very top of the luxury market,&#8221; said Miller. &#8220;That&#8217;s the only way the math works.&#8221;<\/p>\n<p>It’s always units on upper floors that fetch the highest profits, as buyers are willing to shell out big bucks for the view, Johnson said. Two penthouses at One57 have fetched an eye-popping $90 million each. One at 432 Park is apparently priced at $95 million.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Southern States Lead Most Affordable U.S. Housing Markets Buying a home is one of the most expensive investments most people will make in their lifetime. But, some buyers get away with a smaller price tag than others. The price of a home depends on a variety of factors, including location. RealtyTrac calculated income-to-price affordability ratios [&hellip;]<\/p>\n","protected":false},"author":35,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[466],"tags":[575,576,247,577,356,56],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/39581"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/35"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=39581"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/39581\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=39581"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=39581"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=39581"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}