{"id":39721,"date":"2014-09-22T09:00:57","date_gmt":"2014-09-22T09:00:57","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=39721"},"modified":"2022-10-24T10:22:47","modified_gmt":"2022-10-24T17:22:47","slug":"win-your-prospects-business-with-the-back-to-work-program","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/win-your-prospects-business-with-the-back-to-work-program\/","title":{"rendered":"Win Your Prospects&#8217; Business With the Back to Work Program"},"content":{"rendered":"<p>In the real estate sales business, we’re always looking for a reason to pick up the phone on a favorable basis. Agents should never miss a chance to educate buyers – especially on programs that can make it easier for them to buy a house.<\/p>\n<h2>Building a Farm With the Back to Work Program<\/h2>\n<p>Here’s one way you can build up a nice little “farm” of future homebuyers: If you get wind of a person who’s gone through a foreclosure, bankruptcy or other qualifying event, you can be the agent who helps them out when the chips are down. You can be the person who gives them a track to run on and helps get them back in the market, by counseling them on how to get qualified for a loan program just a year later.<\/p>\n<p><img loading=\"lazy\" class=\"alignright  wp-image-39741\" title=\"agent calling prospects\" src=\"\/wp-content\/uploads\/2014\/09\/agent-calling-prospects-300x206.jpg\" alt=\"real estate agent calling their prospects about the back to work program\" width=\"270\" height=\"185\" \/>The good news is, there’s a program active now – and it’s been active for about a year: The U.S. Department of Housing and Urban Development Back to Work Program.<\/p>\n<p>The folks who run HUD and the FHA loan program are aware that a lot of innocent people got clobbered with the massive real estate market correction of 2008 to 2012. And millions more suffered job losses, reductions in income or more employment insecurity.<\/p>\n<p>The Back to Work Program is HUD’s way of conceding that past is not necessarily prelude, and that a lot of people suffered bankruptcies and foreclosures due to no fault of their own, but by circumstances they could not have controlled. HUD believes that the credit histories of these individuals don’t reflect their willingness or ability to pay a mortgage in the future.<\/p>\n<p>So here’s your excuse to pick up the phone and call your contacts with a positive message.<\/p>\n<h2>The Info for Potential Buyers<\/h2>\n<p>Tell clients: If you’ve suffered economic dislocation, such as a job loss or the death of a family member that resulted in a loss of income of 20 percent or more for at least six months – but you are now back in the work force and reestablished, you can get back in the market to buy a home.<\/p>\n<p>You must, however, demonstrate a positive credit history for the last 12 months. If you meet these criteria, then the Federal Housing Authority will waive its normal 3-year waiting period for approval on borrowers who have suffered a bankruptcy, surrendered a deed in lieu of bankruptcy, or had a short sale.<\/p>\n<p>To qualify under the Back to Work: Extenuating Circumstances program, clients must also complete a pre-purchase housing counseling program by a certified HUD provider. They must document that credit issues in the past were incurred as the result of a bona fide financial hardship, and show that they’ve reestablished a positive credit history.<\/p>\n<p>That’s a powerful message to tell prospective buyers. You have an immense psychological tailwind working<em> <\/em>for you, in this case – not against you. And you can get people shopping for a home.<\/p>\n<h2>The Fine Print: Rules and Requirements<\/h2>\n<p>The Back to Work program could be key in helping prospective homebuyers recover from the following financial setbacks:<\/p>\n<ul>\n<li>Chapter 7 bankruptcies<\/li>\n<li>Chapter 13 bankruptcies<\/li>\n<li>Foreclosures<\/li>\n<li>Short sales<\/li>\n<li>Forbearance agreements<\/li>\n<li>Loan modifications<\/li>\n<\/ul>\n<p>But the best news, perhaps, is that there’s no interest penalty for participating in this program. The homebuyer will be able to qualify for the same FHA loan at the same rate as he or she would have without the program. Furthermore, there’s no loan size limit, just the standard size and underwriting requirements for the FHA.<\/p>\n<p>Of course, your clients can’t declare bankruptcy on Monday and then qualify for an FHA loan on Wednesday. They’ve got to meet all the FHA requirements to qualify. Specifically:<\/p>\n<ul>\n<li>12 months of no history of delinquency on rental housing<\/li>\n<li>No more than one 30-day delinquency on payments due to other creditors<\/li>\n<li>No court or collections records reporting, except for medical debt and\/or identity theft-related issues<\/li>\n<li>A credit score of 500 or better, or no credit history as far as FICO is concerned<\/li>\n<\/ul>\n<p>Once that’s established, and the client’s completed an FHA counseling program for at least a month, they can buy a home with an FHA mortgage, as soon as 12 months after the bankruptcy or other disruptive event is concluded.<\/p>\n<p>For Chapter 13 bankruptcies, that date is 12 months after the filing, not from the final disposition. However, if the Chapter 13 bankruptcy is not yet fully discharged, the homebuyer must have the approval of the Bankruptcy Court to enter into the mortgage.<\/p>\n<h2>HUD Housing Counseling<\/h2>\n<p>And the counseling isn’t that big a deal. It takes about an hour in most cases, and can be completed by phone or online. As an agent, you should probably familiarize yourself with the counseling services in your area. The counselor will review the causes of the economic setbacks, address how the family may prevent them from recurring, and advise on how much house they can afford.<\/p>\n<p>When a client comes back to you after the counseling program, and they’ve got nearly 12 months in economic recovery under their belt, you may have a very eager and qualified prospect on your hands.<\/p>\n<h2>How to Work the Back to Work Program<\/h2>\n<ol>\n<li>Make a list of everyone you know who might qualify.<\/li>\n<li>Make a list of everyone you know who might know someone who qualifies. (That would be just about everyone who would take your call.)<\/li>\n<li>Call the people on the first list. Tell them: “Hi, This is SuperAgent! It’s been a while since we’ve talked, but I have some ideas on how you can kick that foreclosure in the butt and get it behind you faster. Got a minute?”<\/li>\n<li>Work down your list and start taking a fact finder.<\/li>\n<li>Make an appointment.<\/li>\n<li>Bring the phone number and location of a couple of <a href=\"https:\/\/answers.hud.gov\/housingcounseling\/s\/?language=en_US\">HUD-approved mortgage counselors in your area.<\/a> Explain how the plan works.<\/li>\n<li>Try to get a rough estimate on when they will be able to qualify to buy.<\/li>\n<li>Enter their names and phone numbers on your calendar to call when they should be about ready to go home-hunting.<\/li>\n<\/ol>\n<p>For a more detailed list of requirements and procedures, see <a href=\"http:\/\/portal.hud.gov\/hudportal\/documents\/huddoc?id=13-26ml.pdf\">HUD Mortgagee Letter 2013-26. <\/a>Happy dialing, and good luck!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>In the real estate sales business, we’re always looking for a reason to pick up the phone on a favorable basis. Agents should never miss a chance to educate buyers – especially on programs that can make it easier for them to buy a house. Building a Farm With the Back to Work Program Here’s [&hellip;]<\/p>\n","protected":false},"author":34,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[34],"tags":[190,578,579,220,554,256,323,222,421],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/39721"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/34"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=39721"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/39721\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=39721"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=39721"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=39721"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}