{"id":39811,"date":"2014-09-17T09:00:23","date_gmt":"2014-09-17T09:00:23","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=39811"},"modified":"2016-04-01T08:55:58","modified_gmt":"2016-04-01T15:55:58","slug":"tried-and-true-real-estate-marketing-tools","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/tried-and-true-real-estate-marketing-tools\/","title":{"rendered":"Tried-and-True Real Estate Marketing Tools"},"content":{"rendered":"<p>Have you ever met a real estate agent that markets their business via direct mail? Tell us the truth: What was the first thought that popped into your mind?<\/p>\n<p>“Old school,” is what we thought – that is, until we got to know some of those old-fashioned agents and picked their brains about why some older strategies are still worth using.<\/p>\n<h2>Real Estate Postcards<\/h2>\n<p>Does anyone really look at their junk mail? Think about your own mailbox: Do you read the stuff that comes in it, or just routinely toss it in the trash without a second glance?<\/p>\n<p>Few studies exist as to the effectiveness of direct mail from a consumer’s point of view, thus much of the information on how well real estate postcards work is anecdotal. But these advantages are clear:<\/p>\n<ul>\n<li>Direct mail can be highly targeted.<\/li>\n<li>It can reach every household in a given area.<\/li>\n<li>It helps reinforce your brand in a particular neighborhood.<\/li>\n<\/ul>\n<p>The biggest disadvantage is the consumer’s perception of your mail pieces as junk. Although rising mail costs are a concern to some agents, others claim that no matter how high the price of mailing a postcard gets, it’s still a more efficient use of their marketing dollars than many other tools.<\/p>\n<p>The most effective postcards seem to be of the “Just Listed” and “Just Sold” variety. Let’s face it – many folks are curious about their neighbors, and even more so when a house goes on the market. With a catchy or compelling enough headline, the just listed or just sold postcard will catch a recipient’s attention and garner a look or two.<\/p>\n<p>Instead of “JUST SOLD!” consider using a headline like: “Sold in Just 10 Days &#8212; 1234 Main Street!”<\/p>\n<p>One favorite just listed card headline is “Guess What Your Neighbors Have Done?” Who doesn’t want to hear the latest neighborhood gossip? And when the potential client reads on, they’ll learn that their neighbors have “just listed their house for sale with neighborhood expert Mary Smith of ABC Realty.”<\/p>\n<p>Don’t forget to include a strong call to action on your postcard, such as “Get your free home evaluation” or “Call for a free copy of our ‘Essential Guide to Selling a Home in Acorn Heights’ e-book!”<\/p>\n<p>Newsletters and a drip email campaign – while not exactly archaic – are simple, cost-effective marketing tools that many agents now eschew in favor of the flashier and the newer. That’s too bad, because real estate newsletters, if done right, are the perfect vehicle to staying top-of-mind with potential and past clients.<\/p>\n<h2>Real Estate Newsletters<\/h2>\n<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-39831\" title=\"real estate newsletter\" src=\"\/wp-content\/uploads\/2014\/09\/real-estate-newsletter-300x232.jpg\" alt=\"Real estate newsletters - sent through email or direct mail - is a tried-and-true marketing tool for agents\" width=\"300\" height=\"232\" \/>All-in-one software that helps you design your newsletters, keep track of and update your mailing list, and automatically send the letters out is worth its weight in gold.<\/p>\n<p><a href=\"http:\/\/www.marketleader.com\/products\/professional-for-agents\/\">Market Leader’s system<\/a>, for instance, allows agents to choose from over 4,000 templates for everything from flyers to newsletters, set up drip campaigns and more, for both direct mail and email.<\/p>\n<h2>Remember, Content Is King<\/h2>\n<p>Newsletters are a waste of time if your content isn’t engaging and valuable to your readers.<\/p>\n<p>The most important consideration when thinking about topics for your newsletter is your audience. If you sell luxury property, you’ll want to write about decadent dining opportunities in your town, spotlight a private country club or list highlights of the philharmonic’s upcoming season.<\/p>\n<p>If you specialize in a local neighborhood, you have several choices when it comes to newsletter topics. Did you know that one of the most popular categories on Pinterest is DIY? Both HGTV and the DIY Network gain popularity every season. In fact, the former enjoyed a 9 percent increase in audience from one year ago, while the DIY Network doubled that percentage.<\/p>\n<p>The DIY craze isn’t going to wane anytime soon, so it’s a safe bet that content dealing with DIY projects, ideas, tips and inspiration for the home will be welcome and valuable to your newsletter readers.<\/p>\n<p>From local real estate market statistics to a review of the new coffee shop in town, ask yourself what is valuable to your particular audience – what will engage them – and write away!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Have you ever met a real estate agent that markets their business via direct mail? Tell us the truth: What was the first thought that popped into your mind? “Old school,” is what we thought – that is, until we got to know some of those old-fashioned agents and picked their brains about why some [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[35],"tags":[23,264,44,87,580,581,113,56],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/39811"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=39811"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/39811\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=39811"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=39811"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=39811"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}