{"id":39941,"date":"2014-09-19T17:51:03","date_gmt":"2014-09-19T17:51:03","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=39941"},"modified":"2021-11-17T08:12:25","modified_gmt":"2021-11-17T16:12:25","slug":"this-week-in-real-estate","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/this-week-in-real-estate\/","title":{"rendered":"This Week in Real Estate: Foreclosures Edge Upwards; Shipping Containers Become Affordable Homes"},"content":{"rendered":"<h2>Foreclosures Slightly Up, but Experts Not Concerned<\/h2>\n<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-39981\" title=\"foreclosures\" src=\"\/wp-content\/uploads\/2014\/09\/foreclosures-300x199.jpg\" alt=\"U.S. foreclosures rise for the first time in four years\" width=\"300\" height=\"199\" \/>For the first time in four years, the number of foreclosure auctions inched up in August. But, housing analysts say it’s nothing to sweat about.<\/p>\n<p>According to <a href=\"http:\/\/money.cnn.com\/2014\/09\/11\/real_estate\/rise-in-foreclosures\/index.html\">CNN<\/a>, nearly 52,000 homes went under the bidding hammer in August.  That’s just a 1 percent increase compared to a year-ago period. But it is significant because it’s the first time since November 2010 that the numbers have gone up.<\/p>\n<p>Daren Blomquist, a spokesman for RealtyTrac, the firm which tracked the numbers, said this by no means signals a disastrous return to the time when the mortgage market collapsed.<\/p>\n<p>Foreclosures have single-handedly dealt the biggest blow to the housing market in recent times. The economic bust triggered a trend where many homeowners missed mortgage payments and lost homes to the foreclosure process. These distressed homes dotted the American landscape, dragging down prices in many neighborhoods.<\/p>\n<p>This new rise in foreclosures has been attributed to delays in the process caused by the mismanagement of paperwork by some lenders, starting around 2010, who rushed in and caused what was called the “robo-signing” controversy. Many states came up with new regulations to safeguard the rights of borrowers.  The new laws put the brakes on many homes which were headed for auction earlier.<\/p>\n<p>According to CNN, New Jersey alone has about 80,000 homes that are in trouble, but may not have yet received any default notices.<\/p>\n<h2>Tell Your Clients to Now Think Inside the Box<\/h2>\n<p>In uncertain economic times, consumers are always hunting for a good deal. The latest buzz in the affordable housing market was created by people who are thinking <em>inside<\/em> the box. They are making inexpensive homes out of old shipping containers.<\/p>\n<p><img loading=\"lazy\" class=\"size-medium wp-image-39961 alignleft\" title=\"Quik House\" src=\"\/wp-content\/uploads\/2014\/09\/Quik-House-300x225.jpg\" alt=\"Quik House shipping container house built by Quik Build LLC\" width=\"300\" height=\"225\" \/><\/p>\n<p>After carrying goods across the ocean from far-off continents, these steel boxes often sit idle around American ports. Some creative architects have come to their rescue and are converting them into affordable guesthouses, studios and single-family homes, <a href=\"http:\/\/money.cnn.com\/2014\/09\/05\/real_estate\/shipping-container-costs\/\">according to CNN<\/a>.<\/p>\n<p>Taking six shipping containers, Architect Adam Kalkin has designed a 2,000-square-foot home called <a href=\"http:\/\/www.quik-build.com\/\">Quik House<\/a>. Among other amenities, these two-story homes have three bedrooms, two and a half baths, a laundry room, a pantry and a mudroom.<\/p>\n<p>The base price of a Quik House is $119,000, says the CNN report. That includes six modified containers with walls, windows, stairs and pre-fitted electric and plumbing.  However, it’s then on the buyer to procure the land where the house would sit, get building permits and have the home connected to water, sewer lines, gas and electric.  The typical cost of the process, including assembly, laying foundation, plumbing, heating, flooring and other utility work and finishes, comes to $184,000.<\/p>\n<p>And the best part – besides the price and the fact that it takes only 10 weeks to be delivered – is that the home is eco-friendly, and your clients can opt to add on cool features such as a green roof or solar power system.<\/p>\n<p>The space and size of the offering could fit the needs of many consumers, who dream of owning such a home, but are crunched for finances. Homebuyers are apparently rising to the occasion: There’s currently a six-month wait list for these homes, CNN said.<\/p>\n<p><em>Photo courtesy of <a href=\"http:\/\/www.quik-build.com\/\">Quik House<\/a>.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Foreclosures Slightly Up, but Experts Not Concerned For the first time in four years, the number of foreclosure auctions inched up in August. But, housing analysts say it’s nothing to sweat about. According to CNN, nearly 52,000 homes went under the bidding hammer in August.  That’s just a 1 percent increase compared to a year-ago [&hellip;]<\/p>\n","protected":false},"author":35,"featured_media":39961,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[466],"tags":[331,478,564,421,56,582],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/39941"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/35"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=39941"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/39941\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=39941"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=39941"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=39941"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}