{"id":40081,"date":"2014-09-29T09:00:29","date_gmt":"2014-09-29T09:00:29","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=40081"},"modified":"2016-01-30T00:23:24","modified_gmt":"2016-01-30T00:23:24","slug":"5-productivity-principles-for-real-estate-agents","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/5-productivity-principles-for-real-estate-agents\/","title":{"rendered":"5 Productivity Principles for Real Estate Agents"},"content":{"rendered":"<p>There are three ingredients to productivity: Luck, which you can’t control, and activity and efficiency, which you <em>can.<\/em> So the first key to improving your income and success as a real estate agent is to focus on the latter two elements. After all, if you work very hard, and if you are very efficient, you will be surprised by how much you increase your chances of being lucky.<\/p>\n<p>Here are some tips for doing both.<\/p>\n<h2>Schedule Prospecting First<\/h2>\n<p><img loading=\"lazy\" class=\"alignright  wp-image-40151\" title=\"productive real estate agent\" src=\"\/wp-content\/uploads\/2014\/09\/productive-real-estate-agent-300x199.jpg\" alt=\"productivity principles for real estate agents\" width=\"270\" height=\"179\" \/>Prospecting is the appointment on your calendar for your business. It’s your business’s ‘me’ time, and it’s the most important time you can schedule. If you plan to sit for 90 minutes and do nothing but cold call every Monday through Thursday, then put it on your calendar.  You can move that time around, maybe, but make sure you aren’t done for the day until you’ve made those calls.<\/p>\n<p>Too many agents make the mistake of prospecting when they have nothing else to do. That makes prospecting the last thing they do every day, when all the other options are out. Prospecting is market development, and it should be your <em>first <\/em>priority, not your last.<\/p>\n<h2>Work to Objective, Not to Time<\/h2>\n<p>If your objective is to have 10 conversations with new prospects, do that. If you want to make 100 calls, then do that. Either way, it’s better than saying “I am going to make phone calls for two hours.” Why? Because most people won’t make the calls. They will shuffle papers, look at the clock, fiddle with their contact list, muck about with spreadsheets – anything but make the calls. That’s no good. You have to be on the phone, talking to people, or you’re missing the point.<\/p>\n<h2>Have a Business Plan<\/h2>\n<p>As the saying goes, those who fail to plan are planning to fail. Your business plan is vital. When everything is vague, when you feel like success is eluding you at every step, when you feel unmotivated and when you are overwhelmed with the vast number of things you have to accomplish as an agent, your business plan gives you a track to run on.<\/p>\n<hr \/>\n<p><\/p>\n<p><strong><span style=\"font-size: 16px; color: #19398a;\">More business plan tips from Market Leader:<\/span><\/strong><\/p>\n<p>Watch this webinar recording to learn how to understand your strengths and weaknesses, find what your focus area should be, and how to create checklists for lead generation, lead engagement, marketing and branding.<\/p>\n<div class=\"wistia_responsive_padding\" style=\"padding:56.25% 0 0 0;position:relative;\">\n<div class=\"wistia_responsive_wrapper\" style=\"height:100%;left:0;position:absolute;top:0;width:100%;\"><iframe loading=\"lazy\" src=\"\/\/fast.wistia.net\/embed\/iframe\/j5syt6zcn7?videoFoam=true\" allowtransparency=\"true\" frameborder=\"0\" scrolling=\"no\" class=\"wistia_embed\" name=\"wistia_embed\" allowfullscreen mozallowfullscreen webkitallowfullscreen oallowfullscreen msallowfullscreen width=\"100%\" height=\"100%\"><\/iframe><\/div>\n<\/div>\n<p><script src=\"\/\/fast.wistia.net\/assets\/external\/E-v1.js\" async><\/script><\/p>\n<hr \/>\n<h2>Eliminate Distractions<\/h2>\n<p>Yes, Facebook is still one of them. I don’t care what’s said about the importance of social media, if you’re scrolling through your own timeline and not speaking substantially with someone about buying, selling or renting real estate, it’s a distraction. (I know because I’m guilty as sin!)<\/p>\n<p>Some tips for eliminating distractions:<\/p>\n<ul>\n<li>Close the door to your home office.<\/li>\n<li>Working on something on the computer? Use the full screen option until you’re done.<\/li>\n<li>Have a to-do list. In writing. You can use a program like <a href=\"http:\/\/www.evernote.com\/\">Evernote,<\/a> or you can just keep a notebook. Do what works for you.<\/li>\n<li>Prioritize each task with an A, B or C. The A’s get done first. And they can’t all be A’s! If you divide your tasks into A’s, B’s and C’s, it will force you to prioritize.<\/li>\n<li>Check email at set times during the day. For example, not before noon!<\/li>\n<li>Use a time management program like <a href=\"http:\/\/www.yast.com\/\">Yast.<\/a><\/li>\n<li>Don’t use too many different productivity tools. If you try to use too many, you will not use any of them well.<\/li>\n<li>Don’t sit at a desk next to another real estate agent at your office. You can’t sell to each other!<\/li>\n<\/ul>\n<h2>Master the Art of Delegation<\/h2>\n<p>This is for agents who have assistants or support staff. But to delegate well, you have to plan to do that, and plan to follow up on those delegated tasks.<\/p>\n<p>Don’t have your own assistant? You can work with other agents to share one, or you can engage a service like <a href=\"https:\/\/www.zirtual.com\/\">Zirtual<\/a>, which provides virtual digital assistants who can help you with some basic tasks like scheduling, online research, database entry, direct mailing, email management, Twitter updates and social media interactions, etc.<\/p>\n<p>For example, you could go to a networking event, grab a bunch of business cards, scan them and send them off to a virtual assistant (VA), who will enter them into your database or contact management system. You can do the same thing with receipts, expenses and bookkeeping tasks as well. (Though I use <a href=\"http:\/\/www.expensify.com\/\">Expensify<\/a> to capture receipts and expenses.)<\/p>\n<p>Depending on your VA’s skill set, you can also have them clean up and format your presentations, marketing materials, and so forth. But before you go crazy working with assistants, make sure that both you and the assistant understand what unlicensed assistants can and can’t do in your jurisdiction.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>There are three ingredients to productivity: Luck, which you can’t control, and activity and efficiency, which you can. So the first key to improving your income and success as a real estate agent is to focus on the latter two elements. After all, if you work very hard, and if you are very efficient, you [&hellip;]<\/p>\n","protected":false},"author":34,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[83],"tags":[23,62,583,584,159,529,56],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/40081"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/34"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=40081"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/40081\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=40081"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=40081"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=40081"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}