{"id":40481,"date":"2014-09-24T09:00:46","date_gmt":"2014-09-24T09:00:46","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=40481"},"modified":"2016-01-30T00:24:02","modified_gmt":"2016-01-30T00:24:02","slug":"boost-customer-service-by-being-an-expert-on-the-mortgage-process","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/boost-customer-service-by-being-an-expert-on-the-mortgage-process\/","title":{"rendered":"Boost Customer Service by Being an Expert on the Mortgage Process"},"content":{"rendered":"<p>Ah, real estate school: That time you spent reading or listening to what seemed like endless hours of lectures. And what did you learn about actually listing and selling real estate? Not much. Sure, you walked away from the experience knowing – without a doubt – that there are 43,560 square feet in an acre. But how to work with first-time buyers or how to determine the market value of a home? These things aren’t covered in licensing classes.<\/p>\n<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-40521\" title=\"real estate customer service\" src=\"\/wp-content\/uploads\/2014\/09\/real-estate-customer-service-300x199.jpg\" alt=\"How real estate agents can provide excellent customer service during the mortgage process\" width=\"300\" height=\"199\" \/>New agents are then cut loose to work with consumers with whatever real estate training their brokers provide. It’s a safe bet that not much, if any, of that training has to do with the mortgage process. To many agents, the mortgage process remains completely foreign and they depend on the lender to explain the process to their clients.<\/p>\n<p>But agents who do their homework and learn the ins and outs of the mortgage process will not only be able to share valuable information with clients, they will also provide a service that will win referrals and take their business to the next level.<\/p>\n<h2>Add Value for Your Clients<\/h2>\n<p>Value is a popular buzzword in the real estate industry lately – how to bring value to the process and how to prove your value is top-of-mind with many agents. It’s all about maximizing the value-added services that you bring to the table that few other agents can.<\/p>\n<p>Let’s face it, it’s not always easy to find ways to differentiate yourself from other agents. One of the best ways is by providing stellar customer service. What you think defines “customer service,” however, and the definition your client gives may be two different things.<\/p>\n<p>In 2012, the California Association of Realtors <a href=\"http:\/\/www.car.org\/3550\/pdf\/econpdfs\/2012_Buyer_Survey_Report.pdf\">conducted a study of homebuyers<\/a> and one of the questions asked was: “If there was one thing you could change about the homebuying experience, what would it be?”<\/p>\n<p>Almost one-fourth of respondents said: “Better agent communication.” In fact, homebuyers surveyed said that either their agents were ignorant of the real estate transaction process, or they didn’t share their knowledge.<\/p>\n<p>Most real estate consumers don’t have a clue about what comes next at any point in the process. They expect their agent to guide them and to share their expertise in a way that’s easy to understand. Do that, and your referral pipeline will be overflowing.<\/p>\n<h2>Learn All You Can About the Mortgage Process<\/h2>\n<p>How much an agent knows about the lending process depends on his or her exposure to the industry. Buying a home yourself and previous work experience in the mortgage industry are two ways to learn about the process, but not all agents have that exposure.<\/p>\n<p>The first step, then, is to learn everything you can about what your clients will meet when they pursue a home loan – from start to finish. If you work closely with a lender, he or she is the perfect tutor. Otherwise use the Internet to study up on the process.<\/p>\n<p>There are many steps on the road to a mortgage, from the loan application and pre-approval to closing. You may need to explain debt-to-income ratio and how lenders use it, what happens during underwriting, the title report, the appraisal and what not to do after applying for a loan, among other things.<\/p>\n<h2>How to Share Your Mortgage Knowledge<\/h2>\n<p>Now that you’ve boned up on the loan process, how should you share this information with buyers?<\/p>\n<h2>Have a Consultation<\/h2>\n<p>Many agents conduct a buyer’s consultation with new clients before stepping foot in a home. The consultation serves several purposes, including getting to know the potential clients, gathering information on their wants and needs in a home, their price range and, naturally, whether or not they’ve begun the loan pre-approval process.<\/p>\n<p>This consultation is the ideal time to explain what they can expect when pursuing a home loan. Take the time to walk them through it, from start to finish, and solicit questions about anything they don’t understand and learn their concerns.<\/p>\n<h2>Create Handouts<\/h2>\n<p>Some agents use a buyer presentation packet, full of information on the home loan and buying processes. This is the ideal place to insert a handout that walks clients through the mortgage process.<\/p>\n<p>Use photos or infographics to help you explain – they’re so much more interesting than plain text. Don’t neglect to use your branding on the handout and include your contact information.<\/p>\n<h2>Add Resources to Your Website<\/h2>\n<p>Every agent with a website should have a Buyer’s Resource section, as well as a Seller’s Resource section. If you don’t yet have these two sections, create them now.<\/p>\n<p>Create a page on “Steps in the Home Loan Process” for the Buyer’s Resource section and direct your prospective clients to it. Again, make the page engaging and easy to read with drawings, photos or infographics.<\/p>\n<h2>Include Info on VA, USDA and FHA Loans<\/h2>\n<p>If you work with a lot of veterans or first-time buyers, have separate pages on your site that deal with VA, USDA and FHA loans. Although the process is similar, there are enough differences between these guaranteed loans and conventional loans that an explanation of the process is necessary. This is especially true if your buyer is interested in purchasing a condo with an FHA-backed loan.<\/p>\n<p align=\"center\">&#8212;<\/p>\n<p><strong>Agents:<\/strong> Do you walk prospective clients through the loan process? If so, what methods do you think work best?<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Ah, real estate school: That time you spent reading or listening to what seemed like endless hours of lectures. And what did you learn about actually listing and selling real estate? Not much. Sure, you walked away from the experience knowing – without a doubt – that there are 43,560 square feet in an acre. [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[97],"tags":[23,254,340,220,421,56,585,586,136],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/40481"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=40481"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/40481\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=40481"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=40481"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=40481"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}