{"id":40811,"date":"2014-09-26T17:31:02","date_gmt":"2014-09-26T17:31:02","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=40811"},"modified":"2021-11-17T08:12:18","modified_gmt":"2021-11-17T16:12:18","slug":"this-week-in-real-estate-new-home-sales-soar-mortgage-applications-fall","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/this-week-in-real-estate-new-home-sales-soar-mortgage-applications-fall\/","title":{"rendered":"This Week in Real Estate: New Home Sales Soar; Mortgage Applications Fall"},"content":{"rendered":"<h2>Sales of New Homes Surge to 6-Year High in August<\/h2>\n<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-40831\" title=\"new home sales\" src=\"\/wp-content\/uploads\/2014\/09\/rising-new-home-sales-300x200.jpg\" alt=\"New home sales surged in August 2014, which is good news for the real estate industry\" width=\"300\" height=\"200\" \/>Another sign of changing times for housing comes from a new report released this week: According to the U.S. Department of Commerce, new home sales skyrocketed last month to the highest level since 2008. That’s an indication that consumer demand is soaring, and if that keeps up the construction market would also do well.<\/p>\n<p>New home sales <a href=\"http:\/\/www.census.gov\/construction\/nrs\/\">jumped<\/a> 18 percent last month compared to the previous month, reaching a seasonally adjusted annual rate of 504,000. According to the <a href=\"http:\/\/online.wsj.com\/articles\/u-s-new-home-sales-surge-18-in-august-1411567310\">Wall Street Journal<\/a>, that’s the biggest month-over-month jump since 1992, and highest sales since May 2008.<\/p>\n<p>Right now, only about a tenth of all sales represent new homes. But the bump is a positive sign. An earlier industry survey showed that builder optimism is at its highest level since 2005. Both of these items indicate that we could be seeing a lot of groundbreaking in the coming months. The ripple effects could also be felt by the overall economy, though some analysts are still cautious about being too optimistic.<\/p>\n<p>&#8220;The leap in August sales would bode very well for starts if it is sustained,&#8221; Joshua Shapiro, chief U.S. economist of MFR Inc., said in a note to clients, reported the Journal. &#8220;We definitely would like to see more data on the new home market before concluding that we are ratcheting up to a new level of activity.&#8221;<\/p>\n<p>One reason for caution: New home sales are still selling at a slower pace compared to historical data. August’s new home sales increased 33 percent compared to a year-ago period, but typically new home sales were touching the million mark before the last recession, said the WSJ.<\/p>\n<h2>Mortgage Applications Slide on Rate Increase<\/h2>\n<p>The cautiousness on the part of industry analysts is not without reason. While a lot of good things are brewing in the housing market, there are still some worrisome indicators. Triggered by a rise in interest rates, mortgage applications fell last week, according to the Mortgage Bankers Association.<\/p>\n<p>Applications for both refinancing and home purchases fell 4.1 percent in the week ended Sep. 19. Though mortgage rates for 30-year fixed loans averaged 4.39 percent, the highest since May.<\/p>\n<p>The MBA&#8217;s seasonally-adjusted index of refinancing applications slipped 7 percent, while the measure for loan requests for homebuying was down just 0.3 percent, <a href=\"http:\/\/www.dailyfinance.com\/2014\/09\/24\/mortgage-applications-fall-rates-rise\/\">Daily Finance<\/a> reported.<\/p>\n<h2>Mortgages Now Easier, Cheaper for Wealthy Home Buyers<\/h2>\n<p>If you have well-off clients shopping around, this news should be encouraging to them, and could speed them up in the homebuying process. Wealthy buyers are now paying lower average rates on high value loans called jumbo mortgages. They are also paying smaller down payments, and in some cases, lenders are even waiving mortgage insurance, according to a CNN <a href=\"http:\/\/money.cnn.com\/2014\/09\/21\/real_estate\/jumbo-mortgages-getting-cheaper\/index.html\">report.<\/a><\/p>\n<p>Tom Wind, executive vice president of home lending for EverBank, told CNN that some lenders have slashed the required down payments on jumbo loans to as low 10 percent. They also require lower credit scores to qualify. In the past, borrowers needed squeaky clean credit, with scores above 700 to get qualified for these loans. Now, some lenders are lowering the bar to 650.<\/p>\n<p>The trend of an easier lending process for wealthy borrowers has been going on for months. According to the Mortgage Bankers Association, the average rate on jumbo loans of $417,000 or more was 4.24 percent last week. That’s slightly lower than the 4.36 percent borrowers are paying on conventional 30-year fixed loans. Over an extended period of time, that slight gap makes a huge difference.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Sales of New Homes Surge to 6-Year High in August Another sign of changing times for housing comes from a new report released this week: According to the U.S. Department of Commerce, new home sales skyrocketed last month to the highest level since 2008. That’s an indication that consumer demand is soaring, and if that [&hellip;]<\/p>\n","protected":false},"author":35,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[466],"tags":[254,356,541,523,56,587],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/40811"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/35"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=40811"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/40811\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=40811"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=40811"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=40811"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}