{"id":41061,"date":"2014-10-06T09:00:33","date_gmt":"2014-10-06T09:00:33","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=41061"},"modified":"2016-01-30T00:21:58","modified_gmt":"2016-01-30T00:21:58","slug":"mortgage-loan-approval","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/mortgage-loan-approval\/","title":{"rendered":"The Nuts and Bolts of Mortgage Loan Approval"},"content":{"rendered":"<p>Now may be the time to strike: Recent data indicates that the closing rate on mortgage applications is up, and the time required from application to closing is down, according to the latest <a href=\"http:\/\/www.elliemae.com\/origination-insight-reports\/Ellie_Mae_OIR_AUGUST2014.pdf\">Mortgage Origination Report from Ellie Mae.<\/a><\/p>\n<h2>How We Got Here: A Quick Background on Mortgages<\/h2>\n<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-41081\" title=\"mortgage loan approval\" src=\"\/wp-content\/uploads\/2014\/10\/mortgage-loan-approval-300x200.jpg\" alt=\"What is takes to get approved for a mortgage loan - debt-to-income ratios, closing times and credit scores\" width=\"300\" height=\"200\" \/>It seems like only yesterday banks were throwing mortgages at just about anybody who could fog a mirror. In 2005-2007, many people who make their investment decisions by looking in a rear-view mirror had convinced themselves that real estate was a can’t miss investment – and therefore bid up real estate prices until that can’t-miss investment became almost certain to miss. That was the thinking at the center of the real estate crash – <a href=\"http:\/\/www.amazon.com\/Extraordinary-Popular-Delusions-Madness-Crowds\/dp\/1463740514\">a phenomenon we’ve seen many times before,<\/a> and one which we’ll no doubt see again.<\/p>\n<p>It was the overstated value of real estate that propped up the vast residential lending machine the industry created. The unrealistic value assigned to increasingly questionable mortgages fed the ability of lenders to go to the capital markets to get more money to lend. That enabled investors to bid up real estate prices even more.<\/p>\n<p>Thus began a massive flight to safety, as lenders pulled in their horns and sought refuge in treasuries, bank-owned life insurance, short-term debt, money markets and the like. As a result, by 2009, almost no one without a substantial down payment and a walk-on-water FICO score was getting a mortgage.<\/p>\n<p>Since then, things have gotten a bit easier, thanks to a Federal Reserve that did all it could to keep revving up the money supply over the last five years. So what does it take to get a residential mortgage loan now?<\/p>\n<h2>Where Mortgage Approvals Are Today<\/h2>\n<p>Ellie Mae’s Mortgage Origination Report gives us a monthly snapshot of the loans that are – and aren’t – getting approved. Ellie Mae is a major software vendor in the mortgage industry, and they are involved somewhere along the line with 57 percent of all mortgages underwritten in the country.<\/p>\n<p>According to the most recently released report, for August 2014, the average number of days required to close on a loan is under 40 for the second month in a row. Meanwhile, the loan approval rate reached 61 percent – the highest the company has on record since it began tracking this data in 2011.<\/p>\n<h2>Faster Closing Times<\/h2>\n<p>The good news for agents is that loans are closing faster than they did a year ago. This is particularly true for FHA loans. A year ago, the average FHA loan was closing in 45 days, and FHA refinance loans were taking 51 days!<\/p>\n<p>The time period has shortened substantially now, with the average FHA purchase loan closing in 39 days, and the average refinance loan closing in 40 days.<\/p>\n<p>The average conventional and VA loan are both closing in 37 days. Both VA and conventional closing times are slightly shorter than a year ago, but the most dramatic improvement has been in the VA market.<\/p>\n<h2>Differences in Closing Rates<\/h2>\n<p>Not all loans are equal. Ellie Mae reports a substantial difference in the closing rate for purchases versus refinance loans. The overall closing rate, an average for all loan types, is 61.1 percent. But purchase loans were much more likely to reach the closing stage, at 65.1 percent, versus 54.2 percent for refinances.<\/p>\n<p>The best closing rate for purchases goes to VA loans, at 71.2 percent. Conventional loans come next, at 67.6 percent, followed by FHA at 60.1 percent. For refinances, the best bet was to go conventional. Conventional financing got 56.8 percent of their loan applications to closing, followed by the VA, 46.6 percent, and  FHA at 42.2 percent. But don’t get too discouraged by this data, because more difficult to underwrite cases were more likely to go FHA rather than conventional.<\/p>\n<h2>The Magic Number Is Still 700<\/h2>\n<p>Credit scores count. For the best shot at success, agents should still coach their clients to join the 700 Club. Consider this: If your credit score is less than 700, your chance of closing a loan falls to less than one in three. The average denied application had a credit score of 695 – about the same as it was in August 2013, though it actually reached 701 in the months just prior. Meanwhile, the average credit score for loans that reached closing was 727.<\/p>\n<p>As expected, however, the average credit score of approved FHA loans, 685 for refinances and 682 for purchases, was somewhat lower than for conventional or VA loans. The average denied FHA loan application score was 637 for refinances and 660 for purchases.<\/p>\n<h2>Conventional Loans Require Strong Credit<\/h2>\n<p>The average approved conventional loan looks like this: For purchases, the average credit score was 755, with 20 percent down (or a loan-to-value ratio of 80). For refinances, the average score was 735, with an average LTV of 70.<\/p>\n<p>Meanwhile, the average denied conventional loan for purchases had an LTV of 81, and credit scores of 723 for purchases and 720 for refis. So even having a FICO score of well over 700 is no sure ticket to success in the conventional loan market.<\/p>\n<h2>The Debt-to-Income Key<\/h2>\n<p>The <a href=\"http:\/\/www.consumerfinance.gov\/askcfpb\/1791\/what-debt-income-ratio-why-43-debt-income-ratio-important.html\">debt-to-income ratio<\/a> is particularly important in the VA world, which doesn’t compare easily with other markets because of the lack of a down payment. The average approved loan in the VA market has a back-end ratio of 42, while the average failed VA application has a back-end ratio of 45.<\/p>\n<p>To qualify for a VA loan, your clients need to manage DTI carefully and have a back-end ratio not greater than 43 percent, which is the highest number you can have and still get a qualified mortgage – that is, a mortgage that the bank can still sell upstream to the Fannies and Freddies of the world.<\/p>\n<p>For the best chance of success, work with your clients to bring that DTI ratio below 36 percent, with not more than 28 percent of your income devoted to mortgage service. Not that this would free up the max of 8 percent of income required to service all other debts, such as car loans, credit cards, student loans, the whole shebang! For you ‘farmers’ out there, creating a market that lives easily within their means is crucial.<\/p>\n<h2>Manage Your Client’s Expectations<\/h2>\n<p>Agents should spend some time managing clients’ expectations when it comes to getting a mortgage – and helping them prepare well ahead of their application. It takes time to nudge a FICO score from 640 to a more competitive 720.<\/p>\n<p>While FICO does not report results by state, indications show that <a href=\"http:\/\/www.governing.com\/blogs\/by-the-numbers\/average-credit-scores-for-states.html\">credit scores were stronger in the north than in the south.<\/a> So, those of you in southern states may have a bit more nudging to do.<strong><\/strong><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Now may be the time to strike: Recent data indicates that the closing rate on mortgage applications is up, and the time required from application to closing is down, according to the latest Mortgage Origination Report from Ellie Mae. How We Got Here: A Quick Background on Mortgages It seems like only yesterday banks were [&hellip;]<\/p>\n","protected":false},"author":34,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[83],"tags":[589,590,557,591,558,421],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/41061"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/34"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=41061"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/41061\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=41061"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=41061"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=41061"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}