{"id":41221,"date":"2014-10-03T19:19:33","date_gmt":"2014-10-03T19:19:33","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=41221"},"modified":"2021-11-22T13:35:26","modified_gmt":"2021-11-22T21:35:26","slug":"this-week-in-real-estate-home-prices-rise-at-slower-pace-many-homes-still-undervalued","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/this-week-in-real-estate-home-prices-rise-at-slower-pace-many-homes-still-undervalued\/","title":{"rendered":"This Week in Real Estate: Home Prices Rise at Slower Pace; Many Homes Still Undervalued"},"content":{"rendered":"<h2>Home Prices Rise at Slowest Pace in Two Years<\/h2>\n<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-41251\" title=\"U.S. home prices\" src=\"\/wp-content\/uploads\/2014\/10\/home-prices-2-300x200.jpg\" alt=\"U.S. home prices rose at their slowest rate in two years in July 2014, according to the Case-Shiller Index\" width=\"300\" height=\"200\" \/>In the year ending in July, home prices in 20 American cities monitored by the S&amp;P\/Case-Shiller index increased. The not-so-good news: Prices rose at the slowest pace in almost two years, <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2014-09-30\/home-prices-in-u-s-rise-at-slowest-pace-in-almost-two-years\">Bloomberg<\/a> reported. Tight credit rules and slower wage increases continue to dampen the prospects of price hikes and other gains for the housing market.<\/p>\n<p>According to the S&amp;P\/Case-Shiller index, home values in those 20 cities climbed 6.7 percent in July compared to a year-ago period. That’s the smallest annual gain since November 2012. Economists were expecting a 7.4 percent bump in the index, Bloomberg said. Nationwide, prices rose 5.6 percent, down from a 6.3 percent gain in the year ended June.<\/p>\n<p>Another reason why prices are slowing down is because investors are retreating from the market. That could be a good sign for homebuyers. In the past, investors have crowded the market, driving up prices and gobbling up inventory, and leaving little room for homebuyers to find their dream home.<\/p>\n<p>Many investors were cash buyers, which put them at an advantage over first-time buyers. With price growth slowing and a slight uptick in the labor market, many Americans who were on the fence may now join the homeownership wagon. But, there’s a lot to be done to keep the momentum going.<\/p>\n<p>“In order to support further gains in home prices, you would need stronger housing demand, an improvement in the rate of household formation, and inventory levels to remain lean,” Michael Gapen, a senior economist for Barclays Capital Inc., told Bloomberg. “You will get all of this, it will just be at a moderate pace” since owners shouldn’t anticipate “8 to 10 percent out of your home forever,” he said.<\/p>\n<p>Adjusted for seasonal variations, home prices in the 20-city index slipped 0.5 percent in July, compared to the prior month. That’s the worst performance since November 2011. Analysts surveyed by Bloomberg had expected the numbers to be unchanged. Unadjusted prices rose 0.6 percent.<\/p>\n<p>Overall, out of the 20 cities monitored by the index, 19 registered year-over-year increases in home prices. With a 0.9 percent gain, Cleveland was the only city that maintained its year-over-year increase, whereas San Francisco took the biggest hit.<\/p>\n<h2>U.S. Home Prices Are Slightly Undervalued<\/h2>\n<p>The current deceleration of prices may worry some homeowners, but Trulia’s Chief Economist Jed Kolko determined that home prices nationally are actually 3 percent undervalued in the third quarter of 2014.<\/p>\n<p>“In 2006 Q1, during the past decade’s housing bubble, home prices soared to 34% overvalued before dropping to 13% undervalued in 2012 Q1,” Kolko said. “One quarter ago (2014 Q2), prices looked 5% undervalued; one year ago (2013 Q3), prices looked 6% undervalued.”<\/p>\n<p>Kolko’s statement was part of the latest Trulia Bubble Watch report. Bubble Watch calculates whether home prices are overvalued or undervalued relative to their fundamental value. It does so by comparing prices today with historical prices, incomes, and rents. When home prices are overvalued compared to fundamentals, the housing market approaches a bubble, and is at bigger risk of a price crash.<\/p>\n<p>“Sharply rising prices aren’t necessarily a sign of a bubble. By definition, a bubble develops when prices look high relative to fundamentals,” Kolko said.<\/p>\n<p>According to Kolko, three out of five Housing Barometer measures are approaching normal levels. But the two measures that connect housing to the broader economy are still struggling, he said. So the job market and housing market aren’t helping each other as much as they should.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Home Prices Rise at Slowest Pace in Two Years In the year ending in July, home prices in 20 American cities monitored by the S&amp;P\/Case-Shiller index increased. The not-so-good news: Prices rose at the slowest pace in almost two years, Bloomberg reported. Tight credit rules and slower wage increases continue to dampen the prospects of [&hellip;]<\/p>\n","protected":false},"author":35,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[466],"tags":[524,254,355,356,535,56],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/41221"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/35"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=41221"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/41221\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=41221"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=41221"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=41221"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}