{"id":41311,"date":"2014-10-01T09:00:32","date_gmt":"2014-10-01T09:00:32","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=41311"},"modified":"2021-12-07T11:43:16","modified_gmt":"2021-12-07T19:43:16","slug":"real-estate-agent-safety-tips","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/real-estate-agent-safety-tips\/","title":{"rendered":"Real Estate Agent Safety Tips"},"content":{"rendered":"<p>The Little Rock real estate community was rocked this week by <a href=\"https:\/\/abcnews.go.com\/US\/arkansas-realtor-beverly-carter-targeted-woman-worked\/story?id=25860583\">the sudden disappearance of Beverly Carter<\/a>, a Crye-Leike real estate agent who vanished immediately after showing a country home in nearby Scott, Ark.<\/p>\n<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-41391\" title=\"real estate safety tips\" src=\"\/wp-content\/uploads\/2014\/10\/real-estate-safety-tips-300x198.jpg\" alt=\"ultimate list of safety tips for real estate agents\" width=\"300\" height=\"198\" \/>Police arrested a suspect (who had an extensive criminal record) and charged him with murder after Carter’s body was found. After three days, Carter’s car was still in the driveway of the home she showed that night. Her body was found in a shallow grave later in the week.<\/p>\n<p>Her colleagues, understandably, are now afraid of going out to show houses. Her managing broker also has a leadership challenge, in trying to keep a business going and support her agents and their families.<\/p>\n<h2>The Risk of Crime Against Real Estate Agents<\/h2>\n<p>Crimes against real estate agents on the job are rare, but they do occur – and nobody is immune. Last May, a Charlotte, N.C., real estate agent <a href=\"https:\/\/www.charlotteobserver.com\/news\/business\/article9121745.html\">was sexually assaulted<\/a> upon showing a prospect a house. A 27-year-old agent, Ashley Okland, was <a href=\"https:\/\/www.desmoinesregister.com\/story\/news\/crime-and-courts\/2021\/04\/08\/ashley-okland-west-des-moines-realtor-2011-unsolved-iowa-murder-what-we-know\/7103725002\/\">shot to death<\/a> while showing a model home in West Des Moines, Iowa, in 2012.<\/p>\n<p>A <a href=\"https:\/\/www.nydailynews.com\/news\/crime\/pa-attempted-rapist-enjoyed-searching-victims-article-1.3288170\">Pennsylvania man named Frank Yeager was arrested in 2012<\/a> after police got wind that he was planning to lure female real estate agents into model homes and then sexually assault them. His target avoided becoming a victim when she refused two separate requests to meet at the home alone with him.<\/p>\n<h2>Recognizing Danger and Staying Safe on the Job<\/h2>\n<p>The last incident is particularly instructive. The agent was selling newly built Pulte homes. She became concerned because Yeager was acting strange and did not ask about prices, according to the report. In this case, her instincts were correct – she told Yeager he could take a look at the home himself, but she would not be going inside with him. Yeager returned insisting that the home had a water leak and again tried to get her to go inside with him. Again, she refused to go in the home with him.<\/p>\n<p>When agents did go look at the house, they found that Yeager had apparently pulled the drapes shut and turned out the lights. They called the police, who got a warrant and found rope, duct tape, two handguns, and a diary detailing his plans. He was sentenced to 10 to 20 years in prison for attempted rape.<\/p>\n<p>The first and best line of defense is always common sense and street smarts. In this case, it may have saved the agent’s life. But it’s not always enough.<\/p>\n<p>In the Little Rock case still unfolding, Beverly Carter took some precautions, as well. Her husband knew exactly where she was going that night, and knew exactly what time he should hear from her. When she was late coming home or calling, Mr. Carter knew something was wrong, and was able to mobilize law enforcement and a massive community search right away.<\/p>\n<h2>Our List of Real Estate Agent Safety Tips<\/h2>\n<p>Naturally, there is no foolproof method of detecting or stopping criminals who prey on real estate agents. But there are a few things agents and their managers can do to help lessen the odds, reduce the opportunity for crime, and make themselves less vulnerable.<\/p>\n<p>Have the client or prospect meet you at the office – with other people there. Copy their driver’s license or another ID.<\/p>\n<ul>\n<li>Trust your instincts. They are finely-tuned, thanks to millions of years of evolution. For more information on intuition and its role in crime prevention, see the excellent book “<a href=\"https:\/\/www.amazon.com\/The-Gift-Fear-Gavin-Becker\/dp\/0440226198\">The Gift of Fear and Other Survival Signals That Protect Us From Violence,<\/a>” by Gavin de Becker. (<a href=\"https:\/\/archive.nytimes.com\/www.nytimes.com\/books\/first\/b\/becker-fear.html\">Read the first chapter here<\/a>.) Among the warning signs he identifies:\n<ul>\n<li>Forced teaming. A criminal may inappropriately try to verbally rope a victim in by implying the two of them are a kind of team, in an effort to gain trust.<\/li>\n<li>Oversharing. A criminal who is lying may volunteer too many details – way more than normal discourse would require – to add credibility to his or her story.<\/li>\n<li>Sharking. A criminal may be overly helpful to an agent, promising deals or referrals, or even giving referrals, in an attempt to get the agent to let his or her guard down over time, and to manipulate feelings of guilt.<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<ul>\n<li>Pre-qualify clients at the office. If they don’t care about price, then why do they want to see homes with you?<\/li>\n<\/ul>\n<ul>\n<li>Put “By appointment only – ID required” on your marketing material. Legit clients won’t mind, and predators may go looking for an easier mark.<\/li>\n<\/ul>\n<ul>\n<li>Keep couples together when showing houses. Don’t let one distract you while the other goes around potentially stealing – or scouting out a place to attack you.<\/li>\n<\/ul>\n<ul>\n<li>Don’t employ sex appeal in your marketing. It could attract stalkers. Professionalism, integrity and competence are better messages to send.<\/li>\n<\/ul>\n<ul>\n<li>Don’t wear scarves or any clothing that is easy to grab. Also keep hair short or done up so that it cannot easily be used to control movement.<\/li>\n<\/ul>\n<ul>\n<li>Showing a home? Mention that someone will be coming by the house in a little while.<\/li>\n<\/ul>\n<ul>\n<li>Don’t carry much cash in your handbag. But consider carrying a secret stash in your car or in a shoe.<\/li>\n<\/ul>\n<ul>\n<li>Keep your cellphone charged and carry an external battery. Get a car charger too.<\/li>\n<\/ul>\n<ul>\n<li>Have your office number use call forwarding to send calls to your cell. Don’t use your personal cellphone number directly on your marketing materials.<\/li>\n<\/ul>\n<ul>\n<li>Park on the street, where you don’t have to back out, and so that no one can block your car in if you need to get out quickly. If you must park in a driveway, back in, or park with the driver’s side door towards your likely escape route.<\/li>\n<\/ul>\n<ul>\n<li>Showing an open house? Go introduce yourself to the neighbors. It’s good marketing – and they can be alert to any unusual sounds coming from the house should you be in danger.<\/li>\n<\/ul>\n<ul>\n<li>Maintain your vehicle. Agents drive around a lot. If you have a car problem, you are vulnerable. Maintain a roadside assistance service. That way you won’t have to rely on the kindness of whatever stranger happens to show up.<\/li>\n<\/ul>\n<ul>\n<li>Don’t go in attics or basements unless you know the client very well. Especially basements – the earth muffles sounds.<\/li>\n<\/ul>\n<ul>\n<li>Keep emergency contact info up to date at the office.<\/li>\n<\/ul>\n<ul>\n<li>Be strict about requiring prospects to fill out an identification form before going out to see homes with you. Legitimate shoppers understand, and many agencies are already taking this step. You won’t be the standout.<\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>The Little Rock real estate community was rocked this week by the sudden disappearance of Beverly Carter, a Crye-Leike real estate agent who vanished immediately after showing a country home in nearby Scott, Ark. Police arrested a suspect (who had an extensive criminal record) and charged him with murder after Carter’s body was found. After [&hellip;]<\/p>\n","protected":false},"author":34,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[83],"tags":[23,592,593,495,56,594,452],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/41311"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/34"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=41311"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/41311\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=41311"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=41311"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=41311"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}