{"id":41471,"date":"2014-10-13T09:00:18","date_gmt":"2014-10-13T09:00:18","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=41471"},"modified":"2016-01-30T00:20:45","modified_gmt":"2016-01-30T00:20:45","slug":"conferences-conventions-and-local-organizations","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/conferences-conventions-and-local-organizations\/","title":{"rendered":"Conferences, Conventions and Local Organizations: Are They Worth Your Time?"},"content":{"rendered":"<p>Every year, there are more real estate industry conventions and conferences than any one agent can possibly attend. Then, there are the local networking events, such as chamber mixers and community events that can be used (subtly) to network. All of these events can quickly fill up a real estate agent’s calendar, so it’s important to decide which are worth your time, and let the other ones slide.<\/p>\n<p>So, how to decide? It’s all about the takeaways. Think carefully about what’s valuable to you, and figure out which events you’ll get the most out of. Here are some ideas to help you make the most of your time.<\/p>\n<h2>Industry Events<\/h2>\n<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-41491\" title=\"real estate conferences and conventions\" src=\"\/wp-content\/uploads\/2014\/10\/real-estate-conferences-and-conventions-300x200.jpg\" alt=\"Are local and industry conferences and conventions worth real estate agents time?\" width=\"300\" height=\"200\" \/>Although industry events such as conferences and conventions are fine for networking, especially if you specialize in relocation or are looking for referrals. They’re also ideal educational arenas. Deciding which ones to attend each year can be challenging. Ask yourself what part of your business needs the most attention. What area do you want to devote more time to in the coming year?<\/p>\n<p>Maybe you’d like to beef up your website, take on video marketing, or become more mobile-marketing savvy. Some workshops at conventions and conferences are highly specific and specialized. The upcoming National Association of Realtors® <a href=\"http:\/\/www.realtor.org\/convention.nsf\/\">Conference<\/a>, for instance, is offering a workshop on the use of drones in marketing.<\/p>\n<p>Marketing your real estate business is an ongoing task. If you’re feeling stuck, the takeaways from a <a href=\"http:\/\/www.hearitdirect.com\/events\/\">Hear it Direct<\/a> conference can be invaluable. These events allow agents to “hear the unfiltered voice of real estate consumers.” You’ll be amazed at the insights you will gain about buyers, sellers, Gen Y and other groups of clients as they speak their minds at these events. Events are held throughout the year, across the country. Use the takeaways to tweak your marketing efforts.<\/p>\n<p>If you feel the need to learn more about the use of technology in your business, and about the latest gadgets, there’s a workshop or conference for that. Need to hone your negotiating skills? There’s one for that too.<\/p>\n<p>Any event that advances your knowledge of the industry or amps up your efficiency is worth your time and money. An added bonus of attending industry events is that you’ll be able to share ideas and swap tips with other agents.<\/p>\n<h2>Community Events<\/h2>\n<p>Community events are used by agents more for networking than for education. Chamber mixers, civic club events, and even church socials are all ways to meet potential clients. Again, there are a seemingly endless number of community events, so you’ll need to decide which ones are the most important. That decision is a snap, if you follow issues you have passion for.<\/p>\n<p>If you love working with animals, join an animal rescue group or volunteer at the ASPCA. A local Habitat for Humanity group could be a great fit for a real estate agent. Even running for a seat on your homeowners association board will get you exposed to potential clients.<\/p>\n<p>Sometimes it helps to think of social issues that matter to you when deciding which group to join. Mothers Against Drunk Driving, a local breast cancer or AIDS agency, groups that work with underprivileged children or the homeless, for instance. Many agents become involved in civic groups such as the Lions Club, Jaycees, Rotary, Kiwanis or the Hispanic or Asian Chamber of Commerce.<\/p>\n<p>Any local event is potentially worth an agent’s time if it gets your name out to the community, or if it offers the opportunity to meet potential clients. Consider it part of your marketing efforts and actually schedule the time to attend these meetings and events.<\/p>\n<p align=\"center\">&#8212;<\/p>\n<p><strong>Readers: <\/strong>What real estate conventions and conferences are you looking forward to? Do you have any tips about which community organizations are best for networking?<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Every year, there are more real estate industry conventions and conferences than any one agent can possibly attend. Then, there are the local networking events, such as chamber mixers and community events that can be used (subtly) to network. All of these events can quickly fill up a real estate agent’s calendar, so it’s important [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[27],"tags":[23,210,409,410,148,281,56],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/41471"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=41471"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/41471\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=41471"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=41471"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=41471"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}