{"id":41651,"date":"2014-10-10T17:19:46","date_gmt":"2014-10-10T17:19:46","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=41651"},"modified":"2021-11-19T10:18:24","modified_gmt":"2021-11-19T18:18:24","slug":"this-week-in-real-estate-more-homeowners-tapping-equity-builders-in-some-markets-sweeten-deals","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/this-week-in-real-estate-more-homeowners-tapping-equity-builders-in-some-markets-sweeten-deals\/","title":{"rendered":"This Week in Real Estate: More Homeowners Tapping Equity; Builders in Some Markets Sweeten Deals"},"content":{"rendered":"<h2>More Homeowners Are Utilizing Home Equity<\/h2>\n<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-41681\" title=\"home equity real estate\" src=\"\/wp-content\/uploads\/2014\/10\/home-equity-real-estate-300x200.jpg\" alt=\"as home prices rise, homeowners are using their home equity to finance purchases and remodels\" width=\"300\" height=\"200\" \/>The housing bust, which triggered a recession and a massive nationwide dip in home equity, deprived many homeowners of tapping into their homes for cash.<\/p>\n<p>But, with home prices now rising, more homeowners are relying on their home’s equity to pay for remodeling, debt consolidation, or buying expensive items, <a href=\"http:\/\/money.cnn.com\/2014\/10\/07\/real_estate\/home-equity-loans\/index.html\">according to CNN<\/a>. Financial services company Experian and consulting firm Oliver Wyman said home equity lines of credit increased 27 percent during the year ended June 30.<\/p>\n<p>This is probably a sign that the housing market is on the mend. But just because there’s a bump in home equity lines of credit, that doesn’t mean that it’s the best option for a homeowner. Here are a few things for your clients to keep in mind before tapping into their homes for cash.<\/p>\n<h3>1. Mortgage Rates<\/h3>\n<p>Mortgage rates have been historically low for some time now. According to CoreLogic, nearly 9 million borrowers got 30-year fixed mortgages at or below 4 percent. But the sweet deals aren’t going to last forever. Rates are expected to rise soon. &#8220;We may be in for a more volatile period,&#8221; Keith Gumbinger of HSH.com, a mortgage information firm, told CNN. Next month, many of the Federal Reserve&#8217;s initiatives to keep rates low, are coming to an end, Gumbinger said.<\/p>\n<p>If borrowers locked into very low rates in the past couple of years, a home equity loan could save them more than refinancing the mortgage through a cash-out refinance, CNN said. If they decide to refinance now, they might end up paying a rate that’s as high as a percentage point more than the original loan. Keep in mind that they will have to pay that rate for the entire balance on their loan.<\/p>\n<p>&#8220;Somebody who has a 3.5 percent first mortgage is not going to do a cash-out refinance at 5.5 percent unless they absolutely have to,&#8221; Greg McBride, senior financial analyst for BankRate.com told CNN.<\/p>\n<h3>2. Borrowing Costs<\/h3>\n<p>The price borrowers will pay to get a home equity loan or line of credit (HELOC) is far cheaper than refinancing, CNN said. Many lenders will ask them to go through the underwriting process and they will have to come up with money associated with it, such as inspection and attorney review fees.<\/p>\n<p>They will also have to get a new title search and insurance. That itself could cost $1,000 or more. Tell your clients to factor in those costs and see if it makes sense in the long run.<\/p>\n<h3>3. Borrowing Time<\/h3>\n<p>Factor in the payment time and schedule. When borrowers make their first payment on the new loan it will be like starting over on a 30-year loan. But, if they choose a 15-year payment plan, it would cut down on the numbers of payments, but increase the amount due each month.<\/p>\n<h3>4. Determine What the Money Is For<\/h3>\n<p>The best reason for someone to take out a home equity loan is to have a positive impact on their financial situation, such as a renovation that would increase the home’s value in the long term, or to pay for a degree, which would increase earning power. It’s best not to unnecessarily dip into these loans for luxury spending, such as buying an expensive car or taking a costly vacation.<\/p>\n<h3>5. Tax Breaks<strong><\/strong><\/h3>\n<p>Like first mortgages, certain home equity loans and HELOCs are eligible for the home mortgage interest deduction, CNN said. Borrowers are eligible for deductions up to $100,000 of<strong> <\/strong>interest paid on a mortgage&#8217;s principal.<\/p>\n<h2>Builders Offer Incentives to Boost Home Sales<\/h2>\n<p>To lure in buyers, homebuilders in suburban Phoenix are offering incentives such as swimming pools, built in barbecues and subsidized mortgage rates, according to <a href=\"http:\/\/www.bloomberg.com\/news\/2014-10-07\/homebuilders-offer-freebies-as-booming-u-s-markets-cool.html\">Bloomberg<\/a>. In one community, a builder agreed to cover as much as $10,000 of a buyer’s closing costs, along with another incentive that the buyer chose.<\/p>\n<p>It’s not just a Phoenix phenomenon. Similar trends have been noted in areas from Sacramento, Calif., to Orlando, Fla. With home sales slowing down due to sticker shock and government regulations to slash the maximum size for mortgages with low down payments, builders are left with few options but to woo reluctant buyers with sweet deals. New home sales nationwide have been unstable. Prices dropped in June, then rose in July and August.<\/p>\n<p>“Phoenix is very slow, Sacramento is spotty,” John Burns, a housing consultant based in Irvine, Calif., told Bloomberg. “The investors came in and pushed prices a little too high. And then FHA rocked the new-home market really hard.”<\/p>\n","protected":false},"excerpt":{"rendered":"<p>More Homeowners Are Utilizing Home Equity The housing bust, which triggered a recession and a massive nationwide dip in home equity, deprived many homeowners of tapping into their homes for cash. But, with home prices now rising, more homeowners are relying on their home’s equity to pay for remodeling, debt consolidation, or buying expensive items, [&hellip;]<\/p>\n","protected":false},"author":35,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[466],"tags":[595,576,596,504,597,222,421,531],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/41651"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/35"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=41651"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/41651\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=41651"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=41651"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=41651"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}