{"id":42111,"date":"2014-10-22T09:00:21","date_gmt":"2014-10-22T09:00:21","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=42111"},"modified":"2021-11-30T11:25:53","modified_gmt":"2021-11-30T19:25:53","slug":"3-must-have-tech-tools-for-real-estate-agents","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/3-must-have-tech-tools-for-real-estate-agents\/","title":{"rendered":"3 Must-Have Tech Tools for Real Estate Agents"},"content":{"rendered":"<p>As a real estate agent, you should be spending time calling prospects, meeting with clients, and showing properties. You shouldn’t be spending a ton of time scouring the internet for cool tools, apps and gadgets to help you be more productive. That’s my job!<\/p>\n<p>Every so often, we’ll be checking back in with the latest tools and tech tips for successful and struggling real estate agents alike. Here are some fantastic recent innovations that can help you focus, stay on track, and make you look like an expert.<\/p>\n<h2>The Neighborhood Data Goldmine: Sitegeist<\/h2>\n<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-42131\" title=\"agent and consumers on tablets\" src=\"\/wp-content\/uploads\/2014\/10\/agent-and-consumers-on-tablets-2-276x300.jpg\" alt=\"Real estate agent and his buyer clients using a tablet\" width=\"276\" height=\"300\" \/>How many times have you been working in a new area – or even in your own – and gotten stumped by a question about the neighborhood? Hyperlocal data has historically been tricky to obtain, until recently.<\/p>\n<p>Sitegeist is a free smartphone app that provides important information about the area you’re standing in right now – facts that clients and prospects want to know. For example, a few taps and swipes on Sitegeist can tell you:<\/p>\n<ul>\n<li>Age distribution<\/li>\n<li>Commuting facts<\/li>\n<li>Historic weather data and record temperatures<\/li>\n<li>Great restaurants, hotspots and venues in the area<\/li>\n<li>Average rent<\/li>\n<li>Political contributions, by party affiliation – for those who want to know just how red or blue their neighbors are<\/li>\n<\/ul>\n<h2>Perfect Your Open Houses With Open Home Pro<\/h2>\n<p>From the folks at HomeFinder.com, <a href=\"https:\/\/www.openhomepro.com\/\">Open Home Pro<\/a> is a free tablet app that helps agents more effectively and elegantly capture contact info at open houses. The app was originally developed for iPads in 2010, and was quite well received, and this summer the company released a version for Android tablets as well.<\/p>\n<p>Open Home Pro gives agents the opportunity to:<\/p>\n<ul>\n<li><strong>Collect and convert qualified leads. <\/strong>Open Home Pro tells agents whether shoppers are represented by an agent, whether they are pre-approved for a mortgage, and which leads are highly interested.<\/li>\n<li><strong>Follow up by email automatically. <\/strong>Even as you’re showing a property, the program is sending an email to the prospective buyer with property details and <em>your<\/em> contact information.<\/li>\n<li><strong>Send notifications of changes. <\/strong>If the price on the house changes, everyone who signed in via Open Home Pro will receive an automatic notification.<\/li>\n<li><strong>Easy follow up. <\/strong>The system will send agents an email detailing the newly captured prospects, including their prequalified status and level of interest, prompting easy follow up. This saves agents valuable time sitting at their desks scratching their heads, wondering who to call!<\/li>\n<li><strong>Streamlined listing and advertising. <\/strong>Once you’re in the system, and you’ve added the property’s address and other basic information, promoting the open house is a snap. One click posts the open house on your social media platforms, saving time and boosting traffic.<\/li>\n<\/ul>\n<h2>For Working on the Go, Try the Dell Venue Tablet<\/h2>\n<p>Looking for a tablet designed to meet the needs of busy road-warrior real estate agents? The Dell Venue tablet provides a great alternative to an iPad, with an attractive price tag. It comes in two sizes, an 11-inch or 8-inch screen.<\/p>\n<p>Consulting firm Prowess Consulting recently looked at how real estate agents spend time and use (or misuse) technology. They wrote a white paper on the subject, commissioned by Intel, which makes processors for the Dell tablets. Here’s what they found:<\/p>\n<ul>\n<li>Agents need intuitive file management that is optimized to work seamlessly with a cloud software program.<\/li>\n<li>Photo editing needs to be easy and streamlined.<\/li>\n<li>The tablet needs to support virtual tours. Images should be fully visible and not obstructed by other elements on the screen.<\/li>\n<li>Easy support for digital signatures.<\/li>\n<li>Speed when using mapping applications.<\/li>\n<li>Local storage – so you can store and show property information without an Internet connection.<\/li>\n<\/ul>\n<p>The report, though written in favor of the Dell tablet since it was paid for by Intel, finds that the Dell Venue offers some great benefits to users for selected real estate agent activities. For example, the Venue provides simple and powerful photo editing and tweaking capabilities – making it easy for agents to take photos of a house and then do some photo processing, fine-tuning and uploading right from the front seat of a car.<\/p>\n<p>All systems involve tradeoffs. You can also make changes to soup up an iPad. But that takes time, probably better spent prospecting and selling. Consider the Dell Venue 8 for your next tablet purchase, as it offers great features for agents, right out of the box.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>As a real estate agent, you should be spending time calling prospects, meeting with clients, and showing properties. You shouldn’t be spending a ton of time scouring the internet for cool tools, apps and gadgets to help you be more productive. That’s my job! Every so often, we’ll be checking back in with the latest [&hellip;]<\/p>\n","protected":false},"author":34,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[83],"tags":[23,462,372,56,379,603,417,276],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/42111"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/34"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=42111"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/42111\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=42111"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=42111"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=42111"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}