{"id":42421,"date":"2014-10-27T09:00:27","date_gmt":"2014-10-27T09:00:27","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=42421"},"modified":"2021-11-22T12:10:42","modified_gmt":"2021-11-22T20:10:42","slug":"3-key-spaces-listing-agents-dont-talk-about","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/3-key-spaces-listing-agents-dont-talk-about\/","title":{"rendered":"3 Key Spaces Listing Agents Don’t Talk About"},"content":{"rendered":"<p>Let’s face it: Many real estate agents aren’t exactly marketing whizzes. From fuzzy photos to typos and grammatical errors in their listing descriptions, agents can do their businesses a disservice by trying to wear too many hats.<\/p>\n<p>These problems are understandable – after all, there are no writing, photography or marketing courses in real estate school.<\/p>\n<p>What isn’t understandable, and can often be intolerable, is that so many agents don’t seem to recognize what buyers want in a home, and this is reflected in their MLS photos and listing descriptions.<\/p>\n<p>Yes, kitchens and bathrooms sell homes. Yet you aren’t doing your client any favors when 98 percent of the photos and descriptions concentrate on just these two rooms. Let’s take a look at three areas of a home that agents often fail to give little more than a cursory mention in MLS listings and property marketing materials.<\/p>\n<h2>1. The Backyard<\/h2>\n<p><img loading=\"lazy\" src=\"\/wp-content\/uploads\/2014\/10\/pristine-beautiful-backyard-300x200.jpg\" alt=\"home buyers care about backyards yet agents frequently don&#039;t address them in listing descriptions\" title=\"pristine beautiful backyard\" width=\"300\" height=\"200\" class=\"alignright size-medium wp-image-42451\" \/>What is it with agents ignoring a listing’s backyard? Consider this: Why does a buyer choose a single-family home over a condo or townhouse? One of the big reasons, as you most likely understand, is for the outdoor space that a single-family home provides.<\/p>\n<p>Studies show that all homebuyers, from those purchasing new construction to luxury homebuyers, want useable outdoor space. When you council your sellers on how to stage the inside of the home, don’t neglect to suggest that they also stage the outside.<\/p>\n<p>Sure, it may take more work to get the backyard in market-ready condition, but a homeowner that is motivated to make top dollar on the sale will take your advice. After weeding and sprucing up the landscaping, suggest that the homeowner consider adding trees, a fence (if the yard isn’t fenced in) and additional exterior lighting.<\/p>\n<p>Staging the yard is the easiest part of the process, and how it’s done depends on the lifestyle that the home represents. A luxury homeowner may want to strive for an oasis-type backyard with water features and a fire pit, according to a survey conducted by Better Homes and Gardens Real Estate. Homeowners in a family-oriented neighborhood could highlight how great backyard barbecues are at the home.<\/p>\n<p>When the outdoor space is set and the home is ready for the market, your marketing photos and listing descriptions should be compelling convey how awesome the yard is.<\/p>\n<h2>2. Storage Spaces<\/h2>\n<p>If you work with a lot of buyers, you probably understand how important storage space is for them – especially for first-timers who’ve been living in an apartment while many of their belongings sit in a self-storage facility.<\/p>\n<p>“Storage” doesn’t only refer to one big area where homeowners can throw all their stuff. Storage can mean a pantry that is large enough to not only hold food, but kitchen items as well. It includes an oversized linen closet, a walk-in bedroom closet, and racks and shelves in the garage.<\/p>\n<p>If a home has any of these features, they should be described and photographed for the MLS listing. Nobody says you can’t leave the pantry door open when you photograph the kitchen. Throw it open! Walk inside and take photos.<\/p>\n<p>Mention these spaces prominently in your description. Make those storage-hungry buyers salivate over your listing.<\/p>\n<h2>3. The Garage<\/h2>\n<p><img loading=\"lazy\" src=\"\/wp-content\/uploads\/2014\/10\/clean-clutter-free-garage-300x200.jpg\" alt=\"home buyers care about garages yet sellers typically don't keep them clean and clutter-free\" title=\"clean clutter-free garage\" width=\"300\" height=\"200\" class=\"alignright size-medium wp-image-42441\" \/>It’s a rare listing that includes mention of a garage, other than how many cars it holds. Seriously though, is car storage the only use for a garage? Of course not. Americans use their garages as hobby rooms, offices, play rooms, storage areas and more.<\/p>\n<p>I have a feeling the reason many listings <em>don’t<\/em> include garage photos is <em>because<\/em> they’re used for so many things, and thus, are cluttered and not very photogenic. Clutter can be remedied, however, and it’s up to you as the listing agent to suggest that the homeowner stage the garage.<\/p>\n<p>Why? Because garages also sell homes. Most new homebuyers want a two-car garage, according to a recent <a href=\"https:\/\/www.nahb.org\/\">National Association of Homebuilders<\/a> survey.<\/p>\n<p>In a <a href=\"https:\/\/www.sparefoot.com\/self-storage\/blog\/5599-cluttered-garage\/\">survey of real estate agents<\/a> taken last year, four out of five of them said that a messy garage puts off buyers. More than 75 percent of agents and brokers surveyed said that the garage should be as presentable as any interior space of the home. Finally, most agreed that an organized garage reflects the homeowner’s pride in the home.<\/p>\n<p>Stage the garage the same way you would stage the interior of the home. Clean, de-clutter, paint and organize. Highlight storage features, such as built-ins and racks. “You want to have cubic storage to put the bins away, and then have the ability to hang bikes and ladders. That gets things off the floor,” Jaime Dietenhofer, president of Garage Envy, told the <a href=\"https:\/\/www.nytimes.com\/2014\/01\/02\/garden\/does-the-garage-interior-matter-to-home-buyers.html?_r=0\">New York Times<\/a>.<\/p>\n<p>If you can convince the homeowner to de-clutter and clean the garage, you’ll have another highly desirable home feature to brag about in your listing descriptions.<\/p>\n<p>When writing your marketing materials and photographing listings, keep in mind that buyers plan on doing a lot more than showering and cooking in their new home. While kitchens and bathrooms are certainly hot buttons, these other key parts of the home can be equally as appealing – and equally as important to shine a light on.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Let’s face it: Many real estate agents aren’t exactly marketing whizzes. From fuzzy photos to typos and grammatical errors in their listing descriptions, agents can do their businesses a disservice by trying to wear too many hats. These problems are understandable – after all, there are no writing, photography or marketing courses in real estate [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[83],"tags":[604,605,606,607,608,609,610],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/42421"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=42421"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/42421\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=42421"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=42421"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=42421"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}