{"id":42851,"date":"2014-10-29T02:16:34","date_gmt":"2014-10-29T02:16:34","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=42851"},"modified":"2021-11-29T15:50:17","modified_gmt":"2021-11-29T23:50:17","slug":"tell-prospective-buyers-owning-is-38-percent-cheaper-than-renting","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/tell-prospective-buyers-owning-is-38-percent-cheaper-than-renting\/","title":{"rendered":"Tell Prospective Buyers: Owning Is 38 Percent Cheaper Than Renting"},"content":{"rendered":"<p>Markets go up; markets go down. But when all is said and done, when the fat lady has sung, and it’s all over save for probate lawyers picking over the remains, it is better to be an owner than a renter.<\/p>\n<p><img loading=\"lazy\" src=\"\/wp-content\/uploads\/2014\/10\/buying-vs-renting-300x200.jpg\" alt=\"tell buyer prospects that buying is still less expensive than renting\" title=\"renting vs. buying\" width=\"300\" height=\"200\" class=\"alignright size-medium wp-image-42911\" \/>While this isn’t exactly counterintuitive, the numbers show that the long-term benefits of owning win out over time. That’s the latest word from Trulia&#8217;s chief economist, Jed Kolko, whose intrepid team of number crunchers just released their <a href=\"https:\/\/www.trulia.com\/research\/\">quarterly cost of renting vs. ownership findings.<\/a><\/p>\n<p>When the costs of borrowing are low, the difference isn’t even close. Owning, in the long run, is a walloping 38 percent cheaper than renting nationwide.<\/p>\n<p>This could explain why some big hedge funds have been eager to back up the truck and dump cash into the housing market in recent years, buying up hundreds of homes at a time. With a 38 percent pretax profit margin baked into the cake, they’d be crazy not to – and it may have made sense for them to borrow at advantageous interest rates to be able to buy more. This isn’t dumb money we’re talking about. This is smart, institutional money, managed by professionals. If the big sharks are feeding, it’s not because there’s no blood in the water.<\/p>\n<p>Here are the specifics:<\/p>\n<ul>\n<li>Buying beats renting in all 100 of the largest metro areas studied. In 99 of them, the difference was at least 20 percent. The one outlier was Honolulu, where buying was only 17 percent cheaper than renting. Still not bad.<\/li>\n<\/ul>\n<ul>\n<li>Mortgage rates would have to rise to 6 percent or more to make buying cheaper than renting in Honolulu. The 30-year fixed mortgage rate hasn’t been that high since 2008.<\/li>\n<\/ul>\n<ul>\n<li>Detroit is a steal by this measure. It’s 63 percent cheaper to own than to rent in that troubled city.<\/li>\n<\/ul>\n<ul>\n<li>The case for ownership over renting is strongest in Southern and Midwestern states. Owners had less of an advantage in California and New York.<\/li>\n<\/ul>\n<ul>\n<li>On average, mortgage rates would have to hit 8.9 percent for the costs of ownership to catch up with renting.<\/li>\n<\/ul>\n<h2>Where Buying Makes the Most and Least Sense<\/h2>\n<p>The cities with the biggest advantage to owners, in terms of the spread between ownership and renting costs, are as follows:<\/p>\n<ol>\n<li>Detroit, MI &#8211; 63%<\/li>\n<li>Gary, IN &#8211; 61%<\/li>\n<li>Akron, OH &#8211; 58%<\/li>\n<li>Toledo, OH &#8211; 58%<\/li>\n<li>Cleveland, OH &#8211; 58%<\/li>\n<li>Kansas City, MO-KS &#8211; 55%<\/li>\n<li>Memphis, TN-MS-AR &#8211; 54%<\/li>\n<li>Grand Rapids, MI &#8211; 54%<\/li>\n<li>New Orleans, LA &#8211; 54%<\/li>\n<li>Birmingham, AL &#8211; 54%<\/li>\n<\/ol>\n<p>The ten markets where the margin between the costs of ownership and renting were narrowest are as follows:<\/p>\n<ol>\n<li>Honolulu, HI &#8211; 17%<\/li>\n<li>Orange County, CA &#8211; 22%<\/li>\n<li>San Jose, CA &#8211; 23%<\/li>\n<li>New York, NY-NJ &#8211; 24%<\/li>\n<li>San Francisco, CA &#8211; 25%<\/li>\n<li>Los Angeles, CA &#8211; 26%<\/li>\n<li>San Diego, CA &#8211; 26%<\/li>\n<li>Sacramento, CA &#8211; 26%<\/li>\n<li>Ventura County, CA &#8211; 28%<\/li>\n<li>Austin, TX &#8211; 30%<\/li>\n<\/ol>\n<h2>A Look at the Methodology<\/h2>\n<p>In calculating these numbers, the Trulia researchers used the following assumptions: Owners put down 20 percent in cash and financed the rest via a 30-year mortgage at the prevailing average rate of 4.3 percent. The model also assumed tax deductions of 25 percent (which I am not quite sold on).<\/p>\n<p>Obviously, these figures wouldn’t represent the results a real estate investor would get, because investors don’t get the benefit of subsidized loan programs like the FHA and VA loans. And they generally have to pay higher interest rates.<\/p>\n<p>Trulia found the best results for homeowners went to those who financed using a 15-year mortgage, rather than a 30-year mortgage – beating even the all-cash buyer. Trulia credits the higher fraction of payments going to pay down the principal and the faster buildup of equity.<\/p>\n<p>A theoretical owner who bought with a 3.5 percent down payment using a FHA loan did not fare as well. In fact, by their calculations, it was actually more expensive to own in Honolulu with a 3.5 percent down, 30-year mortgage, than it was to rent. This goes to show: Costs of carry <em>count.<\/em><\/p>\n<p>A bit more on the methodology: The researchers assumed a 3.5 percent rate of return on capital that is not invested in property. In other words, they value the “opportunity cost” at 3.5 percent. This is the theoretical number an investor can expect to get on whatever he doesn’t tie up in home equity. If you think you can do better, then your opportunity costs increase, and that means it is more expensive to pay down a mortgage. But be careful: The market battlefields are littered with the corpses of investors who thought they could do better than the risk-free rate – much less double it.<\/p>\n<p>Maintenance and other ownership costs were calculated as follows: Annual renovation and maintenance costs were assumed to be 1 percent of the home’s value.  Annual insurance costs were set at 0.46 percent of the home’s value. Monthly utilities were set at $100\/month in excess of what renters typically pay, and property taxes at the average metro property tax rate.<\/p>\n<h2>Boiling It Down for Buyers<\/h2>\n<p>Want to see how the numbers work in your area, or break them down for buyers? Trulia has a couple of interactive tools to help you do just that. Spend some time looking at the <a href=\"https:\/\/www.trulia.com\/research\/\">Rent vs. Buy interactive map<\/a> and the <a href=\"https:\/\/www.trulia.com\/blog\/tech\/rent-vs-buy\/>Rent or Buy Calculator.<\/a><\/p>\n<p>The true costs of ownership may well be somewhat higher than what is represented here. For example, I haven’t met an owner who regretted setting aside more than 1 percent of their home’s value per year for repairs and renovations, in the long run.<\/p>\n<p>But if you’re looking for some data to help you move a prospective buyer into the owner column, this is a great resource – especially if you can get your prospect to play with the tools themselves! It’s one thing to hear it from you – it’s another when they are punching in the data on their own.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Markets go up; markets go down. But when all is said and done, when the fat lady has sung, and it’s all over save for probate lawyers picking over the remains, it is better to be an owner than a renter. While this isn’t exactly counterintuitive, the numbers show that the long-term benefits of owning [&hellip;]<\/p>\n","protected":false},"author":34,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[83],"tags":[254,611,612,613,422],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/42851"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/34"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=42851"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/42851\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=42851"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=42851"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=42851"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}