{"id":42981,"date":"2014-11-03T09:00:19","date_gmt":"2014-11-03T09:00:19","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=42981"},"modified":"2016-02-03T21:31:00","modified_gmt":"2016-02-03T21:31:00","slug":"the-dos-and-donts-of-listing-presentations","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/the-dos-and-donts-of-listing-presentations\/","title":{"rendered":"The Dos and Don’ts of Listing Presentations"},"content":{"rendered":"<p><img loading=\"lazy\" class=\" wp-image-43001 alignright\" title=\"listing presentation tips\" src=\"\/wp-content\/uploads\/2014\/10\/listing-presentation.jpg\" alt=\"what real estate agents should and should not do for their listing presentations\" width=\"225\" height=\"264\" \/>I don’t know about you, but listing presentations make me nervous. My palms sweat, my heart races, and if I were a nail-biter, I probably wouldn’t have any left. You’d think that after a few successes agents would lose the listing presentation jitters, but for some of us, they never abate.<\/p>\n<p>Some older coaches will tell you this is the reason you need scripts and dialogs. But, unless you’ve had theatrical training, scripts and dialogs typically come off sounding canned and unprofessional.<\/p>\n<p>What you need is preparation. Being fully, 100-percent prepared for a presentation is the only way to feel confident that you can not only swing it, but that you’ll crush the competition.<\/p>\n<p>While I know that you don’t need a complete walk-through on how to prepare for a listing presentation, I’d like you to consider a few dos and don’ts.<\/p>\n<h2>1. Do the Basics<\/h2>\n<ul>\n<li>Dress the part. This doesn’t mean you need to wear a suit to every listing presentation. In fact, you’ll feel pretty silly if you do and your potential clients are selling a ranch. Wear something similar to what you assume these folks will be wearing. Just as you’d most likely wear clean jeans and boots to a ranch listing, wear a pair of nice slacks or a skirt, and a casual yet stylish shirt when you visit a tract home.<\/li>\n<li>Make one last call to the homeowners to ensure that all parties will be present. If the wife also needs to sign the listing agreement, it’s a waste of time to show up if she won’t be there.<\/li>\n<li>Arrive on time. Yeah, I know this one’s pretty basic, but you’d be surprised how many agents are chronically late – even for this important job interview.<\/li>\n<li>Turn off your cell phone. Please. Turn. It. Off.<\/li>\n<\/ul>\n<h2>2. Don’t Procrastinate<\/h2>\n<p>Don’t wait until the last minute to prepare your presentation. That’s a recipe for disaster. Give yourself time to ensure that all your figures are correct, that your presentation is professional, and that it shows off your marketing acumen so well that potential clients wouldn’t dream of listing with anyone else.<\/p>\n<h2>3. Don’t Be Vanilla<\/h2>\n<p>As you prepare your listing presentation, remember that each seller is different and each home is different – especially to the homeowner.<\/p>\n<p>Everything in your presentation should be customized to this particular seller and this particular home. Leave the generics to the agents you’re competing against. Don’t skimp on colors, graphics and quality photos. Show – don’t tell – the sellers that you are the consummate marketer. Make them lust after your sample marketing plan.<\/p>\n<p>The materials you leave the seller should be concise but attention-grabbing, and so valuable they’d never dare to throw them away.<\/p>\n<h2>4. Do Take Notes<\/h2>\n<p>Even if you’re just faking it, have a notepad or iPad in front of you and take notes on everything the seller says that you feel is important to him or her.<\/p>\n<p>Nothing beats a rapt audience when someone is trying to relay important information, and taking notes on what’s being said makes you appear completely absorbed.<\/p>\n<h2>5. Do Always Assume the Close<\/h2>\n<p>Sometimes, the most challenging part of the listing presentation is deciding when to assume the close. At times, it seems that the opportunity will never present itself. But it will – even if it’s as you’re walking out the door.<\/p>\n<ul>\n<li>Would you like some tips on how to prepare your home for the market, or do you want to sell it as-is?<\/li>\n<li>Do you want me to hold an open house, just a broker’s open, or both?<\/li>\n<li>Would you like a flyer box on the yard sign, or just the sign?<\/li>\n<\/ul>\n<p>All of these questions assume that you’ll be listing the home. They assume the close. Before he or she knows it, the seller will be answering your questions, and also assuming you’ll be listing the home.<\/p>\n<h2>6. Don’t Forget the Paperwork<\/h2>\n<p>Yup, I’ve done it. And I’ll bet you know somebody else who has too. You are going to get the listing, so not only bring the paperwork with you, have it filled out as well.<\/p>\n<p>Although we don’t expect these tips to beat the Xanax that may be required to overcome the listing presentation jitters, they <em>will<\/em> help you to prepare, and preparation is one thing that <em>does <\/em>instill calm. When you’re ready, and you know it, you’ll be unbeatable.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>I don’t know about you, but listing presentations make me nervous. My palms sweat, my heart races, and if I were a nail-biter, I probably wouldn’t have any left. You’d think that after a few successes agents would lose the listing presentation jitters, but for some of us, they never abate. Some older coaches will [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[36],"tags":[124,499,240,614,615,616,263,452],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/42981"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=42981"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/42981\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=42981"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=42981"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=42981"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}