{"id":43191,"date":"2014-11-05T19:10:15","date_gmt":"2014-11-05T19:10:15","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=43191"},"modified":"2016-01-29T00:51:05","modified_gmt":"2016-01-29T00:51:05","slug":"10-signs-youre-married-to-a-real-estate-agent","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/10-signs-youre-married-to-a-real-estate-agent\/","title":{"rendered":"10 Signs You’re Married to a Real Estate Agent"},"content":{"rendered":"<p><em>I can’t quite place my finger on it, but I’m having suspicions that my husband is secretly pursuing a real estate career. Am I being crazy? – Befuddled in Boise<\/em><\/p>\n<p>We get this question – and others along the same lines – all the time. It’s time we address the issue of real estate agents in our communities head on.<\/p>\n<h2>How to Identify a Real Estate Agent<\/h2>\n<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-43221\" title=\"real estate agent couple\" src=\"\/wp-content\/uploads\/2014\/11\/married-to-a-real-estate-agent-300x225.jpg\" alt=\"How you know you're married to a real estate agent\" width=\"300\" height=\"225\" \/>Real estate agents are all around you. They are your neighbors, your cousins, your brothers and sisters. Chances are good that a real estate agent sold you your house or manages your apartment complex. According to the Bureau of Labor Statistics, at any given time, there are <a href=\"http:\/\/www.bls.gov\/ooh\/sales\/real-estate-brokers-and-sales-agents.htm\">422,000 real estate agents living among us<\/a>. Their kids go to school with your kids. They may be sitting next to you at a football game. A few of them are even able to keep up the appearance of normalcy.<\/p>\n<p>Scientists aren’t sure where real estate agents come from, though most are easy to spot. They send signals to each other by wearing small tokens of real estate agentism called “nametags” on their coats. These tokens not only communicate to potential clients what to call them, but with other signifiers, such as distinctively-colored overcoats, may indicate tribal affiliation and status – much in the same way a silverback indicates the status of a gorilla.<\/p>\n<p>Some agents do not operate openly, however. Instead, they maintain “day jobs” during the week while sneaking off to “networking functions” at night, under the cover of darkness, and to “open houses” on the weekends, where they engage in elaborate rituals in an effort to find clients, listings and other like-minded people.<\/p>\n<h2>10 Signs Your Spouse Is an Agent<\/h2>\n<p>Could you be married to a real estate agent? Here are the top ten signs you have a real estate agent in the home.<\/p>\n<p><strong>1. <\/strong>Dinner dates start with “What are you looking for in a restaurant today?”<\/p>\n<p><strong>2. <\/strong>Hoarding strange business cards.<\/p>\n<p><strong>3. <\/strong>Unexplained signage piling up in the garage – and, very rarely, at locations your spouse may refer to as “listings.”<\/p>\n<p><strong>4. <\/strong>Frequent evening absences at “networking events,” “Toastmasters,” the “Rotary Club”, and with other associations.<\/p>\n<p><strong>5. <\/strong>The suspected party returns all voicemails except for yours.<\/p>\n<p><strong>6. <\/strong>Continually using “showings” and “open houses” as an excuse to avoid weekend chores.<\/p>\n<p><strong>7. <\/strong>Unexplained cheesy glam photos.<\/p>\n<p><strong>8. <\/strong>You own a car your children are not allowed to ride in.<\/p>\n<p><strong>9. <\/strong>There are six gold blazers in the closet and he still can’t figure out what to wear.<\/p>\n<p><strong>10.<\/strong> Describes your family to complete strangers as &#8220;a four bedroom in a neighborhood with great schools and outstanding curb appeal.&#8221;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>I can’t quite place my finger on it, but I’m having suspicions that my husband is secretly pursuing a real estate career. Am I being crazy? – Befuddled in Boise We get this question – and others along the same lines – all the time. It’s time we address the issue of real estate agents [&hellip;]<\/p>\n","protected":false},"author":34,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[83],"tags":[190,435,117,492,56,617],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/43191"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/34"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=43191"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/43191\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=43191"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=43191"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=43191"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}