{"id":43331,"date":"2014-11-12T09:00:43","date_gmt":"2014-11-12T09:00:43","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=43331"},"modified":"2022-10-03T14:39:18","modified_gmt":"2022-10-03T21:39:18","slug":"3-real-estate-tropes-that-need-to-go-away","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/3-real-estate-tropes-that-need-to-go-away\/","title":{"rendered":"3 Real Estate Tropes That Need to Go Away"},"content":{"rendered":"<p>Real estate agents can display some lemming-esque qualities at times. I know because I used to be one. As soon as one agent does something that proves to be even quasi-successful, it’s rapidly copied until nearly everyone is doing it, and no one can quite remember why.<\/p>\n<p>Take selfie video blogs from the car for instance, invented by agent <a href=\"https:\/\/www.youtube.com\/user\/thecarolinasfinest\">Jessica Riffle Edwards<\/a>. These videos quickly became widely popular, and as more agents learned about them, they copied her.<\/p>\n<p>Today, dash cam videos are all over the Internet, produced by thousands of agents. The practice has become so abundant, in fact, that there’s a Tumblr page devoted to it called <a href=\"https:\/\/realestateagentsincars.tumblr.com\/\">“Real Estate Agents in Cars.”<\/a> These videos are no longer unique, so they are really no longer interesting – and quite the contrary, consumers are even laughing at them.<\/p>\n<p>What other practices do masses of agents adhere to without really understanding why or what, if any, benefit they provide? Sadly, many agents don’t seem to understand that a lot of times these fads may actually <em>harm<\/em> their business.<\/p>\n<p>Here are more three examples of real estate tropes that need to go away – for both agents’ and the industry’s sake.<\/p>\n<h2>1. Tired Taglines<\/h2>\n<p><img loading=\"lazy\" class=\"alignright size-thumbnail wp-image-43441\" title=\"cheesy real estate slogan\" src=\"\/wp-content\/uploads\/2014\/11\/cheesy-real-estate-slogan-2-150x105.png\" alt=\"real estate slogans and taglines agents should use\" width=\"150\" height=\"105\" \/><\/p>\n<p>Some agents call them taglines while others refer to them as slogans. Many consumers call them “cheesy.” For an industry that tries so desperately to gain respect and lose the “used car salesperson” stigma, it’s amazing that it still tenaciously clings to something that, if not done right, is smarmy.<\/p>\n<p>Take a look at your tagline: What does it do for your business? Does it motivate anyone to use your services? Does it differentiate you from the competition? Perhaps you think it captures people’s attention or encapsulates your business philosophy.<\/p>\n<p>Those are the only reasons to use a tagline and if yours doesn’t fit one of the above criteria, it is doing the opposite of each. Plus, like closing gifts, it’s something only real estate agents do. Tell me the last time you saw an accountant’s business card that contained a tagline. Does your doctor use a tagline? Your hairdresser? Somehow I don’t think “I Love to Do Taxes” or “Your Surgeon for Life” would cut it.<\/p>\n<p>From silly taglines that make no sense other than that they play off an agent’s name to the overused “Everything I Touch Turns to SOLD” or “A REALTOR you Can Trust” or “I Love to Sell Real Estate” – can we agree, please, that it’s time to dump the taglines?<\/p>\n<h2>2. Cheesy Agent Photos<\/h2>\n<p><img loading=\"lazy\" class=\"alignright wp-image-43351 size-medium\" title=\"cheesy real estate photos\" src=\"\/wp-content\/uploads\/2014\/11\/cheesy-real-estate-photos-239x300.jpg\" alt=\"An example of a cheesy real estate agent photo.\" width=\"239\" height=\"300\" \/><\/p>\n<p>The agent photo on a business card is such a tradition that, at this point, it is useless to debate whether or not it’s effective.<\/p>\n<p>The best commentary on the topic, however, has to be <a href=\"https:\/\/www.theonion.com\/i-wasnt-going-to-buy-this-house-until-i-saw-the-realtor-1819584626\">this story from The Onion<\/a>, the satirical news outlet, titled “I Wasn&#8217;t Going To Buy This House Until I Saw The Realtor&#8217;s Headshot On The Sign.”<\/p>\n<p>And while it’s useless to argue with agents who insist that their photo is the end-all, be-all when it comes to being recognized around town, the photo that they choose <em>is<\/em> debatable – and sometimes the source of ridicule from the general public.<\/p>\n<p>Let’s start with the awful headshot. Try this little experiment: Search online for “cheesy real estate agent photos.” Google returned more than 360,000 results, and just those on the first page will tell you how most people feel about your photos. There is even a Tumblr entitled “<a href=\"https:\/\/estateagents.tumblr.com\/\">Real Estate Agent Headshots<\/a>” that is so real it hurts.<\/p>\n<p><img loading=\"lazy\" class=\"alignright wp-image-43361 size-medium\" title=\"cheesy real estate photos 2\" src=\"\/wp-content\/uploads\/2014\/11\/cheesy-real-estate-photos-2-210x300.jpg\" alt=\"An example of a cheesy real estate agent photo.\" width=\"210\" height=\"300\" \/>If you simply must use a photo on your business card, here are a few tips:<\/p>\n<ul>\n<li>Use a professional photographer to get a professional-looking photo. You may think you look just too cute in that photo snapped at a nightclub, but it’s not suitable for your professional identity. Nor are selfies.<\/li>\n<li>Update your photo at least once a decade – sooner, preferably.<\/li>\n<li>Consider your brand and how you want to come across. There’s nothing wrong with a photo that shows you as humorous, creative, trendy, hip or even serious, as long as it fits your branding and the clients you hope to attract.<\/li>\n<li>Wear something appropriate for a business photo. This doesn’t mean you need to wear a suit if you usually don’t. Cleavage is inappropriate. Gauges in your ears are inappropriate (Yes, there is a headshot in which a 40-something agent not only has gauges, but spiked hair as well). Just use common sense.<\/li>\n<li>Ditch the props. Dogs, kids, telephones, real estate signs – just don’t go there.<\/li>\n<li>Don’t overuse Photoshop. If you’re using your photo to be recognizable, air brushing until you no longer look like yourself is just silly.<\/li>\n<li>Don’t pose. Relax and smile instead.<\/li>\n<\/ul>\n<h2>3. Terrible Listing Photos<\/h2>\n<p><img loading=\"lazy\" class=\"alignleft wp-image-39291 size-medium\" title=\"awful real estate photography\" src=\"\/wp-content\/uploads\/2014\/09\/awful-real-estate-photography-300x223.png\" alt=\"Using a low-quality camera will result in terrible real estate listing photos\" width=\"300\" height=\"223\" \/>Since we’re on the subject of photos, isn’t it time to get rid of <a href=\"\/blog\/lessons-from-the-worst-real-estate-photographers\/\">awful listing photos<\/a>? The trend is perpetuated by a small minority of agents who give a bad name to the profession.<\/p>\n<p>I’m referring to blurry photos, sideways photos, and photos that make viewers scratch their heads and ask “Why on earth would someone take a photo of that?” or worse, “What <em>IS<\/em> that?”<\/p>\n<p>Based on the median sales price, the median commission per transaction is a little over $5,600. There is simply no excuse for lousy listing photos when people will be paying you this amount to market and sell their homes. Get out your wallet and pay for a professional photographer if you aren’t good at it.<\/p>\n<p>The sad truth is, real estate agents have a crummy reputation, right up there with used car salespersons. A few bad actors are responsible for creating this perception, yet the entire industry is tainted by it. And unfortunately, some of the stuff agents create to legitimize themselves actually shows very little imagination, and just digs the hole deeper<\/p>\n<p>It’s a combination of knowledge, charisma and excellent customer service that will bring you clients and referrals from these clients. All the gimmicks in the world won’t change that.<\/p>\n<p><strong>Agents: What real estate cliches would you like to get rid of?<\/strong><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Real estate agents can display some lemming-esque qualities at times. I know because I used to be one. As soon as one agent does something that proves to be even quasi-successful, it’s rapidly copied until nearly everyone is doing it, and no one can quite remember why. Take selfie video blogs from the car for [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":43351,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[83],"tags":[618,23,619,56,620,621,622,474],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/43331"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=43331"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/43331\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=43331"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=43331"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=43331"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}