{"id":43861,"date":"2014-11-19T21:02:46","date_gmt":"2014-11-19T21:02:46","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=43861"},"modified":"2021-11-16T15:55:09","modified_gmt":"2021-11-16T23:55:09","slug":"7-year-end-tax-tips-for-real-estate-agents","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/7-year-end-tax-tips-for-real-estate-agents\/","title":{"rendered":"7 Year-End Tax Tips for Real Estate Agents"},"content":{"rendered":"<p>Starting about February, the financial media will be going gangbusters publishing ideas for tax deductions. That’s too late, though, for a lot of things. To take full advantage of tax planning opportunities, you need to take some steps now – prior to December 31<sup>st<\/sup> – to claim a deduction on your tax return when filing time comes in April. Or August. Or October. Whatever.<\/p>\n<h2>1. Buy Software<\/h2>\n<p><img loading=\"lazy\" src=\"\/wp-content\/uploads\/2014\/11\/tax-tips-for-agents.jpg\" alt=\"Year-End Tax Tips for Real Estate Agents\" title=\"tax tips for agents\" width=\"250\" height=\"203\" class=\"alignright size-full wp-image-43911\" \/>Admittedly, Trulia’s a company that sells software, so we’re not exactly a dispassionate observer. But you should know that software you buy for the purpose of running your real estate business is not only depreciable, it’s tax deductible in the first year, under <a href=\"https:\/\/www.section179.org\/section_179_and_software\/\">Section 179 of the Internal Revenue Code<\/a>.<\/p>\n<p>While the cost of custom-made software has to be depreciated over 36 months, Section 179 allows you to deduct the entire cost of off-the-shelf software, such as <a href=\"\/products\/professional-for-agents\/\">Market Leader’s Professional<\/a>, in the first year.<\/p>\n<p>So, if you’ve been putting off investment in software you need to make sooner or later, now’s the time to pull the trigger – before the year’s end. You need to place the software into service this year, <strong>before December 31<sup>st<\/sup><\/strong>, to qualify for the first year deduction – subject to an overall limit of $25,000 for all Section 179 deductions for tax year 2014.<\/p>\n<p>What qualifies as “off-the-shelf” software?<\/p>\n<ul>\n<li>Software that is readily available for purchase by the general public.<\/li>\n<li>Software that is subject to a non-exclusive license.<\/li>\n<li>Software that has not been substantially modified.<\/li>\n<\/ul>\n<p>Examples of software you may need include:<\/p>\n<ul>\n<li>Microsoft Office Suite<\/li>\n<li>Accounting software such as QuickBooks or Intuit<\/li>\n<li>Market Leader<\/li>\n<li>Security or Antivirus applications like Norton or McAfee<\/li>\n<li>Project management programs<\/li>\n<li>Payroll processing programs<\/li>\n<li>Graphics and creative programs<\/li>\n<\/ul>\n<p>You can also deduct the cost of leasing or renting software, such as Adobe’s Creative Suite.<\/p>\n<h2>2. Buy Mobile Devices<\/h2>\n<p>Again, if you have been putting off that tablet purchase that will help you show properties or capture visitor information at open houses, pull the trigger prior to the end of the year.<\/p>\n<p>While computers are normally depreciable over several years under <a href=\"https:\/\/www.irs.gov\/publications\/p946\">MACRS rules<\/a> (meaning you have to spread out your deductions), <a href=\"https:\/\/www.section179.org\/property_that_qualifies_for_section_179\/\">Section 179<\/a> also applies to computers and most kinds of tangible property put into service prior to the end of the year. If you hold off until after December 31<sup>st<\/sup>, you’ll have to wait until your 2016 filing date to get the deduction.<\/p>\n<h2>3. Replace Office Equipment and Furnishings<\/h2>\n<p>Setting up that home office? Breaking loose from your broker’s office? Setting up your own brokerage? Buy that stuff and put it into service before the end of the year and you can take an immediate deduction under Section 179.<\/p>\n<p>Wait until next year and it’s too late, as you’ll have to wait until 2016’s filing before you can claim a deduction. But you can deduct the cost of furnishings, office equipment and other tangible property for your real estate business in 2015 for anything you purchase and use prior to December 31<sup>st<\/sup>. This is true even if you didn’t pay cash for the furnishings and equipment.<\/p>\n<p><strong>NOTE<\/strong>: Remember that there is an overall limit of $25,000 on all Section 179 deductions for 2014 and 2015, until Congress changes the law. This is much lower than the $500,000 available in previous years.<\/p>\n<h2>4. Pay Professional and Membership Dues and Subscriptions<\/h2>\n<p>That’s a tax deductible expense. Pay them before year end and you can deduct them on this year’s taxes. <a href=\"https:\/\/www.nar.realtor\/membership\/dues-information\">Here is the information for 2014 and 2015 dues and assessments for the National Realtors® Association<\/a>.<\/p>\n<p>Now is the time to commit funds to other subscriptions as well, such as research and sales journals, sales training, periodicals such as the Wall Street Journal, and the like.<\/p>\n<h2>5. Start a Retirement Plan<\/h2>\n<p><img loading=\"lazy\" src=\"\/wp-content\/uploads\/2014\/11\/real-estate-retirement-plan-300x200.jpg\" alt=\"starting a retirement plan can give real estate agents large tax deductions\" title=\"real estate retirement plan\" width=\"300\" height=\"200\" class=\"alignright size-medium wp-image-43901\" \/>Even if you’re self-employed, you can still open up a retirement plan over and above an IRA or a Roth IRA. Options include a Simplified Employee Pension plan (SEP IRA) or a solo 401(k) plan. Both options allow you to set aside significant amounts of money – potentially up to $53,000 or 25 percent of compensation for owner-operators of corporations (20 percent for self-employed individuals), whichever is greater – for retirement.<\/p>\n<p>There may be some costs to establish these plans, but if it’s a new plan, you may be able to claim a <a href=\"https:\/\/www.investopedia.com\/articles\/retirement\/04\/031704.asp\">tax credit<\/a> worth 50 percent of the first $1,000 in setup costs in each of the first three years.<\/p>\n<p>For SEP IRAs, you have until your filing deadline to contribute and still get a tax deduction for this year; but for 401(k)s, you must make your employee contributions prior to the end of the year.<\/p>\n<h2>6. Commit Marketing and Advertising Money<\/h2>\n<p>You can sign forward contracts for advertising and marketing services now to secure an immediate tax deduction for tax year 2014, even if you don’t actually receive the services until next year. This goes for advertising, printing, website development and other business and marketing expenses.<\/p>\n<h2>7. Book Professional Travel<\/h2>\n<p>The 2015 Real Estate Conference and Expo is in San Diego, Calif., on November 13-16. Sure, it’s tough to book out that far. But the <a href=\"https:\/\/www.tsnn.com\/events\/recon-global-retail-real-estate-convention\">RECon Global Retail Real Estate Convention<\/a> is in Las Vegas on May 17-20, for you folks in commercial real estate and shopping centers. By committing the travel money this year, you secure your deduction for this year, as well. Otherwise you’ll have to wait until you file in 2016 before you claim the deduction.<\/p>\n<p><strong>Disclaimer: The information listed in this blog post is for general informational purposes only. Tax planning is highly dependent on your individual circumstances. We recommend that you seek the services of a qualified and licensed tax professional for advice on your specific situation.<\/strong><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Starting about February, the financial media will be going gangbusters publishing ideas for tax deductions. That’s too late, though, for a lot of things. To take full advantage of tax planning opportunities, you need to take some steps now – prior to December 31st – to claim a deduction on your tax return when filing [&hellip;]<\/p>\n","protected":false},"author":34,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[97],"tags":[185,623,624,87,625,143,188,626],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/43861"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/34"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=43861"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/43861\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=43861"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=43861"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=43861"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}