{"id":44181,"date":"2014-11-26T09:00:31","date_gmt":"2014-11-26T09:00:31","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=44181"},"modified":"2022-03-30T10:06:49","modified_gmt":"2022-03-30T17:06:49","slug":"real-estate-blogging-tips-for-beginners","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/real-estate-blogging-tips-for-beginners\/","title":{"rendered":"Real Estate Blogging Tips for Beginners"},"content":{"rendered":"<p>While some want you to believe that blogging is an art, it really isn’t. Anyone with thoughts in their head and a keyboard can construct a blog post. Being a successful real estate blogger, however, requires being mindful of the topics you choose and the construction of your blog posts.<\/p>\n<p>Blogging is time intensive. But then, so is mailing out 1,000 postcards, cold calling or door knocking. If you’re considering ramping up your blogging efforts to reel in new clients in 2015, read on for some helpful tips.<\/p>\n<h2>Why Should Agents Blog?<\/h2>\n<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-44201\" title=\"real estate blogging\" src=\"\/wp-content\/uploads\/2014\/12\/real-estate-blogging-2-300x289.jpg\" alt=\"real estate blogging tips for beginners\" width=\"300\" height=\"289\" \/>The biggest advantage to blogging is that – aside from what your time is worth – it’s free. If you waste that time by publishing garbage, or not posting on a consistent basis, then maintaining a real estate blog is actually quite expensive. This is why it’s so important that when you commit to the process, you follow through.<\/p>\n<p>Once you’re up and running and consistently posting content about your local market, whether strictly real estate-related or not, local consumers will begin to visit your blog. You’ll also be able to show them your personality, so that they get to know, like and trust you.<\/p>\n<p>If you’ve been in the real estate industry for over a week, you should know that there is no such thing as an overnight success. The key to blogging, as in most real estate lead generation techniques, is consistency. New leads probably won’t appear after your first post, but keep plugging away at it. It will take time for blog posts to generate web traffic – and leads. Be persistent and your efforts will pay off.<\/p>\n<h2>Basics of Good Blog Design<\/h2>\n<p>How many times have you left a website because the information you wanted was presented in a tiny font and one great big block of text? What your brain says is “Whoa, it’s a lot of work to read that.”<\/p>\n<p>You’re in a hurry. You don’t have the time or desire to read all those scrunched-up words, and so you click away, knowing you’ll find the information somewhere else.<\/p>\n<p>This is why the structure and design of your blog posts are just as important as what you write about. Concentrate on giving your reader lots of white space with short paragraphs.<\/p>\n<p>Sub-heads are your friend. They act as a roadmap for the harried reader so that he or she understands what is coming next. They also add valuable white space. Consider breaking up long posts with bulleted lists and sprinkle the text with graphics and images.<\/p>\n<p style=\"text-align: left;\" align=\"center\"><a href=\"\/blog\/social-seo-1-content-formatting-and-twitter-basics\/\"><strong><em>Learn more reader-friendly formatting tips here.<\/em><\/strong><\/a><strong><em><\/em><\/strong><\/p>\n<h2>Punctuate and Capitalize Correctly<\/h2>\n<p>Dump the exclamation points, please. “<em>Get pre-approved for a loan!”<\/em> is far too mundane to be considered an exclamatory sentence. Take a tip from the <a href=\"https:\/\/www.apstylebook.com\/\">Associated Press Stylebook<\/a>, every journalist’s bible. “Use the mark to express a high degree of surprise, incredulity or other strong emotion.”<\/p>\n<p>Real Estate Agent shouldn’t be capitalized, nor should Listing Agent. In fact, your biggest worry should be to remember to capitalize the word REALTOR, and then you need a cap for every letter.<\/p>\n<p>If it’s been awhile since high school or college, brush up on basic punctuation and grammar. Check out <a href=\"https:\/\/www.quickanddirtytips.com\/grammar-girl\">Grammar Girl, Punctuation Made Simple<\/a>, <a href=\"https:\/\/brians.wsu.edu\/common-errors\/\">Common Errors in English<\/a> and the <a href=\"http:\/\/jacklynch.net\/Writing\/\">Guide to Grammar and Style<\/a> if you need quick refresher courses.<\/p>\n<h2>What Do I Write About?<\/h2>\n<p>If you actively work with clients every day, keep track of questions they ask and problems they have. Answer those questions and solve those problems on your blog.<\/p>\n<p>There’s no law, however, that says you <em>have<\/em> to write about real estate, as Elizabeth Newlin, agent with Realty ONE Group in Mesa, Ariz., well knows. “I write a <a href=\"http:\/\/realestatetangent.com\/this-post-just-makes-me-sad-for-myself\/\">humor blog<\/a>,” she said.<\/p>\n<p>“People think that a real estate blog should constantly be showing your knowledge of the market and I never do that,” Newlin continued. “I’ll write a couple of posts about things you should know about real estate, but I always do it tongue-in-cheek. For the most part I just write ridiculous stories.”<\/p>\n<p>Those stories may be “ridiculous” to Newlin, but her audience hangs on her every word, and they’ve helped her build a real estate business based 100 percent on referrals.<\/p>\n<h2>Put a New Spin on Popular Topics<\/h2>\n<p>OK, so you don’t fancy yourself a funny guy or gal. If you’ve been blogging for some time, why not update some of your older posts that are proven traffic magnets?<\/p>\n<p>“You can gather all the newest information on the topic, write a new post and then link back internally to the original post. It gives you both a brand new article on something formerly well received, and directs new readers (or old ones) to the first post you did on it. It’s great for traffic,” says Ann Smarty, brand and community manager at Internet Marketing Ninjas.<\/p>\n<h2>Proofread, Proofread, Proofread<\/h2>\n<p>After writing a post, put it away for a while. When you return to it, read it aloud to get a feel for how it sounds. If you like it, proofread it for spelling and grammar errors and you’re almost done.<\/p>\n<h2>Write With SEO in Mind<\/h2>\n<p><img loading=\"lazy\" src=\"\/wp-content\/uploads\/2014\/11\/Fotolia_44888847_XS-300x208.jpg\" alt=\"How real estate agents can improve their blog&#039;s SEO\" title=\"real estate SEO\" width=\"250\" height=\"173\" class=\"alignright size-medium wp-image-44251\" \/>How will you ever show up above the fold on the first page of a Google search? I’m no <a href=\"https:\/\/static.googleusercontent.com\/media\/www.google.com\/en\/us\/webmasters\/docs\/search-engine-optimization-starter-guide.pdf\">search engine optimization<\/a> (SEO) expert, but I have spoken with many specialists on the topic.<\/p>\n<p>One thing they all agree on is to be cognizant of the placement of your keywords. “Keywords placed in important areas like titles, headlines, and higher up in the main body text may carry the most weight,” according to Cyrus Shepard, senior content “astronaut” at <a href=\"https:\/\/moz.com\/blog\/on-page-topic-seo\">SEO and software company Moz<\/a>.<\/p>\n<p>Most also agree that you need links in your blogs. These links should be both internal – linking to other pages on your site – and external. The latter not only helps your readers find more information on the topic, but search engines will see these links as useful as well.<\/p>\n<h2>Final Touches<\/h2>\n<p>Finally, push your blog posts out to social media to boost your readership. The more people who share your posts, the better your chances.<\/p>\n<p>There’s a rumor in the real estate industry that 2015 is the year agents will finally get it. They will finally and fully “embrace content and inbound marketing,” writes marketing speaker Seth Price. “It’s still difficult for many in real estate to perceive the value in creating utility for consumers without turning that utility into an advertisement.”<\/p>\n<p>“Publishing high quality content is the new equivalent of driving a Mercedes,” adds agent Anne Jones at Windermere Professional Partners. “You may not be selling million-dollar homes (yet!) but your marketing should look like you do.”<\/p>\n","protected":false},"excerpt":{"rendered":"<p>While some want you to believe that blogging is an art, it really isn’t. Anyone with thoughts in their head and a keyboard can construct a blog post. Being a successful real estate blogger, however, requires being mindful of the topics you choose and the construction of your blog posts. Blogging is time intensive. But [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[50],"tags":[334,377,627,628,56,134,629],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/44181"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=44181"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/44181\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=44181"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=44181"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=44181"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}