{"id":44451,"date":"2014-12-10T18:54:47","date_gmt":"2014-12-10T18:54:47","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=44451"},"modified":"2016-01-29T00:47:18","modified_gmt":"2016-01-29T00:47:18","slug":"3-ways-to-help-buyers-set-realistic-expectations","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/3-ways-to-help-buyers-set-realistic-expectations\/","title":{"rendered":"3 Ways to Help Buyers Set Realistic Expectations"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright  wp-image-44471\" title=\"helping buyer expectations\" src=\"\/wp-content\/uploads\/2014\/12\/helping-buyer-expectations-300x294.jpg\" alt=\"3 Ways to Help Buyers Set Realistic Expectations\" width=\"240\" height=\"235\" \/>Have you ever watched the real estate TV show about first-time homebuyers? At the beginning of each show, an agent takes the buyers to a chosen neighborhood, and as they walk the streets, asks them to guess the price of each home for sale.<\/p>\n<p>Yup, you guessed it: Most of the time, the buyers undervalue the homes. You probably see something similar in your own real estate practice.<\/p>\n<p>So, what can you do to bring a sense of reality to buyers’ wish lists? While “shock therapy” works – by showing them exactly what they <em>can<\/em> afford in a chosen neighborhood – sometimes it’s better to approach the situation with more subtlety.<\/p>\n<h2>Be Honest About the Market<\/h2>\n<p>“It’s a great time to buy!” say way too many real estate agents. Even in the run-up to the housing market collapse, when prices were inflated, some agents were sending newsletters and publishing blog posts about what a fabulous time it was to buy a home.<\/p>\n<p>This is where agents need to get real. It isn’t always a great time to buy – especially for first timers. When investors are heavily involved in a market, it’s a horrible time for the average first-time buyer. Ditto for when inventories are tight.<\/p>\n<p>If you hope to keep your client’s expectations in the realm of reality, it’s important for you to be honest about the current market. If it’s a tough market for them, let them know – and advise them on ways to handle it.<\/p>\n<h2>Teach Buyers About Seller Psychology<\/h2>\n<p>“Insult a seller and kiss that dream home goodbye,” – these should be words of warning that agents are happy to dispense to their clients. Sadly, they aren’t.<\/p>\n<p>Lowball offers or excessive requests for concessions and repairs to the wrong seller will kill a deal. When you counsel your clients, bring them up to speed on what kind of market they’re entering and whether you believe low offers will be accepted or denied. Make sure their price expectations are grounded in reality.<\/p>\n<p>Explain to them how some sellers can be emotionally attached to their homes and to improvements they’ve made. Coming in ridiculously lower than the list price may be taken as an insult, and no counter will be forthcoming.<\/p>\n<p>This isn’t to say there’s never a time to lowball, but you need to counsel your client on when it’s appropriate and when it’s insulting.<\/p>\n<h2>Help Buyers Work Within Their Budgets<\/h2>\n<p>On another real estate show, the clients are two 25-year-olds on a budget of $250,000, who insist on looking for a home in an area full of million-dollar houses. “My ideal house would have double staircases … a Spanish-style house with columns around the front door,” says the man. She wants an “old-style” house with an updated kitchen and large closets. Oh, and an attached garage. And at least two bathrooms. And a backyard. All this, in an area where condos are priced over $300,000.<\/p>\n<p>These weren’t just dreams or wishes. This couple was telling their agent exactly what they wanted in a home. And they expected to get all of it for $250,000 or less.<\/p>\n<p>It’s not just upscale amenities that some first-time buyers expect. “A survey by Coldwell Banker Real Estate of 300 first-time buyers found that a startling 87 percent said that ‘finding a move-in ready home is important’ to them,” according to the <a href=\"http:\/\/www.washingtonpost.com\/wp-dyn\/content\/article\/2011\/03\/03\/AR2011030306660.html\">Washington Post<\/a>.<\/p>\n<p>In other words, they don’t want to paint, rip out carpet or buy new appliances. In fact, as you well know, many buyers can’t see beyond ugly wall colors and will even dismiss a home based entirely on the paint. First-time buyers, especially, can’t seem to grasp the difference between their dream home and a starter home.<\/p>\n<p>When buyers expect to have granite countertops and stately columns at the front door, and these items are foreign to homes within their budget, it’s time for the aforementioned “shock therapy.” Show them homes that are priced at or below their price point, so that they have absolutely no doubt they’ve been living in a fantasyland.<\/p>\n<p>One Northern Californian agent tackles clients that expect every entry-level home to be turn-key by keeping a folder of before and after photos in her car. “One of my clients bought this house,” she’ll tell them while showing a photo of a living room with purple walls. “He spent less than $200 on paint and look at that room now,” she says as she shows the after-photo.<\/p>\n<p>There are other creative ways to help buyers overcome unrealistic expectations. What are some that you’ve used?<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Have you ever watched the real estate TV show about first-time homebuyers? At the beginning of each show, an agent takes the buyers to a chosen neighborhood, and as they walk the streets, asks them to guess the price of each home for sale. Yup, you guessed it: Most of the time, the buyers undervalue [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[83],"tags":[84,254,124,630,167,56,263],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/44451"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=44451"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/44451\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=44451"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=44451"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=44451"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}