{"id":44571,"date":"2014-12-17T09:00:57","date_gmt":"2014-12-17T09:00:57","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=44571"},"modified":"2022-04-07T13:06:33","modified_gmt":"2022-04-07T20:06:33","slug":"facebook-tightens-rules-on-promotional-posts","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/facebook-tightens-rules-on-promotional-posts\/","title":{"rendered":"Facebook Tightens Rules on Promotional Posts"},"content":{"rendered":"<p>Like many small businesses, real estate agents have been enjoying a pretty sweet deal on Facebook for a while now. We all know how vital word-of-mouth is to real estate agents – especially to newer agents who don’t have a ton of cash flow for traditional forms of advertising.<\/p>\n<p>In recent years, many agents have taken to Facebook to promote their businesses and get the word out about listings, sales and open houses. For the most part, Facebook has been looking the other way on these kinds of posts. But it now looks like the days of freebie promotions on Facebook are over.<\/p>\n<h2>The Blowback on Promotional Posts<\/h2>\n<p>Facebook recently announced a <a href=\"https:\/\/www.facebook.com\/business\/news\/update-to-facebook-news-feed\">crackdown on unpaid posts<\/a> that are “too promotional,” which the company defines as follows:<\/p>\n<ul>\n<li>Posts that hawk a specific product for sale or ask users to download an app.<\/li>\n<li>Anything having to do with entering promotions, sweepstakes and raffles without any sense of context.<\/li>\n<li>Posts that essentially rehash content from ads.<\/li>\n<\/ul>\n<p>These posts were causing complaints from Facebook users, according to the company, and some anecdotal evidence suggests that some users have actually stopped using Facebook because they were tired of all the advertising and promotion.<\/p>\n<p>The kicker: It wasn’t companies that paid for advertisements that were the most guilty of turning off users. Facebook can control the number and quality of paid ads that appear in a user’s news feed. Rather, businesses that users “liked” on Facebook – essentially signing up for their feeds – were the primary culprit.<\/p>\n<p>If you’ve been posting overly promotional content on your feed, Facebook’s management has essentially fired a shot across your bow. Competition to appear in Newsfeeds will increase substantially, starting in January. Abuse your feed, and your page reach will fall significantly over time.<\/p>\n<h2>Time to Revamp Your Facebook Strategy<\/h2>\n<p>This doesn’t mean you can’t continue to use your Facebook page to promote your real estate practice. Far from it. <a href=\"https:\/\/www.facebook.com\/business\/a\/page-posting-tips\">Facebook encourages it<\/a>. But if you’ve been lazy about providing value-added content for your “likers” and friends, with posts that rarely go beyond obnoxiously hawking your services, you’ll need to completely re-do your Facebook strategy.<\/p>\n<p><strong>To create valuable content for your followers, focus on these ideas:<\/strong><\/p>\n<ul>\n<li>Use Facebook to establish yourself as an expert or thought leader within your niche. Brand yourself as an expert by providing timely information that people want to read.<\/li>\n<li>Provide a service to your readers with every post.<\/li>\n<li>Target your posts carefully. You can do this in your “Settings” on Facebook Pages. Click “Settings,” then “Targeting and Privacy.” You can target your posts by location, sex, age, interests, education, language and more.<\/li>\n<li>Do you have a specific promotion going? Then by all means promote, or boost, your posts. Spend a few dollars, if you can – but if you’re spending money, you’d <em>better<\/em> be targeting!<\/li>\n<li>Post regularly. That’s what gives you “top of mind” awareness with your market. When people think “real estate in my neighborhood,” you want them to think of your name. That means you’re going to have to hit them with a couple of dozen impressions before you make the short list of people they will call when they want to buy, sell or rent a property.<\/li>\n<li>Reinforce success. Did one of your posts get an unusual amount of interest and engagement? Pay a few dollars and promote it to increase its reach. You already know the message is effective. You can’t do better testing than that.<\/li>\n<li>Use pictures, links and hashtags with your posts. Studies show that these get more retweets, likes, comments and overall engagement than posts with text only, says Carol Fowler, CEO of KloboMedia, a Chicago-based firm that advises small businesses on social media strategy.<\/li>\n<li>Don’t have a Facebook Page for your business? If you’re just using a personal account, rather than a business page, you can still advertise on Facebook. Those ads will only show up in the right-hand column of pages, though, not in Newsfeeds.<\/li>\n<li>Change your cover photo. Keep some branding elements constant, but switch other things up.<\/li>\n<li>Make use of Facebook <a href=\"https:\/\/www.facebook.com\/help\/336893449723054\/\">Insights<\/a>, which is their counterpart to Google Analytics. Insights is a valuable tool to help measure reader responses to posts, both in terms of reach (how many unique people saw your post) and engagement (how many people shared, liked or commented on it).<\/li>\n<\/ul>\n<p>Facebook isn’t the only game in town, of course. LinkedIn is also a very powerful resource for targeting educated professionals. But Facebook is still the big dog when it comes to social media strategy. Some 80 percent of businesses with a social media profile are on Facebook, and the sheer number of users dwarfs any other platform.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Like many small businesses, real estate agents have been enjoying a pretty sweet deal on Facebook for a while now. We all know how vital word-of-mouth is to real estate agents – especially to newer agents who don’t have a ton of cash flow for traditional forms of advertising. In recent years, many agents have [&hellip;]<\/p>\n","protected":false},"author":34,"featured_media":48169,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[35],"tags":[106,17,631,632,57,118],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/44571"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/34"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=44571"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/44571\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media\/48169"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=44571"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=44571"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=44571"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}