{"id":44731,"date":"2014-12-31T21:08:20","date_gmt":"2014-12-31T21:08:20","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=44731"},"modified":"2016-01-29T00:40:55","modified_gmt":"2016-01-29T00:40:55","slug":"are-buyers-really-liars-addressing-a-common-agent-complaint","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/are-buyers-really-liars-addressing-a-common-agent-complaint\/","title":{"rendered":"Are Buyers Really Liars? Addressing a Common Agent Complaint"},"content":{"rendered":"<p>There’s an old and odious real estate saying that “Buyers are liars.” It’s odious because it’s not completely true and it’s repulsive because lying – or withholding the entire truth – isn’t endemic to real estate consumers.<\/p>\n<p>We all have the capacity to lie when we’re expected to buy. Whether we’re shopping for a pair of shoes or a used car, many of us are not completely honest with salespeople. Sorry, but to real estate consumers that’s what you are, a salesperson.<\/p>\n<p>So, what do agents think homebuyers might “lie” about? The list is long and just about every agent has experienced at least one Pinocchio-esque situation. But are these, in fact, lies? We’re not entirely convinced they are, so let’s take a look at a few common cases.<\/p>\n<h2>Case #1: They Don’t Know What They Want<\/h2>\n<p>Your clients wanted a two-story home on the east side of town and ended up falling in love with a one-story on the west side. That’s the vanilla version of the story. Many agents have stories of showing exactly the type of homes their clients said they wanted, for months on end, only to have them eventually turn their backs on their “must haves” and decide to purchase the exact opposite.<\/p>\n<p>But did they lie about what they wanted? Chances are good they just really didn’t know what they wanted until they were set loose in the candy store of available homes. In fact, chances are even better that buyers know more about what they <em>don’t<\/em> want in a home than what they do. This is why it’s so important you ask the right questions during your initial meeting, and keep asking them as you show potential homes.<\/p>\n<p>“When a buyer says one thing and does another, I see it as a shortcoming in my own qualification and rapport building with the buyer,” says <a href=\"http:\/\/www.sandiegohomefinder.com\/\">Daniel Beer<\/a> of Windermere Real Estate in San Diego.  “Perhaps I did a poor job of listening or maybe I didn&#8217;t ask the right questions. It is my job to help them find what they want, and they don&#8217;t always know exactly what that is.”<\/p>\n<p>Wish lists are obviously not set in stone, and as their agent, you owe it to your clients to dig deep into what they both want and don’t want to help find what’s right for them. Figure out what’s motivating them to buy, and you’ll be a long way down the road to figuring out what they really want.<\/p>\n<h2>Case #2: Tire Kickers<\/h2>\n<p>What’s your knee-jerk reaction when a Macy’s sales associate asks if he or she can help you? “No thanks, just looking,” right? Were you lying? So why then, does a “We aren’t ready to buy yet – we’re just curious to see what’s out there” response from a homebuyer constitute a lie?<\/p>\n<p>Sure, it is highly likely that these lookers would jump on the first house they like with a decent price. You know that. I know that. The potential buyer, however, probably doesn’t.<\/p>\n<p>Now, let’s go back to the Macy’s scenario. What response could the sales associate give you that would put you at ease and make you feel comfortable enough to approach her when you are ready to buy? Munch on that one for a while.<\/p>\n<h2>Case #3: Fibbing on Finances<\/h2>\n<p>If you bought your first home before you entered the real estate industry, this one is easy. Remember how uncomfortable it was to sit in front of a total stranger and tell her how much or how little money you made, how much debt you had, and the dirty little secrets that credit agencies held about your financial life?<\/p>\n<p>Now, if a client fails to tell you about the bankruptcy that was discharged just last month, that’s a lie – not an oversight. If they claim they’ve seen a lender and know exactly where they stand with getting a mortgage, and they haven’t, that’s a lie.<\/p>\n<p>Melissa Graebner, associate professor at the University of Texas at Austin’s McCombs School of Business, published a <a href=\"http:\/\/www.iacmr.org\/Private\/PKU\/Readings\/Graebner%20reading%203.pdf\">2009 study<\/a> that found that buyers are more likely to lie than sellers. She says the lack of honesty stems from the fact that buyers are less trusting than sellers.<\/p>\n<p>Now, Graebner studied buyers in mergers and acquisitions transactions, not in real estate, but the takeaways from her study may apply to our industry as well. They speak loudly to the issue of building trust and rapport with your client as quickly as possible. When clients know you aren’t just a salesperson, that you’re not in it solely for the commission check, and that you care about their motivations and needs, their skepticism will abate.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>There’s an old and odious real estate saying that “Buyers are liars.” It’s odious because it’s not completely true and it’s repulsive because lying – or withholding the entire truth – isn’t endemic to real estate consumers. We all have the capacity to lie when we’re expected to buy. Whether we’re shopping for a pair [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":48195,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[83],"tags":[254,163,633,634,56],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/44731"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=44731"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/44731\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media\/48195"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=44731"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=44731"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=44731"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}