{"id":45551,"date":"2015-01-14T09:00:21","date_gmt":"2015-01-14T09:00:21","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=45551"},"modified":"2016-01-29T00:39:17","modified_gmt":"2016-01-29T00:39:17","slug":"how-to-focus-on-client-retention-in-2015","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/how-to-focus-on-client-retention-in-2015\/","title":{"rendered":"How to Focus on Client Retention in 2015"},"content":{"rendered":"<p>I know what some of you may be thinking. “Who doesn’t know how to retain clients? It’s not rocket science. It’s common sense and there’s really only one way to do it – keep in touch with them.”<\/p>\n<p>However, think about how many agents don’t have a referral base. Maybe it’s not as easy as it seems to stay top-of-mind with former clients. Or maybe, some agents just don’t get how important it is.<\/p>\n<p>Perhaps it’s a bit of both. Here are some points to consider.<\/p>\n<h2>Nurture Past Clients Now to Build Business Later<\/h2>\n<p>So, why bother nurturing relationships you’ve built with past clients? “According to Bain and Co., a 5 percent increase in customer retention can increase a company’s profitability by 75 percent,” writes Alex Lawrence at <a href=\"http:\/\/www.forbes.com\/sites\/alexlawrence\/2012\/11\/01\/five-customer-retention-tips-for-entrepreneurs\/\">Forbes<\/a>.<\/p>\n<p>“And if those numbers don’t impress you,” he continues, “Gartner Group statistics tell us that 80 percent of your company’s future revenue will come from just 20 percent of your existing customers.” Another well-known statistic that Lawrence shares: Running after new clients costs five times more than working on retaining existing and past clients.<\/p>\n<p>I live in Las Vegas, and if you’ve ever been here you know that we don’t have a ton of natural greenery. Every once in a while, driving around the valley, you’ll pass a patch of wild greenery – maybe in a city wash or in the surrounding desert. Underground springs feed this growth, and amazingly it thrives, even in the heat of summer. It wouldn’t, though, if it wasn’t nurtured. The grass isn’t always greener on the other side of the fence. It’s green where you water it.<\/p>\n<p>So, although those new clients look mighty attractive, water the business you have (or had), and watch it multiply.<\/p>\n<h2>Ask for Referrals – It’s Human Nature to Help!<\/h2>\n<p>Quick! What’s the easiest way to get a referral from someone you worked with in the past?<\/p>\n<p><strong>ASK.<\/strong><\/p>\n<p>Sure, referrals can happen spontaneously, but not often enough to bank on them. I once had a landlord that was also a real estate agent. He once called me to ask if I knew anyone that was thinking of buying or selling real estate. I didn’t, but my first instinct was to rack my brain to think of someone. I really liked the guy and I wanted to help him. It’s human nature to want to help.<\/p>\n<p>Take the “ask” process a step further by “narrowing the universe of those you ask,” suggest Jay Conrad Levinson and Al Lautenslager in “<a href=\"http:\/\/www.amazon.com\/Guerrilla-Marketing-Days-2nd-Edition\/dp\/1599182661\">Guerrilla Marketing in 30 Days<\/a>.” Like my former landlord, if you ask me who I know that might be thinking of buying or selling real estate, you are asking me to thumb through my brain’s database of several hundred people.<\/p>\n<p>If you narrow down the universe, you may have better luck getting an immediate answer. Ask your weekend tennis partner who else he plays tennis with that might be interested in your services. When you narrow your “ask” to a niche, the chances of a positive result increase greatly.<\/p>\n<h2>How to Reach Out and Touch Past Clients<\/h2>\n<p>Asking for referrals is a baby step in the grand scheme of retaining former clients. It does, however, count as a “touch.” A touch is what client retention is based on. Let’s dive a bit deeper into what touching past clients means.<\/p>\n<p>Reaching out to people in your database, both former clients and those in your sphere, is the bedrock of relationship marketing. The focus is on building relationships, which is a far cry from old ways agents generated leads.<\/p>\n<p>So, what are some ways to get your required number of “touches?” The easiest (after you set it up) and cheapest way is an email drip campaign. The problem is that it’s so easy, and so inexpensive, that many agents turn it from an email drip campaign into an email torture campaign. Set your CRM to send out an email with valuable, useable content only once a month, if that.<\/p>\n<h2>Get Creative With Client Events<\/h2>\n<p>Mix up the remaining touches. Face-to-face contact – whether it’s for coffee or at a client appreciation event – is amazingly effective. Wes Freas, an agent with Zephyr Realty in San Francisco, holds an annual holiday wreath decorating party in his garage that brings clients out in droves. He serves hors d&#8217;oeuvres, has an open bar, and offers baskets and baskets full of decorating stuff for the fresh wreaths on hand.<\/p>\n<p>Buyer’s Edge agent Steve Israel blows other Bethesda, Md., agents out of the water with his annual soiree. He pulls out all the stops by inviting 500 clients to a catered affair with live music – once he had the Tommy Dorsey Orchestra. The event is held in a swank, historic ballroom and every year Israel finds a unique way to make his grand entrance at the event.<\/p>\n<p>Max Broock Realtors® agent Kathy Broock Ballard came up with one of the cleverest ideas I’ve yet to hear. The local women’s shelter in her North Oakland County, Mich., market was asking for donations of bras. To meet the need, Ballard started an annual event, held on St. Patrick’s Day and called “The Annual Erin Go Bra(gh) Party.” She coordinates a buffet lunch, complete with an open bar, and invites past clients and other folks from her sphere. The price of admission is a new bra, which Ballard donates to the shelter. By mixing community service with past-client retention, Ballard hits the exacta. Add to that the ink she gets in the local press, and the event is transformed into a trifecta.<\/p>\n<p>Your event need not be lavish and expensive (unless you are a luxury home agent). A couple of years ago, St. Augustine, Fla., agent Peggy Gatchet sent out an open invitation for folks to drop by her home on New Year’s Day for brunch. She served black-eyed peas and other “good luck” foods and had a menu printed up to explain what kind of luck the food would bring in the coming year. Her clients loved it.<\/p>\n<p>From movie nights in the park to summer barbecues, agents that believe in face-to-face touches come up with some memorable ideas. And being memorable is the key to building a referral-based business. Imagine: no more chasing after new business.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>I know what some of you may be thinking. “Who doesn’t know how to retain clients? It’s not rocket science. It’s common sense and there’s really only one way to do it – keep in touch with them.” However, think about how many agents don’t have a referral base. Maybe it’s not as easy as [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":48221,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[97],"tags":[190,106,163,116,56,262,638],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/45551"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=45551"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/45551\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media\/48221"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=45551"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=45551"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=45551"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}