{"id":45701,"date":"2015-01-22T10:00:31","date_gmt":"2015-01-22T10:00:31","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=45701"},"modified":"2022-01-26T13:21:10","modified_gmt":"2022-01-26T21:21:10","slug":"8-signs-your-website-is-stuck-in-the-dark-ages","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/8-signs-your-website-is-stuck-in-the-dark-ages\/","title":{"rendered":"8 Signs Your Website Is Stuck in the Dark Ages"},"content":{"rendered":"<p>We’ve all seen them: Websites that are supposed to sell, but wind up making their owners look dumb, inept or out of touch. We live in a digital era. According to the <a href=\"https:\/\/www.nar.realtor\/sites\/default\/files\/reports\/2014\/2014-profile-of-home-buyers-and-sellers-highlights.pdf\">2014 NAR Profile of Homebuyers and Sellers:<\/a><\/p>\n<ul>\n<li>92 percent of homebuyers use the Internet when looking for information<\/li>\n<li>76 percent of buyers view homes or drive by homes for sale that they first find online<\/li>\n<li>43 percent of buyers found their home on the Internet<\/li>\n<\/ul>\n<p>This business is tough enough, but if your website is making you look like you’re stuck in the 90s, while the rest of the real estate industry is moving on without you, you’re ceding a massive marketplace to competitors.<\/p>\n<p>Here are eight vital signs your website presence needs a massive overhaul to catch up with the 21<sup>st<\/sup> century.<\/p>\n<h2>Have a Flash Intro on Your Website<\/h2>\n<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-45721\" title=\"bad real estate website\" src=\"\/wp-content\/uploads\/2015\/01\/bad-real-estate-website-200x300.jpg\" alt=\"Signs Your Website Is Stuck in the Dark Ages\" width=\"200\" height=\"300\" \/>This is especially true if there’s text in the Flash imagery. Search engines can’t read text in a Flash animation. To the internet robots, they just look like image files. It’s like handing a photocopy of a braille book to a blind man and asking him to read it. It just doesn’t work. If you have text in a Flash piece, retype it into regular text. Then dump the Flash.<\/p>\n<h2>Cheesy Glam Photos<\/h2>\n<p>You’ve seen them. Photos of agents with 80s feathered hair that’s been out of style since Frankie went to Hollywood, complete with a pantyhose effect over the lens. Leave the glam shots for your high school yearbook, and go get a proper portrait done.<\/p>\n<h2>Crummy E-mail Addresses<\/h2>\n<p>Real estate agents are professionals. People entrust hundreds of thousands, even millions of dollars, to their care. If you have an email address like fairyangel1000@aol.com or harleydude51@yahoo.com, that’s one more item that undermines the trust that people have in you. Invest in a real email address and domain.<\/p>\n<h2>No Lead Capture Functionality<\/h2>\n<p>Not having this feature alone can kill your practice as a real estate agent. Consumers are now more used to entering basic information into a form, to give you permission to contact them. If a customer wants to see a house, they’ll be willing to let a professional agent contact them about it. Even if it doesn’t lead to an immediate sale, lead capture functionality is a key way of adding contacts to your drip marketing program. Plus, your lead capture system is a powerful defense against any accusation that you violated Do Not Call rules.<\/p>\n<h2>Not Mobile Friendly<\/h2>\n<p>Sure, you’ve had your site up for years. But have you actually looked at it on an iPhone? An Android phone or tablet? You need to do that regularly. Just because a site works on your desktop doesn’t mean it’s not loading up as gibberish on a mobile device.<\/p>\n<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-45751\" title=\"consumer using smartphone\" src=\"\/wp-content\/uploads\/2015\/01\/consumer-using-smartphone-300x300.jpg\" alt=\"Real estate website mistake: not being mobile-friendly\" width=\"250\" height=\"250\" \/>When a potential homebuyer drives by one of your listings, sees your sign in front of the house and wants to look up the online listing, do you think they’re going to write the information down in a notebook and drive home to a big screen desktop? No! They’re going to look you up, on the spot, on their smartphone. If your site is legible and functional, and they’re interested, they’ll call you or drop their contact info in your lead capture system.<\/p>\n<p>According to research by iAquire, 40 percent of users will give up if your site is not mobile friendly. You will never see or hear from them. Furthermore, 70 percent of searches on mobile sites lead to actions on websites within one hour.<\/p>\n<h2>Bad Stock Photography<\/h2>\n<p>Increasingly, consumers are accustomed to seeing homes marketed with beautiful imagery. Think of high-end magazine photography, like Real Simple and Architectural Digest<em>.<\/em> Your website’s top images should convey an elegant and refined look. Most cheap or free stock photo sites are nowhere near the industry standard. For the purposes of branding you and your business, invest in some proper images.<\/p>\n<h2>Bad Agent Photography<\/h2>\n<p>If you’re not a camera fiend, get a professional photographer to take photographs for you. Actually, you should probably do this anyway. You’re not a professional photographer – even if it’s a passion in your private life. You’re a real estate agent.<\/p>\n<p>Every minute you spend setting up the perfect shot and tweaking the image on Photoshop is a minute better spent on the phone, talking to contacts and setting up listings, showings and closings. And counting your commission checks. Photography is a non-core activity for you. Delegate it as soon as you can. See more <a href=\"\/blog\/lessons-from-the-worst-real-estate-photographers\/\">tips on real estate photography<\/a>.<\/p>\n<h2>Poor Social Media Integration<\/h2>\n<p>It’s important for websites to have interactivity and to allow easy, seamless sharing of listings, blog posts, articles and other content via social media. If you spent time writing a great blog post or informative article, you’ve probably branded it with your name and contact information. If it’s useful, people will want to share it with friends. And if it makes you look like an expert, you want this information shared as much as possible. It builds your credibility and helps you grow your business. Make sure your social sharing tools are easy to find.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>We’ve all seen them: Websites that are supposed to sell, but wind up making their owners look dumb, inept or out of touch. We live in a digital era. According to the 2014 NAR Profile of Homebuyers and Sellers: 92 percent of homebuyers use the Internet when looking for information 76 percent of buyers view [&hellip;]<\/p>\n","protected":false},"author":34,"featured_media":48209,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[50],"tags":[126,279,56,57,639,136],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/45701"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/34"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=45701"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/45701\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media\/48209"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=45701"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=45701"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=45701"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}