{"id":45891,"date":"2015-01-28T18:41:48","date_gmt":"2015-01-28T18:41:48","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=45891"},"modified":"2017-06-06T10:02:14","modified_gmt":"2017-06-06T17:02:14","slug":"improve-your-branding-to-attract-better-clients","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/improve-your-branding-to-attract-better-clients\/","title":{"rendered":"Improve Your Branding to Attract Better Clients"},"content":{"rendered":"<p>Just as all real estate agents aren’t alike, nor are all real estate clients. Some are better than others. Now sure, “better” is in the mind of the beholder. Maybe a better client to you is one that can make up his mind before touring the 100th house for sale. Perhaps to the agent at the next desk, a better client is one that instantly trusts her.<\/p>\n<p>Since you <em>are<\/em> your branding, maybe it’s time to take a second look at what you’re putting out there to attract clients. From your logo to your email signature to the colors you choose, everything you do to attract clients should fit into a brand that your ideal client finds compelling.<\/p>\n<h2>Who Is Your Target Client?<\/h2>\n<p>One of the most common mistakes real estate agents make is assuming that everyone is their target audience. It’s an easy trap to fall into when you don’t have a niche. In attempting to be everything to everyone, your brand becomes watered down and you end up blending in, rather than standing out.<\/p>\n<p>Take some time now, at the beginning of a new year, to get clear on who your ideal client truly is. Write out a profile of this person and implant it firmly in your brain. If this process delivers an “aha” moment – one that tells you that you need to practice real estate in a certain niche – all the better.<\/p>\n<p>Once you have your ideal client’s profile, you can fine-tune your branding to target that particular client pool.<\/p>\n<h2>Hone Your Brand Voice<\/h2>\n<p>What good does it do to plaster your website, blog, social media profiles, email and marketing materials with your colors, logo and other aspects of your brand if your content is geared to an entirely different audience?<\/p>\n<p>This happens when agents don’t understand how important their content is to their brand. Dashing off a blog post haphazardly or hiring sub-par content writers to create drivel for your website can lead to a brand identity crisis.<\/p>\n<p>Dig out that ideal client profile and ask: How does this person communicate with others? What kind of language does he use? Is he a no-nonsense, formal type of guy – or is his communication style more casual, with colloquialisms frequently thrown in? Would facts, figures and charts be more appealing to this person, or a narrative that breaks it all down in plain English?<\/p>\n<p>This is important information because it lets you customize your content for that ideal client. If you are targeting luxury clients, you don’t necessarily want to use the same language that you would use for people looking for an entry-level home. Change your voice, and you may just change the type of client you attract.<\/p>\n<p>Establishing your brand voice isn’t easy, but if it speaks to your ideal client’s needs in their preferred mode of communication, it is a powerful adjunct to your branding efforts. Once you determine your brand voice, it’s time to use that voice to give your ideal client what he or she wants, and to supercharge the reinforcement of your brand.<\/p>\n<h2>Make Your Content Matter<\/h2>\n<p>So, just what should that brand voice be saying? First, let’s discuss what it shouldn’t. The ideal client for your real estate business doesn’t want or need to know your life story. She doesn’t want to hear you say the same things every other agent in town is saying. And she certainly doesn’t want to feel marketed to.<\/p>\n<p>Real estate consumers crave information. They want to see listings, and they don’t want to jump through hoops to see them. They want valuable information. What’s the current market doing? What is my next step? If you present this information in a way that resonates with your audience (via your customized brand), and in a voice that speaks to them, they will be back.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Just as all real estate agents aren’t alike, nor are all real estate clients. Some are better than others. Now sure, “better” is in the mind of the beholder. Maybe a better client to you is one that can make up his mind before touring the 100th house for sale. Perhaps to the agent at [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":48205,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[35],"tags":[23,99,100,124,640,635,56],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/45891"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=45891"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/45891\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media\/48205"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=45891"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=45891"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=45891"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}