{"id":46181,"date":"2015-02-04T22:32:13","date_gmt":"2015-02-04T22:32:13","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=46181"},"modified":"2022-10-24T10:25:27","modified_gmt":"2022-10-24T17:25:27","slug":"develop-an-attitude-of-gratitude-to-be-successful-in-real-estate","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/develop-an-attitude-of-gratitude-to-be-successful-in-real-estate\/","title":{"rendered":"Develop an Attitude of Gratitude to Be Successful in Real Estate"},"content":{"rendered":"<p>There’s an exercise instructor in St. Paul, Minn., who just celebrated the big one. One hundred years.<\/p>\n<p>Yup, 100 years old and she still teaches exercise techniques to fellow residents at her senior apartment complex. She began teaching 15 years ago – at the age of 85.<\/p>\n<p>To what does Lauretta Taggert attribute her longevity, and the fact that she can still flex her exercise muscles at 100 years of age? “An attitude of gratitude,” she told Minneapolis’ KARE 11. It turns out that she may have a lesson for all of us. Success in real estate – and in life – requires an attitude of gratitude.<\/p>\n<h2>Gratitude Contributes to Happiness<\/h2>\n<p>Many of us strive for success because we assume it will lead to true and lasting happiness. Studies show, however, that the opposite may be true. “Happy individuals are predisposed to seek out and undertake new goals in life . . .” according to an article by the American Psychological Association. So we may have it backwards: Happiness leads to success.<\/p>\n<p>If success is a byproduct of a joyful disposition, how can we become happier? Scientists at the <a href=\"https:\/\/ggsc.berkeley.edu\/what_we_do\/major_initiatives\/expanding_gratitude\">Greater Good Science Center<\/a> at the University of California, Berkeley, would most likely say that Taggert, our exercise instructor, hit the nail on the head. Gratitude not only contributes to happiness, it also helps us build stronger immune systems and lessens the frequency of loneliness.<\/p>\n<p>So if being grateful contributes to happiness, and happiness fuels success, it only stands to reason that if you hope to make it to the top of the real estate market in your town, you need to start counting your blessings.<\/p>\n<h2>Gratitude Is the Source – Not the Result – of Success<\/h2>\n<p>“People who approach life with a sense of gratitude are constantly aware of what’s wonderful in their life. Because they enjoy the fruits of their successes, they seek out more success,” <a href=\"https:\/\/www.forbes.com\/sites\/erikaandersen\/2013\/11\/27\/how-feeling-grateful-can-make-you-more-successful\/?sh=491634da2de7\">says Geoffrey James<\/a>, contributing editor at Inc.com.<\/p>\n<p>In another <a href=\"https:\/\/www.inc.com\/geoffrey-james\/3-emotions-at-the-root-of-success.html\">piece<\/a>, James discusses the findings of a study that claims gratitude is “a source, rather than result, of success.” The study finds that people who count their blessings are more patient – and better able to put off financial gratification. “In business, patience is extraordinarily valuable,” he writes.<\/p>\n<h2>How to Become More Grateful<\/h2>\n<p>The folks at the Greater Good Science Center <a href=\"https:\/\/greatergood.berkeley.edu\/article\/item\/why_gratitude_is_good#sthash.zYi8Otui.dpuf\">recommend<\/a> counting your blessings on a daily basis. Others suggest that writing these blessings down in a journal is a more powerful way to reinforce the attitude of gratitude.<\/p>\n<p>“Go for depth over breadth. Elaborating in detail about a particular thing for which you’re grateful carries more benefits than a superficial list of many things,” suggest authors Toby H. Birnbaum and Hershey H. Friedman of a report titled <a href=\"https:\/\/papers.ssrn.com\/sol3\/papers.cfm?abstract_id=2398117\">Gratitude and Generosity: Two Keys to Success and Happiness.<\/a><\/p>\n<p>The authors cite research performed by Sonja Lyubomirsky, a professor at the University of California, Riverside, which finds that gratitude journaling once or twice a week is more effective than daily journaling. “Lyubomirsky and her colleagues found that people who wrote in their gratitude journals once a week for six weeks reported boosts in happiness afterward; people who wrote three times per week didn’t.”<\/p>\n<h2>Gratitude and Your Real Estate Business<\/h2>\n<p>What sorts of things might you be grateful for? Perhaps new clients, a closed escrow, progress on your goals for the week, hitting the mark on the number of contacts you need to make, your family, your colleagues, football – anything really.<\/p>\n<p>Marcia Donaldson, a business success coach and trainer, suggests another method to jump start the gratitude habit. When faced with a challenge, try to seek out the good in the situation. She suggests making a game of it, to keep it interesting.<\/p>\n<p>Developing an attitude of gratitude won’t necessarily happen overnight. It takes time to learn a new mindset. Once you get the hang of it, though, you’ll never look back, says Donaldson. “As you practice being grateful, an inner shift begins to occur, and you may be delighted to discover how content and hopeful you are feeling. That sense of fulfillment is the key to your success in life and in business.”<\/p>\n<p><strong><em>So, what are you grateful for today?<\/em><\/strong><\/p>\n","protected":false},"excerpt":{"rendered":"<p>There’s an exercise instructor in St. Paul, Minn., who just celebrated the big one. One hundred years. Yup, 100 years old and she still teaches exercise techniques to fellow residents at her senior apartment complex. She began teaching 15 years ago – at the age of 85. To what does Lauretta Taggert attribute her longevity, [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":48217,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[83],"tags":[190,641,642,442,461,56,180],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/46181"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=46181"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/46181\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media\/48217"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=46181"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=46181"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=46181"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}