{"id":46481,"date":"2015-02-11T09:00:25","date_gmt":"2015-02-11T09:00:25","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=46481"},"modified":"2016-01-29T00:35:33","modified_gmt":"2016-01-29T00:35:33","slug":"facts-about-homebuyers","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/facts-about-homebuyers\/","title":{"rendered":"The Facts: What We Know About Homebuyers"},"content":{"rendered":"<p>Marketing needs direction. If you are in the business of buying or selling homes, you need to know who you’re marketing to.<\/p>\n<p>Of course, many real estate agents are working a niche, and local markets can vary widely. In general though, I’m a big advocate of what I call “selling to the fat part of the bell curve.” That means marketing and advertising to the broadest number of people who have an interest in buying or selling a home – <em>and<\/em> have the financial ability to do so. This involves gathering as much information as you can about your bread-and-butter prospects, including demographic, financial and behavioral data.<\/p>\n<p>So, here is what we know about homebuyers in 2014. This valuable resource can help you better market your services to buyers in your area.<\/p>\n<h2>Key Findings From the Annual NAR Report<\/h2>\n<p>The National Association of Realtors® recently released their annual publication of real estate statistics, the <strong><a href=\"http:\/\/www.realtor.org\/sites\/default\/files\/reports\/2014\/2014-profile-of-home-buyers-and-sellers-highlights.pdf\">2014 Profile of Home Buyers and Sellers<\/a><\/strong>.<\/p>\n<h3>Key Facts From the Report About Buyers<\/h3>\n<ul>\n<li>Forty percent of buyers choose their agent as a result of a referral from a friend or family member.<\/li>\n<\/ul>\n<ul>\n<li>Most buyers – two-thirds of them – only interview one agent.<\/li>\n<\/ul>\n<ul>\n<li>Buyers look at an average of 10 homes before buying.<\/li>\n<\/ul>\n<ul>\n<li>The new home search lasts for an average of 10 weeks – down from 12 weeks in 2012.<\/li>\n<\/ul>\n<ul>\n<li>First-time homebuyers are still down from historical levels. Thirty-three percent of recent homebuyers were first-time buyers. The historical norm is about 40 percent.<\/li>\n<\/ul>\n<ul>\n<li>The average age of first-time buyers: 31. The median household income of first-time buyers is $68,300.<\/li>\n<\/ul>\n<ul>\n<li>Average age of repeat buyers: 53. The median household income of repeat buyers is $95,000 per year.<\/li>\n<\/ul>\n<ul>\n<li>Sixty-five percent of recent homebuyers were married couples.<\/li>\n<\/ul>\n<ul>\n<li>More buyers are using agents: 89 percent of buyers used a real estate agent or broker. That’s up strongly from 69 percent in 2001.<\/li>\n<\/ul>\n<ul>\n<li>The simple desire to own a home was the number one motivator for purchases, with 24 percent reporting this as their leading reason to buy.  It far outstrips those who bought because of a job change involving relocation (9 percent), and those who bought because their family situation changed (8 percent).<\/li>\n<\/ul>\n<ul>\n<li>Ninety-two percent of homebuyers used the internet during their home search. (How’s your website looking?)<\/li>\n<\/ul>\n<ul>\n<li>The average age of a home purchased in 2014: 21 years.<\/li>\n<\/ul>\n<ul>\n<li>The average size of a home purchased in 2014: 1,870 square feet.<\/li>\n<\/ul>\n<ul>\n<li>The average home sold in 2014 had three bedrooms and two bathrooms.<\/li>\n<\/ul>\n<ul>\n<li>The average number of years buyers expect to remain in their homes: 12.<\/li>\n<\/ul>\n<ul>\n<li>Single-family homes were by far the most popular, accounting for 79 percent of homes sold in 2014.<\/li>\n<\/ul>\n<ul>\n<li>Only 13 percent of buyers over age 50 bought a home in a <a href=\"https:\/\/www.youtube.com\/watch?v=2pxQVejXwts\">senior-related development.<\/a><\/li>\n<\/ul>\n<ul>\n<li>Almost 9 in 10 buyers seriously considered heating and cooling costs when deciding whether to buy.<\/li>\n<\/ul>\n<ul>\n<li>Familiarize yourself with your area’s <a href=\"https:\/\/www.walkscore.com\/\">Walk Score<\/a>: 7 of 10 buyers consider commuting costs when making their decision.<\/li>\n<\/ul>\n<h3>The Millennial Buyer Dilemma<\/h3>\n<ul>\n<li><a href=\"http:\/\/www.usnews.com\/news\/articles\/2014\/04\/30\/homeownership-for-millennials-declines-to-historic-lows\">Millennials are lagging far behind<\/a> when it comes to homeownership, compared to previous generations at their age, according to U.S. News &amp; World Report.<\/li>\n<\/ul>\n<ul>\n<li>Nevertheless, the under-30 crowd would like to own someday – 74 percent expect to move in the next five years. During this time, millennials will form 8.3 million new households, <a href=\"http:\/\/demandinstitute.org\/sites\/default\/files\/blog-uploads\/millennials-and-their-homes-final.pdf\">reports the Demand Institute.<\/a><\/li>\n<\/ul>\n<h3>Key NAR Figures on Home Sellers<\/h3>\n<ul>\n<li>Nine percent of sellers attempted to do a FSBO (For Sale By Owner) transaction.<\/li>\n<\/ul>\n<ul>\n<li>Homes sold directly by owners sold at significantly lower prices, on average, than homes sold via a real estate agent: $208,700 vs. $235,000.<\/li>\n<\/ul>\n<ul>\n<li>Agents, on average, delivered 13 percent more value to the seller than those selling on their own, all other things being equal.<\/li>\n<\/ul>\n<h2>Important Mortgage Data<\/h2>\n<p>For mortgage data, we turn to the <a href=\"http:\/\/www.elliemae.com\/origination-insight-reports\/Ellie_Mae_OIR_DECEMBER2014.pdf\">December 2014 Origination Insight Report<\/a>, published by leading mortgage industry software maker Ellie Mae.<\/p>\n<ul>\n<li>The average FICO score for loan applicants who actually received approval on mortgages was 728. This figure has not changed much since 2013.<\/li>\n<\/ul>\n<ul>\n<li>The average FICO score on mortgages that were denied was 679.<\/li>\n<\/ul>\n<ul>\n<li>Average loan-to-value ratio on approved loans was down slightly, to 80 percent. Debt-to-income ratios averaged a 34\/38 front end\/back end.<\/li>\n<\/ul>\n<ul>\n<li>On average, the debt-to-income ratio on denied applications was 29\/46. This, of course, is very useful information to share with clients in the process of building up their credit before trying to buy a home.<\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>Marketing needs direction. If you are in the business of buying or selling homes, you need to know who you’re marketing to. Of course, many real estate agents are working a niche, and local markets can vary widely. In general though, I’m a big advocate of what I call “selling to the fat part of [&hellip;]<\/p>\n","protected":false},"author":34,"featured_media":48177,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[83],"tags":[190,254,403,421,42,209],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/46481"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/34"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=46481"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/46481\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media\/48177"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=46481"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=46481"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=46481"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}