{"id":4651,"date":"2012-04-23T06:00:59","date_gmt":"2012-04-23T14:00:59","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=4651"},"modified":"2022-10-24T10:21:26","modified_gmt":"2022-10-24T17:21:26","slug":"googleplus-real-estate-marketing","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/googleplus-real-estate-marketing\/","title":{"rendered":"Should Google+ Be a Part of Your Real Estate Marketing Plan?"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-full wp-image-6301\" title=\"Google Plus\" src=\"\/wp-content\/uploads\/2012\/04\/Nblog_googlePlus.jpg\" alt=\"\" width=\"300\" height=\"400\" \/><em>“Ask yourself if you want to enhance and expand the number of people who share your passions.” <\/em>&#8211; Guy Kawasaki, CEO of Alltop<\/p>\n<p>If you’ve spent any amount of time on the Internet each day, then you’ve probably heard of Google+. You may have asked yourself, “What is it and what does it do?” With all the new social media platforms popping up, I don’t blame you for getting lost in the chaos as you are building your real estate marketing tool kit.<\/p>\n<p><strong style=\"color: #7a003c;\"><span style=\"font-size: 13.0pt; line-height: 115%; &lt;br \/&gt;&lt;br \/&gt;&lt;br \/&gt;&lt;br \/&gt;&lt;br \/&gt; font-family: 'Calibri','sans-serif';\">Do you have the time for Google+? <\/span><\/strong><\/p>\n<p>Before I dive into the compelling reasons real estate agents should be on Google+, let me encourage you to consider carefully the pros and cons of tackling another real estate social network. Twitter and Facebook are enough work as it is, and to add another social media site might not be what’s best for you or your company’s real estate marketing plan if you don’t have the time to properly invest into it. Like any social media profile, it isn’t enough to create and leave it. Google+ must be maintained and developed on a daily basis in order for that component of your real estate marketing to be successful.<\/p>\n<p><strong style=\"color: #7a003c;\"><span style=\"font-size: 13.0pt; line-height: 115%; &lt;br \/&gt;&lt;br \/&gt;&lt;br \/&gt;&lt;br \/&gt;&lt;br \/&gt; font-family: 'Calibri','sans-serif';\">Google+ is for passions<\/span><\/strong><\/p>\n<p><strong style=\"color: #19398a;\">Guy Kawasaki<\/strong>, CEO of Alltop and former Chief Evangelist for Apple, wrote an excellent book called <a href=\"https:\/\/guykawasaki.com\/books\/what-the-plus\/\"><strong style=\"color: #19398a;\">“What the Plus!”<\/strong><\/a> where he outlines why he loves Google+. He doesn’t discount Twitter and Facebook, but he claims that each real estate social network satisfies different needs. If you’re looking for different perspectives you should visit Twitter. If you’re looking to keep up with people you already know, Facebook is the site to go to. But if you’re looking for a real estate social network to share your passions with people you know, Google+ is for you.<\/p>\n<p><strong style=\"color: #7a003c;\"><span style=\"font-size: 13.0pt; line-height: 115%; &lt;br \/&gt;&lt;br \/&gt;&lt;br \/&gt;&lt;br \/&gt;&lt;br \/&gt; font-family: 'Calibri','sans-serif';\">The top 4 reasons to use Google+<\/span><\/strong><\/p>\n<p><strong>1. In Google we trust:<\/strong> You may have heard some naysayers prophesize how Google+ is a dead-end network or you’ve seen for yourself how empty it may be—devoid of any followers you have on Twitter and Facebook. I would invite those who doubt Google+’s credibility to consider this: It’s a Google product. That means everything within Google’s power will be directed to support Google+. Billions of dollars and some of the most intelligent people on earth are backing this platform.<\/p>\n<p>I’m going to let this sink in for a little bit.<\/p>\n<p>Besides the most obvious factor that Google owns the heaviest flow of Internet traffic in the world, it will soon be integrated into every platform available. Gmail account users are already full-fledged Google+ users. Android and Motorola devices (tablets and smartphones) already have Google+ preinstalled.<\/p>\n<p>Even if you don’t have a Google email account, whenever you search on Google it’s impossible to miss it. Subtle signs to join Google+ are integrated within Google search results.<\/p>\n<p><em>“Google+ is Google itself. We’re extending it across all that we do—search, ads, Chrome, Android, Maps, Youtube—so that each of those services contributes to our understanding of who you are” <\/em>-Bradley Horowitz, VP of Products for Google+<\/p>\n<p>Understand that while Google+ may seem quiet now, it will not go away so long as Google remains the dominant search engine.<\/p>\n<p><strong>2. Become a pioneer:<\/strong> Google+ is still new and there are relatively very few people who are active engagers. It is easy to get lost in the crowds of followers on Twitter and Facebook. However, active, meaningful engagement on Google+ is valuable right now because there just isn’t a lot of it going on.<\/p>\n<p>Establishing yourself while Google+ is still young is vital because if you consistently work at providing quality information and expanding your real estate social network, you will find that not only will you build relationships within social media itself, but Google+ will recognize your real estate marketing activity and include you in search results. This means that if you consistently post about specific keywords, then the chances of you appearing within search results for those keywords will improve your Google rankings.<\/p>\n<p><strong>3. Share your passion: <\/strong>One of the best Google+ profiles is <strong style=\"color: #19398a;\">The Corcoran Group<\/strong>, organized by <strong style=\"color: #19398a;\">Matthew Shadbolt<\/strong>.<\/p>\n<p>The Corcoran Group has over 2,000 people following them on Google+ for one purpose: their passion for New York. It is clear from their daily posts and photos that they’re trying to convey a simple message of what it would be like to live in New York City. Each post is an example of how passionate they are about their city, which is made more vivid by a photo attachment.<\/p>\n<p>As Kawasaki and Shadbolt have both figured out, Google+ enables users to share their passions with others in a simple, yet elegant way.<\/p>\n<p><strong>4. Engagement:<\/strong> Google+ completely dominates Facebook and Twitter capabilities for meaningful, in-depth engagement. Not only do you have thousands more characters to work with, but you have video conferencing, clean photo display in posts, and high visibility of posts. These features provide more opportunity to establish trust with fellow agents, past clients, current clients, and even future clients.<\/p>\n<p><strong style=\"color: #7a003c;\"><span style=\"font-size: 13.0pt; line-height: 115%; &lt;br \/&gt;&lt;br \/&gt;&lt;br \/&gt;&lt;br \/&gt;&lt;br \/&gt; font-family: 'Calibri','sans-serif';\">Leverage Google+ for your real estate marketing<\/span><\/strong><\/p>\n<p>Google’s reputation, the chance to become a pioneer, defining your passion, and excelling at engagement are all compelling reasons to join Google+. Whether you’re passionate about the real estate industry or your local area (or even both) you can easily share both on Google+.<\/p>\n<p>Google+ should not be seen as a lead generation tool. It is a social network and your profile should represent who you are as a professional and as a person. However, while I cannot guarantee you will generate leads by staying active on Google+, there is definitely no downside to staying active on the largest search engine’s social media site.<\/p>\n<p><strong style=\"color: #7a003c;\"><span style=\"font-size: 13.0pt; line-height: 115%; &lt;br \/&gt;&lt;br \/&gt;&lt;br \/&gt;&lt;br \/&gt;&lt;br \/&gt; font-family: 'Calibri','sans-serif';\">Learn how to set up your Google+ account<\/span><\/strong><\/p>\n<p>To learn how to set up your Google+ account, watch the pre-recorded Market Leader workshop, <strong>“Google+: Step-by-Step.”<\/strong> You’ll also get tips for leveraging Google+ to build relationships, generate leads, and show up in Google’s search results.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>“Ask yourself if you want to enhance and expand the number of people who share your passions.” &#8211; Guy Kawasaki, CEO of Alltop If you’ve spent any amount of time on the Internet each day, then you’ve probably heard of Google+. You may have asked yourself, “What is it and what does it do?” With [&hellip;]<\/p>\n","protected":false},"author":33,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[34,35,36],"tags":[68,72],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/4651"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/33"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=4651"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/4651\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=4651"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=4651"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=4651"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}