{"id":46611,"date":"2015-02-18T09:00:15","date_gmt":"2015-02-18T09:00:15","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=46611"},"modified":"2016-01-29T00:34:48","modified_gmt":"2016-01-29T00:34:48","slug":"9-ways-to-help-clients-improve-credit-scores","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/9-ways-to-help-clients-improve-credit-scores\/","title":{"rendered":"9 Ways to Help Clients Improve Credit Scores"},"content":{"rendered":"<p>Being a real estate agent isn’t just about getting listings and showing houses. Many times, you’ll also need to help develop prospective buyers – turning them from renters into homeowners by coaching them on their credit and how to improve their access to financing.<\/p>\n<p>It isn’t about getting them into bigger loans than they can afford. It’s about maximizing their choices (and your commissions.) The bottom line: The better your clients’ credit score, the lower the interest rate, and the bigger the mortgage they will qualify for at any level of income.<\/p>\n<p>Many real estate agents are facing an uphill battle when it comes to credit. <a href=\"http:\/\/assetsandopportunity.org\/assets\/pdf\/2015_Scorecard_Report.pdf\">According to a recent survey<\/a> from the Corporation for Enterprise Development, the majority of Americans have subprime-level credit scores. Simply put, America’s credit sucks.<\/p>\n<p>With today’s tools, there’s no reason for any buyer, or real estate agent helping a buyer, to get surprised by a credit turn-down when applying for a mortgage to buy an owner-occupied home. If the buyer doesn’t walk in with a prequalification letter in hand, always run a credit check and address any issues on the front end. Here are some steps to help make the credit process easier, for both of you.<\/p>\n<h2>1. Check Your Client’s Credit<\/h2>\n<p>How can you run a credit check? It’s easy nowadays. First, everyone is entitled to one free credit report per year from each of the major credit bureaus. If a client doesn’t have a recent one handy, the beginning of the househunting process is a great time to pull it.<\/p>\n<p>Second, you can use the credit bureau services themselves. For example, <a href=\"http:\/\/www.experian.com\/connect\/real-estate-brokers-agents-check-clients-credit.html\">Experian Connect<\/a> allows real estate professionals to review a client’s credit report and score. The client pays a fee of $14.95.<\/p>\n<h2>2. Review the Credit Report Together<\/h2>\n<p>Go over the credit report with your prospect, line by line. Are there any false reports? Identify them, and educate your client on how to get them removed from the credit report.<\/p>\n<h2>3. Take Care of Any Late Debts<\/h2>\n<p>Are there any late debts that can quickly be brought current? Take care of those right away. You don’t want to get to the mortgage application stage with anything currently delinquent, whatsoever. Take care of all the 30-, 60- and 90-day delinquent ash and trash that shows up, and keep things current until the ink on the deed is dry.<\/p>\n<h2>4. Pay Off Old Debts<\/h2>\n<p>Are there any old debts that can be paid off or settled? A “paid” notation looks a lot better than a “settled” one, but “settled” will do in a pinch.<\/p>\n<p>One bit of news: The newest update to the Fair Isaac Corporation’s software that determines credit scores, known as FICO 9, actually bypasses old debts that have been paid off or settled in full. The new algorithm also cuts creditors some slack by not weighting medically-related debt as much. The bad news: That won’t mean much for mortgage applicants for a while. Almost no one in the business has adopted FICO 9 as its underwriting standard. Most of the banking and mortgage industry is still on FICO 4, released years ago.<\/p>\n<h2>5. Pay Down Existing Balances on Credit Cards<\/h2>\n<p>Sure, it’s ok to have one or two credit cards. But advise clients to keep the utilization rate down – ideally to 10 percent or less. You want to be able to show the bank that your buyer has some wiggle room. Things aren’t maxed out. This shows the bank two things:<\/p>\n<ul>\n<li>Your clients are able to live within their means.<\/li>\n<li>They have some credit headroom in the event of an unanticipated cash crunch or emergency.<\/li>\n<\/ul>\n<p>When it comes to available credit, it’s better to have it and not need it than to need it and not have it – or to have it used up!<\/p>\n<h2>6. Ask Creditors to Drop Late Payment Reports<\/h2>\n<p>Is the customer’s record clean except for one or two 30-day-late reports? It won’t hurt to ask the creditor for a “goodwill deletion.”<\/p>\n<p>Another possible approach is re-aging. Here’s how it works: If a client went through a cash crunch at some time in the past and fell behind on some bills, but the crisis is over and the client is able to show the creditor an ability to pay, the lender may be willing to “re-age” the account. That is, essentially drop late payments and late fees from the record.<\/p>\n<p>You can’t go to that well too often, though. Many lenders won’t do it more than once in a one-to-five year period. Others won’t do it unless there’s a formal payoff plan in place, set up by a credit counseling organization. But nobody dings a FICO score just for asking.<\/p>\n<h2>7. Ask Creditors to Lower a Client’s Interest Rate<\/h2>\n<p>Ask credit card issuers if they can lower the interest rate on a good customer. Most lenders would rather do that than have a customer transfer a balance. Your customer’s debt is an <em>asset<\/em> to the bank! If you can get a credit card company to lower the interest rate, you also lower the monthly minimum debt service. This improves the debt-to-income ratio and makes it that much easier for an iffy application to qualify for a loan, or to get bumped up to a better risk category.<\/p>\n<h2>8. Educate Prospects About Credit Counseling Services<\/h2>\n<p>Not every credit counselor is legit, and there are many scams out there preying on desperate people pursuing the dream of homeownership. For clients who choose to use a credit counseling service, <a href=\"https:\/\/www.consumer.ftc.gov\/articles\/0153-choosing-credit-counselor\">share this information<\/a> from the Federal Trade Commission with them.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Being a real estate agent isn’t just about getting listings and showing houses. Many times, you’ll also need to help develop prospective buyers – turning them from renters into homeowners by coaching them on their credit and how to improve their access to financing. It isn’t about getting them into bigger loans than they can [&hellip;]<\/p>\n","protected":false},"author":34,"featured_media":48179,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[83],"tags":[190,124,643,553,644,558,56],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/46611"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/34"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=46611"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/46611\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media\/48179"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=46611"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=46611"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=46611"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}