{"id":48785,"date":"2016-02-05T06:00:10","date_gmt":"2016-02-05T06:00:10","guid":{"rendered":"http:\/\/65.197.142.60\/?p=48785"},"modified":"2016-02-02T20:18:24","modified_gmt":"2016-02-02T20:18:24","slug":"3-ways-to-prevent-your-voicemail-message-from-losing-you-business","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/3-ways-to-prevent-your-voicemail-message-from-losing-you-business\/","title":{"rendered":"3 Ways to Prevent Your Voicemail Message From Losing You Business"},"content":{"rendered":"<p>If it’s been awhile since you recorded your voicemail message, you might not even remember what it says. But our guess is it says something like this:<\/p>\n<p><em>Hi, you’ve reached John Smith with Acme Realty. I’m not available now, but leave me a message and I’ll get back to you as soon as possible. Thanks for calling!<\/em><\/p>\n<p>It’s clear and concise, but lacks personality and only gives callers one option for how to proceed: leave you a message, then wait for you to call back. Clearly, the callers who hear your voicemail want something from you. They have questions about listings, the services you provide, or the health of the local housing market that your voicemail doesn’t address. Worse still, they may reach out to another agent if they want their questions answered quickly. “Clear and concise” are not desirable voicemail message attributes if they cost you business.<\/p>\n<p><strong>Here are three ideas for making your voicemail message more effective and interesting:<\/strong><\/p>\n<h2>Put a Call to Action in Your Voicemail Message<\/h2>\n<p>Reduce the chances of losing clients by changing your voicemail message to something like this:<\/p>\n<p><em>Hi, this is John Smith from Acme Realty. I’m currently helping another customer, but can’t wait to help you too! Please leave me a short message with your number and I’ll call back as soon as possible. In the meantime, please visit my website, www.AcmeRealty.com, for access to home listings, market information, and descriptions of the services we provide.<\/em><\/p>\n<p>This style of voicemail message is a little longer, but it greatly mitigates the chances that potential clients will also reach out to your competitors by giving your callers actionable items that can be accomplished right away. This voicemail template can be supplemented or replaced by an offer for an online freebie (e.g., a downloadable guide about the homebuying process), instructions on how to sign up for your newsletter, or an invitation to follow you on social media.<\/p>\n<hr \/>\n<p>\n<a href=\"http:\/\/www.marketleader.com\/products\/professional-for-agents\/\"><img class=\"alignleft size-medium wp-image-44201\" src=\"http:\/\/www.marketleader.com\/wp-content\/uploads\/2016\/02\/Blog-CTA-arrows-2.png\" alt=\"Learn more about the Market Leader Professional agent branded websites\"><\/a><strong><em>Market Leader Professional’s agent branded websites feature MLS listings and housing market data and are designed to collect leads and capture visitors&#8217; search criteria. <\/em><a href=\"http:\/\/www.marketleader.com\/products\/professional-for-agents\/\">LEARN MORE &gt;&gt;<\/a><\/strong><\/p>\n<hr \/>\n<h2>Give Your Voicemail Message Some Personality<\/h2>\n<p>Our favorite voicemail message belongs to a friend of ours, Larry Flynn, who works as an auctioneer for the nonprofit and real estate industries. His voicemail starts with a typical preamble: “This is Larry Flynn. I’m sorry I missed you. Please leave a message.” But Flynn then goes on to imbue his voicemail with a bit of personality and humor by saying, in his practiced auctioneer’s voice: “I’ll call you back in 5, 10, 15, 20 …”. It’s hard not to crack a grin on hearing this endearing message.<\/p>\n<p>Given that the majority of consumers end up working with the first real estate agent they speak with, it’s vital that your voicemail message endear you to new contacts so as to leave the best possible first impression. Giving a glimpse of your personality and other noteworthy things about you in your voicemail message will make you more memorable to callers, and thus more likely to get their business.<\/p>\n<h2>Test Different Styles of Voicemail Message<\/h2>\n<p>There are no additional expenses associated with changing your voicemail message, and doing so takes hardly any time. It therefore behooves real estate professionals like yourself to try out different styles of voicemail message to see which one works best.<\/p>\n<p>For example, while elaborating on the content available on your website may greatly increase the length of your voicemail message, it may also serve to increase the chances callers actually visit it. So, when it comes to your voicemail message, remember this mantra: “Always Be Testing!”<\/p>\n","protected":false},"excerpt":{"rendered":"<p>If it’s been awhile since you recorded your voicemail message, you might not even remember what it says. But our guess is it says something like this: Hi, you’ve reached John Smith with Acme Realty. I’m not available now, but leave me a message and I’ll get back to you as soon as possible. Thanks [&hellip;]<\/p>\n","protected":false},"author":33,"featured_media":48533,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[83],"tags":[],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/48785"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/33"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=48785"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/48785\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media\/48533"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=48785"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=48785"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=48785"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}