{"id":4881,"date":"2012-05-01T06:00:34","date_gmt":"2012-05-01T14:00:34","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=4881"},"modified":"2021-11-12T09:04:19","modified_gmt":"2021-11-12T17:04:19","slug":"pinterest-online-real-estate-marketing","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/pinterest-online-real-estate-marketing\/","title":{"rendered":"Use Pinterest to Boost Your Online Real Estate Marketing"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignleft size-full wp-image-6281\" title=\"Pinterest\" src=\"\/wp-content\/uploads\/2012\/05\/Nblog_pinterest.jpg\" alt=\"\" width=\"300\" height=\"400\" \/>Pinterest is on a steep rise of success. It is unlike any other social media tool, which adds a nice mix to your online real estate marketing toolkit. More than a fifth of all Pinterest users connect with their personal Facebook profile and its user numbers continue to rise well over 10 million. Impressively, the number of Pinterest referral traffic tops the number of YouTube, LinkedIn, and Google+ referral traffic combined.<\/p>\n<p>Similar to other social media dashboards, Pinterest is used to share pictures and information—and any real estate agent can attest to the power of using images in their online real estate marketing. Interaction between Pinterest users revolves solely around “pins.” When one photo is pinned, other users can “like” the posted pin, comment on it, and\/or re-pin to their own board. Though there are many other social media platforms, now is the time to become an expert “pinner” before the rest of the world jumps on board. Let Pinterest be the new addition to your online real estate marketing toolkit.<\/p>\n<p><strong style=\"color: #7a003c;\"><span style=\"line-height: 115%; font-size: 13pt; br: 'Calibri','sans-serif';\">Here&#8217;s how your real estate business can benefit from using Pinterest<\/span><\/strong><\/p>\n<p><strong>Be a “tour guide” for prospective clients.<\/strong> Show off what there is to do around your community and city. Think about pinning things that would appeal to numerous types of buyers—such as dog parks, museums, shopping centers, and great restaurants. Pin photos of annual events that your city holds. Give people a reason to want to buy in your area and show that you know the ins and outs of your city. Not only does this create an interesting board, it will help lure potential buyers to you.<\/p>\n<p><strong>Showcase homes you are selling.<\/strong> Pinterest offers an effective way to highlight your top listings. Pin only quality pictures of your listings and always include the link to your real estate website (but only if it is your own photo to prevent any legal issues). Pinning these photos also gives you a great opportunity to show potential out-of-the-area buyers the style of houses and landscaping available in your area. This will provide them with what to expect when searching for their home.<\/p>\n<p><strong>Let your inner interior designer out.<\/strong> Do you have great pictures of staged homes you’re selling? Pin those pictures and give recommendations on how to make a sellers house really stand out. If you sought out help to stage the house, link the designer’s webpage to the pin in order to give credit and potentially reach even more consumers.<\/p>\n<p><strong>Offer moving-day tips for buyers and sellers.<\/strong> Give information on the legalities of purchasing a home and how to best prepare a family for a move, whether it’s big or small. Showing your prospective clients that you are there for the long haul–not just the transaction—will give you an edge over other real estate agents.<\/p>\n<p><strong>Provide backgrounds and thank you’s.<\/strong> Give your Pinterest account a personal feel by posting photos with a short background on you and your employees\/co-workers. This background board could also be used in combination with a “thank you” board to previous clients.<\/p>\n<p>Remember that there is no set culture yet on Pinterest. The most important thing to remember is that it’s a place to show off your best and most relevant content to your followers through images. Keep each board organized and interesting to maximize another social arena of your online real estate marketing.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Pinterest is on a steep rise of success. It is unlike any other social media tool, which adds a nice mix to your online real estate marketing toolkit. More than a fifth of all Pinterest users connect with their personal Facebook profile and its user numbers continue to rise well over 10 million. Impressively, the [&hellip;]<\/p>\n","protected":false},"author":33,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[34,35,36],"tags":[77,74],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/4881"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/33"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=4881"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/4881\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=4881"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=4881"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=4881"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}