{"id":49807,"date":"2016-03-09T08:00:55","date_gmt":"2016-03-09T16:00:55","guid":{"rendered":"http:\/\/www.marketleader.com\/?p=49807"},"modified":"2016-03-31T15:54:33","modified_gmt":"2016-03-31T22:54:33","slug":"market-leader-update-going-strong-and-better-than-ever","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/market-leader-update-going-strong-and-better-than-ever\/","title":{"rendered":"Market Leader Update: Going Strong and Better Than Ever"},"content":{"rendered":"<p>You may have noticed Market Leader has experienced some changes over the last couple of years. Through all these changes, we have continued to focus on what we do best: delivering powerful sales and marketing solutions for real estate professionals. We’re excited to have found a home with Constellation Software, Inc., a leading provider of vertical market software solutions. This new ownership couldn’t be better for the 200,000 real estate professionals who use Market Leader’s software and exclusive leads.<\/p>\n<p>The fact that Market Leader is no longer owned by a residential real estate portal is a boon to the agents and teams who are our customers, as the change in ownership has given us the freedom to exclusively focus on improving and innovating on our core products. We are more passionate than ever about helping to make agents more productive and successful through outstanding products, leads, education, and customer support.<\/p>\n<p>We have capitalized on this renewed focus by delivering a host of improvements to our customers’ software over the last year to make it more powerful and intuitive than ever before.<\/p>\n<p><strong>Some highlights from our most impactful recent releases include:<\/strong><\/p>\n<h2>Websites<\/h2>\n<ul>\n<li>Updated property detail pages feature larger listing photos, full-width property maps, and better-organized information.<\/li>\n<li>Website visitors can become contacts more easily now that they can log in to your website using Facebook and you can adjust the number of listings they can view before being required to log in.<\/li>\n<li>New SEO features allow you to add custom pages and create and edit page meta titles and descriptions to improve your website’s SEO and attract more visitors to it.<\/li>\n<\/ul>\n<h2>Marketing Tools<\/h2>\n<ul>\n<li>Use a powerful visual editor to craft personalized HTML-optimized email campaigns, including birthday and new home anniversary campaigns. These emails can hyperlink text and images, be previewed in mobile and desktop views and with test emails, and are less likely to be intercepted by spam filters.<\/li>\n<li>Create real-time email alerts that notify your contacts as soon as there is a new or updated listing that meets their search criteria. New listings can go from being added to your MLS to being delivered to your contacts’ email inboxes in as little as 15 minutes!<\/li>\n<li>Receive notifications once contacts complete marketing campaigns so you can add them to additional campaigns.<\/li>\n<\/ul>\n<h2>CRM<\/h2>\n<ul>\n<li>Our new contact search is incredibly powerful and easy to use and allows you to quickly and easily search for contacts from every page in your system. Know how to use Google? The new contact search is as easy as that and helps you find contacts via name, phone, or email immediately. This enhanced search functionality also allows you to better locate contacts in your system that have fallen off your radar.<\/li>\n<li>The new dashboard&#8217;s simplified notification badges help you focus on the things you need to get done, from viewing outstanding reminders to responding to unread emails.<\/li>\n<\/ul>\n<h2>Productivity Tools<\/h2>\n<ul>\n<li>Daily insight emails alert you to who visited your website the previous day and tell you about that day’s reminders, helping you quickly follow up with relevant content.<\/li>\n<li>Manage your reminders more efficiently by adding, viewing, completing, and removing reminders for multiple contacts simultaneously. <\/li>\n<li>Better track your marketing activities and contact database size and value with an updated performance evaluator dashboard.<\/li>\n<\/ul>\n<p>Market Leader has made a ton of improvements to our core products in recent months, and it’s safe to say we’re just getting started. Upcoming product releases will include more marketing automation, website analytics, lead routing, and a powerful mobile app that will be a must-use for top-performing agents on the go.<\/p>\n<p>It has truly been a pleasure for us to serve the real estate industry for the last 16 years, and we look forward to helping agents and teams manage and grow their businesses for many years to come.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>You may have noticed Market Leader has experienced some changes over the last couple of years. Through all these changes, we have continued to focus on what we do best: delivering powerful sales and marketing solutions for real estate professionals. We’re excited to have found a home with Constellation Software, Inc., a leading provider of [&hellip;]<\/p>\n","protected":false},"author":33,"featured_media":49871,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[51],"tags":[681,267,126,87,159,143,679,136],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/49807"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/33"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=49807"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/49807\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media\/49871"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=49807"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=49807"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=49807"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}