{"id":50099,"date":"2016-03-21T11:27:11","date_gmt":"2016-03-21T18:27:11","guid":{"rendered":"http:\/\/www.marketleader.com\/?p=50099"},"modified":"2017-08-10T12:40:28","modified_gmt":"2017-08-10T19:40:28","slug":"introduction-to-seo-for-real-estate-agents","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/introduction-to-seo-for-real-estate-agents\/","title":{"rendered":"Introduction to SEO for Real Estate Agents"},"content":{"rendered":"<p>Fundamentally, search engine optimization (or SEO) is about making search engines happy &#8211; convincing them that they should send their users to your website by placing your website’s pages higher in their search engine results pages.<\/p>\n<p>The higher your website’s pages rank in search engine results pages, the more likely they are to get clicked on by search engine users. This is the ultimate goal of SEO &#8211; to get more people to visit your website from search engines. (This form of non-paid website traffic is also called “organic” traffic.)<\/p>\n<p>Unfortunately for newcomers, SEO is an incredibly deep and complicated subject. There are thousands of very smart and talented people who have devoted their careers to SEO, and there are more SEO blogs, books, consultants, and thought leaders than you can shake a stick at.<\/p>\n<p>Intimidated by SEO? <strong>Don’t be. <\/strong>You don’t need to be an SEO guru to generate organic traffic for your website. Just like you don’t need an MBA from a prestigious university to start and manage a successful business, it’s possible to attain a healthy amount of organic traffic for your website if you adhere to some basic web design and content principles.<\/p>\n<h2>Make More Commission Income &#8211; for Free &#8211; Using SEO<\/h2>\n<p>The reason why organic traffic is so important, and why people care about SEO so much, is that organic traffic is free. (Beyond the monetary and time costs associated with creating your website and its content, of course.) This arrangement is infinitely preferable to paid advertising, where every incremental visitor has a cost directly associated with them, or traffic from referral relationships, which are typically difficult and time-intensive to create.<\/p>\n<p>Real estate professionals can therefore generate more leads and, in turn, increase their commission income <strong>for free<\/strong> simply by boosting the amount of people who organically visit their websites from search engines.<\/p>\n<p>However, it’s important to remember that SEO isn’t a tool or trick you can use to game search engines. Rather, it’s a set of fairly basic best practices related to the design and content of websites.<\/p>\n<p>This is why simply <strong>having <\/strong>a website isn’t enough. <a href=\"http:\/\/www.marketleader.com\/products\/professional-for-agents\/\">Like the agent-branded websites Market Leader provides<\/a>, your website must set you up for success from the get-go, in terms of adhering to design and content best practices that will help you generate (and, importantly, convert) organic traffic.<\/p>\n<h2>SEO Is Like a Busy Retail Street<\/h2>\n<p>To better illustrate what SEO is, think of a small-town shoe shop on a busy street lined with retail stores in the pre-Internet era. In order to stay in business, the owner of this shoe shop needs to figure out how to get people to enter their store and buy their shoes.<\/p>\n<p>One option for accomplishing this is paid advertising. The shoe shop owner can buy newspaper, radio, and TV advertisements to increase exposure for their business or spread the word about sales and promotions. Unfortunately, not everyone has the budget or expertise for advertising. This shoe shop owner, like many small business owner, has neither of those requirements.<\/p>\n<p>Another option is to adhere to the best practices for optimizing retail stores like shoe shops so that they draw in as many people inside from off the busy retail street as possible. These people are a free source of new business; beyond the cost of any in-shop changes or additions the shoe shop owner makes, it doesn’t cost them a dime to bring these potential new customers in from off the street.<\/p>\n<p>So how does this shoe shop relate to SEO? In this example, the shoe shop is your website. The newspaper, radio, and TV advertisements are the many online paid advertising options available to agents. The flow of people who stroll down the busy retail street are search engine users. By optimizing your shoe shop (website) using certain best practices, you can do a better job convincing people on the street (search engine users) that they should become your customers (or visit your website).<\/p>\n<hr \/>\n<p>\n<a href=\"http:\/\/www.marketleader.com\/products\/professional-for-agents\/\"><img class=\"alignleft size-medium wp-image-44201\" src=\"http:\/\/www.marketleader.com\/wp-content\/uploads\/2016\/02\/Blog-CTA-arrows-2.png\" alt=\"Learn more about the Market Leader Professional agent branded websites\"><\/a><em><strong>Want more leads from your website?<\/strong> Market Leader Professional’s agent branded websites use MLS listings and housing market data to collect leads and capture visitors&#8217; search criteria. <\/em><strong><a href=\"http:\/\/www.marketleader.com\/products\/professional-for-agents\/\">LEARN MORE &gt;&gt;<\/a><\/strong><\/p>\n<hr \/>\n<h2>SEO Is Particularly Important for Agents<\/h2>\n<p>As you’re undoubtedly already aware, the Internet is incredibly important for generating new business across the vast majority of industries. This is especially true for the real estate industry.<\/p>\n<p>Looking at listings and getting market data, which used to be a chore for consumers, is now made exceptionally easy by the Internet. It’s possible to do both from the comfort of your own home, or even while you’re on the go by using a smartphone.<\/p>\n<p><img loading=\"lazy\" src=\"\/wp-content\/uploads\/2016\/03\/Consumer-using-laptop-computer.jpg\" alt=\"SEO is particularly important for real estate agents\" width=\"300\" height=\"200\" class=\"alignright size-full wp-image-50105\" \/>The Internet is also important for real estate professionals because the majority of consumers start their research online. For example, a relatively recent NAR survey found that about 90 percent of home buyers start their home buying journey on the Internet. Given that the majority of consumers work with the first agent they connect with, it’s incredibly important for agents do all they can to make first contact with prospective buyer and seller clients &#8211; using the Internet &#8211; before other agents do.<\/p>\n<p>Using SEO to dominate search engine results pages for local real estate-related keywords, like “Seattle homes for sale” and “Seattle real estate,” can therefore greatly help an agent’s business.<\/p>\n<h2>Understanding How Search Engines Work<\/h2>\n<p>Just like any newbie agent needs to learn about the mindsets of home buyers and sellers, any agent being introduced to SEO should also learn how search engines actually work.<\/p>\n<p>The fundamental purpose of search engines is to guide users to the web content they’re looking for. Search engines survive by successfully serving up the webpages that their users want. Google is the world’s most-used search engine, with about a 65 percent market share of the world’s total search queries, primarily because it provides the best search results for its billions of users.<\/p>\n<p>So how does Google determine where to place your website’s pages in its search engine results pages? Google has several hundred ranking factors that range from things on your website (called on-page ranking factors), like the usage of keywords in page titles, to things off your website (called off-page ranking factors), including the number of links pointing your website from other websites.<\/p>\n<p>No one knows exactly what all of these ranking factors are or precisely how important each one is. However, through observation, search engine optimizers have a very good idea of what the most important ranking factors are, and this provides us with the valuable best practices mentioned throughout this article.<\/p>\n<p>To make matters more complicated, search engines constantly update their algorithms, which are the formulas that determine where pages should rank in search results. Because of these algorithm updates, websites can experience dramatic fluctuations in the amount of organic traffic they receive, even if no substantial changes are made to them from an SEO perspective.<\/p>\n<p>Algorithm updates are made to better serve up the content search engines’ users are looking for. On the whole, they’re undeniably a good thing. Spammy SEO strategies that used to work very well, like <a href=\"http:\/\/www.kickstartcommerce.com\/link-wheels-bad-seo-strategy.html\">“link wheels”<\/a> and <a href=\"https:\/\/en.wikipedia.org\/wiki\/Keyword_stuffing\">“keyword stuffing,”<\/a> caused search engines to often deliver unhelpful search results. Thanks to algorithm updates, these spammy strategies are now detrimental to the websites that still use them.<\/p>\n<p>Given the sheer volume of ranking factors that exist, and that search engine algorithms are constantly changing, anyone who tells you there’s just one thing you need to know about SEO, or that they know a trick that will give you all the organic traffic you could possibly want, they’re either lying or don’t know what they’re talking about.<\/p>\n<h2>Three Vital Things to Remember About SEO<\/h2>\n<p>Let’s face it: You’re a real estate professional, not a digital marketing expert. You have an exceptionally busy schedule closing deals with home buyers and sellers, so you probably only have the time and bandwidth to learn the most salient points about SEO.<\/p>\n<p>Here are the three most important things for you to remember about SEO:<\/p>\n<ol>\n<li><strong>Put people first.<\/strong> Ultimately, the webpages that get the most organic traffic from search engines are the ones that are most appealing to actual humans.<\/li>\n<li><strong>Focus on high-quality content and design.<\/strong> You can excel at SEO &#8211; generate a ton of organic traffic &#8211; without being an expert on that subject if you focus on creating high-quality content and adhering to basic design principles.<\/li>\n<li><strong>Don’t try to fool search engines.<\/strong> It’s dangerous to think of SEO as something you can use to game search engines. Most SEO tricks you’ll hear about don’t work anymore, if they ever worked at all. If there are SEO tricks that do currently work, they likely won’t work for long. Don’t listen to anyone who tells you otherwise!<\/li>\n<\/ol>\n","protected":false},"excerpt":{"rendered":"<p>Fundamentally, search engine optimization (or SEO) is about making search engines happy &#8211; convincing them that they should send their users to your website by placing your website’s pages higher in their search engine results pages. The higher your website’s pages rank in search engine results pages, the more likely they are to get clicked [&hellip;]<\/p>\n","protected":false},"author":28,"featured_media":50103,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[50],"tags":[119,689,687,305,134],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/50099"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/28"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=50099"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/50099\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media\/50103"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=50099"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=50099"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=50099"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}