{"id":50263,"date":"2022-08-04T14:37:03","date_gmt":"2022-08-04T21:37:03","guid":{"rendered":"http:\/\/www.marketleader.com\/?p=50263"},"modified":"2022-11-07T10:31:15","modified_gmt":"2022-11-07T18:31:15","slug":"real-estate-closing-gifts","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/real-estate-closing-gifts\/","title":{"rendered":"Should Agents Give Real Estate Closing Gifts? Arguments for and Against"},"content":{"rendered":"<p>Welcome to the long-standing discussion about whether agents should give real estate closing gifts to their clients. Of course, we won’t settle the matter here. But reaching a universal conclusion that works for every agent everywhere for all time isn’t really the point anyway.<\/p>\n<p>The question behind the question is (or at least should be): What’s the best way an agent can build a strong relationship with their clients after a closing, and does gift-giving have anything to do with that?<\/p>\n<p>Ultimately, only you can decide what’s best for your business and your clients.<\/p>\n<p>Let’s start with the objections.<\/p>\n<h2 class=\"BlogH2\">The 2 Main Arguments Against Giving Real Estate Closing Gifts<\/h2>\n<h3 class=\"BlogH3\">What’s the Point?<\/h3>\n<p>In other words, a real estate closing gift serves no purpose. Or so the argument goes.Not only will you discover the only good reason to give real estate closing gifts, you’ll also learn how to do it. Plus, you’ll get 8 closing gift ideas!<\/p>\n<p>Why should an agent give their clients a gift after closing? Is it to keep up with expectations? To give just because every other agent gives? To keep you at the top of your clients’ minds?<\/p>\n<p>Those are valid reasons to give. But this first objection calls all of those reasons into question and gets us wondering if it “works,” if gift-giving is really worth it. If not, what’s the point?<\/p>\n<h3 class=\"BlogH3\">It Isn’t Necessary.<\/h3>\n<p>The whole concept of a service provider giving a gift to the beneficiary after a job well done is unique to real estate. It’s not a common practice in any other industry.<\/p>\n<p>For example, doctors, hairdressers, accountants, plumbers, lawyers – none of them give gifts to their clients after they provide their services. Perhaps because the service is the gift.<\/p>\n<p>Besides, aren’t real estate closings simply another business transaction? You made the sale. In exchange for your services, you got paid a percentage of the sales price of the home. All parties are satisfied with the outcome. The end.<\/p>\n<p>If we follow this logic, it leads us to see a closing gift as just that: a gift. And by definition, that means it’s unwarranted, a bonus, an extra. It might be a nice gesture or even useful for retention purposes, but it’s not necessary.<\/p>\n<h2 class=\"BlogH2\">The Best (&amp; Only) Reason To Give Real Estate Closing Gifts<\/h2>\n<p>Yes, gifts show appreciation. And sure, gifting a client may feel like the “right thing to do.” But let’s be honest. It may not always be purely altruistic. There may be ulterior motives involved in closing gifts from Realtors.<\/p>\n<p>There’s nothing bad or wrong with that. It’s perfectly okay to admit you’re hoping to remain top-of-mind with the client or that you’re dreaming of future referrals.<\/p>\n<p>The point here is simply to notice (and be honest about) the purpose your closing gifts serve so you can be more intentional about the gifts you choose.<\/p>\n<p>As you know, creating and nurturing strong, long-lasting relationships with your clients is essential for success in real estate. It’s <a href=\"https:\/\/www.marketleader.com\/blog\/the-lost-art-of-lead-conversion\/\">how you capture and convert leads<\/a>. It’s why <a href=\"https:\/\/www.marketleader.com\/solutions\/crm\/\">you get the most robust CRM<\/a>. And it’s the best reason to give real estate closing gifts.<\/p>\n<h2 class=\"BlogH2\">How To Give Real Estate Closing Gifts<\/h2>\n<p>If you’ve decided that giving closing gifts is a good idea for your business and your clients, keep in mind that the “how” matters as much as the “what.” Here are some helpful tips.<\/p>\n<h3 class=\"BlogH3\">Choose the Best Time<\/h3>\n<p>Shortly after closing you’re already top-of-mind with the client. Your name will come up in conversations with anyone who asks about your clients’ experience buying or selling their homes.<\/p>\n<p>If you’ve provided sterling customer service, expect your clients to rave about you. If you haven’t, no closing gift short of a Lamborghini will change that client’s opinion of you.<\/p>\n<p>So, you may want to consider waiting a good chunk of time before offering a closing gift – even six months to a year. Aim to land a gift at their doorstep right around the time you’re fading from memory. Call it an “anniversary gift,” and include a note with it that wishes them a happy anniversary on the sale or purchase of the home.<\/p>\n<p>You could say something like, “I saw this while out shopping and it made me think of you – I just had to buy it. Enjoy!” Then, tell them how grateful you are that they placed their trust in you and to pass your name along to anyone they know who’s thinking of buying or selling.<\/p>\n<p>It’s a gift for them, and it’s a gift for you: You just bought yourself another couple months in that client’s memory.<\/p>\n<h3 class=\"BlogH3\">Don’t Use Marketing Collateral as Your Gift<\/h3>\n<p>The odds are high that your client can tell the difference between a genuine gift and tacky marketing tchotchke. A gift like that could have a negative effect on the way they remember you next time someone asks whether they know any good real estate agents.<\/p>\n<p>Some agents give an item that’s branded because it technically becomes a marketing tool, which means closing gifts from Realtors are not subject to the <a href=\"https:\/\/www.irs.gov\/publications\/p463\">IRS gift restrictions<\/a> clause. That’s fine.<\/p>\n<p>But be careful not to give gifts that feel like marketing collateral. You don’t want to work against the altruistic, personal-touch feeling you’re trying so hard to create.<\/p>\n<p>And what do most people do with those kinds of gifts from real estate agents? That’s right: they’ll end up in the attic if not thrown in the trash. Your best hope is that it will show up in a thrift store where someone, anyone, will actually see it.<\/p>\n<h3 class=\"BlogH3\">Make It Personal<\/h3>\n<p>Keep each individual client in mind as you’re considering the kind of gift you want to give them. Thoughtless gifts are less likely to serve the purpose you have in mind (i.e., developing a great relationship with them).<\/p>\n<p>For example, consider the following:<\/p>\n<ul>\n<li><strong>What are their likes and dislikes?<\/strong> A gift that’s specifically tailored to their hobbies and interests is a great way to stand out. But again, the opposite is also true – a generic gift that has nothing to do with who they are could send you to the background.<\/li>\n<li><strong>What kinds of food and drink ideas would work?<\/strong> Be cognizant of food allergies. A box of chocolates will be appreciated by some, but to diabetics and dieters, it’s not going to leave the best impression. The same holds true for alcohol. If you don’t know whether or not your client is carrying a sobriety coin in his pocket, forgo that bottle of premium vodka or vintage wine.<\/li>\n<li><strong>What is home life like for them?<\/strong> The best closing gift for an elderly retiree might be very different than it would be for a young married couple with a newborn. What you give to a large family with three dogs and a cat may need to be different from what you give to a single college-aged first-time homebuyer.<\/li>\n<li><strong>What will they actually use?<\/strong> Thinking practically can give you some great ideas. The clear advantage to giving them something they can use over and over again is that it’s more likely to keep you top of mind for long time.<\/li>\n<\/ul>\n<p>You get the idea. Choose a gift that will show them they’re not just another nameless paying customer.<\/p>\n<p>Need some inspiration to get you started? Here’s a fail-proof list of both classic and unique real estate agent closing gift ideas.<\/p>\n<h2 class=\"BlogH2\">8 Thoughtful Real Estate Closing Gift Ideas<\/h2>\n<h3 class=\"BlogH3\">Homeowner Journal<\/h3>\n<p>Rachael Hite at <a href=\"https:\/\/www.inman.com\/2015\/12\/16\/how-to-make-a-stellar-closing-gift-out-of-a-homeowner-resource\/\">Inman<\/a> does an admirable job of describing the “Black and Decker Home Planner and Logbook” and why it makes a great closing gift. (There’s even a spot for your brand logo.)<\/p>\n<h3 class=\"BlogH3\">Monthly Subscriptions<\/h3>\n<p>It’s the closing gift that keeps on giving, month after month. And, it’s not just magazine subscriptions that agents are gifting. We’ve seen everything from monthly maid, gardening, or pool service to subscription surprise boxes for the <a href=\"https:\/\/bodibox.com.au\/\">yoga devotee<\/a>, <a href=\"https:\/\/jackedpack.com\/\">fitness freak<\/a> and even the <a href=\"https:\/\/www.barkbox.com\/\">dog owner<\/a>. While they can be pricey, <a href=\"https:\/\/urbantastebud.com\/best-full-meal-subscription-boxes\/\">meal subscriptions<\/a> are popular and a blessing to your client who is too busy to cook.<\/p>\n<h3 class=\"BlogH3\">Cleaning\/Organizing Services<\/h3>\n<p>This is a great idea because it’s really two gifts in one. First, because everyone loves to have a clean house. And second, because it saves your client the time it takes to clean, which frees them up to enjoy a weekend out or to just relax. Companies like <a href=\"https:\/\/www.mollymaid.com\/gift-certificates\/\">Molly Maid<\/a> and <a href=\"https:\/\/www.tidy.com\/gifts\">TIDY<\/a>, for example, offer gift cards.<\/p>\n<h3 class=\"BlogH3\">Flowers and Houseplants<\/h3>\n<p>This is a classic choice. Flowers and plants make for beautiful decoration, they’re memorable, and depending on what you get, they can last a very long time.<\/p>\n<p>You almost can’t go wrong. Almost. Make sure you choose a plant that isn’t toxic, especially if they have small children or pets.<\/p>\n<p>You can find a list of poisonous plants, both indoor and outdoor, at <a href=\"https:\/\/www.poison.org\/articles\/plant\">Poison.org<\/a> and <a href=\"https:\/\/www.aspca.org\/pet-care\/animal-poison-control\/toxic-and-non-toxic-plants\">ASPCA.org<\/a>. And if you’re looking for ideas, Jayme Kinsey at <a href=\"https:\/\/dengarden.com\/gardening\/Non-Toxic-House-Plants-For-Homes-Children-Cats-and-Dogs\">DenGarden.com<\/a> offers a list of non-toxic choices for kids, dogs and cats.<\/p>\n<h3 class=\"BlogH3\">Emergency Kit<\/h3>\n<p>While a home emergency kit might be a no-brainer, how about one for your commuter clients’ car? One for the pets of a dog-loving homeowner?<\/p>\n<p>You can get premade kits, or to add a personal touch, they’re also a fun DIY project. Get ideas and tips from the <a href=\"https:\/\/www.redcross.org\/store\/preparedness\">American Red Cross<\/a>.<\/p>\n<h3 class=\"BlogH3\">Gift Cards<\/h3>\n<p>Your clients will always have a wish list of things they want to buy for their new home, and you can be the agent who helps make a wish or two come true. If you’re not sure which store is their favorite, go for the failsafe big-box stores like Home Depot or Ikea.<\/p>\n<h3 class=\"BlogH3\">Season Passes<\/h3>\n<p>A season pass to a popular local venue is another great idea, especially if your client is new in town. The local water park, movie theater, children’s museum, or ski lifts, for example, are sure to be a big hit.<\/p>\n<h3 class=\"BlogH3\">Gadget Gifts &amp; Techie Tools<\/h3>\n<p>Help your clients keep their house clean with a <a href=\"https:\/\/www.irobot.com\/en_US\/roomba.html\">Roomba robot vacuum cleaner<\/a>. Gift them with peace of mind – give them <a href=\"https:\/\/ring.com\/products\/video-doorbell-v2\">Ring’s video doorbell<\/a> or a <a href=\"https:\/\/august.com\/\">“smart lock” from August<\/a>. Or help them save energy and keep utilities costs down with <a href=\"https:\/\/store.google.com\/us\/product\/nest_learning_thermostat_3rd_gen?hl=en-US&amp;GoogleNest&amp;pli=1\">Google’s Nest Learning Thermostat<\/a>.<\/p>\n<p>We’d love to get your thoughts. How do you feel about closing gifts from real estate agents? Tell us in the comments below.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Welcome to the long-standing discussion about whether agents should give real estate closing gifts to their clients. Of course, we won’t settle the matter here. But reaching a universal conclusion that works for every agent everywhere for all time isn’t really the point anyway. The question behind the question is (or at least should be): [&hellip;]<\/p>\n","protected":false},"author":33,"featured_media":61689,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[83],"tags":[190,699,163,697,202,189],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/50263"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/33"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=50263"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/50263\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media\/61689"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=50263"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=50263"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=50263"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}