{"id":50369,"date":"2016-04-12T16:25:55","date_gmt":"2016-04-12T23:25:55","guid":{"rendered":"http:\/\/www.marketleader.com\/?p=50369"},"modified":"2022-01-26T13:20:56","modified_gmt":"2022-01-26T21:20:56","slug":"4-unconventional-sources-of-motivated-buyer-leads","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/4-unconventional-sources-of-motivated-buyer-leads\/","title":{"rendered":"4 Unconventional Sources of Motivated Buyer Leads"},"content":{"rendered":"<p>Whether you’re new to the real estate business or you’ve been around for a while, lead generation can eat up a good portion of your workday. It’s a necessary evil, however, and real estate professionals are always on the lookout for new or easier ways to find motivated leads.<\/p>\n<p><strong>Looking for some unconventional sources of motivated buyer leads?<\/strong> You’re in luck. We’ve done some research and found agents who were gracious enough to share their best buyer lead generation methods.<\/p>\n<h2>1. Use Twitter Searches to Find Buyer Leads<\/h2>\n<p>Type <a href=\"http:\/\/www.inman.com\/2014\/04\/03\/no-budget-for-real-estate-prospecting-find-free-leads-on-twitter-pinterest-zillow\/\">“Moving to [name of your city]” into Twitter’s search box<\/a> and let the magic begin. We tried this for Las Vegas and found six tweets, posted over just three days, from folks talking about moving to the area.<\/p>\n<p>Try numerous variations of this search. Two examples of additional Twitter searches you could perform are “I want to buy a house in [name of city or neighborhood]” and “homes for sale in [name of your city].” While this method is a bit of a shot in the dark, as not all of the users whose tweets are returned by these searches will be prospective home buyers, it may yield a deal or two.<\/p>\n<h2>2. Fish in the HUD Pond<\/h2>\n<p>If your broker is <a href=\"http:\/\/portal.hud.gov\/hudportal\/HUD?src=\/program_offices\/housing\/sfh\/reo\/hwtosell\">qualified to sell HUD homes<\/a>, they are authorized to “show, advertise, and submit offers on HUD Homes.” Talk to your broker first to ensure you’re following all the rules, then use Craigslist to promote homes that home buyers in your area may find attractive and then reel them in.<\/p>\n<hr \/>\n<p>\n<a href=\"http:\/\/www.marketleader.com\/products\/real-estate-leads\/\"><img class=\"alignleft size-medium wp-image-44201\" src=\"https:\/\/www.marketleader.com\/wp-content\/uploads\/2016\/02\/Blog-CTA-arrows-2.png\" alt=\"Learn how Market Leader can generate more buyer and seller leads for you\"><\/a><strong><em>NEED MORE LEADS? Market Leader can generate a guaranteed number of exclusive buyer and seller leads for you each month. <\/em><a href=\"http:\/\/www.marketleader.com\/products\/real-estate-leads\/\">LEARN MORE &gt;&gt;<\/a><\/strong><\/p>\n<hr \/>\n<h2>3. Be the Content King or Queen<\/h2>\n<p>The vast majority of home buyers who use the Internet during their home searches say they prefer reading articles over ads when getting to know a real estate agent. Fresh and compelling web content is therefore not only good for SEO purposes, but is useful for building your personal brand as well.<\/p>\n<p>Although content marketing isn’t a lead generation technique that offers a quick return on your investment, skillful content marketing can be quite lucrative. Create a combination of hyper-local and real estate-related content in a number of formats, from articles to videos to infographics, and publish them on your website and social media pages.<\/p>\n<p>If the content is compelling enough, your website and social media accounts can attract quite the following. Ask nationally-recognized real estate bloggers like Lawrence Roberts of <a href=\"http:\/\/ochousingnews.com\/\">OC Housing News<\/a> and Ryan Lundquist of the <a href=\"http:\/\/sacramentoappraisalblog.com\/\">Sacramento Appraisal Blog<\/a> just how powerful compelling content can be.<\/p>\n<p>Make sure to craft your content carefully, ensuring that it “builds trust in your brand, positions you as an authority figure and assuages any fears your reader might have in working with you,” <a href=\"http:\/\/www.inman.com\/next\/content-marketing-for-real-estate-is-meaningless-without-understanding-your-business-goals\/\">according to Seth Price at Inman<\/a>.<\/p>\n<p>By the way, you can increase the volume of visitors your website receives by sharing content about the local businesses you write about with their owners. The exposure will be appreciated, so the business owners may link to your content on their websites and social media accounts.<\/p>\n<h2>4. Hold Open Houses for Your Busy Coworkers<\/h2>\n<p>The words “open house” might make you think “boooooring,” but this unconventional buyer lead generation idea is more for new agents who are desperately seeking their first deal. Since newbie agents don’t have any of their own listings, they can offer to hold open houses for their more experienced – and busy – coworkers for the listings they don’t have enough time for. In exchange, the newbie agent will keep any buyer leads generated by the open house’s sign-in sheet and their conversations with the people who attend it.<\/p>\n<p>The first step is to identify the listings that look the most promising. For example, a downtown condo that you can hold open during lunch hour or a starter home in good condition in a popular area will likely have good turnouts.<\/p>\n<p>Next, extend invitations for the open house about a week ahead of time to the contacts in your CRM and invite the listing agent and the homeowner to do the same on their social media accounts. Do some door-knocking around the neighborhood or leave flyers on doors to let the community know about the open house and drive even more foot traffic to it.<\/p>\n<p>Finally, try your darnedest to direct the open house attendees to the sign-in sheet. Include an incentive for attendees to add their information to this list, like a gift card drawing, if you’re particularly desperate for buyer leads.<\/p>\n<p><strong>Need more open house buyer lead generation ideas?<\/strong> Read <a href=\"http:\/\/learn.marketleader.com\/download\/attachments\/82575420\/7+tips+to+market+your+next+open+house.pdf?version=1&amp;modificationDate=1376517524663\">7 Tips to Market Your Next Open House<\/a> for additional ideas on how to get the word out and <a href=\"\/blog\/5-tips-for-successful-open-houses\/\">5 Tips for Successful Open Houses<\/a> for ideas on how to reel in buyer leads during the event.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Whether you’re new to the real estate business or you’ve been around for a while, lead generation can eat up a good portion of your workday. It’s a necessary evil, however, and real estate professionals are always on the lookout for new or easier ways to find motivated leads. Looking for some unconventional sources of [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":50383,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[34],"tags":[331,86,141,701,492,128,18],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/50369"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=50369"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/50369\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media\/50383"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=50369"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=50369"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=50369"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}