{"id":50499,"date":"2016-05-04T08:00:38","date_gmt":"2016-05-04T15:00:38","guid":{"rendered":"http:\/\/www.marketleader.com\/?p=50499"},"modified":"2017-08-10T12:42:33","modified_gmt":"2017-08-10T19:42:33","slug":"4-focus-areas-for-creating-better-real-estate-ads","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/4-focus-areas-for-creating-better-real-estate-ads\/","title":{"rendered":"4 Focus Areas for Creating Better Real Estate Ads"},"content":{"rendered":"<p>Real estate agents wear a lot of hats, and one of the biggest hats they wear is that of a marketer. From promoting their listings to marketing themselves, it can take up a big chunk of their time. That’s understandable since, unless you have a degree in marketing, being adept at copywriting for advertising and other marketing materials likely isn’t a skill that comes easily to you. Yet it’s an essential skill to have if you want to stay in the real estate business.<\/p>\n<p>The response rate your advertising achieves is the yardstick you should use to measure its success. If your response rate is paltry, it’s time to rethink your advertising strategy and make adjustments to what you’re sending out and posting online.<\/p>\n<p>Improve the response rate of your real estate ads by focusing on these four advertising imperatives.<\/p>\n<h2>1. Identify Your Ad’s Ultimate Goal<\/h2>\n<p>Before putting pen to paper or fingers to keyboard, identify exactly what you want your real estate ads to accomplish. Are you hoping to find new clients? Are you looking for a specific type of client, like buyers, sellers, investors, golfers, retirees, or folks interested in new construction? Do you want to own a particular neighborhood or condo community?<\/p>\n<h2>2. Identify and Learn About the Ad’s Target Audience<\/h2>\n<p>Once you know the “why” of a particular piece, determine the “who.” If you are hoping to attract more home buyer clients, for instance, craft each real estate ad’s messaging to appeal to one particular type of buyer. Specific home buyer types might include Millennials, Baby Boomers, families, horse owners, golfers, or international buyers.<\/p>\n<p>Educate yourself on your audience’s traits and hot buttons. For instance, if you’re seeking first time buyers, chances are good they will be Millennials (67 percent of all first time buyers are, <a href=\"http:\/\/www.realtor.org\/reports\/home-buyer-and-seller-generational-trends\">according to NAR<\/a>) and the majority are married couples. Once you understand your audience, it’s imperative to speak to them in <em>their<\/em> language.<\/p>\n<h2>3. Improve Your Pitch by Honing Your UVP<\/h2>\n<p>To effectively sell your services, you’ll need to come up with your “unique value proposition” (UVP), a statement that informs prospective clients about what sets you apart from other agents in your market. Think of it as an elevator pitch, but in writing.<\/p>\n<p>&#8220;Why work with an agent when you can hire an entire real estate company?&#8221; is something Tallahassee, Fla. real estate agent and investor <a href=\"http:\/\/www.manausa.com\/\">Joe Manausa<\/a> frequently reminds his blog’s readers. Sure, other real estate teams exist in Tallahassee, but they don’t sell themselves as an entire company. In one of his blog posts, Manausa claims that his team spends more than 13 hours per day marketing their listings, another powerful statement that could be added to Manausa’s UVP to make it more compelling to sellers.<\/p>\n<p>“We spend over $40,000 a month on marketing” isn’t in the UVP of <a href=\"http:\/\/kerbyandcristina.com\/\">Kerby &amp; Cristina Real Estate Experts of RE\/MAX Results<\/a> but, with a bit of tweaking, it could be a key part of a powerful one. This fact certainly sets them apart from other agents in their Minnesota market.<\/p>\n<p>Do you sell your listings faster and for more money than most other agents? Get specific statistics to illustrate this fact and add them to your UVP. Speak a second language and want to attract home buyers who also speak it? Mention this in your UVP, even if you only say something like “Yo hablo español.”<\/p>\n<p>These qualities are what will keep you from being a dime-a-dozen agent, and remind former clients why they should refer you to their friends and family. Craft a compelling UVP and you’ve solved one of the biggest marketing concerns of any business. So use it everywhere, including in your real estate ads.<\/p>\n<hr \/>\n<p>\n<a href=\"http:\/\/www.marketleader.com\/products\/real-estate-leads\/\"><img class=\"alignleft size-medium wp-image-44201\" src=\"http:\/\/www.marketleader.com\/wp-content\/uploads\/2016\/02\/Blog-CTA-arrows-2.png\" alt=\"Learn how Market Leader can generate more buyer and seller leads for you\"><\/a><strong><em>NEED MORE LEADS? Market Leader can generate a guaranteed number of exclusive buyer and seller leads for you each month. <\/em><a href=\"http:\/\/www.marketleader.com\/products\/real-estate-leads\/\">LEARN MORE &gt;&gt;<\/a><\/strong><\/p>\n<hr \/>\n<h2>4. Craft a Compelling Headline First<\/h2>\n<p>Regardless of whether you’re crafting a flyer, banner ad, or search engine advertisement, making a compelling headline is the most challenging – and most important – part of the ad creation process. A headline must catch consumers’ attention or they won’t give the ad a second glance.<\/p>\n<p>The best way to catch consumers’ attention is by knowing your audience’s hot buttons and then appealing to their interests or offering to meet their needs. Here are three examples of how real estate ad headlines can catch consumers’ attention:<\/p>\n<ul>\n<li>Offer a solution to a perceived problem<\/li>\n<li>Stimulate curiosity<\/li>\n<li>Offer something new that can’t be found elsewhere<\/li>\n<\/ul>\n<p>Once you settle on a headline, the rest of the ad creation process is comparatively easy. Here are some best practices:<\/p>\n<ul>\n<li>Keep it simple, from word choice to sentence and paragraph length.<\/li>\n<li>Avoid redundancy. <span style=\"text-decoration: line-through;\">Avoid redundancy. Avoid redundancy. <\/span><\/li>\n<li>Use a compelling call to action, like “Call today” or “Visit my website,” that matches the purpose and messaging of your ad.<\/li>\n<li>Sell the benefits of working with you. The fact you’ve been in real estate for 20 years is a feature. The fact your listings sell within five minutes is a benefit.<\/li>\n<li>Don’t make your ads all about you; use the word “you” more than “I.”<\/li>\n<\/ul>\n<p>The line between advertising your business and overt self-promotion is a thin one, and is a line that many agents can’t avoid crossing. Remember, real estate consumers are like the rest of us; they don’t like being sold to and only really care about their own personal needs and desires. Will you sell their home in the blink of an eye for well over the asking price? Will you quickly find their dream home in their price range? These are what your ads should focus on.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Real estate agents wear a lot of hats, and one of the biggest hats they wear is that of a marketer. From promoting their listings to marketing themselves, it can take up a big chunk of their time. That’s understandable since, unless you have a degree in marketing, being adept at copywriting for advertising and [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":50505,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[35],"tags":[300,119,707,703,87,705,517],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/50499"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=50499"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/50499\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media\/50505"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=50499"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=50499"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=50499"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}