{"id":505,"date":"2010-07-22T13:36:07","date_gmt":"2010-07-22T21:36:07","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=505"},"modified":"2021-11-11T16:18:45","modified_gmt":"2021-11-12T00:18:45","slug":"it-was-great-to-connect","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/it-was-great-to-connect\/","title":{"rendered":"It was great to Connect!"},"content":{"rendered":"<p>Many of us at Market Leader are getting back in swing following the San Francisco Real Estate Connect conference. As always, it was a fascinating look at how technology is changing the face of real estate and offering new tools to take advantage of opportunities. Some of our highlights included:<\/p>\n<p><a href=\"http:\/\/twitter.com\/karaswisher\">Kara Swisher<\/a> from the Wall Street Journal\/All Things Digital gave terrific and energetic insights into technology for real estate.<\/p>\n<p>Alexis Ohanian of Reddit engagingly explained why business owners and other branded organizations need to understand that through the Internet, consumers now have a lot of control—and it’s a good thing. He used the example of Greenpeace allowing people to vote to name a whale <a href=\"http:\/\/mashable.com\/2007\/12\/12\/mr-splashy-pants-greenpeace\/\">“Mr. Splashy Pants,”<\/a> which created a groundswell of interest and ultimately helped the organization in achieving its goal.<\/p>\n<p>Our panel titled “Generate Leads or Die” was very enlightening as to how brokers are using technology to generate leads. Featured in the panel were Ben Kinney of Keller Williams, Jeff Lobb of EXIT Realty and Jim Browning of Realty Executives.<\/p>\n<p>We were also intrigued to learn what top franchises are doing from Pam O’Connor, CEO of Leading Real Estate Companies of the World; Cary Sylvester, Executive Director of Technology for Keller Williams; and Glenn Melton, CEO of Realty Executives.<\/p>\n<p>Last but not least, the Duet of “The Nerd Vs. The Networker” was especially interesting, underscoring that brokerages in today’s market must be run as <strong><em>businesses<\/em><\/strong>. This means making difficult decisions, including even cutting staff whom you like personally. Brokers must redouble the focus on productivity to survive and grow. The great news is, there’s still plenty of opportunity to increase productivity—and Connect provided lots of ideas for doing it.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Many of us at Market Leader are getting back in swing following the San Francisco Real Estate Connect conference. As always, it was a fascinating look at how technology is changing the face of real estate and offering new tools to take advantage of opportunities. Some of our highlights included: Kara Swisher from the Wall [&hellip;]<\/p>\n","protected":false},"author":6,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[27],"tags":[],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/505"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=505"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/505\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=505"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=505"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=505"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}