{"id":51783,"date":"2016-10-04T14:41:38","date_gmt":"2016-10-04T21:41:38","guid":{"rendered":"http:\/\/www.marketleader.com\/?p=51783"},"modified":"2022-01-26T13:19:47","modified_gmt":"2022-01-26T21:19:47","slug":"4-things-cats-can-teach-you-about-real-estate","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/4-things-cats-can-teach-you-about-real-estate\/","title":{"rendered":"4 Things Cats Can Teach You About Real Estate"},"content":{"rendered":"<p>Dealing with cats can be an exercise in futility, but watching them closely can teach real estate professionals a lot about how to deal with issues they face in their day-to-day work life. While you probably shouldn’t jump up on the dining room table during a listing presentation or take a nap in a bureau drawer while holding an open house, there are four distinctly feline qualities that you can put to good use for your real estate business.<\/p>\n<p><em>More of a dog person? <strong><a href=\"http:\/\/www.marketleader.com\/blog\/3-things-your-dog-can-teach-you-about-real-estate\/\">Click here<\/a><\/strong> to learn what dogs can teach agents about real estate.<\/em><\/p>\n<h2>1. Be a Hunter<\/h2>\n<p>Cats are excellent hunters, and watching one in action can teach agents a lesson in lead follow-up and conversion. Cats stalk their prey, tenaciously, by laying low to the ground, crawling in perfect silence with their eyes fixed on their prey, and then pouncing when they’re within striking distance.<\/p>\n<p>Admittedly, you don’t need to go through the same physical gymnastics that cats do when you’re working your leads. But, like cats, you do need to be focused, patient, and tenacious.<\/p>\n<p>Few of your leads will be close to becoming your clients when you first get them. With cat-like focus, patience, and tenacity in your follow-up, however, your leads will have your name top-of-mind when they’re ready to buy or sell real estate.<\/p>\n<h2>2. Avoid Getting Distracted by Wiggly Objects<\/h2>\n<p>Cats are easily distracted by wiggly objects like pieces of string and laser pointer dots. The same is often true for real estate professionals and the myriad distractions found at their offices.<\/p>\n<p>While it’s fine to peruse the Internet and nurture relationships with your coworkers, your first priority must be to remain productive. Make plans to have coffee, lunch, or drinks outside of work with your coworkers and get your Internet time in during the morning or evening, but remain focused while you’re at the office.<\/p>\n<p>If you work from home, wiggly objects are all over the place, from the TV begging to be watched to dirty dishes in dire needing of washing. The key to overcoming these distractions is to remind yourself that during the workday you are a real estate agent, not a laundry folder. These distractions can wait until whenever your workday is finished.<\/p>\n<h2>3. Be an Allogroomer<\/h2>\n<p>If you’ve ever watched a mother cat groom her kittens, or even adult cats groom one another, you’ve witnessed what animal behaviorists call “allogrooming.” It’s a “social activity that serves to strengthen the bond between cats,” according to animal behaviorist <a href=\"https:\/\/www.petfinder.com\/cats\/cat-grooming\/cats-meticulous-nature\/\">Barbara Pezzanite at Petfinder<\/a>, and helps to build trust and familiarity.<\/p>\n<p>As an agent, you can become an allogroomer not by licking your prospects’ and clients’ hair, as a cat might, but by seeking out appropriate social activities that help to forge strong and lasting bonds with them. Daily phone calls to former clients asking for referrals won’t make you a good allogroomer, but more socially-acceptable activities like sending them friendly holiday cards and inviting them to client appreciation events will.<\/p>\n<h2>4. Learn How to Hiss to Defend Your Boundaries<\/h2>\n<p>Hissing is a cat’s way of warning you that you’ve disrespected its boundaries. You’ve made it defensive and the hissing sound advises you to step away. It’s a handy tactic to adopt, especially if you work from home.<\/p>\n<p>Think back to the job you held before you got into real estate. You most likely had a boss and a desk you needed to be at by a certain time and to which you were pretty much chained to until the workday was over. Did anyone, from friends to family, ever call and ask you to do them a favor during the middle of the workday – say, to pick up a child from school, take a dog to the vet, or run some other errand? Of course not; you were working. Yet, it’s common for these same people to call the self-employed, especially the work-at-home business person, to make those kinds of requests. Although your time is now your own, it seems that it’s everyone else’s as well, right?<\/p>\n<p>Yes, it’s easy to give in to people who’ve declared open season on your time, but it’s also not a productive use of your workday. Jealously guard your time by setting boundaries and then protecting them when someone attempts to cross them.<\/p>\n<p>If you monetize your time, setting these boundaries will be easier because you’ll understand just how valuable every minute of your workday is. How much do you (or do you want to) make an hour? Knowing this figure will allow you to calculate how much it will cost you, in lost dollars, to retrieve your sister’s child from school or find the perfect veterinarian on Yelp for your best friend’s dog.<\/p>\n<p>You can defend your time by going feline on the time thief by flattening your ears, arching your back, and letting out the most attention-getting hiss you can muster. In reality, a polite “I’m working so I’m unavailable” should do the trick. If it doesn’t, then do the scary cat stuff.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Dealing with cats can be an exercise in futility, but watching them closely can teach real estate professionals a lot about how to deal with issues they face in their day-to-day work life. While you probably shouldn’t jump up on the dining room table during a listing presentation or take a nap in a bureau [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":51785,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[83],"tags":[739,733,584,735,737],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/51783"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=51783"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/51783\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media\/51785"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=51783"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=51783"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=51783"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}