{"id":51795,"date":"2016-10-12T08:45:56","date_gmt":"2016-10-12T15:45:56","guid":{"rendered":"http:\/\/www.marketleader.com\/?p=51795"},"modified":"2016-11-02T10:30:51","modified_gmt":"2016-11-02T17:30:51","slug":"hard-truths-for-new-real-estate-agents","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/hard-truths-for-new-real-estate-agents\/","title":{"rendered":"Hard Truths for New Real Estate Agents"},"content":{"rendered":"<p><strong>Congratulations!<\/strong> You passed the licensing exam and are now a full-fledged member of the real estate industry. You no longer have a boss who will tell you exactly how to spend your day. You’re now an independent contractor – a business owner – and, sink or swim, your success is up to you.<\/p>\n<p>Unfortunately, there are some hard truths about working in this industry that you weren’t taught in real estate school. These truths, listed below, should inform how you run your business and market yourself as a real estate agent. Ignore them at your peril! <\/p>\n<h2>Agents Are Viewed as Interchangeable<\/h2>\n<p>According to the National Association of Realtors, most real estate consumers choose the first agent they make contact with. Since you’re a new agent, this is beneficial for you. But the longer you remain in the business, you’ll discover how frustrating it is to not have your experience be recognized and valued by the consumers you work with.<\/p>\n<h2>Designations and Certifications Mean Little to Consumers<\/h2>\n<p>Sure, designations and certifications like “GRI,” “ABR,” and “CRS” look impressive to you, but real estate consumers don’t have a clue what they stand for or how they benefit them. Few know the meaning of even basic industry terms like “Realtor.” At a Hear It Direct conference in Charleston, S.C. a few years ago, the moderator asked the panel of real estate consumers if they knew the difference between a Realtor and a real estate agent. None of them did. <\/p>\n<p>He then asked the panel members what CRS, ABR, e-Pro and SRES stands for. Not only did they not know what the letters stand for, but when they were explained, all of the panelists said that the designations would make no difference to them when choosing a real estate agent. <\/p>\n<h2>You’re Just a Means to an End<\/h2>\n<p>“Sorry, you guys are a means to an end,” is how one consumer summed up how she feels about real estate agents at a Hear It Direct conference. “The agent? I just see them as a vehicle,” remarked another participant.<\/p>\n<p>Buyers and sellers typically don’t care about you as a person – they just want you to facilitate the sale or purchase of a home. This means you should focus less on being friends with consumers and sharing your personal life and accomplishments with them and instead focus on closing deals and delivering amazing customer service.<\/p>\n<h2>Your Advertising Is Literally a Joke<\/h2>\n<p>You know real estate agents are bad at marketing themselves when one of the most popular segments on Ellen DeGeneres’ show is one where she makes fun of agents’ ads. After seeing so many laughably bad ads plastered on bus stops and shopping carts, how, consumers can reasonably wonder, can agents hope to effectively market their homes?<\/p>\n<p>Help your business out and avoid being a laughingstock by refraining from using smarmy plays on your name, don&#8217;t use a cheesy tagline, and getting professionally-done headshots. Or better yet, outsource your marketing and lead generation to a company like Market Leader. Instead of worrying about making your own ads to help you meet your lead generation requirements, you can <a href=\"http:\/\/www.marketleader.com\/products\/real-estate-leads\/\">get a guaranteed number of buyer and seller leads each month from Market Leader<\/a>.<\/p>\n<h2>Consumers Distrust Agents<\/h2>\n<p>Real estate agents have a poor reputation among consumers, one akin to that of used car salespeople. Sure, this bad reputation is largely undeserved and is slowly changing. But in the meantime, many buyers and sellers you encounter will think that you’ll say and do anything just to make a sale. Yes, it’s disgusting, but the bad agents out there have tainted the entire industry. <\/p>\n<p>Stick around your broker’s office long enough and you’ll meet some of them. There’s the older agent who rarely takes a listing or works with buyers, instead preferring to spend their time socializing in the office. Then there is the shyster, the one who uses half-truths and misconceptions to get business.<\/p>\n<p>Unfortunately, the real estate industry is populated with too many bad agents. Raising the bar for entry into the business is one solution, but it doesn’t seem that those with the power to do this are interested. So, it’s up to the good agents to change the public’s perception. You can do your part to change it by striving to provide value to each of your clients and making every part of the transaction as smooth and pleasant for them as possible. <\/p>\n","protected":false},"excerpt":{"rendered":"<p>Congratulations! You passed the licensing exam and are now a full-fledged member of the real estate industry. You no longer have a boss who will tell you exactly how to spend your day. You’re now an independent contractor – a business owner – and, sink or swim, your success is up to you. Unfortunately, there [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":51799,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[83],"tags":[284,119,190,743,520,741,745,141,87],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/51795"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=51795"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/51795\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media\/51799"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=51795"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=51795"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=51795"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}