{"id":51805,"date":"2016-10-19T07:45:39","date_gmt":"2016-10-19T14:45:39","guid":{"rendered":"http:\/\/www.marketleader.com\/?p=51805"},"modified":"2016-10-07T11:49:58","modified_gmt":"2016-10-07T18:49:58","slug":"get-more-online-leads-with-these-real-estate-website-content-best-practices","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/get-more-online-leads-with-these-real-estate-website-content-best-practices\/","title":{"rendered":"Get More Online Leads With These Real Estate Website Content Best Practices"},"content":{"rendered":"<p>Having a better real estate website can help you break out of the brutal prospecting cycle that so many agents are stuck in by organically generating leads that you can turn into new clients. In fact, building up your website is one of the most important lead-generating tasks you can perform because, unlike conventional marketing methods like newspaper and radio ads, websites will generate leads in perpetuity as long as they are fed with new content that draws in visitors.<\/p>\n<p>Hopefully you’ll leave building your website to the professionals to ensure that it looks good and functions even better. But once your website is live, it’s up to you to flesh it out with content, and then consistently add new content over time.<\/p>\n<p>Here are some best practices for creating lead-generating content for your real estate website.<\/p>\n<h2>Customize Your Content<\/h2>\n<p>Customizing the stock content that your website comes with is essential for setting yourself apart from the other agents. But creating customized content tends to be time intensive and, if you contract the work out, expensive. Don’t be intimidated, however, you can do this.<\/p>\n<p>Start your website content customization with the home page, the most valuable piece of real estate on your entire website. When a potential client lands there, they should be able to immediately learn several things about you:<\/p>\n<ul>\n<li>Where you’re located<\/li>\n<li>That you list and sell residential real estate in that location<\/li>\n<li>How to contact you by phone and email<\/li>\n<li>That your website provides consumers with valuable information about your local housing market<\/li>\n<\/ul>\n<p>Consider placing a listings search box on the home page as well, if one isn’t already located there. This is essential because finding local homes for sale is the main reason consumers surf real estate agent websites.<\/p>\n<h2>Get Busy Building Trust<\/h2>\n<p>Here’s a piece of good advice from “The Go-Giver,” by Bob Burg and John David Mann: “All things being equal, people will do business with, and refer business to those people they know, like, and trust.”<br \/>\nWell-written content builds trust by establishing you as a real estate authority or, ideally, a local real estate authority. Next, it helps people get to know and, hopefully, like you. “You’re increasing your likability factor. The more someone likes you, the more they begin to trust you,” Bill Carmody wrote for Inc.com.<\/p>\n<p>The best place to start earning your visitors’ trust is on your blog, which should be free of hard sales pitches. Nobody, especially those seeking information, likes to be sold to. In fact, if you want to repel real estate consumers from your website, pepper your blog content with trite and “salesy” appeals for readers to become your clients.<\/p>\n<p>You won’t get people to trust and like you by exclusively posting open house notices or information about new listings. Instead, you can accumulate repeat visitors by publishing blog posts that contain the valuable information that consumers look for. Save the sales spiel for your static pages, like your “About Me” or “Areas I Serve” pages.<\/p>\n<h2>Publish Posts Persistently<\/h2>\n<p>“If you know exactly what you’re doing, you can build a blog that gets over 100,000 visitors per month in less than a year—from scratch,” claims Neil Patel, one of the world’s foremost bloggers and Internet influencers.<\/p>\n<p>But getting even a fraction as many visitors takes persistence. That’s a nasty word, right? Who has time to persistently blog? Not your competition, that’s almost certain. So, when you tire of asking yourself why you don’t have more listings or buyers, and you find yourself envying the “listing pig” in your office, maybe it’s time to change your tactics.<\/p>\n<p>Whether you persistently write and publish blog posts yourself or hire someone to do so, it will pay off over the long run.<\/p>\n<h2>Social Sharing Leads to Success<\/h2>\n<p>From personal experience, I can safely say that a blog post shared via social media gets many times the views of one that isn’t shared on social media. If your post is relevant, has an attractive photo, and a snappy headline, folks will click on it and, hopefully, share it with others. Each time that post is shared, your website will get more visits. So, while great website content is wonderful to have, sharing it on social media is even better.<\/p>\n<h2>Real Estate Content Topics<\/h2>\n<p>So, what types of information are your visitors looking for? There’s no shortage of topics for your blog, but some are better than others.<\/p>\n<p>Anybody, including Zillow, Trulia, and the rest of the large real estate websites that tend to dominate the front page of Google, can post generic information about how to buy and sell homes. But you, my friend, have a leg up on them because you have extensive local knowledge and insight that consumers can’t find anywhere else on the internet.<\/p>\n<p>Let’s take a look at some of the topics that are ideal for agents.<\/p>\n<h3>Give Regular Updates About Local Neighborhoods<\/h3>\n<p>Honestly, this is where you can not only shine as a local agent but rank high in search engines as well.<\/p>\n<p>Nobody aside from large real estate websites like Zillow, Trulia, and Realtor.com can expect to be found on the first page of search results for queries like “Las Vegas homes for sale.”<\/p>\n<p>However, pepper your blog posts with locally-specific content, such as information about Rhodes Ranch homes for sale or Southern Highlands homes for sale (two popular neighborhoods in South Las Vegas) and Vegas home shoppers interested in those neighborhoods are much more likely to land on your website. Consistently providing updates about these hyperlocal markets will continue to attract new visitors and also prompt repeat visits.<\/p>\n<h3>Teach Your Visitors About Local Schools<\/h3>\n<p>National real estate listing aggregators like Zillow and Trulia don’t post in-depth information on local schools, but you can and should. If you’re helping consumers buy and sell homes throughout your local area, few should know its schools better than you. Provide in-depth information about local public and private schools on a static page on your website. Enrollment, special programs offered, and rankings for state and national standardized tests are all points of interest.<\/p>\n<p>It would also be helpful to include instructions on that page about how to find out what school drawing areas the listings on your website belong to. If your website’s listings don’t provide this information, ensure that it gets added to your website as soon as possible. There’s a reason why websites like Zillow and Trulia make it easy to research schools while looking at listings.<\/p>\n<h3>Share Information About Local Events<\/h3>\n<p>Whether you publish blog posts that list all of the local events set to occur in the upcoming month, or if you have a static page where you provide information about your area’s biggest events that occur each year, consumers love this type of content and tend to share it on social media more often than other types of content.<\/p>\n<h3>Explain Local Housing Market Statistics<\/h3>\n<p>Home buyers and sellers alike love local housing market statistics. The trick to writing about them is being able to describe them in plain English. Dump the jargon and explain everything each time you write about them. An acronym like “DOM” means nothing to the average real estate consumer, and even “days on the market” might be confusing to them. However, a short sentence like “Homes in Happy Valley spend an average of 35 days on the market” tells them exactly what they need to know.<\/p>\n<p>Other terms agents frequently use, like “inventory” and “absorption rate,” are also confusing to consumers. Take the time to explain concepts like these or, better yet, drop them from your vocabulary altogether. Instead write something like “There are currently 400 homes for sale in Happy Valley,” and then explain whether this is a lot of available homes for the area or comparatively few, and whether more or less homes are expected to come on the market over the course of the coming month, quarter, year, or other time frame.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Having a better real estate website can help you break out of the brutal prospecting cycle that so many agents are stuck in by organically generating leads that you can turn into new clients. In fact, building up your website is one of the most important lead-generating tasks you can perform because, unlike conventional marketing [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":51807,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[35],"tags":[334,86,410,126,282,747,749,57,753,755,136,751],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/51805"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=51805"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/51805\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media\/51807"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=51805"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=51805"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=51805"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}