{"id":52019,"date":"2016-12-06T09:48:53","date_gmt":"2016-12-06T17:48:53","guid":{"rendered":"http:\/\/www.marketleader.com\/?p=52019"},"modified":"2017-01-02T13:41:39","modified_gmt":"2017-01-02T21:41:39","slug":"market-leader-and-exit-realty-extend-and-broaden-partnership","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/market-leader-and-exit-realty-extend-and-broaden-partnership\/","title":{"rendered":"Market Leader and EXIT Realty Extend and Broaden Partnership"},"content":{"rendered":"<p><strong>BELLEVUE, Wash., Dec. 6, 2016<\/strong> &#8212; Market Leader and EXIT Realty Corp. International today announced that they have extended and broadened their long-term partnership for providing sales and marketing tools to real estate professionals.<\/p>\n<p>Market Leader is the engine behind EXIT Promo Shop, a robust email, print, and direct mail Marketing Center. First launched in 2005 and used by thousands of EXIT Realty agents, EXIT Promo Shop features thousands of professionally designed templates, automated campaigns, and EXIT-branded marketing pieces. Additionally, Market Leader has also become an Approved Supplier to all EXIT agents for the Market Leader suite of tools for agents, teams, and offices. Included in this enhanced partnership are Market Leader’s Professional and Business Suite products which include powerful branded lead generating websites, a robust desktop and mobile CRM, and marketing tools designed to help agents, teams, and offices manage and grow their businesses; and Market Leader’s Leads Direct and HouseValues leads products: delivering a guaranteed number of exclusive buyer and seller leads to agents, teams, and offices every month.<\/p>\n<p>Market Leader and EXIT Realty Corp. International kicked off this new partnership at EXIT’s recent Annual International Convention held at the Atlantis Resort in the Bahamas.<\/p>\n<p>“Part of our job as a franchisor is to source products and services for our brokerages and associates which will make it easier them to focus on their top priorities and Market Leader is one such company,” states Tami Bonnell, EXIT Realty’s CEO. “We have enjoyed a mutually beneficial relationship with them over the past 11 years and we are looking forward to working with them for years to come.”<\/p>\n<p>“EXIT Realty has been wonderful to partner with, and we’re delighted to announce our continued and expanded agreement,” said Scott Smith, President and General Manager of Market Leader. “We look forward to continuing to work closely with EXIT Realty and their agents to deliver powerful sales and marketing solutions to help grow their businesses.”<\/p>\n<h3>Market Leader<\/h3>\n<p>A pioneer in lead generation and contact management systems, Market Leader (www.marketleader.com) provides innovative online technology-based sales and marketing solutions for real estate professionals. Since 1999, Market Leader has helped real estate professionals succeed and grow, and today serves more than 200,000 agents, teams, brokerages, and franchises across the United States and Canada. Market Leader is a part of the Perseus Operating Group which is a division of Constellation Software Inc. Perseus is a provider of software solutions to a number of vertical markets and is a leading provider of software solutions to the real estate industry through its other businesses Z57, Zurple, Constellation Web Solutions, Sharper Agent, Birdview, and Diverse Solutions. For more information please visit http:\/\/csiregroup.com.<\/p>\n<h3>EXIT Realty<\/h3>\n<p>EXIT is a proven real estate business model that has, to-date, paid out more than a third of a billion dollars in single-level residual income to its associates across the U.S. and Canada. State-of-the-art technology including geolocation Smart Signs™ gives home sellers the edge in a competitive marketplace. A portion of every transaction fee collected by EXIT Realty Corp. International is pledged to its charity of choice and, to-date, more than $3.5 million has been pledged to Habitat for Humanity. For more information, please visit http:\/\/www.exitrealty.com.<\/p>\n<p>-end-<\/p>\n<p><strong>For further information:<\/strong><br \/>\nDebbie Connell<br \/>\nSr. Manager, Marketing<br \/>\n(425) 952-5636<br \/>\ndebra.connell@marketleader.com<br \/>\nwww.marketleader.com<\/p>\n","protected":false},"excerpt":{"rendered":"<p>BELLEVUE, Wash., Dec. 6, 2016 &#8212; Market Leader and EXIT Realty Corp. International today announced that they have extended and broadened their long-term partnership for providing sales and marketing tools to real estate professionals. Market Leader is the engine behind EXIT Promo Shop, a robust email, print, and direct mail Marketing Center. First launched in 2005 [&hellip;]<\/p>\n","protected":false},"author":33,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[51],"tags":[23,267,264,44,763,767,126,87,378,765,769,276],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/52019"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/33"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=52019"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/52019\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=52019"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=52019"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=52019"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}