{"id":52619,"date":"2017-07-26T16:56:40","date_gmt":"2017-07-26T23:56:40","guid":{"rendered":"http:\/\/www.marketleader.com\/?p=52619"},"modified":"2018-11-02T09:38:16","modified_gmt":"2018-11-02T16:38:16","slug":"realestatebusiness","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/realestatebusiness\/","title":{"rendered":"Real Estate Agent: You’re not a Businessman. You’re a Business, Man."},"content":{"rendered":"<p>(Or woman, for political correctness and inclusiveness).<\/p>\n<p>How do you view your business as a real estate agent?  Think about it &#8211; do you invest in yourself the way any other business owner would? Do you tend to the nuances that culminate to create your brand?<\/p>\n<p>There seems to be a common disconnect between how real estate agents perceive themselves and their business, as if they’re not one and the same. The most important element of a business in a crowded space is its brand and how it’s differentiated from the competition; i.e., how it’s perceived.<\/p>\n<p>The reality of the real estate game is that it’s no different from any other competitive industry and requires the same level of investment, if not more when you consider the stakes and magnitude of transactions processed. Your customers are often making the biggest purchase of their lives and if you can position yourself as someone who not only recognizes that, but honors it, you’re much more likely to win their trust and their business.<\/p>\n<h2>How to stand out in the crowded real estate space<\/h2>\n<p>First, let’s address some hard truths:<\/p>\n<ol>\n<li>The real estate market is massively saturated and, no matter how hot your market may be, the competition is diluting your inventory of buyers and sellers.<\/li>\n<li>Clients can have a hard time trusting agents.<\/li>\n<\/ol>\n<p>If you acknowledge these truths, you can immediately begin to identify and implement ways to stand out. On the bright side, the solution to these truths is often the same: Differentiate your brand by offering value, which builds trust and converts more leads.<\/p>\n<p>This article is about how to position your real estate business – i.e., your brand – in your market so 1) you get found, 2) you offer value, and 3) you earn the trust of your leads so that 4) you close more business.<\/p>\n<h3>Get Found<\/h3>\n<p>To be found, you need to be present in the digital world. Do you have a website? A blog? Social media accounts? Is your voice consistent across all touchpoints? This is the only area of your business where you are 100% in control of the information and messaging available to the public.<\/p>\n<p>Take a few minutes to review your professional site and social profiles to make sure 1) you’re accessible and 2) your messaging is consistent and professional.<\/p>\n<p><u>Website<\/u>: The number one thing driving consumers to your site should be local listings. If you have a <a href=\"http:\/\/www.marketleader.com\/products\/professional-for-agents\/\">branded website with MLS listings<\/a>, a visitor should instantly be able to browse and search listings in their target area from your homepage.<\/p>\n<p>When someone visits your website, they should immediately be able to learn:<\/p>\n<ul>\n<li>Where you’re located<\/li>\n<li>That you list, market and sell real estate<\/li>\n<li>How to contact you<\/li>\n<\/ul>\n<p>All this information should be displayed above the fold, which is the part of a website that is visible immediately upon visiting, without having to scroll.<\/p>\n<div id=\"attachment_52621\" style=\"width: 1254px\" class=\"wp-caption alignnone\"><img aria-describedby=\"caption-attachment-52621\" loading=\"lazy\" class=\"wp-image-52621 size-full\" src=\"\/wp-content\/uploads\/2017\/07\/website-above-fold.png\" alt=\"Real estate website\" width=\"1244\" height=\"905\" \/><p id=\"caption-attachment-52621\" class=\"wp-caption-text\">Real estate website musts<\/p><\/div>\n<p>Your website is a great way to attract and capture leads searching for listings in your target area, but you could also be attracting leads through content on your blog and engagement on social media.<\/p>\n<p><u>Blog<\/u>: This is where you can share information specific to your industry, market, community, and clients. How much you invest in creating and maintaining an active blog is completely up to you, but the more information you have posted here, the more likely you are to be found in searches and attract buyers and sellers in your area.<\/p>\n<p><u>Social Media<\/u>: Social is unique in that it is a two-way conduit for engaging with people and generating leads. It is the only digital channel in which you can listen to and engage your network. We’ll touch on that in a bit but be sure everything on your social profiles reflect your website, from posts to profile pictures.<\/p>\n<h3>Offer Value<\/h3>\n<p>Up to 90% of today’s buyer’s journey is self-guided, meaning customers are researching options, products, and businesses (read: YOU) on their own before they ever become a lead.<\/p>\n<p>To stand out, agents need to offer value to their clients (past and future), and this often comes in the form of content that is published on your blog, which lives on your website, and can be shared through your social profiles. Do you see where this is going?<\/p>\n<p>According to <a href=\"http:\/\/www.copyblogger.com\/content-marketing-goals\/\">copyblogger<\/a>, content should:<\/p>\n<ul>\n<li>Build trust and rapport with your audience<\/li>\n<li>Attract new prospects<\/li>\n<li>Provide solutions to clients&#8217; problems<\/li>\n<li>Build strategic partnerships<\/li>\n<li>Deepen loyalty with existing clients (read: <em>referrals and repeat business<\/em>)<\/li>\n<\/ul>\n<p>Sounds good, right?<\/p>\n<p>Some ideas for content include:<\/p>\n<ul>\n<li>Community News and Resources – This will help increase visibility when potential leads are researching specific neighborhoods and, in highlighting local businesses, you’ll develop relationships with local business owners which can lead to more exposure and referrals.\n<ul>\n<li>Local schools<\/li>\n<li>Food &amp; dining<\/li>\n<li>Local vendors &amp; contractors<\/li>\n<li>Local events<\/li>\n<\/ul>\n<\/li>\n<li>Local Market Reports<\/li>\n<li>FAQ’s about the process of buying\/selling a home – Tip: If you can tailor this to your Farm, even better.<\/li>\n<li>Lifestyle\n<ul>\n<li>DIY’s<\/li>\n<li>Recipes<\/li>\n<li>Decor<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<h3>Earn Trust<\/h3>\n<p>Trust is the filter through which all successful business must pass. Whatever you decide to share, a little bit of carefully crafted content that offers value will go a long way in increasing your visibility and earning the trust of leads.<\/p>\n<p>In addition to offering value through content, you can earn the trust of your leads by listening to and engaging with them on social media. Social listening is the act of searching posts by topic and location on social media channels &#8211; you can then join conversations, meet and engage with people in a way that is both personal and valuable. Be mindful: this is an opportunity to earn trust through meaningful interactions (answer questions, offer insights and commentary on topics relevant to your Farm &#8211; show off your expertise and offer value in every interaction).<\/p>\n<p>Per the <a href=\"http:\/\/www.hutrust.com\">HuTrust<\/a> model, “Trust drives 75% of client decisions,” and if a client trusts you, 82% of them will recommend you to others.<\/p>\n<h3>Convert More Business<\/h3>\n<p>Real estate agents who view their business and personal brand interchangeably recognize the need to differentiate themselves from other agents. Surprisingly, as crowded as the real estate industry is, there isn’t much competition when it comes to intentional branding and original content. Investing a small amount of time now to position yourself in any real estate market is a sure-fire way to:<\/p>\n<ul>\n<li>Stand out from the crowd<\/li>\n<li>Attract and capture leads organically<\/li>\n<li>Earn the trust of past and future clients<\/li>\n<li>Generate more referrals<\/li>\n<li>Convert more leads<\/li>\n<li>Be more profitable<\/li>\n<\/ul>\n<p>Market Leader Professional is an all-in-one software solution that helps agents attract, capture, and convert more leads. It includes a branded website with MLS listings that is extensively customizable. <a href=\"http:\/\/www.marketleader.com\/products\/professional-for-agents\/\">Learn more about Market Leader Professional.<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>(Or woman, for political correctness and inclusiveness). How do you view your business as a real estate agent?  Think about it &#8211; do you invest in yourself the way any other business owner would? Do you tend to the nuances that culminate to create your brand? There seems to be a common disconnect between how [&hellip;]<\/p>\n","protected":false},"author":51,"featured_media":52647,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[789,97,35],"tags":[87,56,96,136],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/52619"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/51"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=52619"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/52619\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media\/52647"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=52619"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=52619"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=52619"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}