{"id":53019,"date":"2017-08-17T15:42:15","date_gmt":"2017-08-17T22:42:15","guid":{"rendered":"http:\/\/www.marketleader.com\/?p=53019"},"modified":"2021-11-11T18:08:06","modified_gmt":"2021-11-12T02:08:06","slug":"is-linkedin-worth-your-time","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/is-linkedin-worth-your-time\/","title":{"rendered":"Is LinkedIn Worth Your Time?"},"content":{"rendered":"<p>LinkedIn, the professional networking site, reached <a href=\"https:\/\/techcrunch.com\/2017\/04\/24\/linkedin-hits-500m-member-milestone-for-its-social-network-for-the-working-world\/\">500 million users<\/a> in April 2017, 135 million of which are active users within the United States, but what does that mean for real estate professionals?<\/p>\n<p>It means there is a huge opportunity to network, connect, and impress people on LinkedIn – peers and prospects alike.<\/p>\n<p>According to <a href=\"https:\/\/www.statista.com\/statistics\/246176\/share-of-us-internet-users-who-use-linkedin-by-household-income\/\">Statista<\/a>, 77 percent of people in the U.S. on LinkedIn make over $50,000 a year, 45 percent of which bring in over $75,000. Paired with the fact that the typical home seller has a median household income of $100,700 (<a href=\"https:\/\/www.nar.realtor\/field-guides\/field-guide-to-quick-real-estate-statistics\">NAR<\/a>, 2015), LinkedIn&#8217;s users are likely to be potential home buyers and sellers.<\/p>\n<blockquote>\n<h4>There are 104 million people in the U.S. who are active on LinkedIn and make over $50,000 annually, 58 percent of which make more than $75,000<em>. <\/em><\/h4>\n<\/blockquote>\n<p>If the stats aren’t convincing enough, let’s dig into the theoretical potential that LinkedIn has to offer real estate agents.<\/p>\n<h3><strong>LinkedIn for networking<\/strong><\/h3>\n<p>As an industry that relies almost exclusively on relationships, it’s important for agents to cultivate a network of industry professionals to support each other and their business.<\/p>\n<p>This can be accomplished in the following two ways:<\/p>\n<p><u>Reconnect<\/u>: A great place to start building your LinkedIn network is by reconnecting with former colleagues, professional acquaintances, and fellow alumni from college.<\/p>\n<p><u>Groups<\/u>: There are over 1.5 million professional groups on LinkedIn that were created for the purpose of connecting with like-minded professionals and sharing industry resources.<\/p>\n<p>A few real estate groups worth mentioning:<\/p>\n<ul>\n<li><a href=\"https:\/\/www.linkedin.com\/groups\/118487\/profile\">Real Estate Professionals Referral Group<\/a> (117,821 members)<br \/>\n“Referral network group for real estate professionals around the country and world. The group’s purpose is to provide a source for real estate professionals when they have a client moving outside of their area who needs a great real estate agent. Since real estate is local, we allow local service providers who value referrals from other agents to also participate in the group.****Please do not post listings, local information or sales pitches here…”<\/li>\n<li><a href=\"https:\/\/www.linkedin.com\/groups\/134657\/profile\">Real Estate Professionals Group<\/a> (88,291 members)<br \/>\n“This group is exclusively for real estate professionals who follow the highest ethics and standards. Members are interested in educating consumers and other real estate professionals with their knowledge. The group is not for personal promotion.”<\/li>\n<li><a href=\"https:\/\/www.linkedin.com\/groups\/59\/profile\">Inman – Smart About Real Estate<\/a> Group (86,133 members)<br \/>\n“The purpose of this group is to promote greater networking within the real estate industry. Our hopes are that you can use this group as a tool to expand and grow your sphere of contacts. We do ask that you refrain from posting your listings or marketing your products… spam free environment.”<\/li>\n<\/ul>\n<p>You’ve likely noticed a common condition for group membership – No spam, personal promotion or marketing permitted. Groups offer a platform for building connections and sharing resources, not pitching sales. Always respect your audience.<\/p>\n<h3><strong>LinkedIn as a resource<\/strong><\/h3>\n<p>Aside from the resources that can be found in groups, LinkedIn can be a valuable resource for anyone looking for professional information or development.<\/p>\n<p>71 percent of professionals view LinkedIn as a credible source for professional information. As a professional networking site, whose primary contributors are professionals, it&#8217;s a great place to discover real estate news, reports, and insights. Find industry professionals whose content you appreciate and follow them to customize the feed on your homepage. LinkedIn users and influencers also tend to appreciate engagement more than other social platforms, like Twitter, where the average half-life of a post is 16 minutes. LinkedIn posts often garner engagement for days, meaning you&#8217;re much more likely to be seen and heard by your network.<\/p>\n<p>In addition to the wealth of robust articles published everyday, LinkedIn recently launched <a href=\"https:\/\/www.linkedin.com\/learning\/\">LinkedIn Learning<\/a>, a new digital learning platform designed to help professionals discover and develop their skills through personalized, data-driven experiences. The platform offers courses in real estate photography, sales, marketing, leadership, professional development, and pretty much any other skill you&#8217;d like to explore.<\/p>\n<h3><strong>LinkedIn as a source of new leads<\/strong><\/h3>\n<p>It’s important to mention that no social platform should be viewed as an individual source of new leads, but as one element of a lead generating ecosystem, if you will. Your lead sources should always be diversified and supplemental of each other. If you’re not sure what your lead mix should look like, our <a href=\"http:\/\/www.marketleader.com\/leadcalculator\/\">Lead Calculator<\/a> can help you.<\/p>\n<p><span style=\"text-decoration: underline;\">Collect Recommendations<\/span>: LinkedIn is a great place to collect recommendations from colleagues, past clients and professional acquaintances. Showcasing these testimonials is a great way to boast, without having to boast. In addition to highlighting the benefits of working with you, your recommendations are likely to garner referral business and impress any prospects who might be researching your business.<\/p>\n<p><span style=\"text-decoration: underline;\">Cultivate an audience:<\/span> Do you have a blog that you publish content on? Share your content on LinkedIn to grow your audience, drive traffic back to your website, and build credibility in your network. The more value and unique insights into your local market you can offer your network, the better your content will fare.<\/p>\n<p>Your content on LinkedIn should align with two goals: :<\/p>\n<ol>\n<li>Demonstrate expertise.<\/li>\n<li>Provide value to your network, real estate professionals and prospects alike.<\/li>\n<\/ol>\n<p>Because LinkedIn is a professional platform, levels of trust are higher and consumers are more influenced by their professional networks (<a href=\"https:\/\/business.linkedin.com\/content\/dam\/business\/marketing-solutions\/global\/en_US\/campaigns\/pdfs\/b2c-research-ebook-us.pdf\">LinkedIn<\/a>, 2014). Using the site as a platform to publish and distribute valuable content means increased equity, which earns you the trust of both your peers and prospects.<\/p>\n<p>Real estate agents who take the time to craft a LinkedIn profile with a strong network and valuable content only serve to cultivate a holistic online presence. If your LinkedIn profile provides value to the professional community, lead generation will be but a subsequent byproduct of your efforts.<\/p>\n<p>Users on LinkedIn have nearly <a href=\"https:\/\/business.linkedin.com\/content\/dam\/business\/marketing-solutions\/global\/en_US\/campaigns\/pdfs\/b2c-research-ebook-us.pdf\">twice as much<\/a> buying power than those on Facebook and, while LinkedIn might not be a lead-generating machine, there is much promise.<\/p>\n<p>If you build the network, the leads will come.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>LinkedIn, the professional networking site, reached 500 million users in April 2017, 135 million of which are active users within the United States, but what does that mean for real estate professionals? It means there is a huge opportunity to network, connect, and impress people on LinkedIn – peers and prospects alike. According to Statista, 77 [&hellip;]<\/p>\n","protected":false},"author":51,"featured_media":53031,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[83,104],"tags":[],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/53019"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/51"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=53019"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/53019\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media\/53031"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=53019"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=53019"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=53019"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}