{"id":53123,"date":"2017-08-23T12:27:53","date_gmt":"2017-08-23T19:27:53","guid":{"rendered":"http:\/\/www.marketleader.com\/?p=53123"},"modified":"2022-01-26T13:19:10","modified_gmt":"2022-01-26T21:19:10","slug":"how-to-become-a-successful-real-estate-agent","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/how-to-become-a-successful-real-estate-agent\/","title":{"rendered":"How to Become a Successful Real Estate Agent"},"content":{"rendered":"<p><a href=\"https:\/\/www.tomferry.com\/blog\/87-of-all-agents-fail-in-real-estate\/\">Tom Ferry<\/a> tells us that 87 percent of agents leave the industry within the first five years of getting their real estate license. Others put that figure near 95 percent. Suffice to say, most new agents quit during the early years of their practice.<\/p>\n<p>Why is the attrition rate so high? More important, what can you do to avoid becoming a real estate churn rate statistic?<\/p>\n<h2><strong>Banish unrealistic expectations.<\/strong><\/h2>\n<p>From the outside looking in, the life of a real estate agent seems ideal – the perfect blend of a flexible schedule and a hefty salary. The allure of this easy money prompts far too many to run to their nearest real estate school to take the classes necessary to get their state’s sales license.<\/p>\n<p>Among the many aspects of the industry that they fail to understand is that real estate agents are small business owners. Sure, they’ll hang their licenses with a broker, but the rest of “being a real estate agent” is all up to the individual.<\/p>\n<p>That flexible schedule? In a sense, that outside perspective holds true.<\/p>\n<h4><strong>A new agent’s schedule is Gumbyesque – bendable, pliable and infinitely flexible. <\/strong><\/h4>\n<p>There is no boss to dictate working hours, tasks that must be completed or when to take a vacation. The broker doesn’t care what her agents do or when – if they’re making money.<\/p>\n<p>Starting a business is hard work and entails long hours- yes, that means working evenings and weekends. The truth is, the traditional, Monday through Friday, 9-to-5 employee probably has more flexibility in his or her schedule than the rooky real estate agent. At least a rooky agent with a drive to succeed.<\/p>\n<p>Then, there are those big bucks that so many people outside of the industry assume agents bank. While it’s an old inside joke that 20 percent of agents do 80 percent of the business, it holds some truth.<\/p>\n<p>The latest NAR Member Survey revealed that 24 percent of members make less than $10,000 and an equal number make more than $100,000. The rest of them earn a salary that falls somewhere in-between.<\/p>\n<p>To put this in perspective, 76 percent of agents make less than $100,000 a year and agents with two years or less experience had a median gross income of $8,930.<\/p>\n<p>The good news is, there are ways to beat these odds.<\/p>\n<h2><strong>You’ll need a stash of cash.<\/strong><\/h2>\n<p>A lack of a steady income is the main reason agents give for leaving the business (Ferry, 2014). Real estate is a long-term game that requires substantial planning and preparation. You’ll need to build a nest egg to live off before the commission checks come rolling in.<\/p>\n<p>You’ll also need some upfront cash for startup costs.<\/p>\n<p>The licensing sequence starts with real estate school. Then you’ll need to apply to take the state licensing exam. When you pass the exam, you’ll need to apply for the state license and, in some cases, submit background information and fingerprints.<\/p>\n<p>Once licensed, you’ll need to hang the license with a broker. This is when you really start hemorrhaging money.<\/p>\n<p>Most brokers require membership in the National Association of Realtors (NAR). To obtain membership, however, you must also join the local and state associations and the local MLS.<\/p>\n<p>If you want to sell real estate in Riverside, California. You’ll need to join the local, state and national association (standard in all areas), pay your MLS dues, a one-time MLS Security Fee and a New Member Orientation Fee.<\/p>\n<h4>These fees can be substantially less if you join in December than if you join in January so research pricing ahead of time to potentially save some money.<\/h4>\n<p>Ok, so you have your license and you’ve joined necessary associations- some brokerages will ask you for an errors and omissions insurance fee. Coldwell Banker requires either an annual payment or $235.00 per month.<\/p>\n<p>Finally, there are smaller incidental outlays for things such as business cards, signs, and marekting.<\/p>\n<h4>Startup fees are estimated to be between $1500-2000 (Investopedia, 2017).<\/h4>\n<p>Be sure to look into your local and state fees so you’re able to budget accordingly.<\/p>\n<h2><strong>Choose your broker carefully.<\/strong><\/h2>\n<p>Most of us can recall how challenging it was to decide which office we wanted to work out of and not knowing anyone in the business in your town makes it even more difficult. It’s a pity because seasoned real estate agents have plenty insight to offer.<\/p>\n<blockquote>\n<h4>“The people you surround yourself with in the beginning is critical. Having people that are going to support you, help you grow, and be your cheerleader is just huge … It’s a tough business. You get a lot of rejection. You kind of need that positive strength behind you.” &#8211; <a href=\"\/blog\/agent-spotlight-laurie-weston-davis-of-pinehurst-nc\/\">Laurie Davis<\/a><\/h4>\n<\/blockquote>\n<p>My first broker wouldn’t let me work with clients until I could read both the listing and purchase agreement upside down.<\/p>\n<p>His reasoning for this is that I would be sitting across the table from the buyer or seller and, when they asked questions, I would need to recognize which part of the contract they were pointing at.<\/p>\n<h4>New-agent training is the foundation for your new business, so make this criterion a priority.<\/h4>\n<blockquote>\n<h4>“Listen very carefully and ask a lot of questions.” &#8211;<a href=\"https:\/\/desty.kw.com\/\">Desty Lorino<\/a>, Coldwell Banker<\/h4>\n<\/blockquote>\n<h6>Basic considerations when choosing a broker include:<\/h6>\n<ul>\n<li>How does the broker market the brokerage? Look for signs, ads and check the website.<\/li>\n<li>What type of training is offered to the new agent?<\/li>\n<li>Technology – will you be asked to supply your own or will the broker supply you with an office computer and software?<\/li>\n<li>Who else works under the broker (you’ll need a mentor and supportive colleagues).<\/li>\n<\/ul>\n<p>You’ll also want to know what your split of the commission will be, but this shouldn’t be a condition for choosing a broker – at least not when you’re new.<\/p>\n<h2><strong>Create a plan.<\/strong><\/h2>\n<p>All new businesses benefit from a business plan. A business plan is a map of how you’ll reach your income goals. It’s important to note that business plans aren’t static and require fine-tuning as you move up in your real estate career.<\/p>\n<p>Here are some great resources to help you get started:<\/p>\n<ul>\n<li><a href=\"\/blog\/2017-real-estate-business-planning-essentials\/\">Market Leader’s Real Estate Business Planning Essentials<\/a> Webinar<\/li>\n<li><a href=\"https:\/\/success.marketleader.com\/l\/42972\/2016-10-07\/5dx62t\">2017 Real Estate Business Plan<\/a> with free downloads of worksheets, marketing guides and samples<\/li>\n<li><a href=\"\/blog\/realestatebusiness\/\">How to stand out and position your business in real estate<\/a><\/li>\n<li><a href=\"https:\/\/www.inman.com\/2016\/01\/06\/7-must-haves-real-estate-marketing-plan\/\">Inman<\/a> offers additional marketing resources<\/li>\n<\/ul>\n<h3><strong>Additional considerations<\/strong><\/h3>\n<p>There is a plethora of reasons new agents don’t go the distance, but it’s important to note that most of them come down to unrealistic expectations, a lack of planning, or both. If you’re serious about getting your career off the ground, starting your journey with the right expectations and tools will make the world of difference. It can be done, but it takes work.<\/p>\n<p>Some priceless advice to heed:<\/p>\n<ul>\n<li>Watch your mind set: You are no longer an employee, but a small business owner. Self-motivation is key.<\/li>\n<li>Don’t spend all your time chasing buyers: “List to last” is a phrase you’ll hear a lot. “Go into nearly any real estate office in North America during any kind of market, ask to meet the top producer, and the odds are you’ll soon be shaking the hand of someone whose income comes mostly from listing,” warns Matt Williams in Realtor Mag.<\/li>\n<li>You simply must find a mentor. The benefits of someone else’s experience are incalculable. “Find a mentor; somebody that knows what he or she is doing, is successful and who is willing to teach you,” insists Dano Sayles of RE\/MAX Lifestyle, Maui.<\/li>\n<li>Don’t treat setbacks as the end-of-the-world-as-we-know-it. Michael Jordan was cut from his high school basketball team. “I have failed over and over and over again in my life. And that is why I succeed,” he said. Remember: about 60 percent of sales take place after a prospect says “no” at least four times, according to Dirk Zeller.<\/li>\n<li>Load up on tech as soon as possible. “Get a good contact management database … learn everything you can about it – how it works and what it can do for you. That database will be the one thing that’s gonna make you a lot of money in the future,” suggests Robert Russell, broker\/owner of Robert J. Russell Real Estate in Dallas. Laurie Davis agrees: “Having the website, the CRM and all of the things you’ll need in place from the start is important,” she says.<\/li>\n<li>Get involved in the community. Rub shoulders, cultivate relationships, take names and business cards. Community involvement shows not only your commitment to the community you serve, but helps to build your sphere of influence too.<\/li>\n<li>Failures don’t answer their phones, don’t return calls quickly and don&#8217;t follow up.<\/li>\n<\/ul>\n<p>Even if you’re doing everything right, the ca-ca may hit the fan. Keep in mind these wise words of an <a href=\"https:\/\/www.reddit.com\/r\/RealEstate\/comments\/40iv5i\/why_i_quite_my_real_estate_job_an_open_letter_to\/\">11-year veteran<\/a> of the real estate industry: “every year I am guaranteed at least one full blown existential crisis where I threaten to throw it all away. Then the phone rings, and I pick it up, because that&#8217;s what I do.”<\/p>\n<p>What about you seasoned agents? Any advice for those who are up and coming?<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Tom Ferry tells us that 87 percent of agents leave the industry within the first five years of getting their real estate license. Others put that figure near 95 percent. Suffice to say, most new agents quit during the early years of their practice. Why is the attrition rate so high? More important, what can [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":53139,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[83],"tags":[],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/53123"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=53123"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/53123\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media\/53139"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=53123"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=53123"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=53123"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}