{"id":53169,"date":"2017-08-28T13:58:45","date_gmt":"2017-08-28T20:58:45","guid":{"rendered":"http:\/\/www.marketleader.com\/?p=53169"},"modified":"2021-12-03T07:28:56","modified_gmt":"2021-12-03T15:28:56","slug":"the-truth-about-millennials-and-real-estate","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/the-truth-about-millennials-and-real-estate\/","title":{"rendered":"The Truth About Millennials and Real Estate"},"content":{"rendered":"<p>If you think millennials are more interested in spending their money on <a href=\"https:\/\/time.com\/nextadvisor\/mortgages\/first-time-homebuyer-loans-and-programs\/\">avocado toast<\/a> than they are investing in real estate, think again. Despite a flood of articles in recent years claiming that the generation, <a href=\"https:\/\/time.com\/247\/millennials-the-me-me-me-generation\/\">ridiculed <\/a>for an inability to commit and a sense of entitlement, isn’t interested in investing in real estate, new data has shed light on the truth: millennials aren’t just participating in today’s housing market, they’re <em>powering <\/em>it.<\/p>\n<p>NAR <a href=\"https:\/\/www.nar.realtor\/research-and-statistics\/research-reports\/home-buyer-and-seller-generational-trends\">reported<\/a>, for the fourth consecutive year, that millennials were the largest group of home buyers in 2017. Additionally, 53 percent of millennials are already homeowners and 88 percent of those who don’t currently own are planning to buy.<\/p>\n<p>Being the first generation native to the Digital Age, millennials’ upbringing with ubiquitous access to information sets them apart from generations’ past. They’re both tech and bargain-savvy. They know how to conduct their own research and they seek out brand and product reviews to make informed decisions.<\/p>\n<p>This could be raising the bar for service in the real estate industry, with higher expectations that are likely a byproduct of other industries’ efforts to cater to the generation. Retail, for example, has had to switch gears entirely to accommodate the digital, low-cost preferences of millennials and countless brick and mortar retailers who failed to adapt are now <a href=\"https:\/\/www.bloomberg.com\/news\/articles\/2017-04-07\/stores-are-closing-at-a-record-pace-as-amazon-chews-up-retailers\">closing their doors<\/a>. While the generation’s buying power may have been overlooked in the past, it’s irrefutable today.<\/p>\n<p>The key to building your millennial clientele is understanding their unique pain points. What don’t they understand? What questions are they asking? If you understand what millennials are looking for, where they need help, and what they value most in a real estate agent, you can position yourself to be exactly what they need.<\/p>\n<h2>Millennial Buyers<\/h2>\n<p>Two-thirds of all first-time home buyers today are millennials (NAR, 2017). They&#8217;re not likely know the ins-and-outs of the home buying process, or even what research to conduct prior to making any decisions. Be sure to showcase your expertise and make yourself available as a resource to help them through this process, as well as highlight any information they may be overlooking. The more valuable you make yourself, the more likely they are to work with you and refer you to others.<\/p>\n<p>56 percent of millennials who bought homes in 2017 ended up purchasing a home they found online and only 28 percent found their home through an agent. What does this mean for real estate professionals interested in tapping the millennial market? You need to position yourself as a resource and be sure your website can be used as a platform for searching MLS listings. When your buyers are looking online, you want to be a part of that process.<\/p>\n<p>Millennials also found the home buying process to be more difficult than other generations, so take time to walk them through everything they need to know, from finding the right property to mortgage options and paperwork. Ensuring they understand each step in the home buying process will set you apart and prove that you are 1) valuable and 2) worth your commissions.<\/p>\n<h2>Millennial Sellers<\/h2>\n<p>53 percent of millennials are already homeowners and their average home-ownership tenure is four years shorter than other generations. Of millennials that currently own homes, 60 percent reported plans to sell next year. They are buying and selling homes at a rate that will continue to fuel the housing market for years to come and will be the generation that provides relief to the <a href=\"https:\/\/www.realtor.com\/research\/housing-shortage-boomers\/\">clogged market<\/a> caused by Baby Boomers holding onto inventory. They are a potential real estate gold mine for agents prepared to meet their needs.<\/p>\n<p>Nela Richardson, chief economist at Redfin, <a href=\"https:\/\/www.nbcnews.com\/business\/real-estate\/who-s-powering-housing-market-surprise-it-s-millennials-n768196\">reported<\/a> seeing 73 percent of millennial sellers try to negotiate with the listing agent for a lower commission, compared to 44 percent of Gen-Xers and 24 percent of boomers, and nearly two thirds of millennials who tried to get a lower commission rate percent reported being successful. We’re not recommending that you discount your commissions, but consider the lifetime value millennials bring to the table with recurring business and their network of referrals – it might be worthwhile to create a loyalty or referral program to offer incentive (and improve loyalty). <em>Everyone<\/em> loves incentives. These programs serve as a proactive approach to tackling negotiations, and a great way to meet such requests.<\/p>\n<p>Millennials may have been late bloomers, but they have arrived and will continue to power the real estate market for the unforeseeable future.<\/p>\n<p>Have experience working with millennials or another generation you find to be unique? We&#8217;d love to hear from you in the comments.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Despite a flood of articles in recent years claiming that the generation, ridiculed for an inability to commit and a sense of entitlement, isn’t interested in investing in real estate, new data has shed light on the truth &#8211; millennials aren’t just participating in today’s housing market, they’re powering it.<\/p>\n","protected":false},"author":51,"featured_media":53171,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[83],"tags":[],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/53169"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/51"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=53169"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/53169\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media\/53171"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=53169"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=53169"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=53169"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}