{"id":53223,"date":"2017-08-30T10:32:54","date_gmt":"2017-08-30T17:32:54","guid":{"rendered":"http:\/\/www.marketleader.com\/?p=53223"},"modified":"2022-01-26T13:18:29","modified_gmt":"2022-01-26T21:18:29","slug":"how-to-get-seller-leads-in-a-low-inventory-market","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/how-to-get-seller-leads-in-a-low-inventory-market\/","title":{"rendered":"How to Get Seller Leads in a Low-Inventory Market"},"content":{"rendered":"<p>Chasing down seller leads in this era of squeaky-tight inventories is far from easy, but it’s not impossible.<\/p>\n<p>Housing industry experts are placing the low inventory problem squarely on the shoulders of baby boomers. “By not downsizing, baby boomers help clog up the real estate pipeline,” blasts the <a href=\"https:\/\/www.washingtonpost.com\/realestate\/by-not-downsizing-baby-boomers-help-clog-up-the-real-estate-pipeline\/2015\/12\/01\/ec88299e-978f-11e5-b499-76cbec161973_story.html?utm_term=.afb50473fc82\">Washington Post<\/a>.  NAR also attributes the housing shortage to the boomer generation’s reluctance to sell.<\/p>\n<p>85 percent of Americans over the age of 55 don’t plan on selling their homes within the next year because their current homes fit their lifestyles (<a href=\"https:\/\/www.realtor.com\/research\/housing-shortage-boomers\/\">Realtor.com®<\/a>, 2017).<\/p>\n<p>The good news is, the most pent-up demand right now is for starter homes. “Starter homes receive 1.12 times more views than the typical listing, and 1.37 times more views than large homes,” (NAR, 2017).<\/p>\n<p>If it’s starter homes we need, we should be looking at younger homeowners. 47 percent of homes on the market last year were sold by owners under the age of 50, with over half of millennial homeowners planning to sell in the next two years and more than one-third of Gen X homeowners as well.<\/p>\n<p>There, oh real estate marketing genius, is your <strong>target audience<\/strong>. These are the homeowners you need to pursue to get listings.<\/p>\n<h2>Start in your own backyard<\/h2>\n<p>While client appreciation events aren’t exactly new school, holding one for <em>potential<\/em> clients is. The idea here is to <a href=\"\/blog\/real-estate-marketing-ideas-for-referrals-repeat-business\/\">expose your business<\/a> to several people, simultaneously, getting up close and personal with potential sellers.<\/p>\n<p>Hold an end-of summer barbecue, an autumn crab feed or any other event in which food is served.<\/p>\n<h4>Why?<\/h4>\n<p>More than half of millennials surveyed claimed they decided to attend an event because there were free drinks or food (<a href=\"https:\/\/www.splashthat.com\/resources\/millennialz\">Splash<\/a>, 2017).<\/p>\n<p>You’ll need to create an attractive and compelling invitation because 40 percent of millennials surveyed by Splash said that they wouldn’t attend the event “if the invite or event page is ugly.”<\/p>\n<p>Since nearly 60 percent of the members of this generation say they attend events that promise a chance to meet new people, brand your event as a community-builder; a way for them to get to know their neighbors better.<\/p>\n<p>Keep in mind that more than half of millennials are now parents, so keep the event family-friendly and let them know they’re welcome to bring the kids.<\/p>\n<p>For even better traction, offer to give $5 to a popular local charity for each person who attends.“Millennials will be more likely to buy from you and continue engaging with you if you have some verifiable claim to giving back to the community,” suggests <a href=\"https:\/\/www.forbes.com\/sites\/jaysondemers\/2016\/06\/27\/7-ways-to-target-millennials-through-content-marketing\/?sh=4ce27d9d3e7f\">Jayson DeMers<\/a>, Founder &amp; CEO of AudienceBloom.<\/p>\n<p>Then, invite every millennial, Gen Xer, and owner of a starter home in your neighborhood, farm area, and database. Then, comb that CRM for parents of Gen X and Gen Y, and invite them too.<\/p>\n<h2>Move out into the community<\/h2>\n<p>If you’re low on cash or feel that you can’t draw the right audience to your neighborhood event, consider joining a local event, as a vendor.<\/p>\n<p>Of the nearly 42 million Americans who consider themselves runners, millennials compose the largest demographic, according to Running USA’s “The Millennial Running Study,” so community fun run\/walk events are ideal venues.<\/p>\n<p>Erect a pop-up tent and bill it as a beverage station at the finish line. Then, as runners stop in, hand them a free local housing market report (branded, of course) with their free beverage (brand these too, for extra mileage).<\/p>\n<p>Sponsoring a youth sports team will also get your brand into the eye of the right audience. Showing up at the games, perhaps providing the half-time snack, will help further cement your services in their minds.<\/p>\n<p>Whatever you can do to get your name and face in front of large groups of people will increase your chance of getting seller leads.<\/p>\n<h2>Beef up your online presence<\/h2>\n<p>If you wonder why your CRM is devoid of millennial leads, check out your website. If you’re like far too many agents, it’s full of self-promotion and overused real estate salesy jargon.<\/p>\n<p>Consider this: 84 percent of millennials don’t like or trust traditional advertising and sales messages (<a href=\"https:\/\/www.themccarthygroup.com\/\">The McCarthy Group<\/a>).<\/p>\n<p>Your first task is to rid your website of anything that is obviously aimed at making a sale.<\/p>\n<p>To a millennial, this type of advertising is deceitful, impersonal, and it has no value. Content marketing and social media use are indirect methods of bolstering your brand’s reputation.<\/p>\n<p>This doesn’t mean you can’t employ calls to action and other lead gen techniques on your website – on the contrary. Just concentrate on not clubbing your readers over the head with them – subtlety is key.<\/p>\n<p>Then, turn your attention to your social media presence. If that consists of Facebook postings of your listings, stop it! It’s called “social” media for a reason, so get social. Engage your followers in conversation. Take the time to respond to others’ posts. In a nutshell: pay attention.<\/p>\n<p>If you aren’t pushing your blog posts out on your social media sites, you should be. What good are they doing just sitting on your website when they could be used as a tool for driving traffic to your website?<\/p>\n<h2>Find the golden nuggets in your CRM<\/h2>\n<p>While this one isn’t exactly novel, it’s effective. It&#8217;s always a good time to get in touch with past clients. Give then a call – tell them how tight inventory is right now and how the market is full of buyers clamoring for homes. Then, ask if they know anyone who is thinking of selling.<\/p>\n<p>Once you get those warm calls out of the way, dig into any old leads that went cold – especially if they include expired listings. Cold calling stinks, but if you get even one listing, it will have been worth it. So, pick up the phone.<\/p>\n<p>Remember: target the right audience, rub shoulders in your community, differentiate yourself online and reach out to past clients and leads in your <a href=\"\/solutions\/crm\/\">real estate CRM<\/a>. If you&#8217;re creative in your lead generation techniques, not only will you start generating seller leads but you&#8217;ll be stocking your pipeline for seasons to come.<\/p>\n<p>&nbsp;<\/p>\n<h4>Are you a listing agent with recommendations of your own? We&#8217;d love to hear from you in the comments!<\/h4>\n<h2>Want Guaranteed Leads for Your Business?<\/h2>\n<p>With Market Leader, you can get a guaranteed number of leads every month that are exclusive — not shared with other agents. <strong>Lead inventory is limited, so check availability in your desired areas today.<\/strong><\/p>\n<p><a class=\"et_pb_more_button et_pb_button\" style=\"color: #ffffff; border-color: #0079c1; background-color: #0079c1;\" href=\"\/products\/real-estate-leads\/\">Check Lead Availability<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Chasing down seller leads in this era of squeaky-tight inventories is far from easy, but it’s not impossible. With these lead generation techniques, not only will you generate seller leads but you&#8217;ll be stocking your pipeline for seasons to come.<\/p>\n","protected":false},"author":27,"featured_media":53243,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[83],"tags":[],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/53223"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=53223"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/53223\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media\/53243"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=53223"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=53223"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=53223"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}