{"id":53335,"date":"2017-09-19T09:22:30","date_gmt":"2017-09-19T16:22:30","guid":{"rendered":"http:\/\/www.marketleader.com\/?p=53335"},"modified":"2022-01-26T13:14:54","modified_gmt":"2022-01-26T21:14:54","slug":"2018-real-estate-trends-boomerang-buyers","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/2018-real-estate-trends-boomerang-buyers\/","title":{"rendered":"2018 Real Estate Trends: Boomerang Buyers"},"content":{"rendered":"<h4>This is the first article in a new series highlighting 2018 real estate trends.<\/h4>\n<p>Judging by the scarcity of 2018 housing market forecasts, it’s safe to say that many feel it’s a bit early to be thinking about next year. We beg to differ.<\/p>\n<p>You’re just a few months away from implementing that <a href=\"https:\/\/success.marketleader.com\/l\/42972\/2017-09-26\/655jdj\">2018 business plan<\/a> (you are working on it, right?) and knowing where you’ll need to focus your marketing dollars and energy is critical.<\/p>\n<p>To learn that, you’ll need, at minimum, an idea of what type of market you’re facing, who the major players will be and how you’ll reach them. You’ll also need to know what will work and what won’t in 2018.<\/p>\n<p>Over the next few weeks you’ll find trends to pay attention to and how you can best market your real estate business to ride the 2018 wave. Don’t forget to check back!<\/p>\n<h3><strong>The 2018 Real Estate Market<\/strong><\/h3>\n<p>If there is one thing most early forecasters agree on, it’s that home prices will continue to rise. Where they part ways, however, is how much they will rise, with some claiming 3.65 percent and others, such as <a href=\"https:\/\/www.businesswire.com\/news\/home\/20170905006155\/en\/CoreLogic-US-Home-Price-Report-Shows-Prices-Up-6.7-Percent-in-July-2017\">CoreLogic<\/a>, indicating “that home prices will increase by 5 percent,” from July of this year through July of 2018.<\/p>\n<p>Either prediction is good news for real estate consumers, however, because both beat 2016’s heady increase of nearly 7 percent.<\/p>\n<p>Mortgage rates are expected to increase as well. Back in late March, Federal Reserve Vice Chairman Stanley Fischer told CNBC to expect two more rate hikes by the end of 2017. We got one of them in June and, in July, the Fed decided to hold off on another. But forecasters <a href=\"https:\/\/www.housingwire.com\/articles\/36546-fannie-mae-expect-fed-rate-hikes-in-june-and-december\/\">predict<\/a> the next one will hit in December.<\/p>\n<p>Forecasting how high 2018 mortgage rates will climb is nearly impossible, although, back in April, the Mortgage Bankers Association (MBA) said that they expect the “benchmark 30-year rate to climb above the 5% threshold sometime around the middle of 2018,” according to Brandon Cornett at the <a href=\"http:\/\/www.homebuyinginstitute.com\/news\/mortgage-rate-forecast-for-april-754\/\">Home Buying Institute<\/a>.<\/p>\n<p>So, yes, homes will become less affordable for those on the edge of the affordability envelope. Many will be knocked completely out of the buyer pool. But, have no fear – the boomerang buyers may just make up for the loss of the cash-strapped buyer.<\/p>\n<h4><strong>Gear up your marketing for boomerang buyers.<\/strong><\/h4>\n<p>While exact figures vary, the National Center for Policy Analysis estimates that as many as 10 million Americans were forced into foreclosure when the housing bubble burst. The effects of the Great Recession, which officially ended in June 2009, according to Investopedia, will finally ease for about 1.5 million of these Americans.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter wp-image-53341\" src=\"\/wp-content\/uploads\/2017\/09\/Boomerang-Buyers-2018.jpg\" alt=\"Boomerang Buyers \" width=\"800\" height=\"800\" \/><\/p>\n<p>The <a href=\"https:\/\/selling-guide.fanniemae.com\/Selling-Guide\/Origination-thru-Closing\/Subpart-B3-Underwriting-Borrowers\/Chapter-B3-5-Credit-Assessment\/Section-B3-5-3-Traditional-Credit-History\/1032994681\/B3-5-3-07-Significant-Derogatory-Credit-Events-Waiting-Periods-and-Re-establishing-Credit-08-07-2019.htm\">waiting period<\/a> after a foreclosure is seven years, measured from the completion date of the foreclosure action as reported on the credit report or other foreclosure documents provided by the borrower. If the borrower can document extenuating circumstances, the wait may be cut to three years.<\/p>\n<p><strong>Get to know this group of potential buyers:<\/strong><\/p>\n<p>Knowing your audience is half of the battle when it comes to marketing. From the content you offer up in your newsletters and on your website to the stories and videos you choose to share on social media, laser focusing your marketing efforts, especially early in the year, is critical.<\/p>\n<h3>So, who are these buyers-on-the-rebound?<\/h3>\n<p><strong>They need low down payment loans.<\/strong><\/p>\n<p>“Comparisons of the buying preferences between boomerang buyers and traditional non-distressed, owner-occupied repeat buyers show that boomerang buyers are, on average, four times more likely to finance with FHA loans than the latter,” suggests <a href=\"https:\/\/www.corelogic.com\/intelligence\/find-stories\/boomerang-buyers-making-a-gradual-return\/\">Kristine Yao at CoreLogic<\/a>.<\/p>\n<p>Content geared toward these buyers should let them know that the mortgage process has changed since they purchased their last home. Remember, lending standards were beyond loose and they may even have bought the home with no down payment. They need to know that most mortgages require down payments today.<\/p>\n<p>Information on the FHA loan process &#8212; how to get the lowest down payment in the program, how to buy a condo with an FHA-backed loan, how to find out if a condo community is FHA-approved – is valuable information to 2018’s boomerang buyer.<\/p>\n<p><strong>They’ve been forgotten.<\/strong><\/p>\n<p>Watch TV for any amount of time and you’ll see that <a href=\"\/blog\/the-truth-about-millennials-and-real-estate\/\">millennials <\/a>and baby boomers are the primary target for marketers. If you hope to attract the rebound buyer, however, you’ll be the one marketer in town who focuses on the forgotten generation, Gen X.<\/p>\n<p>The average age of a homeowner who lost a home to foreclosure during the recession was 45, according to a report published by the Federal Reserve Bank of St. Louis. So, expect that your average boomerang buyer will likely be in his or her early 50s.<\/p>\n<p>And, there’s proof that they’re already reentering the housing market, according to <a href=\"https:\/\/www.realtor.com\/news\/trends\/generation-x-real-estate-comeback\/\">Realtor.com’s<\/a> Clare Trapasso. Members of Gen X are “the only generation to buy more homes last year than it did in the previous one.”<\/p>\n<p>When choosing an agent, these tech-adept, pragmatic individuals want, <em>more than anything else<\/em>, proof that you’ll do what you say you’ll do, so include lots of testimonials and success stories in your marketing materials.<\/p>\n<p><img loading=\"lazy\" class=\"wp-image-53343 aligncenter\" src=\"\/wp-content\/uploads\/2017\/09\/Boomerang-Buyers.jpg\" alt=\"\" width=\"800\" height=\"800\" \/><\/p>\n<p>Get active on social media as well, because, according to <a href=\"https:\/\/www.adweek.com\/brand-marketing\/5-reasons-marketers-have-largely-overlooked-generation-x-170539\/\">Adweek’s<\/a> Robert Klara, 75 percent of Gen Xers routinely rely on social networks and online reviews when researching products and services.<\/p>\n<p>Most of all, members of this generation are focused on their bonds with their children. Proving the value of homeownership by putting it in terms of <a href=\"https:\/\/www.marketingprofs.com\/articles\/2009\/3116\/marketing-to-the-new-gen-x\">“protecting and nurturing”<\/a> their child’s future will appeal far better to them than other generations.<\/p>\n<p><strong>They are currently renting.<\/strong><\/p>\n<p>If you don’t currently market to tenants, make 2018 the year that you start. When doing this, your <a href=\"\/solutions\/crm\/\">real estate CRM<\/a> will be your most important tool, so dig into it and start focusing on more renters.<\/p>\n<p>Target apartment complexes, condo and townhome communities. Aside from talking up the financial benefits of owning rather than renting, let them know about local, state and national down payment assistance programs. Ask your preferred lender to help you create charts or other visuals showing these potential buyers that they can own a home for the what they currently pay in rent.<\/p>\n<p>“Tired of paying rent? Own a new home for $799\/mo.” is an incredibly powerful message to someone who doesn’t know about the various programs available to homebuyers.<\/p>\n<p>Keep boomerang buyers in mind as you put together your 2018 business plan. There is huge potential in this pool of opportunity.<\/p>\n<p>We’re excited about the real estate industry in 2018 and the opportunities available to agents. Check back next week to see what&#8217;s in store and learn more!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>This is the first article in a new series highlighting 2018 real estate trends. Judging by the scarcity of 2018 housing market forecasts, it’s safe to say that many feel it’s a bit early to be thinking about next year. We beg to differ. You’re just a few months away from implementing that 2018 business [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":53357,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[35,803],"tags":[],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/53335"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=53335"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/53335\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media\/53357"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=53335"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=53335"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=53335"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}