{"id":53369,"date":"2017-09-22T15:17:55","date_gmt":"2017-09-22T22:17:55","guid":{"rendered":"http:\/\/www.marketleader.com\/?p=53369"},"modified":"2022-01-26T13:14:39","modified_gmt":"2022-01-26T21:14:39","slug":"the-truth-about-online-real-estate-leads","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/the-truth-about-online-real-estate-leads\/","title":{"rendered":"Why Online Real Estate Leads Aren&#8217;t for Everyone"},"content":{"rendered":"<p>Have you ever wondered exactly how online real estate leads work and if they&#8217;re worth the investment for your business? You&#8217;re not alone.<\/p>\n<p>The truth is, online leads aren&#8217;t for everyone.There are a few types, but all require the same incubation process, robust follow-up, and dedication to <a href=\"https:\/\/www.inman.com\/2015\/09\/24\/how-to-execute-killer-online-real-estate-lead-conversion\/\">convert<\/a>.<\/p>\n<h3>Organic Online Leads<\/h3>\n<p>Organic online leads are prospects who have come to you through either your website, social media, or a combination of both. The best ways to drive organic leads into your pipeline are through MLS listings and by publishing hyper-local content on your website. Both features help your website rank higher in searches and offer value to people searching the internet, while also demonstrating your local expertise. Any content you publish on your website should be cross-promoted on your social media profiles as well to reach more prospects and drive traffic back to your website.<\/p>\n<h3>Paid Online Leads<\/h3>\n<p>Paid online leads are leads that are bought, most commonly through paid advertising or third party companies.<\/p>\n<h5>Advertising Leads:<\/h5>\n<p>Leads that are bought by way of advertising dollars essentially land on your website by paying search engines or social networks to get your information in front of certain audiences. These can be great, but they often come at a pay-per-click (PPC) cost rather than cost per user who registers on your website. This means that anyone who clicks on one of your advertisements is costing you, whether you end up getting their information or not. They may land on your website, but that doesn’t mean they’re going to register their information with you &#8211; i.e., become an actual lead.<\/p>\n<h5>Third-party Leads:<\/h5>\n<p>Another type of paid lead can come to you via third party. Third-party leads can be tricky and extremely competitive so be sure you understand exactly what you’re getting when you sign up for any third-party lead service. With some services, each lead is sent to multiple agents who then compete to earn that prospect’s business, so be sure to read the fine print before you commit.<\/p>\n<p><a href=\"\/products\/real-estate-leads\/\">Leads Direct<\/a> offers a guaranteed number of leads in a specific area, that are exclusive to the agent who purchased them – not shared with anyone else. These leads come directly to your branded real estate website through pay-per-click advertisements, but your only cost is for users who register directly on your website. These leads can be buyer leads or seller leads but, because they are exclusive to one agent, landing a subscription can be hard to come by.<\/p>\n<p>Always take the time to research the best option for your specific business objectives, strategy, and make sure you fully understand the what you’re getting when you advertise or pay for leads.<\/p>\n<h2>Online Lead Conversion<\/h2>\n<p>Okay, so you’ve decided on a strategy or leads service and your online leads have started to roll in. What now?<\/p>\n<p>In theory, you generate more leads which automatically equates to more transactions, right?<\/p>\n<p>Wrong.<\/p>\n<p>In practice, there’s so much more that goes into <a href=\"\/blog\/the-top-5-reasons-why-you-hate-online-leads-and-how-a-good-crm-will-make-you-love-them\/\">converting online real estate leads<\/a> than simply getting them into your pipeline. All leads require a great deal of nurturing and patience, but this is especially true for online leads. The way to start converting online leads is to view them for what they are: leads in infancy. Whether they came to you through your website or a paid source, you need to nurture them the same. Paying for a lead generation service doesn’t mean the leads that you’re getting are any more ready to convert than those you generate on your own; it means you&#8217;re increasing the number of contacts you have to begin nurturing into and through your sales pipeline.<\/p>\n<p><img loading=\"lazy\" class=\"wp-image-53377 alignright\" src=\"\/wp-content\/uploads\/2017\/09\/Did-you-miss-the-webinar-.jpg\" alt=\"convert online real estate leads\" width=\"330\" height=\"277\" \/><\/p>\n<p>The incubation process is about nurturing a lead until you’re able to develop a connection. How do you develop a connection with a complete stranger? Take a few minutes to look them up. Whether  or not you have an email or phone number, you can search people on <a href=\"https:\/\/pipl.com\/\">Pipl <\/a>or Facebook with as little information as a name. Obviously, the more information you have, the better, but the reality of information-sharing in today&#8217;s digital world isn&#8217;t always so generous. Once you find information about one of your contacts, use that to connect with them and build rapport.<\/p>\n<p>Once a connection is made, consistency and persistence are key to converting.<\/p>\n<p>Agents who approach online leads expecting them to convert right away are doing themselves, and their contacts, a huge disservice. Real estate is about building relationships and earning the trust that ultimately wins someone&#8217;s business. As soon as a client feels like nothing more than a commission check, they’re out. Real estate is not about instant gratification; it’s about security and long-term wealth, regardless of which side of the transaction you’re on.<\/p>\n<p>A lead needs to know that you have their best interest in mind before they’ll sign on any dotted line. We advise against approaching online leads as transactions waiting to happen, but rather as opportunities to be nurtured. The average online lead takes seven to 18 months to convert. One might convert in six months, another in two years, and some not at all.<\/p>\n<blockquote><p>These leads are dealing with probably the single largest financial transaction in their entire lives. They have to coordinate their desire to purchase with their ability to purchase. It takes the right time. &#8211; Christina Ethridge, <a href=\"https:\/\/www.inman.com\/next\/no-1-mistake-real-estate-agents-make-in-lead-generation-thinking-a-lead-is-a-dead-end-if-it-isnt-ready-right-now\/\">Inman<\/a><\/p><\/blockquote>\n<p><img loading=\"lazy\" class=\"wp-image-53373 alignleft\" src=\"\/wp-content\/uploads\/2017\/09\/Blog-Graphic-1.jpg\" alt=\"real estate pipeline management and success\" width=\"330\" height=\"277\" \/>Online leads are about filling your sales pipeline, which is a long-term investment that, if properly managed, will mature to secure success. In fact, pipeline management is the ONLY way to ensure long-term success.<\/p>\n<p>Again, online leads aren’t for every real estate agent. They work best for those who understand the process and are willing to invest in a long-term strategy to secure future success. Having a solid and refined follow-up process is key. If done right, your real estate business could be sustained exclusively from the relationships you’ve built with your online leads, through referrals and repeat business for years to come.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Have you ever wondered exactly how online real estate leads work and if they&#8217;re worth the investment for your business? You&#8217;re not alone. The truth is, online leads aren&#8217;t for everyone.There are a few types, but all require the same incubation process, robust follow-up, and dedication to convert. Organic Online Leads Organic online leads are [&hellip;]<\/p>\n","protected":false},"author":51,"featured_media":53371,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[97,34],"tags":[],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/53369"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/51"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=53369"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/53369\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media\/53371"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=53369"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=53369"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=53369"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}