{"id":53451,"date":"2017-10-10T09:07:13","date_gmt":"2017-10-10T16:07:13","guid":{"rendered":"http:\/\/www.marketleader.com\/?p=53451"},"modified":"2022-01-26T13:14:24","modified_gmt":"2022-01-26T21:14:24","slug":"2018-real-estate-trends-content-marketing-reigns-king","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/2018-real-estate-trends-content-marketing-reigns-king\/","title":{"rendered":"2018 Real Estate Trends: Insight Reigns King"},"content":{"rendered":"<p style=\"text-align: center;\"><img loading=\"lazy\" class=\"aligncenter wp-image-53577 size-full\" src=\"\/wp-content\/uploads\/2017\/10\/content-definition.png\" alt=\"content marketing definition\" width=\"556\" height=\"138\" \/><\/p>\n<p>Content has long been an integral part of any successful marketing strategy. However necessary, there are likely hundreds of thousands of results that populate when searching any given real estate keyword.  This is where insight comes in: if you want your content to stand out on the crowded world wide web, you&#8217;ve got to offer your readers valuable insight.<\/p>\n<h4>Every piece of content you produce, share, or curate should pass the following insight test:<\/h4>\n<p>Does this content offer insights that my readers will find valuable?<br \/>\nDoes this content offer an original perspective?<br \/>\nDoes this content entertain, inspire, or educate my audience?<br \/>\nDoes this content position me as an expert on this topic?<\/p>\n<p>If you can&#8217;t answer, &#8220;Yes,&#8221; to the previous questions about a particular piece of content, you might want to think twice about sharing it.<\/p>\n<h2><strong>Content will still be king.<\/strong><\/h2>\n<p>While content as a whole will always be king, if it doesn&#8217;t offer valuable insight, it&#8217;s not going to go to work for you. Always adhere to the 80\/20 rule: 80 percent of your content should entertain, inspire, or educate your readers and no more than 20 percent should promote your brand or services.<\/p>\n<p><img loading=\"lazy\" class=\"wp-image-53573 size-full alignright\" style=\"color: #666666; font-size: 14px;\" src=\"\/wp-content\/uploads\/2017\/10\/2-2.png\" alt=\"content marketing quote\" width=\"260\" height=\"143\" \/>&#8220;I&#8217;ve realized that no marketing is possible without content,” according to Rebecca Lieb, author of Content &#8211; The Atomic Particle of Marketing: The Definitive Guide to Content Marketing Strategy.<\/p>\n<p>And, in real estate, the following content marketing ideas that offer valuable insights, should top your list.<\/p>\n<h3><strong>You say &#8216;tomato,&#8217; we say &#8216;testimonial&#8217;<\/strong><\/h3>\n<p>In the tech universe, a <a href=\"\/blog\/how-to-use-client-testimonials\/\">client testimonial<\/a> is known as UGC, or “user-generated content,” and in 2018 it will become more important than ever.<\/p>\n<p>Global Consumer Report, a study conducted by software company Olapic, claims that &#8220;76 percent of consumers believe the content that average people share is more honest than advertising from brands.&#8221;<\/p>\n<p>Let’s look at ways to make sure that 2018 is the year you do something productive with your reviews and testimonials.<\/p>\n<h4>Make your testimonials work even harder for you by including the clients’ photos.<\/h4>\n<p>The Olapic study also found that over half of respondents are more likely to buy a product (or use a service) if they see images of the consumer who is reviewing it.<\/p>\n<p>If you’re chasing millennial homebuyers, including a photo is even more important, as they are the demographic who rely most heavily on social proof – featuring real people – to gain trust about a brand.<\/p>\n<h4>Position your clients’ photos above their testimonials for higher conversion rates.<\/h4>\n<p>And, if the only place potential clients will see these trust-promoting words of delight from former clients is on your website, you have work to do.<\/p>\n<p>Use photo-accompanied testimonials in your newsletters and other email marketing. In fact, consider including a quick case study of a former client in each email of your drip campaign.<\/p>\n<h4><strong>Case studies are testimonials on steroids.<\/strong><\/h4>\n<p>While video testimonials can be powerful, they’re also labor intensive to create and, if done right, they’re expensive. You can derive the same impact through the use of case studies.<\/p>\n<p>In them, you tell your clients’ stories – where they were before they decided to use your services, what challenges they faced that you helped them overcome and a description of the happy outcome. All this story-telling is surrounded by gorgeous photos.<\/p>\n<p>Use the case studies in your listing presentations, on your website, newsletters, brochures and other marketing materials. Push them out on social media occasionally to drive eyes back to your site.<\/p>\n<h3><strong>Neighborhood pages help boost local SEO.<\/strong><\/h3>\n<p>You already know that in-depth neighborhood descriptions on your website help demonstrate your local expertise. But they can do so much more – most specifically, help you rank better in local organic searches.<\/p>\n<p>Sure, your competition may be using them as well, but if the pages aren’t optimized properly, they may as well just delete them from their site. So, make 2018 the year you go head-to-head with your competition and outrank them in local searches.<\/p>\n<p>A lively and in-depth text description of each neighborhood you serve, is a good start. But adding images of the area’s most popular spots will not only help make the pages more user-friendly, but, if they’re <a href=\"https:\/\/yoast.com\/image-seo\/\">optimized for SEO<\/a>, they can help boost the amount of traffic your website receives, too.<\/p>\n<p>Neighborhood pages present many agents with the perfect vehicle to compete with Google’s page one hogs. Yes, it’s challenging for those in the larger markets, but agents in small to medium markets are finding great success.<\/p>\n<h4>Don’t forget to link back from your neighborhood-specific blog posts to your neighborhood pages to boost SEO.<\/h4>\n<p>Once the content and photos are in place, go back over the descriptions and drop in some relevant local keywords (making them sound natural, of course).<\/p>\n<h3><strong>Blogging 2018-style<\/strong><\/h3>\n<p>In case you haven’t figured it out yet, 2018 will be the year of authenticity when it comes to content. Consumers want to be informed or entertained through content – not outright sold to.<\/p>\n<p>This will be a tough one for many in the real estate industry; those who fill their Facebook feeds and blogs with new or sold listings will perish.<\/p>\n<p>Your savvy competition understands this and, going into 2018 you’ll see them ramping up their blogging frequency and quality.<\/p>\n<p>Your blog, if done right, helps build brand awareness and client loyalty, exhibits your expertise, increases website traffic and boosts lead generation.<\/p>\n<p>In fact, according to <a href=\"https:\/\/blog.hubspot.com\/marketing\/blogging-frequency-benchmarks\">Hubspot<\/a>, if you blog consistently, your site will receive 55 percent more visitors and, if you blog frequently (16 or more posts a month), you’ll receive 4.5 times more leads than agents in your area who don’t blog.<\/p>\n<p>But, if you don’t post the information real estate consumers are craving, you may as well delete the blog from your site. They don’t care about your sold listings, so avoid using them as blog fodder.<img loading=\"lazy\" class=\"size-full wp-image-53571 alignleft\" src=\"\/wp-content\/uploads\/2017\/10\/Capture-2-1.png\" alt=\"content marketing quote\" width=\"250\" height=\"178\" \/><\/p>\n<p>“Most brands still treat their content marketing like advertising. For content marketing to truly work, it must be differentiated and consistently produced over a long time.” &#8211; <a href=\"https:\/\/contentmarketinginstitute.com\/2017\/09\/content-marketing-trends-2018\/\">Joe Pulizzi<\/a><\/p>\n<p>The key is quality, authentic content, laid out in an SEO package. And, because blogging will be so important in 2018, if you can’t write (or don’t have the time) and you don’t know SEO, hire someone who can and does.<\/p>\n<h3><strong>For the DIY agent:<\/strong><\/h3>\n<p>Before putting your fingers to the keyboard, it’s important to understand who makes up your audience. What are their problems and goals? Knowing this will help keep you on-topic throughout your post.<\/p>\n<p>Speaking of <a href=\"https:\/\/neilpatel.com\/blog\/how-to-never-run-out-of-blog-post-ideas\/\">topics<\/a> – coming up with them is the one aspect of blogging that stops agents, cold.<\/p>\n<h4>Think about the questions you get from your clients and answer them in blog posts.<\/h4>\n<p>Use community news items, tips for homeowners, buyer and seller tips, sources of down payment assistance and descriptions of the mortgage and buying\/selling processes. Highlight local businesses – in fact, “The Five Best” of a business category posts are quite popular. For instance, “The Five Best Yoga Studios in Smallville.”<\/p>\n<h4>Let the businesses know you’ve featured them on your blog and ask them to link to the piece from their social media pages.<\/h4>\n<p>Another way to find topics is to check your Google Webmaster Tools to find the search terms people are using when they land on your site. These topics are also dynamite for <a href=\"https:\/\/www.searchenginewatch.com\/2013\/06\/10\/how-to-use-google-webmaster-tools-to-maximize-your-seo-campaign\/\">SEO<\/a>.<\/p>\n<p>Links – both internal and outbound – throughout the post are important as well. Link to your own, relevant content and provide outbound links to quality articles that expand on your points.<\/p>\n<p>Once you have that brilliant piece of blogging, promote it everywhere you can – especially across your social media platforms. These are the engines that drive eyes back to your website. That’s the goal, right?<\/p>\n<p>2018 is going to be an interesting year in the real estate industry. We’ve already pointed out that <a href=\"\/blog\/2018-real-estate-trends-boomerang-buyers\/\">boomerang buyers<\/a> will be hitting the market and now you know that to attract leads, you need to pay more attention to your content with client testimonials, long-form neighborhood descriptions to help with search ranking, and the many benefits of blogging.<\/p>\n<p>Where should you focus your tech dollars in 2018? Who will be next year’s buyers and sellers? Check back because we’ve only just begun to crack the surface of the trends you’ll be seeing next year.<\/p>\n<p>Get a leg up on 2018 with our free<a href=\"\/blog\/2018-real-estate-business-plan\/\"> 2018 Real Estate Business Plan<\/a>.<\/p>\n<p>Learn about:<\/p>\n<ul>\n<li>Pipeline management<\/li>\n<li>Tax deductible expenses<\/li>\n<li>Transaction and lead goal worksheets<\/li>\n<li>Real estate marketing strategy<\/li>\n<li>AND MORE<\/li>\n<\/ul>\n<p style=\"text-align: left;\"> <a class=\"et_pb_more_button et_pb_button\" style=\"color: #ffffff; border-color: #0079c1; background-color: #0079c1;\" href=\"https:\/\/success.marketleader.com\/l\/42972\/2017-09-26\/655jdj\">Download the Plan<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Content has long been an integral part of any successful marketing strategy. However necessary, there are likely hundreds of thousands of results that populate when searching any given real estate keyword.  This is where insight comes in: if you want your content to stand out on the crowded world wide web, you&#8217;ve got to offer [&hellip;]<\/p>\n","protected":false},"author":33,"featured_media":53473,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[35,803],"tags":[],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/53451"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/33"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=53451"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/53451\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media\/53473"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=53451"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=53451"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=53451"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}