{"id":53475,"date":"2020-01-09T16:20:54","date_gmt":"2020-01-10T00:20:54","guid":{"rendered":"http:\/\/www.marketleader.com\/?p=53475"},"modified":"2021-11-19T09:29:59","modified_gmt":"2021-11-19T17:29:59","slug":"emotional-marketing-in-real-estate","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/emotional-marketing-in-real-estate\/","title":{"rendered":"How Emotional Connections Win Listings"},"content":{"rendered":"<blockquote><p><strong>The market for something to believe in is infinite. <\/strong>&#8211; Hugh MacLeod, <a href=\"https:\/\/www.gapingvoid.com\/\">gapingvoid.com<\/a><\/p><\/blockquote>\n<p>As we enter an era of post-digital connectivity, the way we interact with prospects, clients, and each other is changing. The way we exist is changing. Long gone are the days of being gatekeepers of products, services, and information in our respective industries.<\/p>\n<p>Digital ubiquity is both a blessing and a curse.  Just as we have more access to industry data and insights than ever before, consumers have access to the competition, reviews, and a seemingly infinite supply of resources that’s capable of destabilizing industries at large.<\/p>\n<p>People today are overloaded with information, messages, and media, and the buyer&#8217;s journey looks more like a courtship than a sales cycle. People need to be able to envision their lives with you in it.<\/p>\n<h3><strong>What does this mean for real estate? <\/strong><\/h3>\n<p>Real estate professionals are no longer just competing with other real estate professionals, but with online portals whose primary revenue stream relies entirely on selling advertising products and space to you, or professionals like you.<\/p>\n<p>They don’t buy or sell homes. They don’t facilitate transactions.  These portals are a marketplace for information. Their entire business model relies on their ability to provide valuable information to buyers, sellers, real estate professionals, and lenders – for free.<\/p>\n<p>They are media companies and they might be your biggest competition. Let that resonate for a minute.<\/p>\n<p>You may not be competing directly with these portals for business, but you’re competing with the vast amount of resources they offer, and the agents who are paying a lot of money to advertise on their websites.<\/p>\n<p>Of course, your direct competition will always be other real estate professionals, but in today’s post-digital world, the playing field has completely shifted because of the ways these digital marketplaces have transformed the expectations consumers have.<\/p>\n<h3><strong>How do you differentiate yourself from the competition? <\/strong><\/h3>\n<p>Today’s consumers are <a href=\"https:\/\/www.forrester.com\/report\/The-State-Of-Empowered-Customers-And-Technology-Benchmark-2017-US\/RES139311\">empowered<\/a>, entitled, and, if you haven’t built up your <a href=\"https:\/\/www.shopify.ca\/encyclopedia\/brand-equity\">brand equity<\/a>, they won’t think twice before leaving you for another agent or broker offering deal sweeteners or charging a lower commission rate. Real estate [sales] professionals need to shift from focusing on the needs of consumers to focusing on their expectations, and how to best meet them.<\/p>\n<p>We have entered the age of the consumer, where engagement is your competitive edge.<\/p>\n<p>Engagement, in lemans terms, describes the way we connect and invite people to interact with our products, brands, and services. It allows consumers to develop emotional connections with otherwise passive companies. Considering people now have a <a href=\"https:\/\/time.com\/3858309\/attention-spans-goldfish\/\">shorter attention span than goldfish<\/a>, engagement has become an imperative driver for success. It&#8217;s how you stay top-of-mind.<\/p>\n<p>As complicated as this all might sound, it’s inherently simple.<\/p>\n<p>Let’s digress.<\/p>\n<blockquote><p><strong>People will forget what you said, people will forget what you did, but people will never forget how you made them feel.<\/strong> – Maya Angelou<\/p><\/blockquote>\n<p>Listen to people; seek to understand their problems before offering up solutions. Before you reach out to a new lead, conduct a little discovery: look them up, find out something about them, find a way to relate to them so when you do reach out, you’re not calling a complete stranger whose phone number you got from the internet, but someone who you know is interested in a type of information that you happen to be an expert in. Ask open ended questions, starting with, &#8220;How&#8217;s your day going?&#8221;<\/p>\n<p>Engagement is about connecting with people. People don’t want to be sold to. They want to be <a href=\"https:\/\/www.inman.com\/2016\/10\/10\/4-agent-skills-that-put-homebuyers-emotions-at-ease\/\">heard<\/a>, helped, and valued. They want brands and services to believe in and <em>this<\/em> is your opportunity.<\/p>\n<p>Real estate is one of the most saturated markets to compete in and the best way to secure more market share (read: money) for yourself is by identifying and capitalizing on opportunities that allow you to establish emotional connections with your prospects and clients.<\/p>\n<p>The number one reason people <a href=\"https:\/\/www.scribd.com\/document\/341184205\/2018-Home-Buyer-and-Seller-Generational-Trends-Report\">sell<\/a> their home is because it’s too small, followed by wanting to be closer to friends and family. These motivations are driven by desire, not necessity.  And, across all generations, the most important factor in choosing which real estate agent to work with is that agent’s reputation, followed by perception that the agent is honest and trustworthy – motivations that are founded on feelings, rather than functionality.<\/p>\n<p>Of course people want help buying and selling a home, but the way they go about finding the person or company to help them do it is based almost entirely on emotion.<\/p>\n<p>No online marketplace of resources can connect with people on an emotional level the way you can. Leverage this opportunity and align your yourself with your customer&#8217;s most emotional decision-making processes to solidify connections that will not only win their business, but advocacy and social proof as well &#8211; the most sought after forms of equity-building marketing that exist today.<\/p>\n<p><strong>Sell the dream, not the service.<\/strong><\/p>\n<p>For more information on real estate marketing, check out our <a href=\"\/blog\/category\/real-estate-marketing-2\/\">other articles about real estate marketing<\/a>.<\/p>\n<p>How do you connect and engage with your clients? Let us know in the comments!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The market for something to believe in is infinite. &#8211; Hugh MacLeod, gapingvoid.com As we enter an era of post-digital connectivity, the way we interact with prospects, clients, and each other is changing. The way we exist is changing. Long gone are the days of being gatekeepers of products, services, and information in our respective industries. [&hellip;]<\/p>\n","protected":false},"author":51,"featured_media":53477,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[83],"tags":[],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/53475"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/51"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=53475"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/53475\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media\/53477"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=53475"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=53475"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=53475"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}