{"id":53603,"date":"2017-10-22T11:50:10","date_gmt":"2017-10-22T18:50:10","guid":{"rendered":"http:\/\/www.marketleader.com\/?p=53603"},"modified":"2022-01-26T13:13:31","modified_gmt":"2022-01-26T21:13:31","slug":"social-media-to-generate-leads","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/social-media-to-generate-leads\/","title":{"rendered":"How To Use the 6 Top Social Media Platforms To Generate Leads"},"content":{"rendered":"<p><span style=\"font-weight: 400;\">Although social media is already widely accepted as a branding tool for real estate agents and brokers, it can also be a powerful <\/span><a href=\"\/blog\/thriving-in-the-internet-era-understanding-generating-and-converting-online-leads\/\"><span style=\"font-weight: 400;\">lead generating<\/span><\/a><span style=\"font-weight: 400;\"> tool. Over 70 percent of Americans have social media accounts, and you can use YouTube, Facebook, LinkedIn, Instagram, and other platforms to target leads, establish your expertise, and form connections with prospective clients located within your farm area. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Keep in mind that people use social media to relax, entertain themselves, find out what’s trending, and keep in touch with family and friends. So, you can’t use too many sales pitches and need to provide value in a way that people are used to seeing on social media. If you do that, social media can do wonders for your real estate business and brand.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">This article explores how to turn 6 popular social media platforms into a highly effective lead generating machine.<\/span><\/p>\n<h3><b>1. YouTube<\/b><\/h3>\n<p><span style=\"font-weight: 400;\">According to data from the National Association of Realtors (NAR), <\/span><a href=\"https:\/\/www.inman.com\/next\/by-the-numbers-how-to-focus-your-video-marketing-for-the-biggest-return-on-investment\/\"><span style=\"font-weight: 400;\">85% of buyers and sellers <\/span><\/a><span style=\"font-weight: 400;\">want to work with an agent who uses video. As a result, YouTube can be a great source of leads, but most real estate agents have yet to take advantage of it.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">The first step is to create a branded YouTube channel &#8211; add your logo, color scheme, and a complete description of your services. Once you’ve done this, add a feature video of yourself to introduce yourself to potential clients. At this point, you can start creating listing videos, but as in all other social media platforms, the objective is not to saturate your content with too many sales pitches. Also post videos highlighting popular spots in your neighborhood, virtual tours, or drone videos of beautiful properties. Add a clear call to action at the end, with links to your website and contact details.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">You don’t need fancy equipment to shoot your videos. Most smartphones nowadays can shoot in 4k high definition, so you’ll still get quality results. Just invest in a basic tripod and tripod mount and follow these tips: <\/span><\/p>\n<ul>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Always use <\/span><a href=\"https:\/\/hyperlapse.instagram.com\/\"><span style=\"font-weight: 400;\">hyperlapse<\/span><\/a><span style=\"font-weight: 400;\"> to reduce camera shaking in your videos<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Disable the autofocus function on your smartphone<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Avoid harsh lighting for outdoor shots and get ambient lighting for indoor shots<\/span><\/li>\n<li style=\"font-weight: 400;\"><span style=\"font-weight: 400;\">Learn how to use post production software like iMovie or Windows Movie Maker<\/span><\/li>\n<\/ul>\n<p><span style=\"font-weight: 400;\">Before posting your videos, make sure that you have specified the appropriate category, and included keywords in the description to target your local audience. This will help your videos rank both in YouTube and Google search results.<\/span><\/p>\n<p><a href=\"http:\/\/www.youtube.com\/user\/thecarolinasfinest\/videos\"><img loading=\"lazy\" class=\"size-full wp-image-53615\" src=\"\/wp-content\/uploads\/2017\/10\/YouTube_Jessica-Riffle-Edwards.png\" alt=\"YoutTube screenshot Jessica Edwards\" width=\"1346\" height=\"704\" \/><\/a><\/p>\n<p><i><span style=\"font-weight: 400;\">Jessica Edward’s YouTube channel has almost 12,000 subscribers. Her videos include answers to common real estate questions and some listings.<\/span><\/i><\/p>\n<p style=\"text-align: center;\"><i><span style=\"font-weight: 400;\">Source: www.youtube.com\/user\/thecarolinasfinest\/videos<\/span><\/i><\/p>\n<h3><b>2. Pinterest<\/b><\/h3>\n<p><span style=\"font-weight: 400;\">There is more to using Pinterest for real estate leads than pinning your listings. It’s all about the strategy &#8211; what kinds of photos you share, which groups you join, the quality of your pins, and how you stand out. First, make sure that you’ve joined the best real estate group boards on Pinterest. You can learn from veteran agents on the board how to create unique postings that stand out. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Diversify your pins to appeal to prospective clients &#8212; don’t post only listings all the time. In fact, listings should make up only about 10 % of all your pins. Ideas for other boards besides listings include an interior design board, a home improvement board, or a gardening board to appeal to a broader audience.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">When pinning something to your account, take the time to fill out the description, with a focus on local keywords (e.g. Williamsburg Brooklyn boutique condo) to get leads in your farm area, and then edit the pin to add your website’s URL. A number of leads get lost on Pinterest when they are left without information or a way to find out more about a photo.<\/span><\/p>\n<p><img loading=\"lazy\" class=\"alignnone size-full wp-image-53611\" src=\"\/wp-content\/uploads\/2017\/10\/PIN_Denise-Robinson.png\" alt=\"Pinterest Screenshot Denise Robinson\" width=\"830\" height=\"660\" \/><\/p>\n<p style=\"text-align: center;\"><i><span style=\"font-weight: 400;\">Denise Robinson’s Pinterest account has over 40,000 followers. She has 133 boards for categories like real estate selling and buyer tips, interior design, and listings.<br \/>\n<\/span><\/i><i><span style=\"font-weight: 400;\">Source: www.pinterest.com\/DeniseRobinsonRE\/<\/span><\/i><\/p>\n<h3><b>3. Facebook <\/b><\/h3>\n<p><span style=\"font-weight: 400;\">If there’s only one social media platform that you choose to leverage, it should be Facebook, the largest social media site with over <\/span><a href=\"https:\/\/www.dreamgrow.com\/top-15-most-popular-social-networking-sites\/\"><span style=\"font-weight: 400;\">2 billion users<\/span><\/a><span style=\"font-weight: 400;\">. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">You can market to prospective clients on Facebook for free. The first step is creating a Facebook business page if you don’t already have one. Once you do, you can start posting content that people in your farm area will find useful such as local market updates, neighborhood news, and restaurant reviews. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Another good strategy is to choose a frequently shared real estate article online, rewrite it (and improve on it) and post in on your website, and then share your rewritten article in multiple relevant Facebook groups. Just remember&#8211;keep your listings down to around 10 percent of all your posts. People come to Facebook to relax, not get sold to.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">You can also use Facebook Advertising to target specific types of leads. For example, if the majority of your clients are parents aged 30-40, you can use Facebook’s ad platform so that only people fitting this profile will see your posts. Facebook also allows retargeting, meaning you can make your ads visible only to Facebook users who have already visited your website.<\/span><\/p>\n<p><a href=\"http:\/\/www.facebook.com\/blancasaldana\/\"><img loading=\"lazy\" class=\"alignnone size-full wp-image-53605\" src=\"\/wp-content\/uploads\/2017\/10\/FB_Blanca-Saldana-Realtor.png\" alt=\"Facebook Screenshot Blanca Saldana\" width=\"837\" height=\"635\" \/><\/a><\/p>\n<p style=\"text-align: center;\"><i><span style=\"font-weight: 400;\">Aside from listings, Blanca Saldana’s Facebook page is filled with useful information like this &#8211; Mortgage Myths Busted in 90 seconds.<br \/>\n<\/span><\/i><i><span style=\"font-weight: 400;\">Source: www.facebook.com\/blancasaldana\/<\/span><\/i><\/p>\n<h3><b>4. LinkedIn<\/b><\/h3>\n<p><span style=\"font-weight: 400;\">Many real estate professionals aren’t leveraging LinkedIn for lead generation. This is probably because this social media platform serves more of a professional purpose than a social one. People don’t come to LinkedIn to comment on friends’ posts or to browse photos. They come to LinkedIn to search for people in their network, and this is what real estate agents should focus on. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Build your network by consistently sending connection requests weekly to former clients or other agents and by joining local groups. Being able to establish a good network can generate referrals and even potential clients from your second and third degree connections. Once you have a solid network, start posting articles that provide helpful information such as industry trends or explaining a particular real estate concept. You can also post, on occasion, your accomplishments or milestones (e.g. 100th property sold). These types of posts will not only build your reputation, but also emphasize your expertise as well. By the time someone among your connections needs a realtor’s services, or wants to recommend a realtor to someone, your name will be top of mind.<\/span><\/p>\n<p><a href=\"http:\/\/www.linkedin.com\/in\/jillepsteinhomes\"><img loading=\"lazy\" class=\"alignnone size-full wp-image-53609\" src=\"\/wp-content\/uploads\/2017\/10\/LI_Jill-Epsein-Homes.png\" alt=\"LinkedIn screenshot Jill Epstein\" width=\"879\" height=\"667\" \/><\/a><\/p>\n<p style=\"text-align: center;\"><i><span style=\"font-weight: 400;\">Posting useful information like industry trends help build your reputation and increase your connections, as you can see from Jill Epstein’s profile.<br \/>\n<\/span><\/i><i><span style=\"font-weight: 400;\">Source: www.linkedin.com\/in\/jillepsteinhomes<\/span><\/i><\/p>\n<h3><b>5. Instagram<\/b><\/h3>\n<p><span style=\"font-weight: 400;\">As of September 2017, Instagram has reached an average of <\/span><a href=\"https:\/\/www.cnbc.com\/2017\/09\/25\/how-many-users-does-instagram-have-now-800-million.html\"><span style=\"font-weight: 400;\">800 million monthly active users<\/span><\/a><span style=\"font-weight: 400;\">, something that real estate agents should capitalize on. Real estate lends itself very nicely to Instagram because it&#8217;s such a visual medium. You can post photos or videos of listings you’ve  sold or interesting places in your farm area.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">You can also update your Instagram account with photos of your recent wins and, when possible, post testimonials from your clients to boost your reputation. Stay on top of the most relevant and popular hashtags specific to your farm area so people can find your posts. Hashtags work similarly to long-tail keywords you use for your website’s SEO. Use these hashtags on your posts but remember not to overdo them to avoid drowning the link to your blog or website.<\/span><\/p>\n<p><a href=\"http:\/\/www.instagram.com\/realtorsterling\/\"><img loading=\"lazy\" class=\"alignnone size-full wp-image-53607\" src=\"\/wp-content\/uploads\/2017\/10\/IG_Realtor-Sterling.png\" alt=\"Instagram screenshot @realtorsterling\" width=\"891\" height=\"597\" \/><\/a><\/p>\n<p style=\"text-align: center;\"><i><span style=\"font-weight: 400;\">Realtor Sterling’s Instagram account has over 17,000 followers. The photos mostly consist of sold listings with hashtags appropriate for its farm area.<br \/>\n<\/span><\/i><i><span style=\"font-weight: 400;\">Source: www.instagram.com\/realtorsterling\/<\/span><\/i><\/p>\n<h3><b>6. Twitter<\/b><\/h3>\n<p><a href=\"https:\/\/www.omnicoreagency.com\/twitter-statistics\/\"><span style=\"font-weight: 400;\">328 million<\/span><\/a><span style=\"font-weight: 400;\"> &#8211; that’s the number of active monthly users on twitter as of August 2017. The first way to take advantage of this and get the best leads is to follow major real estate professionals in your area. See what kinds of things they are tweeting, and retweet current and informative news in your niche to keep your followers interested. Try to get involved in as many discussions as you can, offering insight and professional advice to establish your reputation. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Twitter advertising (Promoted tweets, Promoted trends, Promoted accounts) can also work well once you’ve gotten hold of a solid number of followers, as a sizable amount of retweets, likes and favorites can generate leads. Promoted tweets allows you to purchase advertising space around a popular hashtag which have been proven effective on Twitter. Using promoted tweets brings your content to the top of relevant search results, while a promoted account lands your Twitter account among the “who to follow” lists. <\/span><\/p>\n<p><a href=\"https:\/\/www.twitter.com\/Ryan_DeMent\"><img loading=\"lazy\" class=\"alignnone size-full wp-image-53613\" src=\"\/wp-content\/uploads\/2017\/10\/Twitter_Ryan-DeMent.png\" alt=\"Twitter screenshot Ryan DeMent\" width=\"923\" height=\"646\" \/><\/a><\/p>\n<p style=\"text-align: center;\"><i><span style=\"font-weight: 400;\">Ryan DeMent’s twitter account has quite the number of followers and most of his posts are useful information for sellers, buyers and real estate agents.<br \/>\n<\/span><\/i><i><span style=\"font-weight: 400;\">Source: www.twitter.com\/Ryan_DeMent<\/span><\/i><\/p>\n<h2><b>Pro Tip<\/b><\/h2>\n<p><span style=\"font-weight: 400;\">Once you’ve committed to using these social media platforms to get more real estate leads, the next challenge is to manage all of it simultaneously. A social media management program, like <\/span><a href=\"https:\/\/hootsuite.com\/\"><span style=\"font-weight: 400;\">Hootsuite<\/span><\/a><span style=\"font-weight: 400;\">, lets you schedule posts in advance, monitor your audience’s interaction, and generate reports to help you run your social campaigns on different platforms without fail.<br \/>\n<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Without a doubt, social media platforms are among the most powerful channels for real estate agents to get leads. So if you’re missing out on any of those listed above, it’s probably time to roll up your sleeves and give your business a social media boost.<\/p>\n<p><\/span><\/p>\n<p>&nbsp;<\/p>\n<div id=\"attachment_53617\" style=\"width: 210px\" class=\"wp-caption alignright\"><img aria-describedby=\"caption-attachment-53617\" loading=\"lazy\" class=\"wp-image-53617 size-full\" src=\"\/wp-content\/uploads\/2017\/10\/Emile-LEplattenier.jpg\" alt=\"Emile L'Eplattenier photo\" width=\"200\" height=\"200\" \/><p id=\"caption-attachment-53617\" class=\"wp-caption-text\">Emile L&#8217;Eplattenier<\/p><\/div>\n<p><strong>About the author:<\/strong><br \/>\nA five year veteran NYC real estate agent and member of the Real Estate Board of New York, Emile L&#8217;Eplattenier specialized in selling and renting new developments in the East Village of Manhattan and Williamsburg Brooklyn. He is currently a staff writer and real estate analyst at Fit Small Business.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Although social media is already widely accepted as a branding tool for real estate agents and brokers, it can also be a powerful lead generating tool. Over 70 percent of Americans have social media accounts, and you can use YouTube, Facebook, LinkedIn, Instagram, and other platforms to target leads, establish your expertise, and form connections [&hellip;]<\/p>\n","protected":false},"author":33,"featured_media":53625,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[34,104],"tags":[],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/53603"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/33"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=53603"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/53603\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media\/53625"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=53603"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=53603"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=53603"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}