{"id":53663,"date":"2017-11-01T10:59:29","date_gmt":"2017-11-01T17:59:29","guid":{"rendered":"http:\/\/www.marketleader.com\/?p=53663"},"modified":"2022-01-26T13:13:13","modified_gmt":"2022-01-26T21:13:13","slug":"2018-real-estate-trends-social-proof","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/2018-real-estate-trends-social-proof\/","title":{"rendered":"2018 Real Estate Trends: Social Proof"},"content":{"rendered":"<h2>Make 2018 the Year You Leverage Social Proof<\/h2>\n<p>You have tons of experience. You offer stellar customer service. You’ve developed a killer website. Even your branding is cool.<\/p>\n<p>Guess what? It’s not enough.<\/p>\n<p>Not in 2018.<\/p>\n<p>Like this year’s, next year’s clients want proof before they agree to work with you. And, they want proof from people who have actually used your real estate services.<\/p>\n<p>Make 2018 the year you focus on gathering the social proof you need to help potential clients judge your credibility as a real estate authority, get to know you, and build trust.<\/p>\n<h3>What is social proof?<\/h3>\n<p>A herd of sheep will instinctually stick together, for protection. Where one goes, the others follow – whether it’s back to the farm for supper or to the slaughterhouse, the instinct rules.<\/p>\n<p>We humans have similar inclinations. A famous 1969 study (Milgram et al.) on “the drawing power of crowds of different sizes” found that 4 percent of folks passing by would stop to join one person looking up at a skyscraper.<\/p>\n<p>When there were 15 people looking skyward, the number of passersby who stopped to join them increased to 40 percent. Additionally, 86 percent of passersby, even if they didn’t stop, would look up to see what everyone was looking at.<\/p>\n<p>“We often imitate others’ actions when making choices with limited information about what’s best,” claims David Stipp at <a href=\"https:\/\/archive.fortune.com\/magazines\/fortune\/fortune_archive\/1996\/10\/14\/217822\/index.htm\">Fortune.com<\/a>. “It’s almost a law of nature,” he concludes.<\/p>\n<p>It’s herd behavior and, although it can have negative consequences, it can also be a boon to your marketing efforts.<\/p>\n<h3>Why does it matter?<\/h3>\n<p>A majority of the 2,000 Americans surveyed by Mintel, a market analysis agency, say that online reviews dictate which products they buy and services they use.<\/p>\n<p>It’s only natural, right? We all want to ensure that we’re purchasing the “best” product or hiring the “best” hair stylist.<\/p>\n<p>“In a never-ending quest to buy the ‘best,’ consumers are looking to others’ opinions and experiences via online review sites to validate their choices – and to avoid feeling buyers’ remorse,” Mintel’s Fiona O’Donnell claims in their American Lifestyles 2015 study.<\/p>\n<p>Although consumers of all ages perform this gut check, it is far more common in millennials than in older and younger generations. And, since that particular demographic represents the real estate consumers of tomorrow, social proof becomes even more important.<\/p>\n<h3>How is your online reputation?<\/h3>\n<p>The first thing to consider when starting a social proof campaign is to determine where you stand right now. Will you be starting with a blank slate or multitudes of reviews scattered across the internet?<\/p>\n<p>How many negative reviews will you need to combat? Cleaning up your online reputation takes time and effort unless you have the big bucks required to hire a company to <a href=\"https:\/\/www.forbes.com\/sites\/susanadams\/2013\/03\/14\/6-steps-to-managing-your-online-reputation\/?sh=5a12293b7767\">manage your online reputation.<\/a><\/p>\n<p>And, lest you think image polishing isn’t important, consider this: 75 percent of HR professionals and recruiters say that they have “personnel to research applicants online,” according to a Cross-Tab <a href=\"https:\/\/www.job-hunt.org\/guides\/DPD_Online-Reputation-Research_overview.pdf\">study<\/a>.<\/p>\n<p>Even more frightening (at least for job hunters) is that 70 percent of these hiring pros claim that they have rejected candidates based on what they found out about them online.<\/p>\n<p>Sure, you’re not hoping to be recruited, but if HR professionals seek out social proof for job applicants, it’s a safe bet that real estate consumers do the same when researching real estate agents.<\/p>\n<h3>Types of social proof to consider for your real estate business:<\/h3>\n<p><strong>Review sites<\/strong> &#8212; It’s not enough to have online reviews and testimonials on one site. Gut checkers view two to three different review sites before they make a decision, according to BrightLocal’s Consumer Review Survey 2016.<\/p>\n<p>When researching real estate agents, these review sites typically include Yelp, Zillow and Google. Since Google search results for “real estate agents in” typically come with Google reviews, it’s a good idea to concentrate on the search giant first. Setting up a <a href=\"https:\/\/www.google.com\/business\/?gmbsrc=us-en-ha-se-z-gmb-s-z-h~bk&amp;ppsrc=GMBS0&amp;gclid=EAIaIQobChMI8v7G8IWF1wIVCmh-Ch2LrQtWEAAYASAAEgIDkvD_BwE&amp;dclid=CImD6PeFhdcCFRB2Ygodb-APEA\">Google Business Page<\/a> is a great place to start.<\/p>\n<p><strong>Testimonials<\/strong> – BrightLocal’s survey found that the “authenticity of reviews is the most important factor for consumers to trust the reviews they read.” They want to know that these testimonials are coming from actual people – clients who have used you to represent them when buying or selling a home.<\/p>\n<p>Bring your testimonials to life by including a photo of your clients (with their permission, of course) <a href=\"\/blog\/2018-real-estate-trends-content-marketing-reigns-king\/\">above<\/a> their glowing recommendation.<\/p>\n<p><strong>Case studies<\/strong> – These are another way to give life to your testimonials. They are basically stories that illustrate a client’s problem and how you, as an agent, solved it. Not only are they effective on websites, but because of they are typically photo-intensive, they work well when included with other marketing materials, such as listing presentations and newsletters.<\/p>\n<p><strong>Take it offline, too. <\/strong><\/p>\n<p>Testimonials can be used in all of your marketing materials as long as you don’t overdo it. Choose one or two of your favorites and use them in your newsletters.<\/p>\n<p>Use them in listing presentations, on door hangers, direct mail pieces – all of your offline marketing materials can and should contain at least one testimonial.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Make 2018 the Year You Leverage Social Proof You have tons of experience. You offer stellar customer service. You’ve developed a killer website. Even your branding is cool. Guess what? It’s not enough. Not in 2018. Like this year’s, next year’s clients want proof before they agree to work with you. And, they want proof [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":53665,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[789,803,104],"tags":[],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/53663"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=53663"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/53663\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media\/53665"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=53663"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=53663"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=53663"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}