{"id":53769,"date":"2017-11-17T13:04:50","date_gmt":"2017-11-17T21:04:50","guid":{"rendered":"http:\/\/www.marketleader.com\/?p=53769"},"modified":"2022-01-26T13:10:54","modified_gmt":"2022-01-26T21:10:54","slug":"dont-make-these-real-estate-mistakes","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/dont-make-these-real-estate-mistakes\/","title":{"rendered":"Want to Net a Million? Don&#8217;t Make These Mistakes"},"content":{"rendered":"<p>Have you ever wondered what separates successful agents from the <a href=\"http:\/\/www.tomferry.com\/blog\/87-of-all-agents-fail-in-real-estate\/\">87 percent<\/a> who don&#8217;t last five years in the industry? We&#8217;ve researched and expanded on the biggest things preventing success in the real estate industry.<\/p>\n<h3>Real estate agents don&#8217;t become millionaires because they:<\/h3>\n<p>&nbsp;<\/p>\n<h3><strong style=\"font-size: 18px;\">1. Don’t adopt a business mindset.<\/strong><\/h3>\n<p>We’ve discussed this at length, but it’s worth incessant mention: having the <a href=\"\/blog\/realestatebusiness\/\">mindset of a business owner<\/a> is vital to success in real estate. Failure to adopt a business mindset will undoubtedly complicate your business – potentially killing it.<\/p>\n<p>This mentality allows you to objectively look at operational necessities that are otherwise easily overlooked. Creating a <a href=\"https:\/\/success.marketleader.com\/l\/42972\/2017-09-26\/655jdj\">business plan<\/a> is the best place to start.  Once you outline your financial opportunities and limitations, business objectives and strategies, you can begin the tactical work that will help you achieve success.<\/p>\n<h4><strong>2. Don’t think big.<\/strong><\/h4>\n<p>If you think small, you’ll achieve small results. There’s a reason 87 percent of agents fail within their first five years. Real estate is a long-term game that necessitates a long-term vision, without limitations. When we think big, we blow past the small milestones along the way.<\/p>\n<p>Considering the average lead-to-close cycle in real estate can be as long as 18-24 months, being able to think about the future on a larger scale better accommodates these drawn-out processes and allows you to more realistically gauge your progress without feeling discouraged.<\/p>\n<p>Delayed gratification is the name of the real estate game. Approaching the future with realistic expectations greatly improves your ability to bounce back from rejection, delayed income, and better plan for an accumulation of achievements. Think big in the long term and, over time, all your short-term goals and concerns will be met.<\/p>\n<h4><strong>3. Don’t make lead generation priority ONE.<\/strong><\/h4>\n<p>If there’s one thing you take away from this article, it should be that lead generation is the most important element of your business. If there are no leads in your pipeline, there is no business.<\/p>\n<p>Lead generation isn’t just about getting leads – it’s about having realistic expectations, diversifying your lead sources, and improving conversion rates. The average lead conversion rate hovers around three percent, meaning for every 100 leads you acquire, only three of them will convert. Coupled with a sales cycle that could take up to 24 months, lead generation becomes a numbers game.<\/p>\n<p><span style=\"color: #333333; font-size: 16px;\">Understand the real estate sales cycle.<\/span><\/p>\n<p>The time that lapses between a lead coming into your pipeline and closing a transaction can be years. Aligning your expectations with the reality of the real estate sales cycle will alleviate some of the pressure you might feel to get clients to close. By understanding the <a href=\"http:\/\/www.marketleader.com\/journey\/\">real estate customer&#8217;s journey<\/a>, you can accurately predict when they&#8217;re likely to convert and the types of information they&#8217;re most interested in at each stage, which will in turn improve your conversion rate.<\/p>\n<p><span style=\"color: #333333; font-size: 16px;\">Diversify your lead sources.<\/span><\/p>\n<p>Now that we’ve identified lead generation as a numbers game, let’s talk about lead sources and how they affect conversion rates. An online lead is likely to be at a much earlier stage in their home buying or selling journey so, in order to convert them, you&#8217;ll need to be persistent and patient. Leads that are referred to you through a past client have likely conducted most of their online research and are much closer to closing. By diversifying your sources, you&#8217;re stocking your pipeline with leads who not only will be closing at various rates, but will require different levels of time and resources from you. This allows you to incubate less active leads  while focusing more attention on those farther down in their buyer&#8217;s journey.<\/p>\n<p>Looking to diversify your lead sources? The Close offers up seven underrated ways to generate leads in their latest <a href=\"https:\/\/theclose.com\/real-estate-lead-generation-ideas\/\">article<\/a>.<\/p>\n<p><span style=\"color: #333333; font-size: 16px;\">Invest in converting leads.<\/span><\/p>\n<p>What good is acquiring new leads if they’re not converting? Optimize your response time – try to respond to each contact within minutes. The more time that lapses between communications, the less likely you’ll be able to make contact.<\/p>\n<h4><strong>4. Don’t build a business around a CRM.<\/strong><\/h4>\n<p>This is what allows you to manage your pipeline, at every stage of the sales cycle.<\/p>\n<p>Real estate is one of the few industries built entirely on relationships so implementing a system for managing your contacts is absolutely necessary. Having and using a CRM is one thing, and using it to its potential is another. Align your CRM with business processes to track your activities, maximize your communications with automation, manage and nurture relationships, and stay organized with tasks and reminders.<\/p>\n<h4><strong>5. Don’t manage their money.<\/strong><\/h4>\n<p>Another crucial element of success taught in business schools – but seldom in real estate – is that to manage your business, you’ve got to manage your money. Calculate both your personal and business expenses to understand what income you need to survive. Create budgets and allocate dollars towards marketing, advertising, office supplies and technology that are crucial to running your business.<\/p>\n<p>Once you know exactly what your expenses are, how much money you have and how much money you need, you’re able to budget, not just for subsistence, but for growth.<\/p>\n<h4><strong>6. Don’t disrupt the competition.<\/strong><\/h4>\n<p>Real estate is one of the most saturated markets out there and with that comes massive competition. To differentiate yourself, you must disrupt the competition. Start by creating a unique value proposition that positions you and your business as both unique and valuable.<\/p>\n<p>This is your elevator pitch.<\/p>\n<p>Ask yourself:<\/p>\n<p>What are the benefits of working with me?<br \/>\nHow do I meet your client&#8217;s needs?<br \/>\nWhat sets me apart from my competition?<\/p>\n<p>Identifying and addressing these questions will help you stand out from the pack, which will better resonate with your prospects and position the value of your business and services.<\/p>\n<p>Tips:<br \/>\nBe unique.<br \/>\nAdopt a consumer mindset.<br \/>\nProvide <a href=\"\/blog\/2018-real-estate-trends-social-proof\/\">social proof<\/a>.<\/p>\n<p>Interested in learning more about how to net a million in real estate?<\/p>\n<div class=\"textwidget\">\n<p>Subscribe to our blog to get best practices, tips, and educational webinars sent directly to your inbox.<\/p>\n<div><script type=\"text\/javascript\">\/\/<![CDATA[\n(function(){window.pagespeed=window.pagespeed||{};var b=window.pagespeed;function c(){}c.prototype.a=function(){var a=document.getElementsByTagName(\"pagespeed_iframe\");if(0<a.length){for(var a=a[0],f=document.createElement(\"iframe\"),d=0,e=a.attributes,g=e.length;d<g;++d)f.setAttribute(e[d].name,e[d].value);a.parentNode.replaceChild(f,a)}};c.prototype.convertToIframe=c.prototype.a;b.b=function(){b.deferIframe=new c};b.deferIframeInit=b.b;})(); pagespeed.deferIframeInit(); \/\/]]><\/script><iframe loading=\"lazy\" style=\"border: 0;\" src=\"https:\/\/success.marketleader.com\/l\/42972\/2016-01-25\/4bthtx\" width=\"220\" height=\"90\" frameborder=\"0\" scrolling=\"no\"><\/iframe><\/div>\n<\/div>\n<p>Do you have any other points to add to this list? Let us know in the comments!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Have you ever wondered what separates successful agents from the 87 percent who don&#8217;t last five years in the industry? We&#8217;ve researched and expanded on the biggest things preventing success in the real estate industry. Real estate agents don&#8217;t become millionaires because they: &nbsp; 1. Don’t adopt a business mindset. We’ve discussed this at length, [&hellip;]<\/p>\n","protected":false},"author":51,"featured_media":53821,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[97,83],"tags":[],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/53769"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/51"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=53769"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/53769\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media\/53821"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=53769"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=53769"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=53769"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}