{"id":53825,"date":"2022-11-21T14:14:55","date_gmt":"2022-11-21T22:14:55","guid":{"rendered":"http:\/\/www.marketleader.com\/?p=53825"},"modified":"2022-12-02T07:41:53","modified_gmt":"2022-12-02T15:41:53","slug":"real-estate-cold-calling","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/real-estate-cold-calling\/","title":{"rendered":"8 Best Practices for Real Estate Cold Calling"},"content":{"rendered":"<p>After learning some best practices, your new perspective on cold calling may surprise you.<\/p>\n<p>It gets a bad rap. But if you know what you’re doing, it’s less intimidating and more productive.<\/p>\n<p>Regardless of what you’ve heard or imagined, real estate cold calling can still be an effective lead generation strategy. That’s true even though it is “old school,” and even if there are many ways to fail.<\/p>\n<h2 class=\"BlogH2\">Why Cold Calling Is Still Worthy of Consideration<\/h2>\n<p>If real estate cold calling seems like an old-fashioned strategy, that’s because it is. But like <a href=\"https:\/\/www.marketleader.com\/blog\/real-estate-direct-mail\/\">direct mail marketing<\/a> and <a href=\"https:\/\/www.marketleader.com\/blog\/door-knocking-real-estate\/\">door knocking<\/a>, there’s a reason it’s been a common sales tactic for as long as it has: it works.<\/p>\n<p>Let’s be honest. Upon first glance, the statistics about how good of an ROI cold calling offers aren’t encouraging. For example, <a href=\"https:\/\/www.zippia.com\/advice\/cold-calling-statistics\/\">a recent study<\/a> indicated that roughly one in three prospects will pick up when you call, and only one percent of cold calls will lead to an appointment.<\/p>\n<p>But that doesn’t show the whole picture. Because many top-performing agents consider cold calling to be an essential part of their business plan. They’ve filled their pipelines by “dialing for dollars,” and it’s led to serious commission income increases year after year.<\/p>\n<p>This discrepancy seems to highlight an important point: Real estate cold calling isn’t just a numbers game. Success comes as a result of discipline, hard work, and a bit of technique. Not plugging away until you experience some random luck.<\/p>\n<p>Top-performing agents know how to capitalize on the few opportunities they get. They know how to get warm leads out of cold calls. And that’s doable for you, too, as long as you follow some tried-and-true techniques.<\/p>\n<p>So let’s dive into the best practices so you can be among the many expert agents who leverage cold calling to close more deals.<\/p>\n<h2 class=\"BlogH2\">8 Pro Tips for Real Estate Cold Calling<\/h2>\n<h3 class=\"BlogH3\">1. Understand the Law<\/h3>\n<p>Cold calling in real estate isn’t foolproof. There are many ways it can go wrong. Getting into legal trouble is among the worst ways to fail.<\/p>\n<p>The Telephone Consumer Protection Act (TPCA) was created in 1991 to protect consumers from pesky telemarketers. It applies to “any person, business, or entity that conducts telephone solicitations,” which includes real estate agents.<\/p>\n<p>The TCPA is important to mention here because both the Federal Communications Commission (FCC) and the Federal Trade Commission (FTC) have the regulatory powers to enforce it. The last thing you want as a result of trying to generate leads is a lawsuit.<\/p>\n<p>And beware: today there are more than 220 million numbers on the FCC’s official <a href=\"https:\/\/www.ftc.gov\/news-events\/topics\/do-not-call-registry\">Do Not Call Registry<\/a>. If you call numbers on the registry, you could face a fine of up to <a href=\"https:\/\/www.rd.com\/list\/truth-about-do-not-call-list\/\">$40,000<\/a> for each call.<\/p>\n<p>So what does this mean for you? Essentially it means you need to comply with the following:<\/p>\n<ul class=\"BlogUL\">\n<li class=\"BlogLI\">Restrict your calls to hours between 8 a.m. and 9 p.m.<\/li>\n<li class=\"BlogLI\">Be transparent: immediately tell the recipient who you are and the name of your business<\/li>\n<li class=\"BlogLI\">Don’t block your phone number from the recipient’s caller I.D.<\/li>\n<li class=\"BlogLI\">Search the registry for every cold call you make to ensure you aren’t contacting anyone who’s on that list<\/li>\n<\/ul>\n<p>For more details about how to cold call in real estate without breaking the law, <a href=\"https:\/\/www.nar.realtor\/telemarketing-cold-calling\">check out NAR’s quick summary<\/a>.<\/p>\n<h3 class=\"BlogH3\">2. Prepare<\/h3>\n<p>Do the proper research before you call so you can speak knowledgeably about your prospect’s situation and provide thorough responses to any questions that might come up. For example: if you’re cold calling a potential seller, familiarize yourself with the neighborhood, know the area’s <a href=\"https:\/\/www.realtor.com\/research\/market-trends\/\">median listing price<\/a>, and compile a handful of nearby listing comps for reference.<\/p>\n<p>Prepare your lines beforehand. Use <a href=\"https:\/\/www.marketleader.com\/wp-content\/uploads\/2022\/06\/2022-Call-Scripts-Guide.pdf\">the most effective real estate call scripts<\/a> and adjust them to fit your personality and the specific situation.<\/p>\n<p>Then practice. Rehearse your main talking points. Call yourself and leave a voicemail to assess your delivery.<\/p>\n<p>Ask a friend, family member, or colleague to play the role of an inquisitive consumer so you can practice fielding questions, addressing concerns, and handling objections. Work toward sounding as natural as possible.<\/p>\n<h3 class=\"BlogH3\">3. Resist the Urge To Sell<\/h3>\n<p>Be relational, not salesy. No one wants to feel like they’re being used to boost your bottom line. So be friendly and provide value. Demonstrate that you actually care about them as a person.<\/p>\n<p>How can you do that? By listening to what they say, taking notes, and repeating their own words back to them throughout the conversation. Tailor your approach specifically to their pain points and show how you’re the agent who can provide the help they need.<\/p>\n<p>Your ultimate goal, of course, is to turn them into a client. But that’s not what this call is about. You’re not going to sign any contracts after a single phone call.<\/p>\n<p>Instead, focus on being genuinely helpful, and replace your ultimate goal with a much smaller one for the time being: to get them to take the next step (which, for example, might be something as simple as scheduling a follow-up call).<\/p>\n<h3 class=\"BlogH3\">4. Set a (Realistic) Daily Cold Calling Goal<\/h3>\n<p>Aiming for 500 cold calls a day is admirable, but it’s also a recipe for burnout.<\/p>\n<p>First, establish your commission income goals. Then determine how many calls you’ll need to get there.<\/p>\n<p>For example, let’s say you want to earn $75,000 this year in commissions and you’re on a 10 percent split with your broker. That means you’ll need to close slightly less than $2.8 million worth of real estate sales. (The breakdown: $75,000 of total commissions income ÷ 90% to account for the split ÷ 3% if that’s the transaction commission rate.) If the median sale price of a home in your area was $285,000, you’d need to close 10 deals a year to reach (and slightly exceed) your commission goal.<\/p>\n<p>(If you want the quickest, easiest way to find out how many leads you’ll need to reach your annual income goal, use Market Leader’s free <a href=\"https:\/\/www.marketleader.com\/leadcalculator\/\">Lead Calculator<\/a>. Simply punch in the numbers you’re aiming for, and the calculator will tell you how many transactions and leads you’ll need across all lead sources.)<\/p>\n<p>Also, this is where investing in your <a href=\"https:\/\/www.marketleader.com\/solutions\/crm\/\">CRM<\/a> pays off. Analyze the data it provides to determine how many contacts it took you to generate the deals you closed last year.<\/p>\n<h3 class=\"BlogH3\">5. Call at the “Right Time”<\/h3>\n<p>If you still don’t feel all warm and fuzzy about real estate cold calling, consider getting it out of the way as soon as possible so you can avoid procrastinating. Many agents like to make telephone prospecting the first thing they do every morning so they can get it off their mind and their to-do list.<\/p>\n<p>Is that the best time to call? It could be. But as long as you comply with the FCC’s limitations, of course, any time may be a good time for you and your prospects.<\/p>\n<p>You could go the route of following the statistics. For example, findings from <a href=\"https:\/\/www.revenue.io\/blog\/the-best-time-to-cold-call-prospects-in-2020\">one recent study<\/a> suggested that “decision makers are more likely to engage in the late afternoon,” with engagement rates peaking “during the 4-5 p.m. hour.” And data from <a href=\"https:\/\/www.execvision.io\/blog\/best-time-cold-call\/\">another study<\/a> showed that “the best time to cold call a prospect is between 9 a.m. and 4 p.m., with 10 a.m. (15.53%) and 2 p.m. (15.01%) providing the best response times.”<\/p>\n<p>Studies like those might provide a good starting point. But ultimately, you need to find what works best for you and your prospects. That’s going to require some trial and error.<\/p>\n<p>Hypothesize about what might work best, give it a try, track your results, and repeat the process until you’ve found a time range that yields the highest results. Once you’ve identified the ideal times to call, make that a regular part of your schedule and stick to it.<\/p>\n<h3 class=\"BlogH3\">6. Demonstrate Your Value Immediately<\/h3>\n<p>The prospect should immediately learn 1) who you are and 2) what you bring to the table. And they should know both of those things <em>before<\/em> they can even begin to consider objections.<\/p>\n<p>Sharing who you are is easy – just start off the call by mentioning your name and, if applicable, the name of your business or brokerage. But how can you demonstrate your value?<\/p>\n<ul class=\"BlogUL\">\n<li class=\"BlogLI\"><strong>Share a version of your unique value proposition<\/strong>, a statement that expresses how you’re different (and better!) than your competitors. (Don’t have one? <a href=\"https:\/\/www.marketleader.com\/blog\/real-estate-marketing-plan\/\">Market Leader’s free real estate marketing plan<\/a> walks you through the process of creating a unique value proposition, vision statement, and mission statement.)<\/li>\n<li class=\"BlogLI\"><strong>Share your enthusiasm.<\/strong> Think of Theodore Roosevelt’s famous line: “Nobody cares how much you know until they know how much you care.” Demonstrating your level of expertise is very important (which is why it’s our next point), but it’s not the only thing that matters when cold calling – you also need to show that you have their best interest at heart. Your prospect is looking for an advocate and cheerleader, not just a consultant.<\/li>\n<li class=\"BlogLI\"><strong>Share what you know.<\/strong> By translating not only facts and figures but also your interpretation, insights, and conclusions based on the data, you’re essentially saying, “I’m the local expert, I’ve put in the hard work to understand this market at a granular level, and I’m bringing a kind of value that no other agent can provide.” It’s that kind of analysis that will put you leagues beyond what your prospects can find on Zillow.<\/li>\n<\/ul>\n<h3 class=\"BlogH3\">7. Be Memorable<\/h3>\n<p>Not only are you competing with other agents, you’re also competing with all of the other things that take prospects’ time and attention away from buying or selling. So find your own unique way to stand out. Maybe for you it’s your personality, a catchphrase, a resource you provide, or a personal connection you share.<\/p>\n<p>But remember: Ultimately, the call isn’t about you. It’s about helping the prospect. So as you’re capturing their attention, be careful not to push them aside. Always help your prospects draw a clear connection between what you do and how (exactly) that benefits them.<\/p>\n<h3 class=\"BlogH3\">8. Give Them the Next Steps<\/h3>\n<p>After the call is over, they should know what’s going to happen next. End by scheduling a meeting, for example, or nailing down the best time for a follow-up call.<\/p>\n<p>Is there a specific action you want them to take after the call? Tell them plainly. Depending on the situation, you might have one specific call to action (e.g., “Take a look at the listings on my website,” or “Check out this <a href=\"https:\/\/www.marketleader.com\/blog\/what-is-a-cma-in-real-estate\/\">CMA<\/a> and let me know what you think”).<\/p>\n<p>Or maybe the next step is something you will do (e.g., “I’m going to shoot you an email that walks you through the buying process…,” or “I’ll give you a call on Wednesday…”).<\/p>\n<p>In any case, don’t end the call without providing clarity about who is doing what when.<\/p>\n<p><strong>Speaking of next steps…<\/strong><\/p>\n<p>Cold calling is just one way you can get more listings. Learn all <a href=\"https:\/\/www.marketleader.com\/blog\/get-more-listing-leads\/\">seven essential tactics for getting more listing leads<\/a> and discover how to&#8230;<\/p>\n<ul class=\"BlogUL\">\n<li class=\"BlogLI\">cold call FSBOs and expired listings<\/li>\n<li class=\"BlogLI\">build your brand<\/li>\n<li class=\"BlogLI\">nail your marketing<\/li>\n<li class=\"BlogLI\">grow your network<\/li>\n<li class=\"BlogLI\"><a href=\"https:\/\/www.marketleader.com\/products\/real-estate-leads\/\">get exclusive buyer and seller leads in your local market<\/a><\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>After learning some best practices, your new perspective on cold calling may surprise you. It gets a bad rap. But if you know what you’re doing, it’s less intimidating and more productive. Regardless of what you’ve heard or imagined, real estate cold calling can still be an effective lead generation strategy. That’s true even though [&hellip;]<\/p>\n","protected":false},"author":33,"featured_media":53837,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[34,35,83,36],"tags":[],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/53825"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/33"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=53825"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/53825\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media\/53837"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=53825"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=53825"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=53825"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}