{"id":54047,"date":"2017-12-11T14:30:54","date_gmt":"2017-12-11T22:30:54","guid":{"rendered":"http:\/\/www.marketleader.com\/?p=54047"},"modified":"2022-01-26T15:28:37","modified_gmt":"2022-01-26T23:28:37","slug":"5-ways-to-maximize-open-houses","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/5-ways-to-maximize-open-houses\/","title":{"rendered":"Why You Should Hold Open Houses and 5 Ways to Maximize Them"},"content":{"rendered":"<h3><strong>Don’t do open houses? Maybe you should reconsider.<\/strong><\/h3>\n<p>More than half of real estate agents surveyed by <a href=\"http:\/\/rismedia.com\/2015\/08\/10\/open-houses-powerful-or-pointless-2\/#close\">RISMedia<\/a> say that open houses are a waste of time. Which, to us, means that more than half of real estate agents either haven’t a clue as to how to hold an effective <a href=\"\/blog\/5-tips-for-successful-open-houses\/\">open house<\/a>, or lack the imagination necessary to understand how valuable they can be.<\/p>\n<p>So, if holding your listings open in 2018 isn’t on your list of marketing tactics, read on. We’re going to convince you otherwise.<\/p>\n<h4><strong>Admit the <em>why.<\/em><\/strong><\/h4>\n<p>Agents who avoid holding open houses will typically quote the NAR statistic that claims only 9 percent of open house visitors eventually decide to buy that home.<\/p>\n<p>Nevertheless, looking at the glass half-full means that nearly half a million homes nationwide sold to an open-house visitor last year.<\/p>\n<p>Most agents don’t hold open houses to sell the listing. Admit it &#8212; open houses are buyer bait. That, and they’re something many sellers expect.<\/p>\n<p>Once you’re honest with yourself about why agents hold open houses, you’ll be better able to embrace the process and approach it as a marketing tool – <em>for you<\/em> &#8212; not the home.<\/p>\n<h4><strong>1. Market the daylights out of it.<\/strong><\/h4>\n<p>The purpose of an open house is to generate traffic, regardless of your reason for holding one. To get feet through the door requires strategic, compelling marketing.<\/p>\n<p>Consider starting with a single-property landing page or a custom page on your website to whet the potential attendees’ appetites. Although many may consider this a waste of time and money in a fiery market, where homes are selling quickly, remember your <em>why<\/em>.<\/p>\n<p>Additionally, some of those open house attendees may have a home to sell and witnessing how well you’ve marketed <em>this<\/em> home is a testament to why they should consider hiring you.<\/p>\n<p>Then, share the page on your social media platforms and post it to Craigslist. A screen shot and the page URL can also go in your newsletters and in an email blast. And, naturally, you’ll want your laptop open to the page during the open house.<\/p>\n<h4><strong>2. Know the competition.<\/strong><\/h4>\n<p>Your listing typically won’t be the only home for sale in the area, so get to know the competition. Don’t just troll the MLS to get the descriptions and features of neighboring homes for sale. Tour each one and take notes on each home’s features.<\/p>\n<p>Then, when open house attendees are looking for something that your listing can’t provide, you’ll be considered a walking encyclopedia of homes for sale in the neighborhood when you rattle off features of nearby listings that you can’t wait to show them. Of course, the homeowners won’t appreciate you steering potential clients to other homes, but remember your <em>why<\/em> and don’t do it in their presence.<\/p>\n<h4><strong>3. Schedule Strategically.<\/strong><\/h4>\n<p>One aspect of the modern open house that differentiates it from the old-school type is that agents aren’t feeling locked into a particular day or even time of day.<\/p>\n<p>While the after-work open house may not fly in a commuter-centric region, in others, agents are having amazing results with it. Downtown condos and lofts being held open during the lunch hour are also becoming more common.<\/p>\n<p>Any home with a stunning view will practically sell itself if it’s held open during the appropriate time of day. Why hold a downtown penthouse open on a Sunday afternoon when the city lights are best viewed in the evening?<\/p>\n<p>It’s easy to mention in your listing remarks or on a flyer that the patio of the lakefront property you’ve listed faces west. Holding it open at sunset, however, puts them right in front of your lakefront property’s most compelling feature.<\/p>\n<p>If you decide to hold the home open on the weekend, check local events calendars to ensure you won’t be competing for foot traffic.<\/p>\n<h4><strong>4. Use a sign-in sheet.<\/strong><\/h4>\n<p>For new agents, especially, getting visitors to sign the open house guestbook is uncomfortable. Nobody wants to demand personal information from a complete stranger.<\/p>\n<p>So, blame the homeowner.<\/p>\n<p>It’s an old trick, but it works: tell everyone that comes through the door that the homeowner requests that, for security purposes, everyone sign in.<\/p>\n<p>A quick, easy and techie way to sign folks up is to use the <a href=\"https:\/\/www.openhomepro.com\/\">Open Home Pro<\/a> iPad or Android app or the less-pricey AM Open House. Anecdotal evidence from agents who use it shows that open house visitors more readily sign in on an iPad than the old-school pen-and-paper-on-a-clipboard routine.<\/p>\n<h4><b>5. Offer hand-outs.<\/b><\/h4>\n<p>Again, remember your <i>why <\/i>when holding open houses and offer lots of handouts. We’re not just talking the listing sheet or the flyer, here.<\/p>\n<p>Go overboard, with handouts of a list of the home’s updates, a list of any personal property included in the sale, school and neighborhood information, a list of average monthly utility costs and, of course, information about you. And, all of it, with your branding.<\/p>\n<p>If you use promotional items, like branded calendars, pens and pads of paper, include them in your packet as well.<\/p>\n<p>Don’t <em>ask<\/em> attendees if they want one of your packets – force them to take one. Not physically, of course, but keep pushing it on them until they take one. Let them know that there’s other valuable information included aside from that about this particular home.<\/p>\n<p>There are several agent marketing tactics that have ended up with the “waste of time” moniker. Post card mailings, <a href=\"\/blog\/dont-knock-it-till-you-try-it-door-knocking-tips-for-agents\/\">door knocking<\/a> and <a href=\"\/blog\/cold-calling-best-practices\/\">cold calling<\/a> are all considered archaic by many, yet agents nationwide are finding great success with these methods.<\/p>\n<p>Acknowledge the <em>why<\/em>, and approach open houses with it in mind, and they do dual duty: exposing your listing to more buyers and exposing your brand as well.<\/p>\n<h4>Looking for more? Enter your email address to get best practices, tips, and educational webinars sent directly to your inbox.<\/h4>\n<div><script type=\"text\/javascript\">\/\/<![CDATA[\n(function(){window.pagespeed=window.pagespeed||{};var b=window.pagespeed;function c(){}c.prototype.a=function(){var a=document.getElementsByTagName(\"pagespeed_iframe\");if(0<a.length){for(var a=a[0],f=document.createElement(\"iframe\"),d=0,e=a.attributes,g=e.length;d<g;++d)f.setAttribute(e[d].name,e[d].value);a.parentNode.replaceChild(f,a)}};c.prototype.convertToIframe=c.prototype.a;b.b=function(){b.deferIframe=new c};b.deferIframeInit=b.b;})(); pagespeed.deferIframeInit(); \/\/]]><\/script><iframe loading=\"lazy\" style=\"border: 0;\" src=\"https:\/\/success.marketleader.com\/l\/42972\/2016-01-25\/4bthtx\" width=\"220\" height=\"90\" frameborder=\"0\" scrolling=\"no\"><\/iframe><\/div>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Don’t do open houses? Maybe you should reconsider. More than half of real estate agents surveyed by RISMedia say that open houses are a waste of time. Which, to us, means that more than half of real estate agents either haven’t a clue as to how to hold an effective open house, or lack the [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":54051,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[35],"tags":[],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/54047"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=54047"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/54047\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media\/54051"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=54047"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=54047"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=54047"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}