{"id":54359,"date":"2017-12-20T10:00:58","date_gmt":"2017-12-20T18:00:58","guid":{"rendered":"http:\/\/www.marketleader.com\/?p=54359"},"modified":"2018-01-11T11:06:25","modified_gmt":"2018-01-11T19:06:25","slug":"real-estate-agents-need-a-brand","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/real-estate-agents-need-a-brand\/","title":{"rendered":"Real Estate Agents: You Need a Brand"},"content":{"rendered":"<p>Warren Buffett, perhaps the greatest living investor, understands the value of a brand. His holding company, Berkshire Hathaway, owns a big chunk of Coca Cola – one of the greatest brands in history. “I could take a billion dollars, and I still couldn’t make a dent in Coca Cola’s market share,” he told a group business students at the University of Florida.<\/p>\n<p>Buffett has long been attracted to strong brands, and in recent years has owned stakes in Visa, Verizon, Pampers, and Gillette (via parent company Proctor &amp; Gamble).<\/p>\n<p>Brands are valuable things: Investors have paid billions just for the use of a name. Corporate accountants list the value of a brand on company balance sheets (look in any major brand’s parent company’s annual report under the heading “goodwill.”)<\/p>\n<p><a href=\"http:\/\/www.wppwrap.com\/brandztop100global2017\/mobile\/#p=17\">A recent study from Kantar Millward Brown<\/a> found that a basket of stocks representing the world’s top 100 brands outperformed the S&amp;P 500 over the ten years ending in April 2017, 129 percent to 81 percent.<\/p>\n<p>&nbsp;<\/p>\n<h3><strong>Branding in the Real Estate Business<\/strong><\/h3>\n<p>The real estate business is no different. The big real estate brokerages all carefully build their brands – and zealously guard them against internal and external threats.<\/p>\n<p>This is serious business. For many companies, its brand is one of its most important assets. A quick look at RE\/MAX’s 2016 annual report shows that <a href=\"http:\/\/s2.q4cdn.com\/001766218\/files\/doc_financials\/annual_reports\/Remax-2016-Annual-Report.pdf\">the company estimated its brand and associated goodwill to be worth <em>$126 million.<\/em><\/a><\/p>\n<p>That’s more than the net present value of all its franchise agreements ($109 million) and representing 29 percent of the total assets of the company.<\/p>\n<p>&nbsp;<\/p>\n<h4><strong>What is a Brand?<\/strong><\/h4>\n<p>Your brand, essentially, is what other people think of you and your real estate business. Your brand audience doesn’t just include customers and clients, but also other real estate agents and allied professionals, as well. In a crowded field with lots of competitors, it’s your brand that makes your real estate business unique in the eyes of your community, and sets you apart from your competition.<\/p>\n<p>It’s much more than a logo or catchphrase, though those are important elements. <strong>Your brand is the set of values and associations that the public associates with you.<\/strong><\/p>\n<p>If you don’t manage your brand, <em>others will define it for you.<\/em> Including competitors.<\/p>\n<p>&nbsp;<\/p>\n<h4><strong>Basics of Real Estate Agent Brand Management<\/strong><\/h4>\n<p>Make a plan<strong>. <\/strong>Nobody makes a great building without a <a href=\"https:\/\/success.marketleader.com\/l\/42972\/2017-09-26\/655jdj\">blueprint<\/a>. Similarly, nobody builds a great brand without a <a href=\"https:\/\/success.marketleader.com\/l\/42972\/2017-10-25\/6bp7dn\">marketing plan<\/a>. That means investing in developing a good branding guide as soon as possible.<\/p>\n<p>A logo’s a good start, but it’s only a start. Businesses serious about building a valuable brand invest a significant amount of time and effort into it, and create a brand identity document that helps them stay on message and consistent in everything they do.<\/p>\n<p>RE\/MAX’s own set of branding guidelines, <a href=\"https:\/\/remax-saarlouis.de\/wp-content\/uploads\/2014\/10\/Marken-_und_Grafikstandards.pdf\">available online here,<\/a> is an excellent example of a good branding guide. While many branding documents just deal with how to display the logo, RE\/MAX’s guide starts by establishing a set of values.<\/p>\n<p>&nbsp;<\/p>\n<h4><strong>Branding Fundamentals<\/strong><\/h4>\n<p>Real estate agents and agency principals should keep these basic branding principles in mind:<\/p>\n<h5>1. Be consistent.<\/h5>\n<p>Brand every communication with your company name and logo.<\/p>\n<h5>2. Brand <em>yourself<\/em>, not just your company.<\/h5>\n<p>As an agent of your business, your personal brand is just as important as your company’s brand. If someone wants to research your services online, odds are they’ll find your personal pages as well. Be mindful of your client’s journey and be sure your personal and business brands are consistent.<\/p>\n<h5>3. Stay on message.<\/h5>\n<p>You can never repeat your brand message too often. Repetition counts.<\/p>\n<h5>4. Invest in a good website.<\/h5>\n<p>In today&#8217;s digital environment, your web presence is often your best and most important brand messenger. 90 percent of home searches begin online according to research from the National Association of Realtors. You want your brand to be in front of these people.<\/p>\n<h5>5. Create your &#8220;Pizza Statement.&#8221;<\/h5>\n<p>Your pizza statement is what marketing consultants call your <em>unique value proposition. <\/em>This should be something that sets you apart in some way, and that competitors would have a hard time matching. Domino’s Pizza had one of the greatest UVP’s of all time: “Fresh, hot pizza in 30 minutes or less, guaranteed.”<\/p>\n<h5>6. Define a market to dominate.<\/h5>\n<p>For you, it might be a certain neighborhood or development. Or a certain kind of client. You can’t compete with the giants and fight for your whole state. But you can beat them on your own home turf. You want to dominate your space. But in order to dominate it, you must first <em>define<\/em> it. For example:<\/p>\n<ul>\n<li>“The restaurant experts.”<\/li>\n<li>“The Frisco relocation team”<\/li>\n<li>“Your source for &lt;insert neighborhood&gt; homes”<\/li>\n<li>“The condo people”<\/li>\n<li>“Specializing in serving veterans and their families”<\/li>\n<li>“The experts in North Dallas luxury homes”<\/li>\n<\/ul>\n<p>Finally, <em>don’t get carried away!<\/em> If you’re just starting out, don’t get so focused on branding that you forget the basics. Spend your time prospecting, meeting with potential sellers and buyers, showing homes and asking for the sale. Too many people in the real estate business spend too much time obsessing over logos and websites. Beware of avoidance behavior. Don’t let branding distract you from the activity that generates sales, or you won’t be in the real estate business long enough to see your brand grow.<\/p>\n<p>Eyes on the prize.<\/p>\n<h4>Looking for more? Enter your email address to get best practices, tips, and educational webinars sent directly to your inbox.<\/h4>\n<div><script type=\"text\/javascript\">\/\/<![CDATA[\n(function(){window.pagespeed=window.pagespeed||{};var b=window.pagespeed;function c(){}c.prototype.a=function(){var a=document.getElementsByTagName(\"pagespeed_iframe\");if(0<a.length){for(var a=a[0],f=document.createElement(\"iframe\"),d=0,e=a.attributes,g=e.length;d<g;++d)f.setAttribute(e[d].name,e[d].value);a.parentNode.replaceChild(f,a)}};c.prototype.convertToIframe=c.prototype.a;b.b=function(){b.deferIframe=new c};b.deferIframeInit=b.b;})(); pagespeed.deferIframeInit(); \/\/]]><\/script><iframe loading=\"lazy\" style=\"border: 0;\" src=\"https:\/\/success.marketleader.com\/l\/42972\/2016-01-25\/4bthtx\" width=\"220\" height=\"90\" frameborder=\"0\" scrolling=\"no\"><\/iframe><\/div>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Warren Buffett, perhaps the greatest living investor, understands the value of a brand. His holding company, Berkshire Hathaway, owns a big chunk of Coca Cola – one of the greatest brands in history. “I could take a billion dollars, and I still couldn’t make a dent in Coca Cola’s market share,” he told a group [&hellip;]<\/p>\n","protected":false},"author":33,"featured_media":54379,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[97,35],"tags":[],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/54359"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/33"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=54359"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/54359\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media\/54379"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=54359"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=54359"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=54359"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}