{"id":54445,"date":"2017-12-21T08:39:04","date_gmt":"2017-12-21T16:39:04","guid":{"rendered":"http:\/\/www.marketleader.com\/?p=54445"},"modified":"2021-12-02T14:00:23","modified_gmt":"2021-12-02T22:00:23","slug":"market-leader-and-exit-realty-extend-partnership-with-multi-year-agreement","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/market-leader-and-exit-realty-extend-partnership-with-multi-year-agreement\/","title":{"rendered":"Market Leader and EXIT Realty Corp. International Extend Partnership with Multi-Year Agreement"},"content":{"rendered":"<p><em>This story originally appeared on <a href=\"https:\/\/www.prweb.com\/releases\/2017\/12\/prweb15033272.htm\" target=\"_blank\" rel=\"noopener\">PRWeb.com<\/a>.<\/em><\/p>\n<p>BELLEVUE, WA. December 21, 2017 &#8211; Market Leader announced that they have extended their long-standing partnership with EXIT Realty Corp. International, providing sales and marketing tools for real estate professionals via EXIT Promo Shop, along with Professional and Business Suite products.<\/p>\n<p>First launched in 2005, EXIT Promo Shop features thousands of professionally-designed templates, automated campaigns, and a robust email, print, and direct mail marketing center. Market Leader is also an EXIT Approved Supplier for the Market Leader suite of tools for agents, teams, and offices.<\/p>\n<p>“EXIT Realty has been great to partner with for the last 12 years, and we’re thrilled to announce our extended agreement,” said Scott Smith, President and General Manager of Market Leader. “We look forward to continuing to work closely with EXIT Realty and their associates to deliver powerful sales and marketing solutions to help grow and manage their businesses.”<\/p>\n<p>“We take pride in sourcing products and services that help our brokerages and associates manage their businesses while making it easier for them to focus on their top priorities, and Market Leader has been a great partner for doing such,” stated Tami Bonnell, EXIT Realty’s CEO. “We look forward to continuing our partnership with Market Leader for years to come.”<\/p>\n<p>This continued partnership also includes Market Leader’s Leads Direct and HouseValues leads products, which deliver a guaranteed number of exclusive leads every month and Market Leader’s Professional and Business Suite products, offering lead-generating websites, a robust desktop CRM with mobile app, and marketing tools designed to help agents, teams, and offices master their businesses.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>About Market Leader <\/strong><\/p>\n<p>A pioneer in lead generation and contact management systems, Market Leader provides innovative online technology-based sales and marketing solutions for real estate professionals. Since 1999, Market Leader has helped real estate professionals succeed and grow, and today serves more than 250,000 agents, teams, brokerages, and franchises across the United States and Canada. Market Leader is a part of the Perseus Operating Group which is a division of Constellation Software Inc. Perseus is a provider of software solutions to several vertical markets and is a leading provider of software solutions to the real estate industry through its other businesses Z57, Zurple, Constellation Web Solutions, Sharper Agent, Birdview, Diverse Solutions, and ReloSpec. For more information please visit <a href=\"https:\/\/www.constellationreg.com\/\">ConstellationREG.com<\/a>.<\/p>\n<p><strong>About EXIT Realty  <\/strong><\/p>\n<p>EXIT is a proven real estate business model that has to-date paid out more than a third of a billion dollars in single-level residual income to its associates across the U.S. and Canada. The company’s Focus on Good Health initiative promotes wellness at work and home. A portion of every transaction fee collected by EXIT Realty Corp. International is applied to its charitable fund and to-date, $4 million has been pledged to charity.  For more information, please visit <a href=\"https:\/\/exitrealty.com\/\">www.exitrealty.com<\/a>.<\/p>\n<p style=\"text-align: center;\">###<\/p>\n<p style=\"text-align: left;\">For more information:<\/p>\n<p>Shara Maurer<br \/>\nMarketing Communications Manager<br \/>\n<a href=\"tel:14259526612\" target=\"_blank\" rel=\"noopener\">(425)952-6612<\/a><br \/>\n<a href=\"mailto:shara.maurer@marketleader.com\" target=\"_blank\" rel=\"noopener\">shara.maurer@marketleader.com<\/a><br \/>\n<a href=\"http:\/\/www.marketleader.com\">www.marketleader.com<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Market Leader to provide EXIT Promo Shop, Along with Professional and Business Suite Products for EXIT Associates<\/p>\n","protected":false},"author":51,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[51],"tags":[],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/54445"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/51"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=54445"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/54445\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=54445"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=54445"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=54445"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}