{"id":54621,"date":"2017-12-27T09:58:52","date_gmt":"2017-12-27T17:58:52","guid":{"rendered":"http:\/\/www.marketleader.com\/?p=54621"},"modified":"2022-03-30T10:07:32","modified_gmt":"2022-03-30T17:07:32","slug":"5-cringe-worthy-mistakes-experienced-agents-make-on-their-listings","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/5-cringe-worthy-mistakes-experienced-agents-make-on-their-listings\/","title":{"rendered":"5 Cringe-Worthy Mistakes Experienced Agents Make on Their Listings"},"content":{"rendered":"<p>After making the transition from agent to analyst, I am continually amazed at the glaring and cringe-worthy mistakes that even the best Realtors make on their listings. Part of the problem is that even some of the best agents in the industry pick up bad habits that carry over into their listings. They then make the error of thinking that these mistakes aren’t thinning their sales funnel and hurting their bottom line. Trust me on this. They are.<\/p>\n<p>If you’re reading this, chances are you aren’t a million-dollar agent with an endless stream of eight figure listings in Malibu. Even if you are, you may be surprised to learn how even small marketing and branding mistakes you make on your listings are giving your competitors business.<\/p>\n<p>No matter what level of your career you’re in, a quick refresher on the brand killing mistakes most people don’t realize they’re making couldn’t hurt. Here are the five most common mistakes I find in both mid-range and high-end listings.<\/p>\n<p><img loading=\"lazy\" class=\"alignleft size-full wp-image-54623\" src=\"\/wp-content\/uploads\/2017\/12\/1.jpg\" alt=\"\" width=\"1353\" height=\"899\" \/><\/p>\n<h2>1. The Great Wall of Text<\/h2>\n<p>Yes, your listing is truly special and you want your buyer’s agents and their clients to know <em>everything<\/em> about it. That means writing a 5,000-word description that goes into minute architectural details will help draw in buyers, right? In most cases, this is going to either bore your buyers to tears, or worse, reveal a flaw that may keep them from ever viewing the property in person. It happens more than you might think!<\/p>\n<h4>The “Warts and All” Approach Means Fewer Showings and Fewer Offers.<\/h4>\n<p>Let’s face it, even a Philip Johnson designed midcentury masterpiece or a stately Victorian will have flaws that will make some buyers run for the hills. Tiny bathrooms, dark kitchens, or linoleum flooring have kept otherwise interested buyers from viewing your listings. If their buyer’s agent does convince them to come look, they’re holding off until the end of their search, when your homeowner is already getting annoyed with your lack of offers.<\/p>\n<h4>Focus on Building an Emotional Connection Instead.<\/h4>\n<p>If they’re not wild about the pictures of your listing, then you need to use your listing description to build enough of an <a href=\"\/blog\/emotional-marketing-in-real-estate\/\">emotional connection<\/a> to get them to pick up the phone. In order do this properly, focus on short, meaningful sentences, and write an outline of what you want your leads to <em>feel<\/em> while reading your listing description.<\/p>\n<h4>Layout Matters.<\/h4>\n<p>Here’s the deal. Even the most curious client is going to be turned off by a wall of text. Instead, try writing an outline and including bold subheadings to break up the copy. This way the people who are interested in a deep dive will still read everything, but the people who want to skim will come away with the key concepts you want them to.<\/p>\n<p><em>Important note:<\/em> If you’re posting listings directly from your MLS to Zillow, make sure that the formatting you include in your MLS description makes it over to Zillow.<\/p>\n<p><img loading=\"lazy\" class=\"alignleft size-full wp-image-54631\" src=\"\/wp-content\/uploads\/2017\/12\/2.jpg\" alt=\"\" width=\"1350\" height=\"900\" \/><\/p>\n<h2>2. Repeating Information Already Available on Zillow or Other Portals<\/h2>\n<p>Another mistake that I see even million dollar agents make (I won’t name names…) is just listing the features of the home in their listing description. There are three huge problems with this approach. One, it is painfully boring. Two, it’s redundant— Zillow and other portals already strip key details about your listing into the property features area. When listings are presented in search results, this is what shows up. Third, and most importantly, you’re giving up valuable on page real estate that you could be using to build and emotional connection with your leads.<\/p>\n<p><img loading=\"lazy\" class=\"alignleft size-full wp-image-54629\" src=\"\/wp-content\/uploads\/2017\/12\/3.jpg\" alt=\"Kitchen with white cupboards, dark hardwood floor and stainless steel applicances\" width=\"1353\" height=\"899\" \/><\/p>\n<h2>3. Not Investing in a Professional Photographer<\/h2>\n<p>This is a big one, and if you spend a few hours cruising through Zillow right now, one you’ll find listings that deserve better. If you want to maximize your ROI for your business marketing, then there is simply no excuse for not hiring the best professional photographer you can afford. There are two key reasons why:<\/p>\n<h4>1. Listings shot by Professional Photographers Close Faster and for More Money.<\/h4>\n<p>According to a study done by Redfin, homes listed between $200,000 and $1 million sell for $3,400 to $11,200 more relative to their list prices when listing photos are taken with DSLR cameras. In all price ranges, homes with professional photos sold faster. In the million+ dollar range, professionally photographed listings sold four days faster.  Listings in the $400,000 range sold <em><u>three weeks faster<\/u><\/em> than their counterparts with amateur listing pictures.<\/p>\n<h4>2. Professionally Shot Listing Pictures Are Great for Your Listing Presentation.<\/h4>\n<p>Any good agent is going to talk about their marketing expertise when pitching homeowners or FSBO’s. Most are also going to include marketing case studies of previous listings to show how amazing they made their former client’s home look. That means the $350 you spend on a professional photographer will not only make your listing sell faster and for more money, but can help you land more listings in the future. Not a bad investment huh?<\/p>\n<p><img loading=\"lazy\" class=\"alignleft size-full wp-image-54627\" src=\"\/wp-content\/uploads\/2017\/12\/4.jpg\" alt=\"\" width=\"1350\" height=\"900\" \/><\/p>\n<h2>4. Too Many Pictures or Too Many Detail Shots<\/h2>\n<p>Okay. Confession time. This is one of my personal pet peeves. That said, the odds that this annoys other potential leads too is 100%. After all, who wants to click through ten pictures of the same kitchen counter from slightly different angles, only to have to click through ten more of the backyard from 20 different angles? Why am I looking at this picture of a close-up of the homeowner’s sofa? Does it come with the house?<\/p>\n<p>You may be thinking that I’m just nitpicking here. TOO many pictures are better than too few, right? Wrong. Including too many pictures in your listing only shows your potential clients that you have a hard time focusing on what’s truly important. Not exactly a quality most people are looking for in a great listing agent.<\/p>\n<h4>Instead, Only Post One Photo of Each Room, Front and Back Yards, &amp; a Drone Shot.<\/h4>\n<p>Instead of overwhelming people with dozens of pictures or including close-ups of your homeowner’s furniture, keep it minimal and interesting. At most, you should include one good shot of each room, the front and back yards, and a dramatic drone shot of the property. If your listing has killer historical details then, by all means, include a few close ups of moldings, fireplaces etc. Just remember to not overdo it. You want to leave a little mystery for the showing!<\/p>\n<p><img loading=\"lazy\" class=\"alignleft size-full wp-image-54625\" src=\"\/wp-content\/uploads\/2017\/12\/5.jpg\" alt=\"\" width=\"1351\" height=\"900\" \/><\/p>\n<h2>5. Talking up The Neighborhood Too Much<\/h2>\n<p>Location, location, location! Yes, we know. Believe it or not we’ve heard that one before. More importantly, if I’m already looking at your listing, then chances are I already know how cool the neighborhood is. I don’t need a tour guide, I need a home.<\/p>\n<p>Even worse, you taking up precious listing real estate talking up the neighborhood makes me think that there are issues with the home, or that the immediate neighborhood is bad enough to warrant talking about the whole zip code.<\/p>\n<h4>Stay Local and Talk About the Lot or Block Instead.<\/h4>\n<p>Instead of talking up the whole area, focus on the highlights of the lot or block instead. For example, is it a larger than normal lot with few homes surrounding it? Do the trees give great shade in the summer? Does the block regularly have block parties or barbeques? Is it lined with old growth oak trees and stately homes? Try and paint a picture of the area directly around the home to draw in your leads.<\/p>\n<p>&#8211;<\/p>\n<h4>Looking for more? Enter your email address to get best practices, tips, and educational webinars sent directly to your inbox.<\/h4>\n<div><script type=\"text\/javascript\">\/\/<![CDATA[\n(function(){window.pagespeed=window.pagespeed||{};var b=window.pagespeed;function c(){}c.prototype.a=function(){var a=document.getElementsByTagName(\"pagespeed_iframe\");if(0<a.length){for(var a=a[0],f=document.createElement(\"iframe\"),d=0,e=a.attributes,g=e.length;d<g;++d)f.setAttribute(e[d].name,e[d].value);a.parentNode.replaceChild(f,a)}};c.prototype.convertToIframe=c.prototype.a;b.b=function(){b.deferIframe=new c};b.deferIframeInit=b.b;})(); pagespeed.deferIframeInit(); \/\/]]><\/script><iframe loading=\"lazy\" style=\"border: 0;\" src=\"https:\/\/success.marketleader.com\/l\/42972\/2016-01-25\/4bthtx\" width=\"220\" height=\"90\" frameborder=\"0\" scrolling=\"no\"><\/iframe><\/div>\n<p><em>This article was provided to us by Fit Small Business. Fit Small Business is an online marketplace for resources, focused on providing small business owners with the information they need to succeed. <\/em><\/p>\n<div id=\"attachment_53617\" style=\"width: 210px\" class=\"wp-caption alignright\"><img aria-describedby=\"caption-attachment-53617\" loading=\"lazy\" class=\"wp-image-53617 size-full\" src=\"\/wp-content\/uploads\/2017\/10\/Emile-LEplattenier.jpg\" alt=\"Emile L'Eplattenier photo\" width=\"200\" height=\"200\" \/><p id=\"caption-attachment-53617\" class=\"wp-caption-text\">Emile L&#8217;Eplattenier<\/p><\/div>\n<p><strong>About the author:<\/strong><br \/>\nA five year veteran NYC real estate agent and member of the Real Estate Board of New York, Emile L&#8217;Eplattenier specialized in selling and renting new developments in the East Village of Manhattan and Williamsburg Brooklyn. He is currently a staff writer and real estate analyst at Fit Small Business.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Even small marketing and branding mistakes made on your listings can give your competitors business. Most don’t realize they’re making these common brand-killing mistakes found in both mid-range and high-end listings.<\/p>\n","protected":false},"author":33,"featured_media":54703,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[35],"tags":[],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/54621"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/33"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=54621"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/54621\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media\/54703"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=54621"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=54621"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=54621"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}