{"id":54699,"date":"2017-12-28T07:12:01","date_gmt":"2017-12-28T15:12:01","guid":{"rendered":"http:\/\/www.marketleader.com\/?p=54699"},"modified":"2022-11-07T10:29:23","modified_gmt":"2022-11-07T18:29:23","slug":"10-things-realtors-should-be-doing-on-social-media","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/10-things-realtors-should-be-doing-on-social-media\/","title":{"rendered":"10 Things Realtors Should Be Doing on Social Media"},"content":{"rendered":"<h3>Make it a New Year’s Resolution: Fully engage your real estate market on social media in 2020.<\/h3>\n<h4>Here’s why:<\/h4>\n<p><a href=\"\/blog\/the-truth-about-millennials-and-real-estate\/\">Millennials<\/a>, the most digitally-engaged generation by far, now constitute most new home buyers. They are also now the single biggest cohort of homebuyers overall – and will remain so for decades to come. Your real estate social media marketing will be the key to reaching them and staying in front of them.<\/p>\n<h4>Consider the following:<\/h4>\n<ul>\n<li>Close to 99 percent of Millennials will be using the Internet in their home search. 58 percent of Millennial homebuyers report that they used a mobile device in the house-hunting process.<\/li>\n<li>Nearly 6 in 10 millennials – 58 percent – found their home using a mobile device. 46 percent of Generation X homebuyers found their home on a mobile device.<\/li>\n<\/ul>\n<p>Until recently, most people used Google to search for listings and real estate agents. But increasingly, we’re seeing younger Americans bypass Google and go directly through their favorite social media platforms to find information.<\/p>\n<h4>Video Is Ascendant<\/h4>\n<p>Video is becoming a more important part of real estate marketing, especially as the industry develops new technologies, like virtual tours and drone footage. 73 percent of consumers say they are more likely to use a realtor who is active on YouTube – yet only 12 percent of agents are active on the platform, observes Brandon Gaille, a Houston area marketing consultant and blogger. The disconnect creates a prime opportunity for a real estate social media expert to exploit.<\/p>\n<p>Yes, most older real estate agents are on social media. But if they’re restricting themselves to Facebook and Twitter, they’re missing a big chunk of the Millennial market, which has begun to migrate to newer, more visually-focused platforms like Snapchat and Instagram.<\/p>\n<h3><strong>Real Estate Social Media Tips<\/strong><\/h3>\n<p>&nbsp;<\/p>\n<h4><strong>1. Complete your profiles. <\/strong><\/h4>\n<p>You can’t dominate every platform, all the time. But you can make sure that each major social media platform has a full, complete profile that reinforces your brand, your expertise, and takes readers to your home page and your listings. The average Internet user has seven accounts on various platforms. You want to be present on all of them. You can always link to your content on other platforms. But you don’t want to be absent!<\/p>\n<h4><strong>2. Think beyond Facebook.<\/strong><\/h4>\n<p>Yes, everyone is on Facebook. Facebook is the 800-pound gorilla of the social media world, with 79 percent of real estate agents actively using the platform. But don’t limit yourself to Facebook!<\/p>\n<p>The median Pinterest user household has an income of about $50,000, 10 percent of Pinterest users have household incomes of over $125,000 per year, <a href=\"https:\/\/www.omnicoreagency.com\/pinterest-statistics\/\">according to Omnicore,<\/a> which makes them among the most affluent of the social media user bases. Furthermore, Pinterest users are over 80 percent women. That makes them a more easily targeted demographic – and much less saturated by other real estate marketers.<\/p>\n<p>If you aren’t using Pinterest yet, join the board or boards related to your community. If you can’t find one, even better: <em>You can start it!<\/em><\/p>\n<h4><strong>3. Think visually. <\/strong><\/h4>\n<p>Try to include a graphic with each post. <a href=\"https:\/\/business.twitter.com\/en\/basics\/what-to-tweet.html\">Twitter posts with photos have at least three times the engagement rates of posts without photos<\/a>, and other platforms are seeing similar results. With some platforms, like Instagram and Tumblr, nearly everyone else in your readers’ feeds will have images. If you aren’t thinking visually, your readers may just scroll pass the walls of text.<\/p>\n<p>Try to incorporate memes, infographics, cartoons, videos, charts, professional photographs, and anything else that may draw the eye and set you apart. And brand everything you do with your name and logo, so they remember your name.<\/p>\n<h4><strong>4. Blog frequently.<\/strong><\/h4>\n<p>Studies show that businesses that blog frequently outperform those that don’t. Frequent updates keep content fresh, which is good for Google search results, and builds loyalty among readers. Furthermore, among real estate agents, the blogging field is wide open: <em>Only 11 percent of your competitors are currently blogging, nationwide. <\/em><\/p>\n<h4><strong>5. Stay engaged. <\/strong><\/h4>\n<p>Don’t just post and forget. Stay engaged with your social media audience and commenters. This is especially true in the blog and Twitter world, where many feeds are characterized as much by the commenters as the host.<\/p>\n<h4><strong>6. Ask for the follow. <\/strong><\/h4>\n<p>Sales professionals know to ‘ask for the sale.’ If you don’t ask, it won’t happen. Establish your real estate page on Facebook and wherever else you have a natural market – and <em>ask people to ‘like’ and ‘follow’ your page! <\/em><\/p>\n<h4><strong>7. Serve the reader with every post. <\/strong><\/h4>\n<p>Don’t post just to post. Each post should serve your readers in some way. Too many posts that are purely self-promotional and that don’t educate, entertain or move the reader in some way will quickly get an ‘unfollow.’ Don’t be boring, and don’t be selfish with your content.<\/p>\n<p>It doesn’t always have to be “how to buy a home,” either. Community-minded posts on anything from local events to great local restaurants and date ideas can help brand you as an expert on the neighborhoods you’re targeting.<\/p>\n<h4><strong>8. Have a ‘premium content’ offering. <\/strong><\/h4>\n<p>It’s a great idea to create some premium content that helps establish you as an expert in your market. It could be anything from a new home buyer’s guide to a neighborhood event schedule to a home inspection checklist to a white paper on local economic trends. You can use social media to get the link in front of followers, but get something in return – an e-mail address, or permission to follow up with a phone call.<\/p>\n<h4><strong>9. Schedule posts to reach the most readers. <\/strong><\/h4>\n<p>For business to consumer social media transmissions, concentrate on posting on weekends and on Thursdays and Fridays, when office workers are already thinking about the weekend. Twitter engagement for consumers is 17 percent higher on weekends than during the week. Pinterest engagement reaches its peak around 9 PM.<\/p>\n<p>Use social media management tools like <a href=\"https:\/\/hootsuite.com\/\">HootSuite<\/a> to help you schedule and manage your posts. That way, even if it’s 2AM when you finally have time to write that blog or tweet you’ve been meaning to write, you can still schedule it to post when it’s likely to get in front of the most eyeballs.<\/p>\n<h4><strong>10. Measure your metrics. <\/strong><\/h4>\n<p>Define the metrics most important to them, and measure them. Reinforce success. Carefully track leads generated from which platforms, and which platforms generate the most <em>local<\/em> interest for your efforts.<\/p>\n<p>Don’t operate blind: Each platform offers a number of tools for its advertisers. For example, use Facebook’s <a href=\"https:\/\/www.facebook.com\/business\/news\/audience-insights\">Audience Insights<\/a> tool to learn who is seeing your content – and guide your decision-making process when it comes to your social media strategy.<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Make it a New Year’s Resolution: Fully engage your real estate market on social media in 2020. Here’s why: Millennials, the most digitally-engaged generation by far, now constitute most new home buyers. They are also now the single biggest cohort of homebuyers overall – and will remain so for decades to come. Your real estate [&hellip;]<\/p>\n","protected":false},"author":33,"featured_media":54705,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[35,104],"tags":[],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/54699"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/33"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=54699"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/54699\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media\/54705"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=54699"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=54699"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=54699"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}