{"id":54767,"date":"2018-01-09T15:00:27","date_gmt":"2018-01-09T23:00:27","guid":{"rendered":"http:\/\/www.marketleader.com\/?p=54767"},"modified":"2022-01-26T15:25:13","modified_gmt":"2022-01-26T23:25:13","slug":"digital-body-language-what-your-leads-are-saying","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/digital-body-language-what-your-leads-are-saying\/","title":{"rendered":"Digital Body Language: Understand What Your Leads are Saying"},"content":{"rendered":"<p>How do you read your clients nonverbal cues when you’ve never met them face-to-face? Read their digital body language.<\/p>\n<p>While networking and <a href=\"\/blog\/dont-knock-it-till-you-try-it-door-knocking-tips-for-agents\/\">door knocking<\/a> are great for getting in front of new people, <a href=\"https:\/\/www.nar.realtor\/research-and-statistics\/research-reports\/home-buyer-and-seller-generational-trends\">88 percent<\/a> of real estate buyers and sellers have taken their search for information online and 88 percent of consumers across industries avoid face-to-face meetings whenever possible.<\/p>\n<p>Digital body language is the aggregate of someone’s online behavior. This can include visits to your website, likes on social media, even unsubscribing from an email campaign.<\/p>\n<h3>Understanding Digital Body Language<\/h3>\n<p>Every digital interaction a person has with your business will tell you something about who they are, what they’re looking for, where they&#8217;re at in the <a href=\"http:\/\/www.marketleader.com\/journey\/\">buyer’s journey<\/a>, and illustrate their intent. The more interactions a person has with you online, the better you’ll understand them – which will help you anticipate their needs, send personalized messages, and targeted content based on what they&#8217;ve communicated with you.<\/p>\n<p>If read properly, digital body language should help you turn visitors into leads and leads into clients.<\/p>\n<p>Behavior triggers are your window of opportunity. Certain behaviors communicate interests and intent and should prompt you to act quickly based on the information you acquire through digital cues.<\/p>\n<h4>1. Viewed Homes<\/h4>\n<p>The homes consumers view says a lot about the type of home they are interested in, or what type of home they’re looking to sell. Identify trends and patterns like the ones below:<\/p>\n<p>• Type of home (condo, townhouse, single family home)<br \/>\n• Neighborhoods<br \/>\n• Price range<br \/>\n• Features (view, vaulted ceilings, pool)<br \/>\n• Number of bedrooms and bathrooms<\/p>\n<p>Does anything stand out about the homes that were viewed? For example, a visitor has viewed multiple homes in a family-friendly neighborhood with 3-4 bedrooms within a certain price range.<\/p>\n<p>You can assume they’re looking to buy or sell something similar. Look them up on social media and see if they’re growing their family and looking to size-up, or maybe you see they’re a more mature client who’s likely looking to downsize.<\/p>\n<p>Identifying patterns allows you do dig deeper into their journey and provide relevant content and communications to begin the nurturing process.<\/p>\n<h4>2. Saved Homes<\/h4>\n<p>Saved homes communicate similar cues as viewed homes, but suggest that the consumer is further along in the <a href=\"http:\/\/www.marketleader.com\/journey\/\">customer journey<\/a>. With this knowledge, you’re equipped to fully engage with them. If someone is actively saving listings, they’re likely moving beyond the research stage of their customer journey to consideration: saving, reviewing, comparing listings against each other or possibly their current home.<\/p>\n<p>If a visitor is saving information on your website, they’re serious about the information they’ve sought out and would likely appreciate any additional information you provide them.<\/p>\n<h6>TIP: Go above and beyond by pulling up all a prospect’s saved homes in the MLS and collect as much information on them as you can. Try and find information that isn’t available to consumers so you have unique value to bring to the table when you contact the lead.<\/h6>\n<h4>3. Unsubscribes<\/h4>\n<p>Don’t panic, and don’t take it personal. This could signal they’re not quite ready for ongoing communications. They might have been conducting initial research and subscribed to get more information, but simply prefer not to be contacted yet.<\/p>\n<p>Their customer journey might still be in infancy or  perhaps they&#8217;re not interested in a particular type of messaging. Be on the lookout for online activity and always circle back to check in. Unsubscribing or opting out of a marketing campaign doesn’t necessarily mean they’re not interested. Set reminders to look at their behavior in 60-90 days to see when they were last active, what they were looking at, and find a way to offer them value.<\/p>\n<p>We&#8217;ve said it before and we&#8217;ll say it again: the real estate sales cycle can take years. Understanding that some leads won&#8217;t be ready to transact for months, even years, can be used to your advantage. Imagine all the opportunities missed by agents who fail to respect the sales cycle and customer journey, and dismiss leads after an unsubscribe.<\/p>\n<p>Demonstrating expertise and proving that you’re a valuable resource at every stage of their journey is what wins business.<\/p>\n<p>&nbsp;<\/p>\n<h4>Looking for more? Enter your email address to get best practices, tips, and educational webinars sent directly to your inbox.<\/h4>\n<p><iframe loading=\"lazy\" style=\"border: 0;\" src=\"https:\/\/success.marketleader.com\/l\/42972\/2016-01-25\/4bthtx\" width=\"220\" height=\"90\" frameborder=\"0\" scrolling=\"no\"><\/iframe><\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>How do you read your clients nonverbal cues when you’ve never met them face-to-face? Read their digital body language. While networking and door knocking are great for getting in front of new people, 88 percent of real estate buyers and sellers have taken their search for information online and 88 percent of consumers across industries [&hellip;]<\/p>\n","protected":false},"author":51,"featured_media":54771,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[34],"tags":[],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/54767"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/51"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=54767"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/54767\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media\/54771"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=54767"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=54767"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=54767"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}