{"id":55073,"date":"2018-02-02T05:00:15","date_gmt":"2018-02-02T13:00:15","guid":{"rendered":"http:\/\/www.marketleader.com\/?p=55073"},"modified":"2018-02-27T14:47:40","modified_gmt":"2018-02-27T22:47:40","slug":"constellation-software-real-estate-group-acquires-real-estate-digital-llc-from-xome-holdings-llc","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/constellation-software-real-estate-group-acquires-real-estate-digital-llc-from-xome-holdings-llc\/","title":{"rendered":"Constellation Software Real Estate Group Acquires Real Estate Digital LLC from Xome Holdings LLC"},"content":{"rendered":"<p class=\"releaseDateline\">BELLEVUE, Wash. February 01, 2018<\/p>\n<p>Constellation Software Real Estate Group (CSRE), a leading provider of scalable SaaS products in the real estate industry, announced today that it has acquired Real Estate Digital from Xome Holdings LLC, excluding its reDataVault product of which Xome will retain ownership.<\/p>\n<p>Real Estate Digital, an integrated technology provider of real estate business management and marketing software, provides solutions for franchises, brokers, agents and Multiple Listing Services. The acquisition further expands CSRE’s market presence in the real estate industry, now providing sales, marketing, and transaction solutions for over half of a million real estate agents, brokerages, and franchises across the U.S. and Canada.<\/p>\n<p>The purchase of Real Estate Digital fits into CSRE’s strategy of investing in proven vertical market software solutions with a focus on strong products and long-term customer relationships.<\/p>\n<p>“Real Estate Digital is a great fit within our portfolio of real estate software and marketing offerings,” states Scott Smith, President of Constellation Software Real Estate Group. “They have a demonstrated commitment to their customers through products and service and have a proven track record in delivering for their clients. As we continue to grow our real estate software portfolio and focus on more long-term customer relationships, we’re excited to welcome Real Estate Digital to the Constellation Software Real Estate Group.”<\/p>\n<p>“Constellation has a proven history of supporting and growing its many software companies, and the Real Estate Digital team looks forward to leveraging that experience to increase service levels to our customers,” said Rich Lull, General Manager of Real Estate Digital. “We see this as an opportunity to refine our focus on our business of helping real estate franchises, brokers, agents, MLSs and the consumers they touch.”<\/p>\n<p>Following the purchase of the Relocation Specialist (ReloSpec) business in November 2017, the purchase of Real Estate Digital marks CSRE’s second acquisition in the past six months. Real Estate Digital brings some of the industry’s largest enterprises to the CSRE family; serving hundreds of brokers, over 200,000 agents, and touches millions of consumers every month.<\/p>\n<p>About:<\/p>\n<p><strong>Constellation Software Real Estate Group<br \/>\n<\/strong>Constellation Software Real Estate Group acquires and invests in real estate software brands that are committed to providing long-term solutions and partnerships with franchises, brokers, agents, MLSs, and associations. Today, CSRE provides a suite of market-leading technology solutions designed specifically for the real estate industry through its brands: Market Leader, Constellation Web Solutions, Sharper Agent, Zurple, Z57, Diverse Solutions, Birdview, ReloSpec, and now Real Estate Digital. Over half of a million real estate agents, teams, and brokerages across North America rely on CSRE’s products and services to power, manage, and grow their businesses. <a href=\"http:\/\/csiregroup.com\/\" target=\"_blank\" rel=\"noopener\">http:\/\/csiregroup.com\/<\/a><\/p>\n<p><strong>Real Estate Digital<br \/>\n<\/strong>Real Estate Digital, based out of Aliso Viejo, CA, is a provider of integrated technology, media, and data solutions for real estate franchisors, brokerages, agents and MLS associations. Real Estate Digital products improve profitability, increase efficiency, and manage risk at every stage of the sales cycle, specializing in transaction and data management, customer relationship management, and website solutions. <a href=\"https:\/\/realestatedigital.com\/\" target=\"_blank\" rel=\"noopener\">https:\/\/realestatedigital.com\/<\/a><\/p>\n<p><em>This story was originally published on <a href=\"http:\/\/bit.ly\/CSREACQ\">prweb.com<\/a> on 2\/1\/2018.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>BELLEVUE, Wash. February 01, 2018 Constellation Software Real Estate Group (CSRE), a leading provider of scalable SaaS products in the real estate industry, announced today that it has acquired Real Estate Digital from Xome Holdings LLC, excluding its reDataVault product of which Xome will retain ownership. Real Estate Digital, an integrated technology provider of real [&hellip;]<\/p>\n","protected":false},"author":51,"featured_media":55081,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[51],"tags":[],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/55073"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/51"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=55073"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/55073\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media\/55081"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=55073"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=55073"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=55073"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}