{"id":55109,"date":"2018-02-06T15:22:18","date_gmt":"2018-02-06T23:22:18","guid":{"rendered":"http:\/\/www.marketleader.com\/?p=55109"},"modified":"2022-10-03T14:26:21","modified_gmt":"2022-10-03T21:26:21","slug":"5-ways-to-build-a-referral-based-business","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/5-ways-to-build-a-referral-based-business\/","title":{"rendered":"5 Ways to Build a Referral-based Business"},"content":{"rendered":"<p>What is a referral-based business? For realtors, a referral-based business is one in which the majority of your leads come from people who know you, and who have recommended you or your brokerage, <em>by name<\/em>, to be their agent.<\/p>\n<p>A new study from the <a href=\"https:\/\/crs.com\/resources\/connect-blog\/connect-blog\/2017\/01\/12\/the-power-of-real-estate-referrals\">Residential Real Estate Council<\/a> bears this out: 40 percent of agents surveyed report that at least half of the referrals they receive from their own network of clients or from other real estate professionals results in a closed sale. Another 20 percent say they’re able to convert between 25 and 50 percent of these referrals to a closed sale.<\/p>\n<p>The survey also found the <a href=\"https:\/\/www.investopedia.com\/terms\/p\/paretoprinciple.asp\">Pareto Principle<\/a> in play: Nearly 80 percent of the referrals are going to 20 percent of the agents. The top 20 percent say they’re receiving six to 10 referrals each year. Another 40 percent of agents surveyed say they receive between one and five referrals per year. (We suspect the very top agents are too busy working on referrals to answer surveys like these).<\/p>\n<p>Of these inbound referrals, about 40 percent come from other real estate professionals (in return for a split averaging about 25 percent of the commission). Another 40 percent comes from current and past satisfied clients and customers, the study finds. The full study is available <a href=\"http:\/\/v2.referralexchange.com\/wp-content\/uploads\/2017\/01\/ReferralExchange-Report_FINAL.pdf\">here.<\/a><\/p>\n<p>Just moving from the middle 40 percent to the top 20 percent would represent a substantial income boost for the average agent.<\/p>\n<h1>What a referral-based business looks like<\/h1>\n<p>You know you’ve got a referral-based business when you are so busy with confirmed referral appointments and working on selling your own listings that you have trouble finding time in the day for prospecting and cold calling.<\/p>\n<ul>\n<li>You constantly have multiple leads from high-quality referrals moving through your <a href=\"\/blog\/the-5-principles-of-sales-pipeline-management\/\">sales pipeline<\/a>.<\/li>\n<li>You have trouble finding time to follow up with prospects from cold marketing.<\/li>\n<li>You’re able to sell referrals to other agents in return for a split because you’re too busy to get to everyone yourself.<\/li>\n<li>You are among the highest-paid agents in your market.<\/li>\n<li>You have a ton of satisfied clients you can call to ask for referrals.<\/li>\n<li>You have a lot of productive COI (center of influence) calls you can make to drum up new business.<\/li>\n<li>You need staff to help you track leads and contact management – and you can afford to hire them.<\/li>\n<\/ul>\n<p>So, how do you build a referral-based business?<\/p>\n<h4><strong>1. Avoid Selfish Marketing. <\/strong><\/h4>\n<p>Too many agents have an egocentric approach to branding. Look at your social media history: If 80 percent of your posts are your own listings, trying to drum up business too directly, or flat-out salesy, chances are your readers are starting to tune you out. This kind of marketing does not establish you as a trusted expert. It establishes you as another salesperson.<\/p>\n<p>The reader has no reason whatsoever to refer you to anyone, because egocentric marketing doesn’t help you establish trust or credibility.<\/p>\n<h4><strong>2. Embrace <em>customer-centric<\/em> marketing, not egocentric marketing. <\/strong><\/h4>\n<p>Instead, look for ways to use content marketing that helps readers answer questions and solve problems related to real estate. Establish yourself as the subject matter expert for real estate needs in your community.<\/p>\n<p>At the same time, you’ll also be creating top-of-mind awareness of yourself and your brand. And you’ll get your share of referrals via your social media presence – provided you also put in the time mailing, writing, and picking up the phone.<\/p>\n<h4><strong>3.  Use social media. But don’t rely on it.<\/strong><\/h4>\n<p>Social media is a gold mine for building a referral-based business. But it’s only the beginning. Don’t expect referrals just from being online. Referrals ultimately come on the strength of your <em>personal<\/em> relationships with people in your network.<\/p>\n<p>Facebook and other social media are useful research tools, but they’re <em>supplementary <\/em>tools. They still require active <a href=\"\/blog\/why-relationship-management-crm-is-crucial-in-real-estate-5-ways-to-maximize-roi\/\">relationship management<\/a>.<\/p>\n<p>Before meeting someone, check out their social media feeds. Take a note of who their closest associates, friends and family are on social media. Is anybody moving into or out of town? Chances are good they’ll need a real estate agent.<\/p>\n<p>Have a <a href=\"\/products\/professional-for-agents\/\">system<\/a>. If you have Market Leader, <em>use it<\/em>. Market Leader is one of the most advanced CRM systems available to agents in the industry.<\/p>\n<p>When in doubt, call. Just check on people. Pick up the phone. It’s still your most powerful weapon.<\/p>\n<h4><strong>4. Trial close the referral question.<\/strong><\/h4>\n<p>You close on the referral question just like you close on the property: Do a trial close. “Based on what we’ve done so far, would you feel comfortable referring me to people like you?”<\/p>\n<p>If the answer is “yes,” then you can go right into it. “Great! Who do you know who might need to buy or sell a home soon?”<\/p>\n<p>Don’t stop there. Start opening mental filing cabinets. Most people who freeze up when asked for a generic referral can come up with a name or two when you prompt them with some specificity.<\/p>\n<p>For example, “Who do you know who needs a good real estate agent might draw a blank. But you can open mental filing cabinets and get much better results with more specific prompts like these.<\/p>\n<ul>\n<li>Who do you know whose kids have recently left home?<\/li>\n<li>Who do you know who flips houses?<\/li>\n<li>Who do you know who’s a successful real estate investor, or wants to be one?<\/li>\n<li>Who do you know who has kids who might need to go to a better school district?<\/li>\n<li>Who do you know who’s probably going to move out of town in the next year or so?<\/li>\n<li>Who do you know who just got married? Divorced?<\/li>\n<li>Who do you know who needs more income?<\/li>\n<li>Who do you know who recently lost a parent or may have inherited some money they need to invest?<\/li>\n<\/ul>\n<p>“These are the people I know I can really help right away!” you can say.<\/p>\n<h4><strong>5. Don’t let a closing go to waste.  <\/strong><\/h4>\n<p>Former White House Chief of Staff and Mayor of Chicago Rahm Emanuel is famous for saying “never let a crisis go to waste.”<\/p>\n<p>By the same token, you should never let a closing go to waste, either. Usually all parties are chuffed that the deal is done, the transaction is complete, people are either getting paid or getting a home, and everyone should be in a good mood. A great source of stress is gone! A celebration is in order! Everyone can relax!<\/p>\n<p>Not you, though. You’ve got to press the advantage and exploit your victory. Stop mentally counting your commissions and focus: <em>Now<\/em> is the time to get referrals from your happy clients! Strike while the iron is hot!<\/p>\n<p>If you’ve trial closed properly along the way, you can be confident that your referral question has every chance of success.<\/p>\n<p>Turn every close into four referrals. Close half of them, as the Residential Real Estate Council says you should be doing, if you’re good – and you’ve tripled your business.<\/p>\n<p>Happy hunting!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>What is a referral-based business? For realtors, a referral-based business is one in which the majority of your leads come from people who know you, and who have recommended you or your brokerage, by name, to be their agent. A new study from the Residential Real Estate Council bears this out: 40 percent of agents surveyed [&hellip;]<\/p>\n","protected":false},"author":33,"featured_media":53665,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[97,34],"tags":[],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/55109"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/33"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=55109"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/55109\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media\/53665"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=55109"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=55109"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=55109"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}