{"id":55151,"date":"2018-02-13T10:39:18","date_gmt":"2018-02-13T18:39:18","guid":{"rendered":"http:\/\/www.marketleader.com\/?p=55151"},"modified":"2022-01-26T15:21:41","modified_gmt":"2022-01-26T23:21:41","slug":"win-the-client-before-theyre-a-lead","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/win-the-client-before-theyre-a-lead\/","title":{"rendered":"How to Win the Client Before They&#8217;re a Lead"},"content":{"rendered":"<blockquote>\n<p style=\"text-align: center;\">“Victorious warriors win first and then go to war, while defeated warriors go to war first and then seek to win.”<\/p>\n<p style=\"text-align: center;\">—Sun Tzu<\/p>\n<\/blockquote>\n<p>Ever watch a long-distance bike race or Olympic marathon on TV? Most of the coverage, understandably, happens within a mile of the finish line. That’s where a lot of the drama happens: in the last five percent of the race.<\/p>\n<p>Every home buyer and seller runs a long course to get to the finish line, too. If you just focus on the last mile of their journey, you’re going to miss out. If you’re not engaged with them well before they get to the stage where they’re looking at houses or ready to list, you’re going to lose business to the agents that are.<\/p>\n<p>They may well have established relationships with other agents. When the time comes, they’re likely to go with the agent who’s been working with them all along. After all, it is that agent who’s earned the sale.<\/p>\n<p>&nbsp;<\/p>\n<h2>The Journey has Changed.<\/h2>\n<p>&nbsp;<\/p>\n<p>Too many agents don’t understand the long journey that many buyers have been on before they even meet the agent.<\/p>\n<p>A generation ago, the majority of people seeking a real estate agent relied on referrals from friends and family. Those were much better and more reliable than Yellow Pages ads, which were also big drivers of business. But that was a long time ago: When was the last time you physically opened a phone book?<\/p>\n<p>In those days, getting a lead well into the <a href=\"\/journey\/\">buyers’ journey<\/a> was still a big leg up. Chances are, no one had had an opportunity to interact with the buyer until they were ready to transact.<\/p>\n<p>Not anymore.<\/p>\n<p>Today’s buyer has a seemingly infinite number of ways to interact with the real estate market, find and research properties, and look up realtors before you will even know they exist. They may have narrowed down their list of properties long before you ever get a chance to buy their names and numbers as a lead.<\/p>\n<p>To be the agent that puts them in the home of their dreams, you will need to begin engaging them well before the last mile of the race. Ideally, you’ll be engaging them before they even know they’re racing.<\/p>\n<p>&nbsp;<\/p>\n<h1>Become the Race Trainer.<\/h1>\n<p>&nbsp;<\/p>\n<p>People don’t just wake up and run a marathon, or race in the Tour de France. They know it’s challenging, and long before they formally enter the race, they start preparing their bodies for what’s to come.<\/p>\n<p>They’ll read up on nutrition, training techniques, shoes and gear. They might hire a trainer, or start following marathon and cycling\/fitness trainers on YouTube. This can happen six months or a year before they ever formally signing up for the race.<\/p>\n<p>Your clients go through a similar <a href=\"\/journey\/\">journey<\/a>. Consider how long someone might save for a down payment on a home or upgrading a home they’re prepping to sell –  all of this happens long before they’ve even thought about meeting with a realtor.<\/p>\n<p>These people are looking for information like the following:<\/p>\n<ul>\n<li>Ways to reduce debt<\/li>\n<li>How to improve credit score<\/li>\n<li>How to save money<\/li>\n<li>Where the best schools are<\/li>\n<li>ROI on upgrades to their current home<\/li>\n<li>Home valuations<\/li>\n<\/ul>\n<p>Smart agents will be positioning themselves to engage these prospects in this early stage. An agent who can be a great financial coach and provide meaningful information to people on, say, how to improve their credit or what upgrades to invest in before listing, will have the decided inside track when it comes to getting their business.<\/p>\n<p>And you’ll know the customer much better, too, for having gone through that process.<\/p>\n<h1><\/h1>\n<h1>Cut Off Competitors.<\/h1>\n<p>&nbsp;<\/p>\n<p>The best time to engage a prospect is before they cross the start line. Get them before they even join the race. By engaging this early in the buyer’s journey, you’re essentially shutting other agents out of the process. If you can engage someone and establish trust before the race begins<em>,<\/em> <em>even if they fill out another agent&#8217;s lead capture form during their research, <\/em>it will be very difficult for a new agent to work their way in.<\/p>\n<p>You don’t want to be that agent. If you bought the lead, but another agent has already established trust and provided value, your chances of converting them to being your client are nearly nil.<\/p>\n<p>Studies show that the typical real estate journey lasts 11 to 27 months. If you can engage &#8211; <em>not sell<\/em> &#8211; prospects this early in the journey, you can be confident that they&#8217;re not already talking to other agents.<\/p>\n<p>&nbsp;<\/p>\n<h1>Best Practices for Early Engagement<\/h1>\n<p>&nbsp;<\/p>\n<ul>\n<li>Have a strategy for capturing prospects in the earliest stages of their journey.<\/li>\n<li>Have an <a href=\"https:\/\/www.diversesolutions.com\/blog\/2017\/08\/24\/get-more-leads-out-of-your-real-estate-website\/\">online lead generating<\/a> presence. Lead capture tools have become incredibly sophisticated and are invaluable in capturing leads at the beginning of their journey – and acting on them quickly – before the competition has a chance to.<\/li>\n<li>Target keywords that aren’t necessarily directly related to real estate. For example, “How to Improve My Credit Score” or “best schools in Charlotte” can get you connected with future clients long before they’re completing lead forms for other agents online.<\/li>\n<li>Get them in your <a href=\"\/products\/professional-for-agents\/\">CRM<\/a> and put them on <a href=\"\/blog\/the-real-estate-guide-to-email-marketing-and-automation\/\">automated marketing campaigns<\/a>.<\/li>\n<li>Maintain top-of-mind awareness through drip marketing campaigns.<\/li>\n<li>Don’t sell before they’re ready to buy. At this stage, you’re looking to establish credibility and trust, while educating the client.<\/li>\n<li>Invite them to educational events, seminars, etc.<\/li>\n<li>Help them understand which <a href=\"http:\/\/www.hgtv.com\/design\/real-estate\/top-home-updates-that-pay-off-pictures\">home improvements have return the best returns<\/a>.<\/li>\n<li>Help them understand the financial requirements of buying a home.<\/li>\n<li>Help them understand how to improve their credit scores.<\/li>\n<li>Invest in the technology to know when they are browsing your site. If they’re looking at your listings <em>on your site<\/em>, you should get an alert. It’s time to contact them again.<\/li>\n<\/ul>\n<p>&nbsp;<\/p>\n<p>By the time they start their race, they’ll already have an agent in mind.<\/p>\n<p>Make sure it’s you.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>“Victorious warriors win first and then go to war, while defeated warriors go to war first and then seek to win.” —Sun Tzu Ever watch a long-distance bike race or Olympic marathon on TV? Most of the coverage, understandably, happens within a mile of the finish line. That’s where a lot of the drama happens: [&hellip;]<\/p>\n","protected":false},"author":33,"featured_media":55153,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[83],"tags":[],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/55151"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/33"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=55151"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/55151\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media\/55153"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=55151"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=55151"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=55151"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}