{"id":55227,"date":"2018-02-21T13:33:41","date_gmt":"2018-02-21T21:33:41","guid":{"rendered":"http:\/\/www.marketleader.com\/?p=55227"},"modified":"2022-01-26T15:22:43","modified_gmt":"2022-01-26T23:22:43","slug":"no-lead-phone-number-no-problem","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/no-lead-phone-number-no-problem\/","title":{"rendered":"No Lead Phone Number, No Problem."},"content":{"rendered":"<h1>Engage Real Estate Leads Without a Phone Number.<\/h1>\n<p>25 years ago, if you didn’t have a lead’s phone number, you were dead in the water. At best, you had someone you could send direct mail to. But in those days, few had e-mail. And most new agents don’t have the budget for massive direct mail pushes.<\/p>\n<p>But the world has been transformed. First, ‘do not call’ regulations reduced the effectiveness of cold calling. With so many numbers off limits without a clear ‘opt-in,’ just having a phone number isn’t the in with a prospect that it was 20 years ago.<\/p>\n<p>A generation ago, call screening was the exception. Now it’s the rule. If a contact doesn’t recognize the phone number, and isn’t expecting the call, chances are you’re going to voicemail.<\/p>\n<p>Which they may never check.<\/p>\n<p>That doesn’t mean it’s not a lead. If it came to you from a lead generation service, they expressed interest in your services in some way. And you can still get to them.  If a lead doesn&#8217;t provide a phone number, it might just signal that they&#8217;re early in their home buying or selling journey.<\/p>\n<p>Be patient.<\/p>\n<p>It might take some work before you get them on the phone, but there are several things you can do.<\/p>\n<h4>1. Google the information they provided.<\/h4>\n<p>If it’s a business owner, <u>you can call them at work.<\/u> They get calls from vendors and salespeople all the time on their business number. They have to pick up because it could be a customer, and Do Not Call regulations <em><em>don’t apply to business phone numbers.<\/em><\/em><\/p>\n<p>Often times, you can find valuable information about a lead with as little as email or first and last name &#8211; phone numbers, social media profiles, birthdays, mailing address. Always be mindful of the information you find during your research, but don&#8217;t let the lack of a phone number discount a lead.<\/p>\n<h4>2. Have <a href=\"\/email-script-generator\/\">scripts<\/a> ready.<\/h4>\n<p>Be prepared to connect on every possible channel, with various types of leads:<\/p>\n<ul>\n<li>Email scripts<\/li>\n<li>Social media scripts<\/li>\n<li>Physical address postcards<\/li>\n<\/ul>\n<p><em>See some sample segments for leads types in section six.<\/em><\/p>\n<h4>3. Find them on social media.<\/h4>\n<p>You can find a wealth of information on Facebook, Pinterest, Instagram or other sites to begin a conversation with them. If you find them on Facebook and connect, you can call them directly through the Facebook app.<\/p>\n<p>Dan and Tempe Perreira, out of Edmond, Oklahoma, have a dedicated <a href=\"\/blog\/get-more-clients-with-this-million-dollar-lead-conversion-plan\/\">lead conversion plan<\/a> using social media to follow up with leads who don’t provide a phone number:<\/p>\n<ul>\n<li>Find your lead on social media using their name or email address<\/li>\n<li>Connect with them on applicable platforms: friend request on Facebook, connect on LinkedIn, follow on Twitter<\/li>\n<li>Never call someone without knowing something about them: look at their profiles and find a piece of information or common ground to break the ice and connect<\/li>\n<\/ul>\n<h4> 4. Add them to your CRM and put them on drip marketing campaigns.<\/h4>\n<p>This brings you to top-of-mind awareness over extended periods of time. If they aren’t ready, but they know someone actively looking to buy or sell a house, guess who’ll they will think of first in conversation?Or, perhaps they’re not ready to transact, but six, nine, even twelve months down the road find themselves ready to connect – drip campaigns are what keep you top-of-mind and relevant as they move through their <a href=\"\/journey\/\">journey<\/a>.<\/p>\n<h4>5. Do you know their search criteria?<\/h4>\n<p>If they visited your site, you should. You should also know what page they came in from, and what page they left to. Modern web tools should be able to give you all this information. This allows you to connect and send them information and listings that match their search criteria and inquiries.<em><br \/>\n<\/em><\/p>\n<h4>6. Have different kinds of content ready to go.<\/h4>\n<p>People who aren’t ready for a ‘hard sell’ may be ready for other kinds of information.<\/p>\n<ul>\n<li>Tips for relocating to the area<\/li>\n<li>Best schools in town<\/li>\n<li>How to improve your credit score<\/li>\n<li>Top 5 home-buying mistakes<\/li>\n<\/ul>\n<p>It’s a good idea to segment your messaging. For example, if you believe a lead is  (entry page, exit page, other information the lead provides) that the lead is interested in listing their house for sale, that calls for different messaging:<\/p>\n<ul>\n<li>Best time of year to sell your home<\/li>\n<li>How to prepare your home for sale<\/li>\n<li>Home staging tips<\/li>\n<li>How to get the best price for your home<\/li>\n<li>Why you need an agent to sell your property<\/li>\n<li>What to look for in a real estate agent<\/li>\n<li>How to sell your house fast<\/li>\n<\/ul>\n<p>You may be able to come up with other messaging based on contextual clues. For instance, if you find them on Facebook and see that he or she is a veteran, you have an in and can include information on VA mortgage benefits. Or you may be able to tell this is a luxury home shopper or a budget home shopper from various contextual clues. Conduct a little detective work, and create categories that work within your market.<\/p>\n<blockquote><p>Example: You get a lead with an email that reads ArmyVet11B@domain.com.<\/p>\n<p>Immediately, you know they&#8217;re an Army veteran. And you know what they did for the Army: The “11B” is an MOS designation that means he was an infantryman. Even if you know nothing else about them, you can send an email saying:<\/p>\n<p style=\"padding-left: 30px;\"><em>Hi! I noticed you’re an Army vet, and, I presume an infantry veteran. Thank you for your service! I assume you’re thinking of buying or selling a home in the future. I’m attaching the latest information on your VA mortgage benefits, and how best to use them. If you qualify, you may be able to buy for nothing down. <\/em><\/p>\n<p style=\"padding-left: 30px;\"><em>I’m also attaching a guide to improving your credit score so you’ll have no problem qualifying for the mortgage when the time comes.<\/em><\/p>\n<p style=\"padding-left: 30px;\"><em>When you’re ready to go, let’s get in touch. Meanwhile, I’ll be sending you the latest news in VA mortgages and homebuying in this market. <\/em><\/p>\n<p style=\"padding-left: 30px;\"><em>If you like, drop me a note with your budget and anything else you might be looking for, and I’ll do some digging for you. <\/em><\/p>\n<p style=\"padding-left: 30px;\"><em>Thanks for your service! I look forward to serving you. <\/em><\/p>\n<p style=\"padding-left: 30px;\"><em>Sincerely, <\/em><\/p>\n<p style=\"padding-left: 30px;\"><em>Agent<\/em><\/p>\n<p>&nbsp;<\/p>\n<p>Note that the entire highlighted section is a template. It can be used for ANY veteran, of any service. Only the first sentence is personalized.<\/p><\/blockquote>\n<p>To efficiently handle leads without a phone number, have email templates ready to go for different types of leads:<\/p>\n<ul>\n<li>Luxury buyers<\/li>\n<li>Sellers<\/li>\n<li>Young families\/Millennials<\/li>\n<li>Retirees\/empty nesters<\/li>\n<\/ul>\n<p>And any other target demographic you’d like to be in front of.<\/p>\n<p>Then have a drip marketing plan for each category you target.<\/p>\n<p>Don’t have too many categories, you’ll go crazy trying to keep them all straight! Three to five is a good start. The most important thing is the follow-through. Agents relying on phone numbers may never get a chance with this crowd.<\/p>\n<p><strong>Should you require a phone number? <\/strong><\/p>\n<p>Sure, leads with phone numbers are stronger. They trust you enough to give you a number. <em>Somebody’s <\/em>number, anyway.<\/p>\n<p>But we also know that when a lead capture tool requires a phone number, people are less likely to fill it out in the first place. You could be losing a valuable lead simply for asking for too much information.<\/p>\n<p>That’s a lot of fish swimming right through your net. One study found that <a href=\"https:\/\/unbounce.com\/conversion-rate-optimization\/how-to-optimize-contact-forms\/\">37 percent of site visitors abandoned a lead capture site when it required a phone number for completion.<\/a> Many others included a fake phone number. When they made the phone number field optional, the visit-to-capture ratio doubled, from 42.6 percent to 80 percent.<\/p>\n<p><strong>A 2010 study also found that requiring a phone number on a lead capture page reduced conversions by nearly a third. <\/strong><\/p>\n<p>The bottom line: Don’t be put off by leads that don’t have phone numbers. They are extremely valuable and if you disregard them, someone else will happily engage and take their business.<\/p>\n<p>Have a plan to engage via email and social media, and <u>work your plan.<\/u><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Engage Real Estate Leads Without a Phone Number. 25 years ago, if you didn’t have a lead’s phone number, you were dead in the water. At best, you had someone you could send direct mail to. But in those days, few had e-mail. And most new agents don’t have the budget for massive direct mail [&hellip;]<\/p>\n","protected":false},"author":33,"featured_media":55233,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[34],"tags":[],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/55227"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/33"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=55227"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/55227\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media\/55233"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=55227"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=55227"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=55227"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}