{"id":55267,"date":"2018-03-01T15:21:58","date_gmt":"2018-03-01T23:21:58","guid":{"rendered":"http:\/\/www.marketleader.com\/?p=55267"},"modified":"2022-01-26T15:18:53","modified_gmt":"2022-01-26T23:18:53","slug":"mortgage-rates-are-climbing-call-your-prospects-now-heres-how","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/mortgage-rates-are-climbing-call-your-prospects-now-heres-how\/","title":{"rendered":"Mortgage Rates Are Climbing – Call Your Prospects Now. Here’s How."},"content":{"rendered":"<p>Now’s a great time to call your prospects and tell them to lock in a good mortgage rate.<\/p>\n<p>It&#8217;s been a nice run of rock bottom interest rates, but mortgage rates are on the rise once again. Rates have gone up substantially just since the first of the year, buoyed by a strong economy and the return of inflationary pressures.<\/p>\n<p>As of March 1<sup>st<\/sup>, mortgage rates have risen for eight consecutive weeks, rising to an average of 4.57 percent, for a fixed 30-year conventional mortgage.<\/p>\n<p>We’re already seeing higher mortgage rates impact home sales, though prices continued to rise, 2.5 percent in January – the last full month for which data is currently available. But pending home sales slipped to a three-year low that month.  According to National Association of Realtors data, the number of new listings nationwide also fell a whopping 9.5 percent compared to January of last year.<\/p>\n<p>The good news for agents is this:<\/p>\n<p><a href=\"https:\/\/www.marketwatch.com\/story\/us-jobless-claims-plunge-to-49-year-low-of-210000-2018-03-01\">The unemployment rate is the best it’s been in nearly five decades.<\/a><\/p>\n<p>So if you can coach clients to keep credit utilization down, and pay their bills on time, they should be able to get a mortgage.<\/p>\n<p>Either way, now’s a great time to reach out to your prospects and fence sitters, and spread the word:<\/p>\n<p>Interest rates are going up and listings are going down faster than pending sales.<\/p>\n<h3>U.S. 30-Year Fixed Mortgage Rates, 1 January to 28 February, 2018<\/h3>\n<div id=\"attachment_55269\" style=\"width: 1942px\" class=\"wp-caption alignnone\"><img aria-describedby=\"caption-attachment-55269\" loading=\"lazy\" class=\"wp-image-55269 size-full\" src=\"\/wp-content\/uploads\/2018\/03\/20180301-MORTGAGE.png\" alt=\"2018 FRED 30-year fixed mortgage rate average in the united states\" width=\"1932\" height=\"928\" \/><p id=\"caption-attachment-55269\" class=\"wp-caption-text\"><em>Source: Freddie Mac <\/em><\/p><\/div>\n<p>Historically, increasing rates have typically led to falling home sales: About 35 thousand fewer sales nationwide for every 10 basis points, according to the National Association of Realtors.<\/p>\n<p>Why are rates moving higher? In the mortgage world, it’s because of continued growth forecasts. Markets are still predicting continued economic growth. Which is great for jobs, and great for future homeowners. It also means that there’s a danger of rising inflation, as well.<\/p>\n<p>Lenders have to compensate themselves for that risk: They can’t lend at 3 percent if inflation is at 4 percent. That equates to a 1 percent loss of wealth, every year. They have to increase interest rates to account for it.<\/p>\n<p>Call, email, text or write your prospects who’ve been on the fence for a while.<\/p>\n<p>Here’s the message:<\/p>\n<ul>\n<li>Interest rates are going up, and fast.<\/li>\n<li>People are already starting to put fewer houses on the market.<\/li>\n<li>The job situation looks good. Future employment prospects are excellent<\/li>\n<li>As long as the economy improves, home prices will keep going up.<\/li>\n<li>The cost of real estate and the cost of money are both increasing fast.<\/li>\n<li>The time to lock in a rate and buy that dream home is<\/li>\n<\/ul>\n<p>Yes, mortgage rates were at rock bottom just a short time ago – But they’re going up and they’re going to continue to rise, with <a href=\"http:\/\/www.chicagotribune.com\/business\/ct-biz-mortgage-rates-20180301-story.html\">no end in sight<\/a>.<\/p>\n<p>Send an email or newsletter with the graph showing increasing interest rates. And then follow up on the phone. Ask outright – “did you get the piece I sent?”<\/p>\n<p>Whatever they answer, you’re set up for the conversation – why they need to lock in a good mortgage rate <em>now. <\/em><\/p>\n<h1>The Conversation<\/h1>\n<p>Locking in makes sense for three reasons:<\/p>\n<ul>\n<li><strong>It reduces your cost of ownership<\/strong>: Every dollar you <em>don’t<\/em> have to pay in interest is a dollar you can turn into home equity or savings. The sooner you lock in, the more home equity or the more savings you can build, faster.There’s no reason to pay 4.9 percent when you can get the same mortgage at 4.43 percent and save tens of thousands of dollars.<\/li>\n<\/ul>\n<ul>\n<li><strong>It reduces uncertainty. <\/strong>Mortgage rates haven’t just been increasing – they’ve been getting more volatile. It’s nerve wracking for everybody once your offer’s been accepted and you’re lining up financing, but you have no idea what the final mortgage payment is going to be.<strong> <\/strong><\/li>\n<\/ul>\n<ul>\n<li><strong>You can buy a better house.<\/strong> The lower your mortgage rate, the more home you can qualify for. This expands your set of options: You can raise your family in a better school district. You can have a back yard. Each kid can have their own bedroom. That extra buying power that you can qualify for at a lower rate isn’t just money – it comes with real world lifestyle, education and safety advantages.<\/li>\n<\/ul>\n<p><strong> <\/strong><\/p>\n<p>Your follow-up at this point depends on the prospect’s response. Are they ready to go? Then get them in touch with a lender and start the process. Follow up and make sure the appointment is made.<\/p>\n<p>Are they hesitating? Find out why. They might be worried about their credit or the <a href=\"\/blog\/mortgage-loan-approval\/\">mortgage approval process<\/a>. In that case, you can add a lot of value, and you have a good chance of being their agent in an eventual home purchase – just not right now. How? Coach them on how to <a href=\"\/blog\/9-ways-to-help-clients-improve-credit-scores\/\">improve their credit score<\/a> so they can get that mortgage.<\/p>\n<p>Whatever they tell you, you’re still a winner. By reaching out, you’re ensuring top-of-mind awareness. You’re showing the prospect that you remember them, and you’re looking out for their best interest.<\/p>\n<p>Any productive conversation works for you, and gets you that much closer to your next sale.<\/p>\n<p>Don’t be call shy. Pick up the phone and guide people through the process and into their dream home.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Now’s a great time to call your prospects and tell them to lock in a good mortgage rate. It&#8217;s been a nice run of rock bottom interest rates, but mortgage rates are on the rise once again. Rates have gone up substantially just since the first of the year, buoyed by a strong economy and [&hellip;]<\/p>\n","protected":false},"author":33,"featured_media":55275,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[803],"tags":[],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/55267"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/33"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=55267"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/55267\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media\/55275"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=55267"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=55267"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=55267"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}