{"id":55415,"date":"2018-04-12T08:46:58","date_gmt":"2018-04-12T15:46:58","guid":{"rendered":"http:\/\/www.marketleader.com\/?p=55415"},"modified":"2022-01-26T15:14:28","modified_gmt":"2022-01-26T23:14:28","slug":"the-biggest-mistakes-agents-make-with-leads","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/the-biggest-mistakes-agents-make-with-leads\/","title":{"rendered":"The Biggest Mistakes Agents Make with Leads"},"content":{"rendered":"<p>According to Inman, the number one <a href=\"https:\/\/www.inman.com\/next\/no-1-mistake-real-estate-agents-make-in-lead-generation-thinking-a-lead-is-a-dead-end-if-it-isnt-ready-right-now\/\">mistake<\/a> Realtors® make is throwing away great leads because they aren&#8217;t ready to transact. Ironically, 95 percent of the real estate journey takes place <em>before<\/em> a lead is ready to make contact, let alone transact.<\/p>\n<p>There&#8217;s no such thing as a dead lead.<\/p>\n<p>From <strong>day one<\/strong>, building out a pipeline that maps your client’s journey should be <strong>priority one<\/strong>. Lead generation is about feeding the beast – and the beast is your pipeline. <a href=\"\/blog\/the-5-principles-of-sales-pipeline-management\/\">Pipeline management<\/a> is about putting a long-term strategy in place to work leads through their journey <em>and <\/em>your pipeline.<\/p>\n<p>Six, 12, 18 months down the road you’ll be closing transactions consistently and with far less effort than the agent who dismisses leads in the early stages of their journey.<\/p>\n<p>Everyone you know should fall into one of four stages of the real estate sales pipeline, as mapped out below. There’s no such thing as a cold lead, only someone who isn&#8217;t ready to transact.<\/p>\n<h2><strong>Mapping the Real Estate Pipeline &amp; Stages<\/strong><\/h2>\n<div id=\"attachment_55461\" style=\"width: 1210px\" class=\"wp-caption aligncenter\"><a href=\"http:\/\/www.marketleader.com\/wp-content\/uploads\/2018\/04\/funnel1200.jpg\"><img aria-describedby=\"caption-attachment-55461\" loading=\"lazy\" class=\"size-full wp-image-55461\" src=\"https:\/\/www.marketleader.com\/wp-content\/uploads\/2018\/04\/funnel1200.jpg\" alt=\"real estate pipeline infographic\" width=\"1200\" height=\"900\" \/><\/a><p id=\"caption-attachment-55461\" class=\"wp-caption-text\">Click to enlarge.<\/p><\/div>\n<h3><\/h3>\n<h3><strong>1. Leads<\/strong><\/h3>\n<h4>Stage: Top of Funnel – Awareness<\/h4>\n<p><img loading=\"lazy\" class=\" wp-image-55463 alignright\" src=\"https:\/\/www.marketleader.com\/wp-content\/uploads\/2018\/04\/Matt-Heinz.png\" alt=\"quote from Matt Heinz about respecting your customers\" width=\"302\" height=\"222\" \/>Perhaps the most undervalued stage of the real estate pipeline, the awareness stage is where 75 percent of leads are captured, requires the least amount of investment, and offers the most potential for reward &#8211; if you&#8217;re patient and persistent. This sits at the top of the funnel and most people in this stage of their real estate journey are only starting to think about moving or purchasing a home.<\/p>\n<p>Those in the awareness stage of the real estate sales cycle are seeking information and typically prefer to remain anonymous. This doesn’t mean you can’t contact them, but the way you contact them and your expectations need to be in line with where they’re at in their real estate <a href=\"\/journey\">journey<\/a>.<\/p>\n<p>Most marketing dollars are spent in this stage, attracting people to your brand, expertise, and services. When you run a Facebook ad offering a free home valuation, you’re attracting people who are seeking information into your funnel so you can help inform their decision-making process.<\/p>\n<p>They’re starting to think about selling and aren’t working with any other agents – not because they haven’t found one – but because they’re not ready to work with an agent yet. This is critical to understand.<\/p>\n<p>Advertising brings the lead in, marketing is how you nurture them. This stage of the sales cycle is not about converting leads or closing; it’s your opportunity to offer value, educate, and guide them deeper into their real estate journey so when they are ready to take the next step, it’s with you.<\/p>\n<blockquote><p><strong>Bottom line: Be known, but let them browse.<\/strong><\/p><\/blockquote>\n<h3><strong>2. Prospects<\/strong><\/h3>\n<h4>Stage: Middle of Funnel – Consideration<\/h4>\n<p><img loading=\"lazy\" class=\"alignright wp-image-55475\" src=\"https:\/\/www.marketleader.com\/wp-content\/uploads\/2018\/04\/Trust.png\" alt=\"quote about trust and successful business\" width=\"275\" height=\"209\" \/>A lead becomes a prospect when they’ve expressed interest or intent, and are now showing interest in your expertise and services. This is the time to show them what it would be like to work with you and all you have to offer.<\/p>\n<p>A prospect is exploring their options; they’re considering who they’d like to work with and may or may not be ready to choose an agent, but they’re still interested in your expertise. This is your chance to earn the trust of your leads.<\/p>\n<blockquote><p><strong>Bottom line: <\/strong> <strong>Engage them and aid them in their quest for information. <\/strong><\/p><\/blockquote>\n<h3><strong>3. Clients<\/strong><\/h3>\n<h4>Stage: Bottom of Funnel – Decision<\/h4>\n<p>You’ve gotten the prospect to sign an agreement and you’re actively working with a them to buy or sell a home through this stage.<\/p>\n<p>You’re meeting in person, offering recommendations based on their preferences and needs, and providing support with contracts and negotiations. In this stage, you further demonstrate your expertise, while offering support and guidance through the transaction process.<\/p>\n<p>When a prospect becomes a client, it’s important that you do all you can to affirm they’ve made the right decision to have chosen you as their agent.<\/p>\n<blockquote><p><strong>Bottom line: Give clients a reason to work with you again. <\/strong><\/p><\/blockquote>\n<h3><strong>4. Post-sale<\/strong><\/h3>\n<h4>Stage: Through Funnel – Source of referrals and repeat business<\/h4>\n<p>You may have closed the transaction, but it’s necessary to stay top-of-mind as past clients are your best source of referrals and repeat business<\/p>\n<p>According to the National Association of REALTORS, 64 percent of real estate business is generated from referrals and past buyer clients, and 69 percent from past seller clients. To maximize this huge opportunity that already exists within your network, it’s important to put effort into maintaining relationships post-sale.<\/p>\n<p>Stay top-of-mind with these marketing ideas for <a href=\"\/blog\/real-estate-marketing-ideas-for-referrals-repeat-business\/\">referrals and repeat business<\/a>.<\/p>\n<p>Putting forth the effort to show your clients you care after the transaction has closed will work wonders for your pipeline. Real estate is a long-term game that requires some long-term strategy.<\/p>\n<blockquote><p><strong>Bottom line: Do not lose contact.<\/strong><\/p><\/blockquote>\n<p>Remember – your pipeline is fluid; people will move in, out, and through each stage and your top priority should be to impact and guide their journey any way you can.<\/p>\n<p>&nbsp;<\/p>\n<h4>Looking for more? Enter your email address to get best practices, tips, and educational webinars sent directly to your inbox.<\/h4>\n<p><iframe loading=\"lazy\" style=\"border: 0;\" src=\"https:\/\/success.marketleader.com\/l\/42972\/2016-01-25\/4bthtx\" width=\"220\" height=\"90\" frameborder=\"0\" scrolling=\"no\"><\/iframe><\/p>\n","protected":false},"excerpt":{"rendered":"<p>According to Inman, the number one mistake Realtors® make is throwing away great leads because they aren&#8217;t ready to transact. Ironically, 95 percent of the real estate journey takes place before a lead is ready to make contact, let alone transact. There&#8217;s no such thing as a dead lead. From day one, building out a [&hellip;]<\/p>\n","protected":false},"author":51,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[34,83],"tags":[],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/55415"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/51"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=55415"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/55415\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=55415"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=55415"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=55415"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}