{"id":55971,"date":"2018-08-12T07:46:23","date_gmt":"2018-08-12T14:46:23","guid":{"rendered":"http:\/\/www.marketleader.com\/?p=55971"},"modified":"2022-01-26T13:02:45","modified_gmt":"2022-01-26T21:02:45","slug":"3-ways-for-real-estate-agents-to-win-the-hearts-of-their-community","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/3-ways-for-real-estate-agents-to-win-the-hearts-of-their-community\/","title":{"rendered":"3 Ways for Real Estate Agents to Win the Hearts of Their Community"},"content":{"rendered":"<h1>Real estate agents: Win the hearts of your community &#8211; <em>and<\/em> clients.<\/h1>\n<p>It’s not easy to <a href=\"\/blog\/realestatebusiness\/\">stand out among the crowd of other agents<\/a>, which is why so many agents choose to go the overtly-self-promotional route. This, by the way, does nothing to endear anyone to them.<\/p>\n<blockquote><p>“You can make more friends in two months by becoming interested in other people than you can in two years by trying to get other people interested in you,” according to Dale Carnegie.<\/p><\/blockquote>\n<p>Showing an interest in others and in your community is good for them <em>and<\/em> good for your business.<\/p>\n<p>Let’s take a look at several ways you can show that interest and reap big rewards &#8212; emotionally, spiritually and economically.<\/p>\n<h2>Pay it forward<\/h2>\n<p>Even when money was tight during the recession, more than half of respondents to a poll claimed that they would choose a service from a socially responsible company over one that isn’t, regardless of price.<\/p>\n<p>Today, surveys show that 90 percent of consumers say they are “likely to switch to brands that support a good cause,” according to frontstream.com.<\/p>\n<p>Yes, you’re busy, but associating your brand with a cause that is near and dear to your heart (or your clients’)  not only helps the community but gives a boost to your brand’s recognition.<\/p>\n<p>One of the easiest ways to get the most bang for your buck is to dedicate a percentage of each commission check to a worthy and needy cause. We found two companies that go all out helping agents not only give to a cause they are passionate about but assists them with tying their philanthropy to their brand.<\/p>\n<h3>Give Back Homes<\/h3>\n<p><strong>Give Back Homes<\/strong> provides agents a profile page to customize and share with their spheres of influence, on social media and in marketing materials. They also help agents organize community events and they provide other tools to help them stand out as socially responsible real estate pros, dedicated to the areas they serve.<\/p>\n<p>Check them out at <a href=\"https:\/\/givebackhomes.com\/how-we-work\">givebackhomes.com.<\/a><\/p>\n<h3>Agent with Heart<strong>&#x2122;<\/strong><\/h3>\n<p><strong>The Agent with Heart&#x2122;<\/strong> program is similar in scope. Agents pledge to donate to their client’s choice of nonprofit at the close of escrow. PinRaise, the company who created Agent with Heart, then manages the process and provides custom marketing materials (including a very cool video you can post on your site and social media) for the agent to use.<\/p>\n<p>Learn more about the Agent with Heart program at <a href=\"https:\/\/pinraise.com\/\">pinraise.com<\/a>.<\/p>\n<p>Then, there are individual brokerages that hire agents who agree that giving back is important. Austin’s Give Realty is a brilliant example of how to combine paying it forward and marketing your business.<\/p>\n<p>Take a look at just <a href=\"http:\/\/www.giverealty.com\/about\/how-we-did-it\/\">one page on their website<\/a>, promoting their program (it’s highlighted on many pages across the site).<\/p>\n<h2>Give of your time<\/h2>\n<p>Out of all of the ways to win the hearts of the community, we think volunteering your time is one of the best. Not only are you helping your community, but your hands-on approach will give you exposure and access to other, like-minded community members (aka potential clients and friends).<\/p>\n<p>It’s so much easier for them to get to know, like and trust you when they work with you, rather than through your website.<\/p>\n<blockquote><p>“If you’re not volunteering in your community you’re doing your neighborhood a disservice,” according to Brentwood, CA agent Cathy Daniel. “If I won mega millions tomorrow, I’d be a professional volunteer.”<\/p><\/blockquote>\n<p>If you have a passion, then you have a good idea of where to give your time. If you don’t know where to start, we offer advice on <a href=\"\/blog\/how-community-involvement-can-help-your-real-estate-business\/\">community involvement for real estate agents<\/a> in a previous article.<\/p>\n<h2>It’s all about the kids<\/h2>\n<p>Members of Generation X have one overriding priority in their lives: their kids. Just about everything they do is filtered through the parenthood lens.<\/p>\n<p>And, since this is the generation most likely to sell one home to buy another in the near future, involving yourself in their community is the ideal way to get to know them.<\/p>\n<p>It just so happens that this cohort volunteers more than any other, so you should find yourself surrounded by your ideal real estate client. In fact, according to the Corporation for National &amp; Community Service, in 2015, nearly 20 million members of Generation X provided slightly more than 2 billion hours of service.<\/p>\n<h4>Ideas for volunteer opportunities where you can rub shoulders with this cohort include:<\/h4>\n<ul>\n<li>Sponsoring a youth sports team – Leagues typically offer sponsorship packages that may include website mentions of your business, the opportunity to have your brand on the field’s signage or the team’s uniforms. You can also offer team members branded water bottles. Show up for the games and bring the halftime snack.<\/li>\n<li>Sponsor a school garden – School gardening programs are typically and woefully underfunded. Offer to sponsor the one at your local school or to help raise donations for one.<\/li>\n<li>Start a back-to-school supply drive for teachers and low-income students – Visalia, CA agent Heather Cox held one of these in her market area. “I sent out a branded postcard asking for specific supplies that were needed in Tulare County schools,” she told Gina Thelemann at smartzip.com. The drive ended up being quite successful and she went on to organize another for pet supplies to benefit the local SPCA.<\/li>\n<\/ul>\n<p>Find a need that fits your passion and make the time to fill that need. Then, don’t be afraid to share your volunteer successes with your blog and social media audiences.<\/p>\n<p><strong> <\/strong><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Real estate agents: Win the hearts of your community &#8211; and clients. It’s not easy to stand out among the crowd of other agents, which is why so many agents choose to go the overtly-self-promotional route. This, by the way, does nothing to endear anyone to them. “You can make more friends in two months by [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":56061,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[789,83],"tags":[],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/55971"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=55971"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/55971\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media\/56061"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=55971"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=55971"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=55971"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}