{"id":56271,"date":"2018-09-10T09:58:40","date_gmt":"2018-09-10T16:58:40","guid":{"rendered":"http:\/\/www.marketleader.com\/?p=56271"},"modified":"2022-01-26T13:02:09","modified_gmt":"2022-01-26T21:02:09","slug":"lead-generation-is-not-trophy-hunting","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/lead-generation-is-not-trophy-hunting\/","title":{"rendered":"Lead Generation Is Not Trophy Hunting"},"content":{"rendered":"<h1>Trophy hunting is not an effective real estate lead-generation strategy<\/h1>\n<p>I have a friend who owns a retail store. She spends a ton of money on advertising to get people in the door of her shop.<\/p>\n<p>What if I told you that every time someone walked through that door, she evaluated their likelihood of buying the more expensive items in the store and modified her customer service tactics accordingly?<\/p>\n<p>Someone she felt would spend more than $200 got the royal treatment, and those who appeared to be window shopping? She retreated to the back room, talked on the phone or otherwise busied herself.<\/p>\n<p>It’s not true, of course. In fact, this woman could and should give lessons on how to provide impeccable customer service.<\/p>\n<p>Sadly, however, the story illustrates standard practice for many real estate agents. The mentality seems to be that the only good lead is a ready-to-transact lead. Like an ambush predator, the agent lies in wait for the lead to come to them.<\/p>\n<p>In reality, every real estate lead is a potential client.<\/p>\n<p>“Every lead deserves love,” according to Tom Ferry, and we agree. Even the seemingly reluctant leads deserve nurturing to gently nudge them through the sales funnel.<\/p>\n<h2>Lead Nurturing = Lead Conversion<\/h2>\n<p>On his website, Ferry mentions a study of “several hundred thousand seller leads” analyzed by CoreLogic. The results? Every 100 leads results in three closes.<\/p>\n<p>Which, without information on how each agent handles leads, means nothing. But, since we know that real estate lead conversion is challenging for most agents, we can use this statistic as a baseline.<\/p>\n<p>So, the question is why do so many agents work so hard to generate hundreds of leads when they will only convert a handful of them?<\/p>\n<p>Do the rest truly “suck?” Or is it the lead converter who does? We think it’s the latter, because, according to Michael Boyette at Marketo, <a href=\"https:\/\/blog.marketo.com\/2013\/01\/why-salespeople-dont-follow-up-on-good-leads.html\">55 to 60 percent<\/a> of B2C leads that ask about a service will eventually close.<\/p>\n<p>Whether they close with you depends on where they are in the buying or selling cycle and if you remain top-of-mind. “Some are ready to make a final decision. Others are just beginning to explore their options,” according to Boyette.<\/p>\n<p>“In other words, out of those 45 opportunities, only about four will be ripe. The rest are too green to pick.” He goes on to caution that, to some, “a green lead can look like a bad lead.” Assuming these leads aren’t serious, however, is a mistake.<\/p>\n<h2>Enter: Real Estate Lead Nurturing<\/h2>\n<p>“The fortune is in the follow-up” isn’t just some old-school motivational hype. It’s a fundamental tenet of successful sales. Your job doesn’t end with simply generating leads. To convert them to a commission check requires following up, consistently.<\/p>\n<h3>You’ll need a <a href=\"\/blog\/the-5-principles-of-sales-pipeline-management\/\">lead-management<\/a> strategy, composed of three parts:<\/h3>\n<ul>\n<li>Classifying new leads<\/li>\n<li>Nurturing the leads<\/li>\n<li>A <a href=\"\/products\/professional-for-agents\/?utm_source=Inman&amp;utm_medium=Product%20Hub\">robust CRM<\/a> to handle the first two<\/li>\n<\/ul>\n<p>Label each lead according to how soon they will be ready to transact. We like coach and consultant Bob Corcoran’s no-brainer classification method. For instance, “A” leads will pull the trigger the soonest, “B” leads are warm but not yet simmering and “C” leads are the coldest.<\/p>\n<p>Although they all need your attention, you’ll want to get to work on those “A” leads as soon as possible. Then, put those “B” and “C” leads into a drip system that provides them with relevant content, consistently.<\/p>\n<p>What constitutes as relevant content? Anything that fits their position in the <a href=\"\/journey\">real estate sales funnel<\/a>.<\/p>\n<h3>Relevant content includes:<\/h3>\n<ul>\n<li>Market updates<\/li>\n<li>Home-sale success stories<\/li>\n<li>Preparing a home for the market<\/li>\n<li>Staging for home sellers<\/li>\n<li>New listing alerts<\/li>\n<li>Mortgage news<\/li>\n<li>CMAs and neighborhood information for buyers<\/li>\n<\/ul>\n<h2>Soup it up<\/h2>\n<p>Use the information from your CRM to hyper-nurture, when appropriate. In other words, when you learn that a lead has clicked on an email link, he or she needs additional attention.<\/p>\n<p>Visits to your website from leads should trigger an acceleration in your reach-outs as well. Any change in a lead’s behavior requires your immediate attention and a finer focus on their interests.<\/p>\n<p>Watch any TV special about sharks and you learn that they bump first, then bite and then split. They’re called “hit-and-run attacks,” according to the National Oceanic and Atmospheric Administration (NOAA).<\/p>\n<p>“They mistake thrashing arms or dangling feet as prey, dart in, bite, and let go when they realize it&#8217;s not a fish.”<\/p>\n<p>Too many real estate agents see the real estate consumer as prey, darting in to grab the lead and then letting go when they learn there will be no immediate gratification.<\/p>\n<p>Your marketing efforts don’t end once you &#8220;bump&#8221; into a new lead. Sharks are ambush predators; they sit and wait for their prey to come to them. Pursuit predators, on the other hand, scout out potential prey, determine the prey’s quality and quantity and then start the pursuit.<\/p>\n<p>Sure, being shark-like may appear easier, but every time you reject a lead as not tasty enough, you’ll need to repeat the work it took to get that lead.<\/p>\n<p>Ditch the trophy hunting and nurture every lead until they transact or die.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Trophy hunting is not an effective real estate lead-generation strategy I have a friend who owns a retail store. She spends a ton of money on advertising to get people in the door of her shop. What if I told you that every time someone walked through that door, she evaluated their likelihood of buying [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":56295,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[97,34],"tags":[],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/56271"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=56271"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/56271\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media\/56295"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=56271"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=56271"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=56271"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}