{"id":57041,"date":"2018-12-18T09:37:35","date_gmt":"2018-12-18T17:37:35","guid":{"rendered":"http:\/\/www.marketleader.com\/?p=57041"},"modified":"2018-12-18T09:38:35","modified_gmt":"2018-12-18T17:38:35","slug":"time-tested-ways-to-enhance-curb-appeal","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/time-tested-ways-to-enhance-curb-appeal\/","title":{"rendered":"Time Tested Ways to Enhance Curb Appeal"},"content":{"rendered":"<h1>Enhance Curb Appeal to Reel Buyers in<\/h1>\n<p>When you pull up to the curb in front of a listing only to have your buyers ask you to drive on, you’ll understand, instantly, the power of curb appeal (or lack thereof).<\/p>\n<p>Attractiveness sells, whether it’s a car, a pair of shoes or a house. In fact, studies shows that, although homebuyers are not necessarily drawn to more attractive real estate agents, “the more attractive the agent, the more the buyer is willing to pay.”*<\/p>\n<p>It only makes sense then that the more attractive a house is, the more the buyer is willing pay.<\/p>\n<p>Yet even a cursory stroll through the MLS shows evidence of clueless homeowners who lack the common sense (or the funds) to present their homes attractively.<\/p>\n<p><strong>In all fairness, though, is it the homeowner who lacks the common sense or the listing agent?<\/strong><\/p>\n<p>Gone are the days when your duties with listing clients consisted of sticking the sign in the yard, hooking the lockbox to the doorknob and entering the home’s vitals in the MLS.<\/p>\n<p>No, the home’s curb appeal isn’t your job. But, counselling your client about its importance and offering valuable tips most certainly is.<\/p>\n<h2>It’s time to have “the talk”<\/h2>\n<p>It’s not easy to let someone know that their home stinks or that, perhaps, they aren’t the best housekeeper on the planet. Potential buyers will most certainly let them know by either not touring the home or with their lack of offers.<\/p>\n<p>Since both of you want the most money for the home that the market will bear, it falls on you to have that uncomfortable talk with your listing clients<\/p>\n<p>Before speaking with them, go through the MLS and save examples of sold homes lacking curb appeal and a similar home whose owner’s took the time to spiff up the exteriors.<\/p>\n<p>The price differential should sell them on the idea of paying attention to the home’s exterior. If not, use anecdotes from your own real estate practice, such as the one at the beginning of this post.<\/p>\n<p>Then, offer suggestions on what they can do to make the home more appealing to potential buyers.<\/p>\n<p>One agent we know has a dedicated file on her computer of suggestion pages for her listing clients (how to choose a paint color, what to consider when painting a home for sale, etc.). She then emails the pertinent ones to her listing clients.<\/p>\n<h2>Speaking of paint<\/h2>\n<p>Most experts agree that homeowners should start their curb appeal project with the house itself and then work their way out to the curb.<\/p>\n<p>If it’s a new coat of paint that will help the home stand out, don’t hesitate to suggest it. And, since color is so important, offer your client some tips, such as:<\/p>\n<h3>Which colors will the HOA allow?<\/h3>\n<p>Remind homeowners who live in a managed community that their HOA may have color restrictions, and to consult the CC&amp;Rs to find out before settling on a color scheme.<\/p>\n<h3>Which colors help homes sell?<\/h3>\n<p>A Minnesota builder posted a photo of one of his homes at Houzz.com and received thousands of requests for the color. You’ll find it at <a href=\"https:\/\/www.bobvila.com\/slideshow\/12-exterior-paint-colors-to-help-sell-your-house-47419#gray-house\">BobVila.com<\/a>.<\/p>\n<p>Zillow offers up the results of its <a href=\"https:\/\/www.zillow.com\/research\/paint-colors-help-sell-20240\/\">2018 Zillow Paint Colors Analysis<\/a>. Find out which exterior colors are most likely to add value to the home.<\/p>\n<h3>Consider the surroundings<\/h3>\n<p>Ensure that the color they choose harmonizes with the unpainted exterior features, such as the roof.<\/p>\n<p>Find additional color-choosing tips to pass on to your clients at <a href=\"https:\/\/www.thoughtco.com\/choosing-exterior-paint-colors-176052\">ThoughtCo.com<\/a>.<\/p>\n<h2>The front door<\/h2>\n<p>Since potential buyers will hopefully get up close to the front door, counsel your clients to either get a new one or make the current one pop.<\/p>\n<p>The <a href=\"http:\/\/www.remodeling.hw.net\/cost-vs-value\/2018\/\">2018 Cost vs. Value<\/a> report from Remodeling Magazine ranks a new front door (made of steel) as the project with the third highest ROI.<\/p>\n<p>If all it needs is a coat of paint, see Zillow’s paint color study, mentioned previously, to learn how much value a black front door adds to the home.<\/p>\n<h2>Garage door<\/h2>\n<p>If the garage is situated near the front of the house, it comprises a large amount of the view potential buyers will see when they drive up to the home.<\/p>\n<p>Suggest that the homeowners paint or replace it. A new “upscale” garage door, by the way, is the project with the highest ROI, according to the <a href=\"http:\/\/www.remodeling.hw.net\/cost-vs-value\/garage-door-replacement-upscale?y=2018\">Remodeling Magazine<\/a> study.<\/p>\n<h2>Landscaping<\/h2>\n<p>As any buyers’ agent knows, little things do get noticed. Share this information with your listing clients and urge them to spiff up the landscaping.<\/p>\n<ul>\n<li>Pull weeds<\/li>\n<li>Remove branches and other debris from the front yard<\/li>\n<li>Consider adding new edging to the beds<\/li>\n<li>Spread fresh mulch in the beds<\/li>\n<li>Green up the lawn and keep it mowed<\/li>\n<\/ul>\n<p>Additional small changes to suggest include:<\/p>\n<ul>\n<li>Replacing the builder’s standard front porch light with something more attractive<\/li>\n<li>Buy a new welcome mat<\/li>\n<li>Install big, bold house numbers<\/li>\n<li>Paint or replace the mailbox<\/li>\n<\/ul>\n<p>While the conversation about the home’s condition is uncomfortable, it’s necessary if your clients hope to get the most money possible for the home. Consider writing up your advice with a checklist to make it easier for everyone.<\/p>\n<p>*(Arndt, A. et al. Real Estate Agent Target Marketing: Are Buyers Drawn Towards Particular Real Estate Agents? Journal of Housing Research. 2017, Vol. 26 Issue 1)<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Enhance Curb Appeal to Reel Buyers in When you pull up to the curb in front of a listing only to have your buyers ask you to drive on, you’ll understand, instantly, the power of curb appeal (or lack thereof). Attractiveness sells, whether it’s a car, a pair of shoes or a house. In fact, [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":57043,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[35,803],"tags":[],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/57041"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=57041"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/57041\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media\/57043"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=57041"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=57041"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=57041"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}