{"id":57049,"date":"2018-12-28T14:07:39","date_gmt":"2018-12-28T22:07:39","guid":{"rendered":"http:\/\/www.marketleader.com\/?p=57049"},"modified":"2022-01-10T12:30:51","modified_gmt":"2022-01-10T20:30:51","slug":"real-estate-continuing-education","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/real-estate-continuing-education\/","title":{"rendered":"Real Estate Continuing Education—Beyond License Renewals"},"content":{"rendered":"<h1><strong>Real Estate Continuing Education – <em>it’s not just for license renewal<\/em>.<\/strong><\/h1>\n<p>Yes, “continuing education” is the term we use for what we have to do to keep our licenses. While requirements differ across states, we’ll typically have to take courses in agency, ethics and contracts, among others.<\/p>\n<p>It’s usually no biggie and it allows us to remain licensed in the real estate industry. Unfortunately, many agents perform only the mandatory continuing education courses, pass the tests and call it a day.<\/p>\n<p><strong>There is so much more to learn. <\/strong>What you do every day makes you better at what you do every day; but it doesn’t necessarily make you a better practitioner in the long run, suggests David Reischer of staples.com.<\/p>\n<p>Yes, keeping your business running is most likely your sole focus and it keeps you super busy. But, you&#8217;re not doing yourself or your clients any favors by focusing on tasks that are important today at the expense of learning how to get better at what you do, he concludes.<\/p>\n<p>Professional development isn’t a luxury, it’s a must for all small business owners, including real estate agents.<\/p>\n<p>&nbsp;<\/p>\n<h2><strong>Online workshops and webinars<\/strong><\/h2>\n<p>&nbsp;<\/p>\n<p>You don’t need to look far and wide for online learning opportunities. In fact, your friends here at Market Leader offer an ongoing training\/coaching series to customers. It’s the <a href=\"\/resources\/million-dollar-pipeline-program\/\">Million Dollar Pipeline Program<\/a> (MDPP) and available exclusively to Market Leader clients. MDPP dives deep<\/p>\n<p>Get ideas on how to more efficiently generate and convert leads and how to use the tools we offer to grow your business.<\/p>\n<p>OK, enough shameless self-promotion. We know we aren’t the only company that provides real estate-specific, online professional development opportunities.<\/p>\n<p>Aside from the designations you can acquire through your association, NAR also offers a ton of continuing education online courses. Learn <a href=\"https:\/\/www.nar.realtor\/edmatrix.nsf\/courseonline?OpenView&amp;Start=1&amp;Count=500&amp;Expand=11#11\">how to work with buyers<\/a>, <a href=\"https:\/\/www.nar.realtor\/edmatrix.nsf\/f5241e920438a34e86256fbd00650396\/059930f7a32c729a862579eb0073cd3f?OpenDocument\">tips on listing presentations<\/a>, negotiation scripts and <a href=\"https:\/\/www.nar.realtor\/education\/courses\">more<\/a>.<\/p>\n<p>Check your local association’s website for information, as well. For instance, the <a href=\"https:\/\/www.car.org\/education\/prodev\">California Association of REALTORS®<\/a> offers a lengthy list of courses for new agents and new brokers, like how to set up a system for seller clients, social media best practices, and more.<\/p>\n<p>Professional development doesn’t necessarily need to come from the real estate industry. For example, I write exclusively about real estate, but I draw my inspiration from a number of industries.<\/p>\n<p>Take a marketing class, learn new tax tips, dive into learning about the latest tech tools.<\/p>\n<p>The U.S. Small Business Administration offers a number of online classes. Learn how to <a href=\"https:\/\/learn.sba.gov\/learning-center-market\/learning-center-market-research\">conduct market research<\/a>.<\/p>\n<p>The National Federation of Independent Businesses (NFIB) offers to familiarize small business owners with the new <a href=\"https:\/\/www.nfib.com\/webinars\/an-introduction-to-the-tax-cuts-and-jobs-act\/\">Tax Cut and Jobs Act<\/a> and how it impacts your business taxes. Confused about local SEO? NFIB offers a <a href=\"https:\/\/www.nfib.com\/webinars\/6-ways-to-use-local-seo-for-your-small-business\/\">webinar<\/a> on the topic.<\/p>\n<p>The HP Foundation offers 30 pages of online, self-paced learning opportunities. You’ll need to sign up before accessing them, which we did (hey, it was free!). We found courses about effective use of email in your business, creating your unique value proposition and social media marketing – all pertinent for real estate agents.<\/p>\n<h2><strong>Offline opportunities<\/strong><\/h2>\n<p>Your local SCORE office offers free mentoring and small business-related workshops. For instance, in Boston you can take the <a href=\"https:\/\/boston.score.org\/#ws\">Accounting for Small Business Owners<\/a> class, learn how to craft an elevator pitch and dive deeper into QuickBooks. Find your local SCORE office at <a href=\"https:\/\/www.score.org\/\">score.org<\/a>.<\/p>\n<p>Check the offerings through your local Chamber of Commerce. The <a href=\"https:\/\/www.cobbchamber.org\/\">Cobb Chamber of Commerce<\/a> in Marietta, GA, for example, offers members the opportunity to participate in their Business Builders program – meeting weekly to study and discuss the “best-selling business books of today.”<\/p>\n<p>If you’re interested in keeping your continuing education real estate-specific, consider attending one of the numerous annual conferences held across the country.<\/p>\n<p>Work within a real estate franchise? If so, you are likely aware of their educational offerings and the immense benefits derived when you attend. These include the Keller Williams Mega Camp and Family Reunion, RE\/MAX R4, Century 21 One21 Experience®, Berkshire Hathaway Home Services (“All In 2019”), and others.<\/p>\n<h2><\/h2>\n<h2><strong>Yikes! How do I choose?<\/strong><\/h2>\n<p>&nbsp;<\/p>\n<p>Yes, it would be amazing to be a perpetual student, spending time in professional development every month. The reality is that you’ll need to choose which conferences, workshops or webinars are worth your time.<\/p>\n<p>Think about not only what you <em>need<\/em> to learn to get ahead in real estate, but what interests you as well. If tech boggles your brain and you’d rather sit in an endodontist’s chair for a couple hours than attend a tech conference, delegate it to a team member or assistant.<\/p>\n<p>Retain the fun, interesting stuff for yourself. There’s a triple bonus in this scheme: you’ll get tips and inspiration on how to take your business a giant leap forward, the event is most likely tax deductible and you’ll actually enjoy the experience.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Real Estate Continuing Education – it’s not just for license renewal. Yes, “continuing education” is the term we use for what we have to do to keep our licenses. While requirements differ across states, we’ll typically have to take courses in agency, ethics and contracts, among others. It’s usually no biggie and it allows us [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":57051,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[83],"tags":[],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/57049"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=57049"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/57049\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media\/57051"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=57049"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=57049"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=57049"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}