{"id":5711,"date":"2012-05-22T06:00:05","date_gmt":"2012-05-22T14:00:05","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=5711"},"modified":"2021-11-12T09:00:42","modified_gmt":"2021-11-12T17:00:42","slug":"service-via-real-estate-website","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/service-via-real-estate-website\/","title":{"rendered":"How to Provide Great Customer Service via Your Real Estate Website and Social Media Tools"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignright size-full wp-image-6181\" title=\"Nblog_customerService\" src=\"\/wp-content\/uploads\/2012\/05\/Nblog_customerService.jpg\" alt=\"Improve your customer service\" width=\"300\" height=\"400\" \/>Have you heard any of these phrases before?<\/p>\n<p><em>Online customers are fickle.<\/em><\/p>\n<p><em>They are only interested in finding the very lowest price.<\/em><\/p>\n<p><em>Today’s consumers want instant gratification.<\/em><\/p>\n<p><em>They’re not interested in quality, just quantity.<\/em><\/p>\n<p><em>It’s hard to keep in touch with customers and leads online. <\/em><\/p>\n<p><em>People have such short attention spans these days. <\/em><\/p>\n<p>Maybe you’ve even thought these to yourself, or mentioned your observations to a colleague. It’s a fact that technology is changing the way we do business and the way we interact with each other. And, sometimes it seems like it changes so quickly, it’s hard to keep up. But, regardless of your opinions about where technology is headed, one thing is certain: in order to be successful in business, you must embrace every communication medium that your leads and clients embrace, including your real estate website and real estate social networks.<\/p>\n<p>Translating what you do best—providing valuable real estate services to your clients—from a brick-and-mortar storefront to the digital world can be difficult, but in many ways, the Internet is just another channel for demonstrating your worth. Follow these simple tips for participating in today’s online economy and you’ll be thriving in no time.<\/p>\n<p><strong style=\"color: #7a003c;\"><span style=\"font-size: 11.0pt; line-height: 115%; font-family: 'Calibri','sans-serif';\">Tune in to how people are communicating with you via your online social networks. <\/span><\/strong>The companies with the strongest social media presence are doing one thing right: they see social media as a two-way street. Did a potential customer post something to your business’ Facebook page or Twitter feed? Answer back! Create ongoing communication. Also, regularly post items of value, like market trends, new listings, tips for homeowners, and information on interest rates. Start up online conversations that encourage participation.<\/p>\n<p><strong style=\"color: #7a003c;\"><span style=\"font-size: 11.0pt; line-height: 115%; font-family: 'Calibri','sans-serif';\">Offer a wealth of information on your real estate website.<\/span><\/strong> Your real estate website should be a repository of information for your clients and prospective clients. Offer more than just listings, certifications, and contact information. Including a blog, a frequently asked questions section, and advice for buyers and sellers can show customers that you’re truly a real estate industry expert.<\/p>\n<p><strong style=\"color: #7a003c;\"><span style=\"font-size: 11.0pt; line-height: 115%; font-family: 'Calibri','sans-serif';\">It’s the little things.<\/span><\/strong> When it comes to the world of online lead generation, online social networks, and real estate websites, don’t over-think it. Make your real estate website user friendly. Write your blog in terms that everyone can understand. Respond promptly, but with all of the information (and more!) that the client has requested. Over-deliver whenever possible. Offer value to your clients, communicate clearly and concisely, and showcase your expertise.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Have you heard any of these phrases before? Online customers are fickle. They are only interested in finding the very lowest price. Today’s consumers want instant gratification. They’re not interested in quality, just quantity. It’s hard to keep in touch with customers and leads online. People have such short attention spans these days. Maybe you’ve [&hellip;]<\/p>\n","protected":false},"author":33,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[35,36,50],"tags":[72,65],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/5711"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/33"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=5711"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/5711\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=5711"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=5711"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=5711"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}