{"id":57131,"date":"2019-01-28T10:08:57","date_gmt":"2019-01-28T18:08:57","guid":{"rendered":"http:\/\/www.marketleader.com\/?p=57131"},"modified":"2022-09-26T14:57:43","modified_gmt":"2022-09-26T21:57:43","slug":"real-estate-business-card-tips-for-agents","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/real-estate-business-card-tips-for-agents\/","title":{"rendered":"Real Estate Business Card Tips for Agents"},"content":{"rendered":"<p>OK, who is the wise guy (or gal) who first suggested that folding your arms for your real estate business card photo is cool?<\/p>\n<p>We don’t know for sure, but it seems like nine out of 10 agents have chosen this pose. It’s a particularly curious practice in a business where practitioners say they crave a way to set themselves apart from others.<\/p>\n<p>Same pose.<\/p>\n<p>Same smile.<\/p>\n<p>“It’s contagious. One of them gets an idea and it spreads through the body like a flu,” House of Cards’ President Frank Underwood claims.<\/p>\n<p>If that’s true, members of the Senate and real estate agents have a lot in common.<\/p>\n<p>With real estate agent business cards, you have just seven square inches to convey your message. If half of that is taken up by your photo, and your photo screams “Nothing unique to look at here!” you’re doing yourself no favors.<\/p>\n<p>So, how can you use that valuable space for all it’s worth? We went to the experts to find out.<\/p>\n<h2>To headshot or not?<\/h2>\n<p>The arguments for using a photo on a real estate business card equal the number against. Southern California broker\/agent Mellissa Zavala is in both camps, feeling that some situations call for a card with her photo.<\/p>\n<p>She solves the dilemma by carrying two different cards, one with and one without her headshot. The former is used in “situations where I want to people to remember more than just my name,” Zavala claims.<\/p>\n<p>Other agents feel that the photo is important, but not so much that it should take up the more valuable “real estate” of the tiny business card. These agents put their photo on the back.<\/p>\n<p>Eric Bryn, attorney, adjunct professor at Loyola University, and Chicago broker points out that professionals in other industries don’t plaster their business cards with their photos (they don’t offer their clients gifts at the end of a business deal either, but that’s fodder for another blog post).<\/p>\n<p>“In the space where the headshot goes, why not add a core value statement?” he asks. He goes on to explain an even bigger reason he’s against the ubiquitous agent photo on business cards. “A few years back we did a really cool test,” he begins. “We printed 2000 post cards for a client. Same exact message on both. One had a picture of an agent on the card, the other did not.<\/p>\n<p>Both had a very clear and defined call to action &#8211; a phone number. Each had a different number so we could get accurate results,” Bryn explains.<br \/>\nHe and his team sent 1,000 of each card to area addresses. The results are pretty astounding.<\/p>\n<p>They got zero response from the 1,000 cards sent out that contained the agent’s photo and nearly 200 responses from the 1,000 cards that lacked a photo.<br \/>\nBryn goes on to explain that they’ve done similar tests on other types of agent marketing, such as webpages, whole sites, business cards and more. In every test, he claims, the marketing piece without the agent’s photo out-performs the one with the photo.<\/p>\n<p>They have never found, “a situation where an image of an agent increases conversation. What we find is, it completely obliterates it.”<br \/>\nAgents and brokers who do recommend using a photo on a business card stress that the photo should be recent and professionally shot.<\/p>\n<h2>Agent – Heal Thyself<\/h2>\n<p>When counselling your listing clients on how to ensure their homes make a brilliant first impression, you suggest that they clean and declutter, right? Then, as you walk out the door, you remind them to call you if they need anything, handing them a business card that is full of clutter.<br \/>\nFrom the string of letters behind your name to a fax number, a headshot and every conceivable way to contact you, the card looks a bit like an ugly home page on a website.<\/p>\n<p>Cleaning up the clutter on your business card may help yours avoid being among the 88 percent that are tossed into the trash within the first week of receiving them.<\/p>\n<h4>Give your logo the space you devoted to your headshot and then include:<\/h4>\n<h5 style=\"padding-left: 30px;\">• Name (personal and brokerage)<br \/>\n• Email address<br \/>\n• Phone number<br \/>\n• Website URL<br \/>\n• URL of the social media site you’re most active on<\/h5>\n<p>&nbsp;<\/p>\n<h2>Pay attention to aesthetics<\/h2>\n<p>Designing a business card is a lot like designing a website; some of the same aesthetics apply.<\/p>\n<h5 style=\"padding-left: 30px;\">• Font choice<br \/>\n• Color<br \/>\n• Lots of white space<\/h5>\n<p>In fact, experts recommend that you use your website branding concept on your business card.<\/p>\n<p>Card stock is something you’ll need to think about as well. “When I receive a business card, I create an opinion about the company as soon as the card touches my hand. Is it thin and flimsy? Is it thick cardstock?” Chris Ake of Grand Apps asks the Forbes Agency Council.<\/p>\n<p>“Cheap business cards get printed on: 100 lb. gloss cover,” suggests Andrew Shu, with MGX Copy, a San Diego print company. He goes on to say, however, that a card printed on this stock “feels perfectly fine, and it doesn’t feel cheap.”<\/p>\n<p>Fourteen and 15-point card stocks, on the other hand, “feel very corporate and professional.”<\/p>\n<h2>Has technology killed the business card?<\/h2>\n<p>&nbsp;<\/p>\n<h4>All of the above depends, of course, on which camp you’re in when it comes to business cards:<\/h4>\n<h5 style=\"padding-left: 30px;\">• They are a must for real estate agents – old-school has merit<br \/>\n• This is the 21st century – business cards are outdated<\/h5>\n<p>Personally, I can’t recall the last time I received a business card. Even the agent who helped me buy my home two years ago didn’t proffer one.<\/p>\n<p>“Business cards still hold a purpose, which is quickly exchanging information at events, conferences and other networking opportunities,” Leila Lewis of Be Inspired PR tells Forbes.com.<\/p>\n<p>Mark Sims, founder of Foundation, a design and branding company, claims that it’s the smartphone that has killed the business card,“ . . . we can swap and store contact information with one another with a simple tap of the phone,” he says, which does away with the need for a business card. This “tap,” however, doesn’t “carry forward your brand identity,” he continues.<\/p>\n<p>If this is important to you, keep using business cards. And, unless you hope to mimic the Black Astrum card ($1,500 per card and, yes, those are real diamonds), business cards remain an economical way to broadcast your brand.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>OK, who is the wise guy (or gal) who first suggested that folding your arms for your real estate business card photo is cool? We don’t know for sure, but it seems like nine out of 10 agents have chosen this pose. It’s a particularly curious practice in a business where practitioners say they crave [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":57159,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[789,35,803],"tags":[],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/57131"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=57131"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/57131\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media\/57159"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=57131"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=57131"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=57131"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}