{"id":573,"date":"2010-10-15T14:22:17","date_gmt":"2010-10-15T22:22:17","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=573"},"modified":"2021-11-12T12:50:16","modified_gmt":"2021-11-12T20:50:16","slug":"team-leaders-combine-resources-increase-marketing-impact","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/team-leaders-combine-resources-increase-marketing-impact\/","title":{"rendered":"Team Leaders: Combine Resources&#8230;Increase Marketing Impact"},"content":{"rendered":"<p>In the old days, real estate team leaders taught new members of their team how to market by simply replicating themselves, producing “mini me&#8217;s”. It’s understandable that agents used to imitate their leaders. I mean, you’ve already had enough success in your business to show that you are able to grow a team. So naturally, you&#8217;d think having another “you” would make your team twice as successful, right? Two heads are better than one, you can be in two places at the same time… and if you have two, three, a dozen team members who are just like you, you’ll close two, three, twelve times as much business, right?<\/p>\n<p>If you scratch the surface, of course, you’ll see <strong>that’s not the case<\/strong> for a couple of reasons:<\/p>\n<ol>\n<li>Individuals are just that—individuals unlike anyone else. <strong>Their strengths and weaknesses are not yours, so if they are doing the same thing you do, they will not be as efficient as you are.<\/strong> That’s just the way it goes.<\/li>\n<li><strong>Specialization increases efficiencies.<\/strong> If you only have to juggle six hats instead of 12, that will make you much better at those six hats. And your team members can get better at their hats too.<\/li>\n<li><strong>Customer service matters<\/strong> a lot in this business. When your team is specialized and coordinated, you’re able to provide better customer service than a single agent or team that’s trying to do everything for everybody. If real estate isn’t a service industry, then it’s a commodity. <strong>Set yourself apart by combining your resources across the team.<\/strong><\/li>\n<\/ol>\n<p>So—you’re on board with the idea of letting your team specialize, right?  How to do it starts with getting to know the individual. When you interview and first bring them on board, <strong>identify core competencies<\/strong>. If they’re not the same as yours, all the better. <strong>Teach them the part of marketing that they need to know, and let the rest speak for itself.<\/strong><\/p>\n<p><strong>Coordination<\/strong> is key. Set up processes and expectations to ensure information is shared throughout the team. This sounds more complicated than it is. Start by asking each team member to send a status email once a week, and schedule regular team meetings. Be proactive about reminding your team members of the process for the first few weeks, until it becomes a solid habit.<\/p>\n<p><strong>Accountability<\/strong> is equally important. Make sure each team member specializes in a particular channel or audience. Ask them to document their plan, including specific goals and success criteria. Set quarterly reviews, just as you do for your business.<\/p>\n<p>While all this coordination may seem like a chore, you may be glad to know it quickly becomes your strength—<strong>when you’re the “brains” behind the team, you need strong nerve connections to keep everyone in sync and focused on what’s most important.<\/strong> That way, your marketing will make a bigger, bolder impact.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>In the old days, real estate team leaders taught new members of their team how to market by simply replicating themselves, producing “mini me&#8217;s”. It’s understandable that agents used to imitate their leaders. I mean, you’ve already had enough success in your business to show that you are able to grow a team. So naturally, [&hellip;]<\/p>\n","protected":false},"author":6,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[35,36],"tags":[],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/573"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=573"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/573\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=573"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=573"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=573"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}