{"id":57335,"date":"2019-02-28T15:13:53","date_gmt":"2019-02-28T23:13:53","guid":{"rendered":"http:\/\/www.marketleader.com\/?p=57335"},"modified":"2019-04-01T15:25:01","modified_gmt":"2019-04-01T22:25:01","slug":"market-leader-joins-keller-cloud-as-premier-platinum-partner","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/market-leader-joins-keller-cloud-as-premier-platinum-partner\/","title":{"rendered":"Market Leader Joins Keller Cloud as Premier Platinum Partner"},"content":{"rendered":"<h1>Market Leader and Keller Williams announce extended multi-year partnership<\/h1>\n<p>We&#8217;re excited to extend our multi-year partnership with Keller Williams and be named a Premier Platinum Partner in the Keller Cloud Innovator Program!<\/p>\n<p>As technology partners, we look forward to continuing to provide KW Associates tools that increase productivity through our long-term partnership.<\/p>\n<h3>Full press release:<\/h3>\n<p>AUSTIN, Texas&#8211;(<a href=\"https:\/\/www.businesswire.com\/\" rel=\"nofollow\">BUSINESS WIRE<\/a>)&#8211;Keller Williams (“KW”), the world&#8217;s largest real estate franchise by agent count and the U.S. leader in units and sales volume, announces Market Leader, a pioneer in sales and marketing technology for the real estate industry, as a Platinum Partner in the Keller Cloud Innovator Program.<\/p>\n<blockquote>\n<p id=\"pull-quote\">“Our Innovator Program is a giant leap for us at KW and real estate as a whole,” said Josh Team, president, @kwri. “We’ve created a true innovation hub &#8211; an environment where we can bring to life the best ideas from the most innovative disruptors.”<\/p>\n<\/blockquote>\n<p>“We&#8217;re excited to continue to partner with Market Leader and plug their applications into the Keller Cloud,” said Josh Team, president, Keller Williams. “This collaboration offers our agents the opportunity to leverage Market Leader products in their businesses, and in turn, Market Leader solutions are strengthened through their integration with the most robust data-driven smart platform in real estate.”<\/p>\n<p>Through the Keller Cloud Innovator Program (“KCIP”), KW collaborates with leading technology companies, like Market Leader, to enhance the operations of real estate businesses via the Keller Cloud, a proprietary, AI-fueled real estate cloud for Keller Williams agents.<\/p>\n<p>Using a Keller Cloud application programming interface, or API, available for outside technology developers, KCIP enables the integration of additional top technology tools within an agent’s Keller Cloud solutions.<\/p>\n<p>Through benefits resulting from the KCIP, KW agents can now further customize Command, a smart CRM-plus suite of solutions. Recently, KW released Command into a general availability lab for its agents.<\/p>\n<p>Market Leader Pro, a set of tools for agents to generate and close more business, will also be included in the launch of the forthcoming KW Marketplace: an app store for KW agents to browse top software integrations made by non-Keller Williams developers.<\/p>\n<p>“We’ve been a proud technology partner to Keller Williams Realty for the past eight years with the common goal of delivering tools that increase productivity,” said Scott Smith, president and general manager, Market Leader and Constellation Real Estate Group. “And, we’re delighted to extend our multi-year partnership to provide KW and their associates a competitive advantage.”<\/p>\n<p>Market Leader has been a partner with KW since 2011, being principally involved with KW’s award-winning eEdge platform, a complete lead-to-close business solution.<\/p>\n<p><b>About Market Leader<\/b><\/p>\n<p>A pioneer in lead generation, CRM, and marketing software, Market Leader provides innovative cloud-based sales and marketing solutions for the real estate industry. Since 1999, Market Leader has helped hundreds of thousands of real estate professionals succeed and grow their businesses. Today, Market Leader powers more than 250,000 agents, teams, brokerages, and franchises across the United States and Canada.<\/p>\n<p>Market Leader is part of the Constellation Real Estate Group, which is a division of Constellation Software, Inc. The Constellation Real Estate Group acquires and invests in real estate software brands that are committed to providing long-term solutions and partnerships with franchises, brokers, agents, MLSs, and associations. Over 500,000 real estate agents, teams, and brokerages across North America rely on CREG’s products and services to power, manage, and grow their businesses.<\/p>\n<p>For more information about Market Leader, visit <a href=\"https:\/\/cts.businesswire.com\/ct\/CT?id=smartlink&amp;url=http%3A%2F%2Fwww.marketleader.com%2F&amp;esheet=51948281&amp;newsitemid=20190228005916&amp;lan=en-US&amp;anchor=marketleader.com&amp;index=4&amp;md5=b6ad54f81933389a8321733d2b235951\" target=\"_blank\" rel=\"nofollow noopener\">marketleader.com<\/a>.<\/p>\n<p>For more information on the Constellation Real Estate Group, visit <a href=\"https:\/\/cts.businesswire.com\/ct\/CT?id=smartlink&amp;url=http%3A%2F%2Fconstellationreg.com&amp;esheet=51948281&amp;newsitemid=20190228005916&amp;lan=en-US&amp;anchor=constellationreg.com&amp;index=5&amp;md5=325205e0855459fcd685c9c80bffddb3\" target=\"_blank\" rel=\"nofollow noopener\">constellationreg.com<\/a>.<\/p>\n<p><b>About Keller Williams<\/b><\/p>\n<p>Austin, Texas-based Keller Williams, the world&#8217;s largest real estate franchise by agent count, has more than 1,000 offices and 180,000 associates. The franchise is also No. 1 in units and sales volume in the United States.<\/p>\n<p>In 2019, Fast Company named Keller Williams the No. 1 “Most Innovative Company” in real estate. In 2015, the company began its evolution into a technology company, now building the real estate platform that agents&#8217; buyers and sellers prefer.<\/p>\n<p>Since 1983, the company has cultivated an agent-centric, technology-driven and education-based culture that rewards agents as stakeholders. For more information, visit <a href=\"https:\/\/cts.businesswire.com\/ct\/CT?id=smartlink&amp;url=http%3A%2F%2Fkw.com&amp;esheet=51948281&amp;newsitemid=20190228005916&amp;lan=en-US&amp;anchor=kw.com&amp;index=3&amp;md5=14049e1258736de2c1ea8d4b5a348b27\" target=\"_blank\" rel=\"nofollow noopener\">kw.com<\/a>.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Market Leader and Keller Williams announce extended multi-year partnership We&#8217;re excited to extend our multi-year partnership with Keller Williams and be named a Premier Platinum Partner in the Keller Cloud Innovator Program! As technology partners, we look forward to continuing to provide KW Associates tools that increase productivity through our long-term partnership. Full press release: AUSTIN, [&hellip;]<\/p>\n","protected":false},"author":51,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[51],"tags":[],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/57335"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/51"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=57335"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/57335\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=57335"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=57335"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=57335"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}