{"id":57501,"date":"2019-05-01T08:58:58","date_gmt":"2019-05-01T15:58:58","guid":{"rendered":"http:\/\/www.marketleader.com\/?p=57501"},"modified":"2021-11-22T11:02:32","modified_gmt":"2021-11-22T19:02:32","slug":"real-estate-yard-signs-what-where-and-why","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/real-estate-yard-signs-what-where-and-why\/","title":{"rendered":"Real Estate Yard Signs: What, Where, and Why"},"content":{"rendered":"<h1>A Simple Guide to Real Estate Yard Signs<\/h1>\n<p>&nbsp;<\/p>\n<h2><strong>Are your real estate signs working as hard as they should?<\/strong><\/h2>\n<p>Did you know that there is a “Standard Alphabets for Highway Signs” book? And, who knew that there exists in the U.S. the Foundation for the Advancement of the Sign Industry?<\/p>\n<p>In fact, highway signage has a whole set of rules that we’re willing to wager few of agents consider when sticking for-sale real estate signs in a client’s lawn.<\/p>\n<p>It only makes sense, however, when we <em>do<\/em> think about it. For the public’s safety, highway signs must be legible from certain distances.<\/p>\n<p>For an entirely different reason, real estate signs also need to be legible from certain distances.<\/p>\n<p>Here we are in 2019, well past the dawn of the digital age, and little has changed with real estate signage. They’re still stuck in the front yard or window of a home for sale, they still get muddy and many agents still make the same mistakes with them.<\/p>\n<p>Of course, any discussion of real estate signage should be prefaced with the caveat that the majority of brokers and franchise owners dictate the use of their branded signs, so many agents don’t have a choice of what is on their real estate signs.<\/p>\n<p>If you do have a choice, read on for information on how to make your real estate signs work hard to bring in buyers and, quite possibly generate additional real estate leads.<\/p>\n<h2><strong>Remember the sign’s true purpose<\/strong><\/h2>\n<p>One agent in a Facebook group brags that his signs are emblazoned with a very large copy of his logo. He loves the feedback he gets from the public.<\/p>\n<p>“I get calls from people who say things like ‘I can’t turn in this town without seeing your sign.’”<\/p>\n<p>It’s cool to get accolades from others, but the only accolades you should be aiming for with your real estate signs are those from your listing clients to all the folks they’ll be referring to your business.<\/p>\n<p>And that won’t happen if your real estate signs are vanity signs.<\/p>\n<p>Listing clients hire agents to market their homes for sale, not to market themselves. It’s dishonest to use your clients’ front yard to erect a monument to yourself.<\/p>\n<p>A real estate sign’s main job is to clearly and concisely convey the listing agent’s contact information. And you can do so in a number of ways.<\/p>\n<h2><strong>What color is your real estate sign? <\/strong><\/h2>\n<p>“During the day, our eyes are most easily able to pick up green light, followed by yellow and blue,” according to April Sanders at Sciencing.com.<\/p>\n<p>Red, on the other hand, is the least easy to view from a distance. At night, yellow is most visible.<\/p>\n<p>So, what does this mean for real estate signs? No, we aren’t advocating you change your branding colors to suit your signage, but do consider that the phone number, the most important element of your sign, might look dashing in yellow against a green background.<\/p>\n<h2><strong>Typography<\/strong><\/h2>\n<p>One rule of thumb in the signage industry is that the individual letters on a real estate sign should measure 1 inch in height for every 30 feet in distance from the viewer.<\/p>\n<p>“Thus, if a sign must be readable from 300 feet, its letters must be at least 10 inches tall,” according to Wade Swormstedt, executive director of the Foundation for the Advancement of the Sign Industry.<\/p>\n<p>Since the widely accepted <a href=\"https:\/\/plannersweb.com\/\">width of a residential street<\/a>, from curb-to-curb, is 28 feet, the minimum height of the phone number on your sign should be 10 inches tall. That way, the family passing by on the other side of the street can see it.<\/p>\n<p>For another take on letter height in signage, check out <a href=\"https:\/\/www.signazon.com\/help-center\/sign-letter-height-visibility-chart.aspx\">this signage chart<\/a>.<\/p>\n<p>It’s interesting how the digital age ushered in an attention to typography. Everyone has a favorite font, right?<\/p>\n<p>The problem is that our favorites (give me Times New Roman any day) may not be the best to use in certain situations.<\/p>\n<p>Take websites, for instance. Experts recommend Sans Serif fonts for online purposes (those without “<a href=\"https:\/\/www.awai.com\/2011\/10\/the-best-fonts-to-use-in-print-online-and-email\/\">little feet and embellishments on the tip and base of each letter<\/a>,”) and Serif fonts for printed material.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter wp-image-57505 size-full\" src=\"https:\/\/www.marketleader.com\/wp-content\/uploads\/2019\/05\/Serif-Fonts.png\" alt=\"serif font vs. sans serif font visual\" width=\"589\" height=\"195\" \/><\/p>\n<p>Advertising legend David Ogilvy preferred the Century family, Caslon, Baskerville, and Jenson, according to Awai.com’s John Wood.<\/p>\n<h3>The pros at landmarksigns.com suggest the following fonts:<\/h3>\n<ul>\n<li>\n<h4>Futura<\/h4>\n<\/li>\n<li>\n<h4>Garamond<\/h4>\n<\/li>\n<li>\n<h4>Helvetica<\/h4>\n<\/li>\n<li>\n<h4>Trajan<\/h4>\n<\/li>\n<li>\n<h4>Verdana<\/h4>\n<\/li>\n<\/ul>\n<p>Your phone number is the most important element of your real estate sign’s lettering, so consider using what the highway sign experts use:<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter wp-image-57503 size-full\" src=\"https:\/\/www.marketleader.com\/wp-content\/uploads\/2019\/05\/Highway-Gothic-vs.-Interstate-Fonts.png\" alt=\"Highway Gothic Font vs. Interstate Font example\" width=\"609\" height=\"278\" \/><\/p>\n<p>Since “better legibility is obtained by using a relatively wide spacing between letters,” according to the <a href=\"https:\/\/mutcd.fhwa.dot.gov\/shse\/design.pdf\">U.S. Department of Transportation<\/a>, the Interstate font seems to be the best choice.<\/p>\n<p>Not all agents can choose their real estate signs. If you can, use the space wisely.<\/p>\n<p>And, if you work under a broker who insists that the phone number on a real estate sign can’t be larger than the broker’s name, it’s time to strike out on your own.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>A Simple Guide to Real Estate Yard Signs &nbsp; Are your real estate signs working as hard as they should? Did you know that there is a “Standard Alphabets for Highway Signs” book? And, who knew that there exists in the U.S. the Foundation for the Advancement of the Sign Industry? In fact, highway signage [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":57507,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[789,35],"tags":[],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/57501"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=57501"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/57501\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media\/57507"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=57501"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=57501"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=57501"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}