{"id":57617,"date":"2019-05-22T13:54:50","date_gmt":"2019-05-22T20:54:50","guid":{"rendered":"http:\/\/www.marketleader.com\/?p=57617"},"modified":"2019-05-22T14:36:40","modified_gmt":"2019-05-22T21:36:40","slug":"5-time-wasters-that-hurt-your-real-estate-business","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/5-time-wasters-that-hurt-your-real-estate-business\/","title":{"rendered":"5 Time-Wasters That Hurt Your Real Estate Business"},"content":{"rendered":"<h1><strong>5 common time and resource wasters that hurt your real estate business<\/strong><\/h1>\n<p>You know those days where you just can’t motivate yourself to be productive? Those days when Facebook or your favorite movie or video game screams louder than the pile of work in front of you?<\/p>\n<p>I feel your pain. At least in my business, we have an excuse – we can just call it “writer’s block.” But not you, so when you waste time doing things that don’t make you money, the guilt starts stacking up and, if you waste too much time, your business suffers.<\/p>\n<p>Self-discipline is the key; being able to push yourself even when you don’t feel like it is crucial.<\/p>\n<p>The good news is that you can train yourself to be more disciplined and it starts by first recognizing the ways that you waste time and sabotage your success.<\/p>\n<p><strong style=\"color: #333333; font-size: 26px;\">1. Are you chronically disorganized?<\/strong><\/p>\n<p>If you can’t find the scrap of paper that holds the contact info from your newest lead or you’re winging it when it comes to a marketing budget and your desk looks like a bomb went off on it, you’re probably chronically disorganized.<\/p>\n<p>Every minute that you spend searching for something is a minute you could’ve spent being productive. It’s a minute wasted and at the end of the day, those minutes may add up to hours.<\/p>\n<p>Disorganization leads to details falling through the cracks and missed deals due to a lack of follow-up. Time wasters are money wasters and represent money most agents would prefer to have in <em>their<\/em> bank accounts rather than their competition’s.<\/p>\n<p>Thankfully, there are tools and systems to help you break the chaos habit. Chief among the tools is a <a href=\"\/products\/professional-for-agents\/\">CRM<\/a>.<\/p>\n<blockquote><p><strong>“The first reason you want a database or CRM platform is because your ability to make money is tied up in your ability to follow up with the people that you’re ultimately trying to serve.” &#8211; <\/strong> Business Coach <a href=\"https:\/\/travisrobertson.com\/\">Travis Robertson<\/a>.<\/p><\/blockquote>\n<p>Why bother generating leads if you aren’t able to effectively and consistently follow up with them to convert them to clients?<\/p>\n<p>If you’re new to the business, a CRM should be the first tool you invest in for your business. Then, start loading it up with the names and contact information of everyone you know and everyone you meet.<\/p>\n<p>Organize and categorize these contacts according to where they are in the <a href=\"\/wp-content\/uploads\/2018\/04\/funnel1200.jpg\">sales funnel<\/a> and set up systems to ensure you consistently follow up appropriately with each.<\/p>\n<p><strong style=\"color: #333333; font-size: 26px;\">2. Spending time on social media platforms that have little ROI<\/strong><\/p>\n<p>Are you on Twitter because someone told you they get leads from it? How about Instagram? How much time do you spend making pretty posts for a platform that caters to the wrong demographics for real estate agents?<\/p>\n<p>Stop wasting time on social media marketing platforms that return little on an agent’s time invested. Choose one or two that attract potential real estate consumers and learn how to dominate them.<\/p>\n<p>The two with the most favorable demographics – those of the typical homebuyer and seller – are Facebook and LinkedIn.<\/p>\n<p>Run some giveaways or contests on Facebook, join LinkedIn groups. But vow to only work on the platforms late in the day; make this marketing task the one you perform before you close up shop for the day.<\/p>\n<p><strong style=\"color: #333333; font-size: 26px;\">3. Being overly social when you should be working<\/strong><\/p>\n<p>According to <a href=\"https:\/\/www.emarketer.com\/Chart\/Average-Time-Spent-per-Day-with-Facebook-Instagram-Snapchat-by-US-Adult-Users-of-Each-Platform-2015-2020-minutes\/222515\">eMarketer<\/a>, the average American over the age of 18 spends 40 minutes per day on Facebook.<\/p>\n<p>That’s fine if those 40 minutes are personal minutes and you aren’t stealing them from your business. If social media starts taking time away from drumming up biz, however, it might be considered a waste of time.<\/p>\n<p>And a money thief.<\/p>\n<p>Check out page 22 of Market Leader’s oldie-but-still-goodie “<a href=\"http:\/\/files.marketleader.com\/pdfs\/TheCompleteGuide-to-RealEstateLeadGeneration.pdf\">Complete Guide to Real Estate Lead Generation<\/a>” for tips on how to take control of your social media usage.<\/p>\n<p><strong style=\"color: #333333; font-size: 26px;\">4. Not setting boundaries<\/strong><\/p>\n<p>Agents who work from home understand the temptations that await you every day. The Netflix movie you fell asleep in the middle of that you can’t wait to finish, the dishes piled in the sink and the laundry waiting to be folded – all of them beckon.<\/p>\n<p>Those, however, are self-inflicted time wasters. The demands of other people are something all work-from-home agents must guard against.<\/p>\n<p>Can you imagine calling a friend who works a 9-to-5 in an office, asking her to pick up your kids from school at 3 p.m.? Wouldn’t dream of it, right?<\/p>\n<p>For some reason, many people feel that those of us who work from home aren’t <em>really<\/em> working. Your time is up for grabs. And far too many of us allow them to continue with this misconception, even giving in to it.<\/p>\n<p>Setting clear boundaries is hard for some of us, but it can be learned. Practice if you must, but repeat after me:<\/p>\n<p>“I’d love to help you but I’ll be working when [your flight arrives, your kids get out of school, your dog needs to go to the vet].<\/p>\n<h2><strong>5. Choosing the wrong clients<\/strong><\/h2>\n<p>In the beginning of your professional real estate life you’ll pretty much work with any buyer or seller who comes along. As time goes by, however, you should be able to recognize those clients who are guaranteed to be a time suck.<\/p>\n<p>You know the ones: the buyers who have champagne tastes and beer pocketbooks, the sellers who insist on overpricing their homes.<\/p>\n<p>They’ll suck weeks, maybe months of your time and, in the end, blame you that they didn’t get the mini-mansion for $200,000 or when you don’t bring in buyers for their unrealistically priced home.<\/p>\n<p>The beauty of being in business for yourself is that you don’t have to work with any particular client. Pass the time wasters off to a colleague for a referral fee and free yourself to pursue better clients.<\/p>\n<p>The best way to start getting rid of the time and resource wasters in your business is to take it one task at a time. Vow to get organized. When that’s accomplished, move on to tweaking your social media strategy or whatever else is most pressing.<\/p>\n<p>Some of these time-wasting habits may take more time than others to banish, but if you concentrate on doing a little bit each day, before you know it, you’ll be a <em>former<\/em> time waster and one kick-butt productive real estate agent.<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>5 common time and resource wasters that hurt your real estate business You know those days where you just can’t motivate yourself to be productive? Those days when Facebook or your favorite movie or video game screams louder than the pile of work in front of you? I feel your pain. At least in my [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":57625,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[97,83],"tags":[],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/57617"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=57617"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/57617\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media\/57625"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=57617"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=57617"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=57617"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}