{"id":57709,"date":"2019-06-25T13:52:25","date_gmt":"2019-06-25T20:52:25","guid":{"rendered":"http:\/\/www.marketleader.com\/?p=57709"},"modified":"2022-01-26T12:56:34","modified_gmt":"2022-01-26T20:56:34","slug":"ibuyer-what-does-it-mean-for-real-estate-agents","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/ibuyer-what-does-it-mean-for-real-estate-agents\/","title":{"rendered":"iBuyer: What Does it Mean for Real Estate Agents?"},"content":{"rendered":"<p>After decades of coasting along relatively comfortably, the real estate industry is facing an onslaught of disruptors. It started with the listing portals – Zillow, Trulia and the others.<\/p>\n<p>In the beginning, they were primarily lead generators (and lead sellers) and they stayed away from actual transactions.<\/p>\n<p>Then, OpenDoor launched in 2014 and the industry began changing. This company and its imitators began “moving closer to the transaction … getting involved in more parts of” it, Michael DelPrete claims in an Inman Select <a href=\"https:\/\/www.youtube.com\/watch?v=l2OmyguHNQE&amp;feature=youtu.be\">video<\/a>.<\/p>\n<p>With Instant Offers, he says, Zillow began “moving from search engine to service engine.”<\/p>\n<p>Today, there are several others in the iBuyer space, all clamoring for the holy grail of real estate: listings.<\/p>\n<h2><strong>What is an iBuyer?<\/strong><\/h2>\n<p>iBuyers are quite similar to the cash-heavy real estate investors who make rock bottom offers on homes, fix them up and flip them. Apparently, iBuyers bristle at being called “flippers,” but that’s pretty much what they are.<\/p>\n<p>But, that’s an opinion and, like all opinions, there’s an opposing side. Some, like the brilliant Notorious R.O.B, beg to differ.<\/p>\n<p>“iBuyer is Not Real Estate Investing; Real Estate Investing is Not iBuyer,” he <a href=\"https:\/\/notorious-rob.com\/2018\/11\/the-case-for-ibuyer-becoming-the-default\/\">says<\/a> and for proof of his point he quotes (wait for it) <em>Spencer Rascoff<\/em>.<\/p>\n<p>Rascoff’s argument, by the way, is that “Flipping requires distressed homes and distressed sellers, people that are selling their home under duress, and it only applies to a very small segment of the market.”<\/p>\n<p>Those who utilize the services of iBuyer companies, on the other hand, favor “speed, certainty, ease, convenience,” Rascoff continues.<\/p>\n<p>Who is he trying to kid?<\/p>\n<p>“The motivated Seller who wants to sell fast, is willing to sell low, and does not want to work with an agent is the one the Investor wants,” says an investor at BiggerPockets.com. She describes the very <em>same<\/em> consumer that iBuyers target.<\/p>\n<blockquote><p><strong>So, buying homes at less-than-market value, fixing them up and then reselling them is called “flipping,” but <em>not<\/em> when Zillow does it.<\/strong><\/p><\/blockquote>\n<p>In fact, all of the companies in this space stress (repeatedly) that their home sale process is “convenient and hassle-free.”<\/p>\n<p>The bottom line for the consumer, however, is that iBuyers use automated value models (AVMs) and we all know how unreliable those are. Then, there are plenty of horror stories from home sellers about the pitiably small offers they’ve received.<\/p>\n<p>“An agent in Atlanta requested offers on his own newly renovated home with OpenDoor, Knock, and OfferPad to see how the process worked,” explains an unnamed writer at MetroBrokers.com.<\/p>\n<blockquote><p>“His property, which was appraised at $495,000, received [iBuyer] offers from $265,000 on the low end to $373,000 on the high end.”<\/p><\/blockquote>\n<p>It’s easy to read that and assume that iBuyers are going nowhere, fast. And, nationally, they only capture 0.2 percent of the market (2018, all U.S. iBuyers), according to DelPrete.<\/p>\n<p>But he also goes on to remind us that all real estate is local: “In November of 2018, in Phoenix, the market share of all iBuyers was 5 percent.”<\/p>\n<p>Zillow’s Instant Offer generated 20,000 Phoenix listing leads in its first four months in the market. That’s 20,000 homeowners in one city who actually clicked through and requested an offer from Zillow, DelPrete explains.<\/p>\n<p>Impressive, right?<\/p>\n<h2><strong>Is there any good news for agents in all this?<\/strong><\/h2>\n<p>Let’s get back to those 20,000 leads that Zillow generated. DelPrete says that the company purchased only one percent of the homes.<\/p>\n<p>Unlike agents, however, Zillow doesn’t <a href=\"\/blog\/the-biggest-mistakes-agents-make-with-leads\/\">throw away leads<\/a> that don’t or can’t immediately transact. In fact, they’ll be selling 99 percent of those 20,000 leads to you guys.<\/p>\n<p>These are leads who were motivated enough to ask Zillow for an evaluation of their home’s value for possible participation in the Instant Offer program. So, motivation is the bonus.<\/p>\n<p>The downside to these leads is that they’ll most likely haggle over your commission and they may be unrealistic about their price (thus why Zillow didn’t work with them).<\/p>\n<h2><strong>How can agents compete?<\/strong><\/h2>\n<p>This is one of those question that stumps the industry. Many agents feel that they don’t need to compete.<\/p>\n<p>“Because the one thing startups can’t disrupt is the real estate agent,” according to Henry Grabar, staff writer for <a href=\"https:\/\/slate.com\/technology\/2018\/06\/redfin-zillow-and-opendoor-cant-disrupt-real-estate-agents-and-may-not-want-to.html\">Slate.com’s Moneybox<\/a><\/p>\n<p>Perhaps making just a few changes, if performed en masse, is the answer.<\/p>\n<p>Presenting your services in a more positive light will go a long way in combatting the lure of convenience and the “hassle-free” process that iBuyers promote.<\/p>\n<p>Sure, selling a home is somewhat of a hassle. Remind potential listing clients that with the right agent, it can be a smooth process and bring in top dollar for the home.<\/p>\n<h2><strong>In short, watch your words.<\/strong><\/h2>\n<p>I recently read a real estate blog post that began with an entire paragraph about just how much of a hassle selling a home can be.<\/p>\n<p>“Selling your house can be one of the most stressful events of your life,” it begins. Then, there’s the attempt to scare the you-know-what out of the seller by reminding him or her that the home will be open to “total strangers.”<\/p>\n<p>The negativity doesn’t stop there, though. The third sentence reminds the seller that “you’re facing the daunting task of moving in the (hopefully near) future, and you’re worried about the finances of selling your home.”<\/p>\n<p>Not content with reminding the reader that moving is a “daunting task,” the writer also felt the need to slip in a hint that the home <em>may<\/em> not sell in the near future.<\/p>\n<p>Finishing up this completely stupefying paragraph is the reminder that “uncertainty” underlies the entire home sale process: “will you find a good buyer in time, will you get a fair value for your home, and will the sale of your home go smoothly?”<\/p>\n<p>I don’t know about you, but after reading this, I’d sincerely consider going with an iBuyer.<\/p>\n<p>I get it. If you explain just how complex the home sale process is, sellers will be less likely to go FSBO.<\/p>\n<p>But FSBO isn’t their only option in 2019. While some agents are sounding like Debbie Downer in their marketing copy, the iBuyer folks are all sunshine and unicorns in explaining how easy-breezy their process is.<\/p>\n<h2><strong>Use iBuyers&#8217; ignorance to your benefit.<\/strong><\/h2>\n<p>You, as a boot on the ground, have the experience of working directly with real estate consumers. Perhaps decades of this experience. You know what they want and what they don’t want.<\/p>\n<p>Those at the top of the iBuyer chain do not. In fact, at least in Zillow’s case, they’ve vastly misunderstood the typical home seller. Jeremy Wacksman, Zillow’s chief marketing officer, claims to know exactly what home sellers want.<\/p>\n<p>“What they care about is pushing the button and making magic happen,” he claims.<\/p>\n<p>“Magic, in this case, means selling your house in a matter of days, even at a small discount,” Grabar adds.<\/p>\n<p>Can anyone be more out of touch with the average real estate consumer? Yes, home sellers would LOVE to have a “magic button.” Their idea of “magic,” however, is selling the house in a matter of days FOR FULL MARKET VALUE.<\/p>\n<p><strong>How many sellers have you dealt with who were willing to take one cent less than what their home is worth just to have it sell quicker? <\/strong><\/p>\n<p>Let’s agree that from here forward, your marketing to home sellers will be more positive about the process. Remember:<\/p>\n<ul>\n<li>Your method of determining their home’s value is far superior to an AVM.<\/li>\n<li>Even Spencer Rascoff’s home value wasn’t nailed by Zillow’s AVM.<\/li>\n<li>Since iBuyer fees are higher than real estate commissions (at least for now), home sellers working with an agent will not only make more money from the sale but have professional representation as well.<\/li>\n<\/ul>\n<p>Personally? We don’t think you have anything to worry about.<\/p>\n<p>The lazy agent, the complacent agent and the one who is in it just for the money?<\/p>\n<p>They should worry.<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>After decades of coasting along relatively comfortably, the real estate industry is facing an onslaught of disruptors. It started with the listing portals – Zillow, Trulia and the others. In the beginning, they were primarily lead generators (and lead sellers) and they stayed away from actual transactions. Then, OpenDoor launched in 2014 and the industry [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":57711,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[83,803],"tags":[],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/57709"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=57709"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/57709\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media\/57711"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=57709"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=57709"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=57709"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}