{"id":57807,"date":"2019-09-23T07:49:43","date_gmt":"2019-09-23T14:49:43","guid":{"rendered":"http:\/\/www.marketleader.com\/?p=57807"},"modified":"2019-09-23T10:58:34","modified_gmt":"2019-09-23T17:58:34","slug":"5-ways-to-get-more-real-estate-leads-this-fall","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/5-ways-to-get-more-real-estate-leads-this-fall\/","title":{"rendered":"5 Ways to Get More Real Estate Leads this Fall"},"content":{"rendered":"<h1>1. Recognize That Fall Isn’t All That Different<\/h1>\n<p>Mindset is everything. Spring and summer may be widely regarded as the height of the home buying season, but that doesn’t mean real estate transactions don&#8217;t close outside of that time frame. The lead generation strategies you find effective during the spring and summer should also work throughout the fall, even if they don’t work quite as well. Fall might slow down a bit, but leads active in the market during this time are just as motivated.<\/p>\n<p>Keep this in mind as you go about generating leads for your business this fall. <strong>Believing that you won’t be successful during this time might make that a reality.<\/strong><\/p>\n<blockquote>\n<h5>“The single most important thing for fall prospecting is to get your mindset right before doing any of it. If you don’t think there is much of a fall market, you won’t get much business. If you believe in the power of the fall market, or the holiday market, just talking about the positives of those markets in your blog posts and  conversations can uncover buyers.” &#8211; <strong>Chris Ann Cleland, Bristow, VA<\/strong><\/h5>\n<\/blockquote>\n<h1>2. Use Football Games as Powerful Networking Opportunities<\/h1>\n<p>For a significant portion of Americans, fall is devoted to football. From poring over team updates and tinkering with fantasy football lineups during the workweek to watching and attending as many games as possible over the weekend, the passion diehard football fans have for the sport causes it to take over their lives as soon as fall comes around.<\/p>\n<p>This passion gives real estate professionals ample opportunities to create well-attended networking events. Have an extra-large living room and TV? Invite past clients over to watch the local team play an away game. Have a grill and other tailgating accouterments? Set them up at a tailgating hotspot on game day, put on your name tag, stock up on business cards, and reel in multitudes of hungry football fans with greasy stadium grub. There’s perhaps no better way to create a lasting connection with a football fan – one that could result in future closed deals – than chatting about the sport with them with beers and brats in hand.<\/p>\n<p>Another idea: start a private fantasy football league and invite the clients you know would join, then open the league up to their friends. This is great for engagement and you’ll create long-term connections (read: long-term business and referrals), while having fun at the same time.<\/p>\n<blockquote>\n<h5>“We host a football party for our clients for a game when our Carolina Panthers are out of town playing during the fall and winter months. Keep on keepin’ on – don’t change a thing, but add the football!” <strong>&#8211; Debe Maxwell, Charlotte, NC<\/strong><\/h5>\n<\/blockquote>\n<h1>3. Send Season-Specific Postcards<\/h1>\n<p>Compared to modern digital marketing strategies, real estate postcards are admittedly quite “old school.” But as this article describes, their ability to drum up new clients can’t be denied. One Massachusetts agent was able to get six new listings by sending out 200 “just listed” postcards to homeowners in her farm area.<\/p>\n<h4>There are plenty of seasonal topics that can be used in autumn postcards. Here are a few:<\/h4>\n<ul>\n<li>Provide a quick quarterly update about the health of the local housing market with a one-sentence executive summary (e.g., “Sell now because home prices are expected to fall this fall”) and information about how to find more detailed real estate statistics on your website.<\/li>\n<li>Make an impression with parents whose children have recently gone back to school by encouraging them to visit your website and learn how much homes in the best school districts in the area are selling for (“Get an Affordable New Home – and a Priceless Education for Your Children”). The best real estate websites, like Market Leader’s customizable websites with MLS listings, offer school ratings in addition to MLS listings.<\/li>\n<li>A Halloween-themed postcard that features a photo of children wearing spooky costumes and sporting the headline “Halloween Is Scary – Buying a Home Isn’t” that shares how you can help them find and purchase their dream home.<\/li>\n<\/ul>\n<blockquote>\n<h5>“We send out ‘fall backward’ postcards reminding our prospects to turn back their clocks, and gave them helpful tips on preparing their homes for the colder months like getting their furnace serviced and cleaned, cleaning the gutters, and changing batteries in smoke detectors.”<strong> &#8211; David Hunter, Cleveland, OH<\/strong><\/h5>\n<\/blockquote>\n<h1>4. With Summer Over, Pop-By Season Has Begun<\/h1>\n<p>With the summer over and people spending less time away from home on vacation or doing outdoor activities, fall is a perfect time to pop by the homes of former clients or people in your farm area to drop off seasonal gifts. A quick, friendly, and conversational visit will be sufficient to keep you top of mind and give you the chance to remind them that, even though the spring and summer buying season is over, it can still be a great time to buy or sell a home.<\/p>\n<h4>Here some ideas for relatively inexpensive seasonal gifts you can give out during fall pop-bys:<\/h4>\n<ul>\n<li>Pumpkin spice cookie mix for Halloween.<\/li>\n<li>Electric turkey carving knife for Thanksgiving.<\/li>\n<li>Nice bottles of gift-wrapped beer and branded bottle openers for Oktoberfest.<\/li>\n<li>Fancy hot cocoa or spiced apple cider for warding off chilly fall weather.<\/li>\n<\/ul>\n<h1>5. Organize a Thanksgiving Canned Food Drive<\/h1>\n<p>Canned food drives offer a great way to give back to your community by feeding the less fortunate during a time of the year when they are particularly vulnerable. Organizing a canned food drive will also give you new ways of incorporating novel messaging into your marketing materials that can start conversations with unresponsive prospects and leads. For example, a lead who hasn’t responded to emails offering free housing market reports or alerting them to<br \/>\nnoteworthy new listings might be more prone to starting a conversation with you after responding to an email about your canned food drive that promises to match any donation they make.<\/p>\n<p>For our complete list of fall marketing ideas, download the <a href=\"http:\/\/success.marketleader.com\/l\/42972\/2018-09-07\/79ynwg\">Fall Lead Generation Guide<\/a>.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>1. Recognize That Fall Isn’t All That Different Mindset is everything. Spring and summer may be widely regarded as the height of the home buying season, but that doesn’t mean real estate transactions don&#8217;t close outside of that time frame. The lead generation strategies you find effective during the spring and summer should also work [&hellip;]<\/p>\n","protected":false},"author":51,"featured_media":57813,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[34],"tags":[],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/57807"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/51"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=57807"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/57807\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media\/57813"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=57807"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=57807"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=57807"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}