{"id":57825,"date":"2019-09-26T06:00:37","date_gmt":"2019-09-26T13:00:37","guid":{"rendered":"http:\/\/www.marketleader.com\/?p=57825"},"modified":"2019-09-26T07:00:42","modified_gmt":"2019-09-26T14:00:42","slug":"market-leader-pro-launches-in-keller-williams-marketplace","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/market-leader-pro-launches-in-keller-williams-marketplace\/","title":{"rendered":"Market Leader Pro Launches in Keller Williams MarketPlace"},"content":{"rendered":"<h1>All KW associates now have access to integrated technology with Market Leader tools through Keller Williams&#8217; MarketPlace.<\/h1>\n<p><img loading=\"lazy\" class=\"size-full wp-image-57827 alignright\" src=\"http:\/\/www.marketleader.com\/wp-content\/uploads\/2019\/09\/kwCommand1.jpg\" alt=\"\" width=\"399\" height=\"239\" \/><\/p>\n<p><strong>September 26, 2019 BELLVUE, WA<\/strong> &#8211; Market Leader, a Premier Platinum Partner in the Keller Cloud Innovator Program (KCIP), announced today that its professional suite of tools, Market Leader Professional (Market Leader Pro) has launched in the KW MarketPlace, an app store on the Keller Cloud platform.<\/p>\n<p>“We’ve been technology partners with Keller Williams since 2011, with the shared goal of providing agents solutions that increase productivity and help them manage and grow their businesses,” said Robert Vickers, General Manager of Market Leader.<\/p>\n<p>“We’ve continued to work closely with Keller Williams to provide customizable, agent-owned websites, powerful insights that drive better business decisions and increased profits, and robust agent branding— integrated seamlessly with Command. We’re excited to continue to deliver KW associates custom and integrated solutions that they can leverage to generate and close more business through the Keller Cloud MarketPlace,” said Vickers.<\/p>\n<p>KW associates can now access Market Leader tools that seamlessly integrate with the Keller Cloud platform. Market Leader Pro drives increased productivity and sales with fully customizable websites, exclusive buyer and seller leads, deep website and contact insights, and marketing automation—all fully integrated, seamlessly syncing lead and contact data, with Command, KW’s smart CRM-plus solution.<\/p>\n<p>Designed to integrate into Command and provide KW associates additional features to grow their businesses, Market Leader Pro delivers powerful agent branding and a seamless consumer experience:<\/p>\n<p><img loading=\"lazy\" class=\" wp-image-57829 alignright\" src=\"http:\/\/www.marketleader.com\/wp-content\/uploads\/2019\/09\/yourWebsite.png\" alt=\"Keller Wiliams website screenshot of homepage with beautiful house\" width=\"313\" height=\"177\" \/><\/p>\n<p style=\"padding-left: 30px;\">● Fully customizable and mobile-responsive IDX websites—with agent-owned domains—designed to capture leads and deliver custom consumer experiences<br \/>\n● Deep insights on contacts and website visitors that deliver consumer timeline and buyer intent signals<br \/>\n● Robust agent-branded marketing and automation with real-time listing alerts, automated campaigns and listing marketing<br \/>\n● Access to exclusive buyer and seller leads and SEM services<\/p>\n<p>To celebrate this launch, Market Leader is offering Pro at a discount exclusively to KW associates who sign up by October 31. For more information, KW associates can visit the KW MarketPlace within Command or <a href=\"http:\/\/success.marketleader.com\/l\/42972\/2019-09-13\/7knpzv\">click here<\/a>.<\/p>\n<p><strong>About Market Leader<\/strong><br \/>\nA pioneer in lead generation, custom websites, CRM, and marketing software, Market Leader provides innovative cloud-based sales and marketing solutions for the real estate industry. Since 1999, Market Leader has helped hundreds of thousands of real estate professionals succeed and grow their businesses. Today, Market Leader powers more than 250,000 agents, teams, brokerages, and franchises across the United States and Canada. Market Leader is part of the Constellation Real Estate Group, which is a division of Constellation Software, Inc. The Constellation Real Estate Group acquires and invests in real estate software brands that are committed to providing long-term solutions and partnerships with franchises, brokers, agents, MLSs, and associations. Over 500,000 real estate agents, teams, and brokerages across North America rely on CREG’s products and services to power, manage, and grow their businesses.<br \/>\nFor more information on the Constellation Real Estate Group, visit: <a href=\"https:\/\/www.constellationreg.com\">https:\/\/www.constellationreg.com<\/a><\/p>\n<p><em>This release originally appeared on <a href=\"http:\/\/bit.ly\/2lCLmno\">PR Web<\/a>. <\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>All KW associates now have access to integrated technology with Market Leader tools through Keller Williams&#8217; MarketPlace. September 26, 2019 BELLVUE, WA &#8211; Market Leader, a Premier Platinum Partner in the Keller Cloud Innovator Program (KCIP), announced today that its professional suite of tools, Market Leader Professional (Market Leader Pro) has launched in the KW [&hellip;]<\/p>\n","protected":false},"author":51,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[83],"tags":[],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/57825"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/51"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=57825"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/57825\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=57825"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=57825"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=57825"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}