{"id":57877,"date":"2019-12-10T06:45:10","date_gmt":"2019-12-10T14:45:10","guid":{"rendered":"http:\/\/www.marketleader.com\/?p=57877"},"modified":"2019-12-11T09:05:51","modified_gmt":"2019-12-11T17:05:51","slug":"market-leader-launches-comprehensive-website-customization-without-the-cost","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/market-leader-launches-comprehensive-website-customization-without-the-cost\/","title":{"rendered":"Market Leader Launches Comprehensive Website Customization Without the Cost"},"content":{"rendered":"<p>All-new real estate websites include limitless customization options, allowing agents to design websites to best reflect their brand and digital presence without the cost of a web developer.<\/p>\n<p><strong>DECEMBER 10, 2019 BELLEVUE, WA: <\/strong>Market Leader, the pioneer in lead generation and real estate technology, has announced the launch of a major upgrade, featuring all-new customizable websites, available today for its 250,000+ users. With a highly intuitive interface, Market Leader sets a new standard in custom real estate websites — allowing agents to create a unique digital presence without incurring the additional cost of hiring web developers.<\/p>\n<p>Agents can create and add content pages, configure website navigation, change page designs and style, create a blog, and tailor both featured properties and communities served to best market their business and listings.<\/p>\n<p>The new websites were developed to be modified with ease using new proprietary widgets. With modern designs, agents can create content-rich, custom websites without any coding or HTML knowledge.<\/p>\n<p><strong>Advanced modifications made easy with proprietary widgets: <\/strong><\/p>\n<ul>\n<li>Drag-and-drop interface with multi-device preview and visualization<\/li>\n<li>In-line and on-page editing for both desktop and mobile devices<\/li>\n<li>Numerous layout options and content cards to highlight other pages on the website including featured properties, blog, communities served, and more<\/li>\n<li>Custom content to easily add video, text, images, and links<\/li>\n<li>Image library with hundreds of licensed photos to choose from as well as personal image library<\/li>\n<\/ul>\n<p>In addition to the new website designs and features, Market Leader has launched an easy-to-use Website Setup Wizard to guide agents through the configuration process, facilitating effortless customization, instantly.<\/p>\n<p>“Market Leader has delivered technology solutions to help real estate professionals build their businesses for over 20 years,” said Robert Vickers, General Manager at Market Leader. “With lead generation at our core, we had already built a comprehensive platform for our customers to manage and grow their businesses and, today, they can also tailor their digital presence to reflect their brand and differentiate themselves from competitors—resources we believe to be unmatched in the marketplace.”<\/p>\n<p>“We’re excited to offer our customers infinitely customizable, IDX-enabled, lead-generating websites that establish and maintain brand consistency, without the additional costs often associated with custom website design.”<\/p>\n<p>The new websites launched today and are available to all Market Leader customers at no additional cost.<\/p>\n<p><strong>About Market Leader<br \/>\n<\/strong>A pioneer in lead generation, custom websites, CRM, and marketing software, Market Leader provides innovative cloud-based sales and marketing solutions for the real estate industry. Since 1999, Market Leader has helped hundreds of thousands of real estate professionals succeed and grow their businesses. Today, Market Leader powers more than 250,000 agents, teams, brokerages, and franchises across the United States and Canada. Market Leader is part of the Constellation Real Estate Group, a division of Constellation Software, Inc. The Constellation Real Estate Group acquires and invests in real estate software brands that are committed to providing long-term solutions and partnerships with franchises, brokers, agents, MLSs, and associations. Over 500,000 real estate agents, teams, and brokerages across North America rely on CREG’s products and services to power, manage, and grow their businesses.<br \/>\nFor more information on the Constellation Real Estate Group, visit: <a href=\"https:\/\/www.constellationreg.com\/\">https:\/\/www.constellationreg.com<\/a><\/p>\n<p><em>This press release originally appeared on <a href=\"http:\/\/bit.ly\/2E1oDa0\">PR Web<\/a>. <\/em><\/p>\n<p><strong> <\/strong><\/p>\n","protected":false},"excerpt":{"rendered":"<p>All-new real estate websites include limitless customization options, allowing agents to design websites to best reflect their brand and digital presence without the cost of a web developer. DECEMBER 10, 2019 BELLEVUE, WA: Market Leader, the pioneer in lead generation and real estate technology, has announced the launch of a major upgrade, featuring all-new customizable websites, [&hellip;]<\/p>\n","protected":false},"author":51,"featured_media":57879,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[51],"tags":[],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/57877"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/51"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=57877"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/57877\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media\/57879"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=57877"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=57877"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=57877"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}