{"id":588,"date":"2010-10-20T12:31:52","date_gmt":"2010-10-20T20:31:52","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=588"},"modified":"2021-11-30T11:40:35","modified_gmt":"2021-11-30T19:40:35","slug":"are-you-reboot-ing-your-real-estate-business-for-2011","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/are-you-reboot-ing-your-real-estate-business-for-2011\/","title":{"rendered":"Are you &quot;REBoot-ing&quot; your real estate business for 2011?"},"content":{"rendered":"<p>Guest Post By: Tom Kelly<\/p>\n<p>Salespersons seem to be more analytical and reflective in the fourth quarter of the year. They look at performance sheets, seek tools to make them better, them make New Year’s Resolutions. (Why do you think the Realtors hold their annual convention in November?)<\/p>\n<p>Some of them got a head start this year with the helpful Agent Reboot series sponsored by Inman News. These one-day marketing and technology seminars for brokers and agents stressed that making a difference in the neighborhood usually makes a difference in the pocketbook.<\/p>\n<p>For example, attendees “got” the importance of social media when Dale Chumbley, an agent with <a href=\"https:\/\/prunw.com\/\">Prudential NW Properties<\/a> in Vancouver, Washington said social media for generated 40 percent of his business. His blog “365 Things to Do in Vancouver, Washington” has become a national model and features basic information about the Vancouver area without attempting to sell anything.<\/p>\n<p>“It simply got people interested, and I listened,” Chumbley said. “It was a way for them to participate. For me, it could eventually become a way to meet a person face-to-face. That’s my goal with all social media – to eventually set up a face-to-face meeting.”<\/p>\n<p>An important element of the Reboot series was that portions were aimed at social media non-believers and presented by former non-believers.<\/p>\n<p>Michael McClure, chief executive of <a href=\"https:\/\/professionalone.com\/\">Professional One Realtors<\/a>, thought Twitter “was the dumbest, most narcissistic thing ever invented.’’ Now, 18 months later, it’s the backbone of his business.<\/p>\n<p>“It’s all about consistent content creation,” McClure said. “It’s about relationships, not the transaction.”<\/p>\n<p>When I started writing about reverse mortgages for seniors 10 years ago, the most successful loan reps said that industry was all about providing information and hand-holding with no expectations of an immediate transaction. Today’s residential real estate marketing is much the same.<\/p>\n<p><em>Tom Kelly is a syndicated columnist and talk show host. His latest work “Bargains Beyond the Border” will soon be available.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Guest Post By: Tom Kelly Salespersons seem to be more analytical and reflective in the fourth quarter of the year. They look at performance sheets, seek tools to make them better, them make New Year’s Resolutions. (Why do you think the Realtors hold their annual convention in November?) Some of them got a head start [&hellip;]<\/p>\n","protected":false},"author":6,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[27,36],"tags":[],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/588"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=588"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/588\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=588"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=588"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=588"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}