{"id":58851,"date":"2020-05-21T16:59:45","date_gmt":"2020-05-21T23:59:45","guid":{"rendered":"http:\/\/www.marketleader.com\/?p=58851"},"modified":"2022-01-26T12:55:49","modified_gmt":"2022-01-26T20:55:49","slug":"real-estate-search-activity-rebounds-exceeds-pre-covid-levels","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/real-estate-search-activity-rebounds-exceeds-pre-covid-levels\/","title":{"rendered":"Real Estate Search Activity Rebounds, Exceeds Pre-COVID Levels"},"content":{"rendered":"<p>The majority of the country is approaching its third month of a new, post-pandemic normal. Some states are easing shelter-in-place (SIP) orders, while others are extending and restricting even further.<\/p>\n<p>Google searches for “homes for sale” fell over 30% from February to March in the wake of the coronavirus’ entrance to the U.S., the World Health Organization declaring a global pandemic, and inaugural SIP orders. Along with consumer home-search behavior declining, the stock market plummeted and the Federal Reserve slashed mortgage rates in an attempt to stimulate investor activity.<\/p>\n<p>Pre-pandemic consumer search volume for the Real Estate category in 2020 peaked in mid-February at 81 points before falling 46% to 44 points in mid-March, as the effects of COVID began to take a toll.<\/p>\n<p>Understandably, the real estate industry was shaken. Those who witnessed the Great Recession of 2008 are likely plagued by similar encounters with plummeting stocks, threats of corporate bankruptcy and economic collapse. No one could be sure what the future held; whether the spring 2020 seller’s market was lost or if activity would cease entirely.<\/p>\n<p>Despite an uncertain economic outlook, volatile stock market, and over <a href=\"https:\/\/www.bls.gov\/news.release\/pdf\/empsit.pdf\">38 million<\/a>Americans filing for unemployment benefits in the past nine weeks, the real estate market has already begun to recover.<\/p>\n<p>Consumer search volume for “homes for sale” has now rebounded to <i>above<\/i> pre-COVID levels. As of May 17th, U.S. search activity in the Real Estate category was continuing to rise and search volume for “homes for sale” has hit 100 points, the highest monthly search volume it’s ever been.<\/p>\n<div id=\"attachment_58853\" style=\"width: 845px\" class=\"wp-caption aligncenter\"><img aria-describedby=\"caption-attachment-58853\" loading=\"lazy\" class=\"wp-image-58853 size-full\" src=\"https:\/\/www.marketleader.com\/wp-content\/uploads\/2020\/05\/GT20200521-Consumer-Search-Volume-Index.png\" alt=\"Google Trends Real Estate Search Volume COVID\" width=\"835\" height=\"503\" \/><p id=\"caption-attachment-58853\" class=\"wp-caption-text\">Data source: Google Trends<\/p><\/div>\n<p>Despite a fast-recovering market, agent activity is not rebounding as quickly as consumer search volume and is still down 12-15% from pre-COVID levels.<\/p>\n<p>There is <a href=\"\/blog\/real-estate-opportunities-to-seize-during-the-pandemic\/\">opportunity to be seized<\/a>.<\/p>\n<p>We surveyed thousands of agents last month to understand what successes they were seeing, what they were doing to engage their markets. We learned a lot. The biggest takeaway from survey responses was this:<\/p>\n<blockquote>\n<h3>The only agents who aren’t seeing any success right now are those doing nothing.<\/h3>\n<\/blockquote>\n<p><b>To recap, here’s what we learned<\/b>:<\/p>\n<ul>\n<li style=\"font-weight: 400;\">51% of agents are making care calls regularly and of those agents, 46% are generating new business.<\/li>\n<li style=\"font-weight: 400;\">25% of agents are leveraging social media to stay in touch with their sphere and continue to market their listings; 35% of which are generating new business.<\/li>\n<li style=\"font-weight: 400;\">Only 5% of agents are investing in paid <a href=\"\/products\/real-estate-leads\/\">lead generation<\/a> services, but 75% of them are generating new business.<\/li>\n<\/ul>\n<p>Albeit cautiously, the real estate industry and markets across the country are rebounding. There are less active agents and those who are still active are less productive. The need for consumers to buy and sell real estate is not dependent on your willingness to show up. Transactions will close whether with you or your competition.<\/p>\n<p>The real estate industry is resilient. Those who adapt and innovate to serve their clients in a shifting market are going to reap the rewards long far into a post-pandemic world.<\/p>\n<p>We’ll continue to publish updated information, trends and resources as situations evolve. If you’ve got any successes, strategies or just positive stories to share as they relate to the global environment today – please share! We’d love to feature you and share your story with the industry.<\/p>\n<p><b>Please note: Official guidance in regard to COVID-19 is constantly changing. For the most up-to-date and accurate recommendations for your area, please refer to the CDC and your local healthcare authorities.<\/b><\/p>\n","protected":false},"excerpt":{"rendered":"<p>The majority of the country is approaching its third month of a new, post-pandemic normal. Some states are easing shelter-in-place (SIP) orders, while others are extending and restricting even further. Google searches for “homes for sale” fell over 30% from February to March in the wake of the coronavirus’ entrance to the U.S., the World [&hellip;]<\/p>\n","protected":false},"author":51,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[841],"tags":[],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/58851"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/51"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=58851"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/58851\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=58851"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=58851"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=58851"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}