{"id":58934,"date":"2020-07-24T09:44:28","date_gmt":"2020-07-24T16:44:28","guid":{"rendered":"http:\/\/www.marketleader.com\/?p=58934"},"modified":"2020-07-24T09:46:47","modified_gmt":"2020-07-24T16:46:47","slug":"5-post-shift-takeaways-from-a-powerhouse-real-estate-agent","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/5-post-shift-takeaways-from-a-powerhouse-real-estate-agent\/","title":{"rendered":"5 Post-Shift Takeaways from a Powerhouse Real Estate Agent"},"content":{"rendered":"<h1><span style=\"font-weight: 400;\">Five actionable insights to heed today as you navigate a new normal. <\/span><\/h1>\n<p><span style=\"font-weight: 400;\">Feelings of panic, hesitation, and fear pervaded the real estate industry through most of the spring selling season. Now that the dust has settled and markets are rebounding nationwide, summer selling season is upon us and it’s time to kick your business into gear.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">We sat down (<\/span><i><span style=\"font-weight: 400;\">virtually<\/span><\/i><span style=\"font-weight: 400;\">) with Aubie Pouncey – a powerhouse agent and team leader serving the greater Seattle area – to discuss how tech will continue to shape our industry, the data that drives it, and how you can leverage both to have the right conversations, and dominate your market in today’s new normal.<\/span><\/p>\n<h2><span style=\"font-weight: 400;\">1. Technology is here to stay.<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">The real estate industry has long struggled to adopt technology and if there’s one glaring effect the pandemic has had on industries worldwide is the acceleration of <\/span><span style=\"font-weight: 400;\">technology adoption. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Technology will continue to drive the real estate industry, post-pandemic. <\/span><span style=\"font-weight: 400;\">Consumers were already interacting with the market digitally, leaning on agents to facilitate negotiations and the transaction itself; agents who struggled to adopt (and adapt) before can now lean into technology to be a bigger part of the consumer experience. <\/span><\/p>\n<blockquote>\n<h3><span style=\"font-weight: 400;\">Aubie says: Consider an agent whose largest source of business was open houses. All of their eggs were in one basket, and now they can&#8217;t get in front of people. <\/span><\/h3>\n<\/blockquote>\n<p><span style=\"font-weight: 400;\">It’s an agent’s job to take things digital faster than their competitors and find ways to provide value in new mediums. <\/span><\/p>\n<h2><span style=\"font-weight: 400;\">2. Today&#8217;s consumer is the same, but different.<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Consumer behavior has been changing for decades. Despite a lot of agents who, pre-pandemic, were hanging on to the idea of real estate being a belly-to-belly industry, it just isn’t anymore. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Pre-pandemic, consumers already preferred a more digital experience. They are empowered and can browse homes online and conduct their own research. Today, those agents who have been slow to understand changing consumer expectations are forced to adapt and we think it will serve them well. <\/span><\/p>\n<blockquote>\n<h3><span style=\"font-weight: 400;\">Aubie says: Open all doors of communication and see which one they walk back through.<\/span><\/h3>\n<\/blockquote>\n<p><span style=\"font-weight: 400;\">Call, text and email any new leads and let them interact with you on their terms. Give them options and let them know you are always there. No pressure is key. It is about giving them options and doors to walk through. <\/span><\/p>\n<h2><span style=\"font-weight: 400;\">3. When you make it about you, you lose.<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">Don&#8217;t let your own insecurity ruin a deal. Provide resources and value. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">You can&#8217;t force someone into the market, but you can provide them with resources and information that helps them make the best decisions for can themselves. If they don&#8217;t end up working with you, but you provided them with value, they&#8217;ll remember that down the road &#8211; whether their situation changes and they become ready to work with an agent or if they cross paths with someone looking to buy or sell. The seeds you sow today can be harvested for years to come. <\/span><\/p>\n<blockquote>\n<h3><span style=\"font-weight: 400;\">Aubie says: It&#8217;s about the model and the process.<\/span><\/h3>\n<\/blockquote>\n<h2><span style=\"font-weight: 400;\">4. Let the numbers tell the story.<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">What is driving the market? What is driving YOUR market? People care about how things acutely affect them. It’s not about the overall market, it&#8217;s about THEIR market.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Become the local economist and share market data as it relates to them. Are you a buyers agent? What does the data in your market say about new listings and mortgage rates? Are you a listing agent? What does the data say about buyer activity and how record low mortgage rates are creating an increased demand? <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Use data to tell your market’s story as it relates to your audience. Distill the numbers in a way that both makes sense and eases concerns. Note: y<\/span><span style=\"font-weight: 400;\">ou’ve got to understand the data so you can share it. Get comfortable with it and spend time understanding it. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">Don&#8217;t underestimate how easy it is to access data. Google, local REALTORS associations, MLSs and your brokerage are all great resources. <\/span><\/p>\n<h2><span style=\"font-weight: 400;\">5. The new world has its sights set on rural. <\/span><\/h2>\n<p><span style=\"font-weight: 400;\">One glaring impact the pandemic has had across the country: people no longer want to be in densely populated areas. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">People with underlying health issues and compromised immune systems are relocating entirely. Large populations of people living in urban areas are now remote, free to live and work from anywhere. People who have options will exercise them.<\/span><\/p>\n<p>While the world starts to settle into our new, foreseeable normal, agents have a massive opportunity to step up and capitalize on some of the disruption caused a few short months ago.<\/p>\n<blockquote>\n<h3><span style=\"font-weight: 400;\">Aubie says: Pivot, find the market of the minute and connect with those people who need resources.<\/span><\/h3>\n<\/blockquote>\n<p>&nbsp;<\/p>\n<h6><strong>Disclaimer<\/strong>: Official guidance in regard to COVID-19 is constantly changing. For the most up-to-date and accurate recommendations for your area, please refer to the CDC and your local healthcare authorities.<\/h6>\n","protected":false},"excerpt":{"rendered":"<p>Five actionable insights to heed today as you navigate a new normal.  Feelings of panic, hesitation, and fear pervaded the real estate industry through most of the spring selling season. Now that the dust has settled and markets are rebounding nationwide, summer selling season is upon us and it’s time to kick your business into [&hellip;]<\/p>\n","protected":false},"author":51,"featured_media":58935,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[83],"tags":[],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/58934"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/51"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=58934"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/58934\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media\/58935"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=58934"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=58934"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=58934"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}