{"id":59670,"date":"2021-06-02T10:28:51","date_gmt":"2021-06-02T17:28:51","guid":{"rendered":"https:\/\/www.marketleader.com\/?p=59670"},"modified":"2021-06-14T11:34:51","modified_gmt":"2021-06-14T18:34:51","slug":"market-leader-launches-facebook-leads","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/market-leader-launches-facebook-leads\/","title":{"rendered":"Market Leader Launches Facebook Leads to Help Customers Generate Leads and Grow Their Sphere"},"content":{"rendered":"<h3>New Facebook Leads offering gets agents in front of consumers in their target markets, while removing barriers to entry and challenges of managing ads in complex Ads Manager.<\/h3>\n<p><center><script src=\"https:\/\/fast.wistia.com\/embed\/medias\/rfg317fbvk.jsonp\" async><\/script><script src=\"https:\/\/fast.wistia.com\/assets\/external\/E-v1.js\" async><\/script><\/center><\/p>\n<div class=\"wistia_responsive_padding\" style=\"padding: 56.25% 0 0 0; position: relative;\">\n<div class=\"wistia_responsive_wrapper\" style=\"height: 100%; left: 0; position: absolute; top: 0; width: 100%;\">\n<div class=\"wistia_embed wistia_async_rfg317fbvk seo=false videoFoam=true\" style=\"height: 100%; position: relative; width: 100%;\">\n<div class=\"wistia_swatch\" style=\"height: 100%; left: 0; opacity: 0; overflow: hidden; position: absolute; top: 0; transition: opacity 200ms; width: 100%;\"><img style=\"filter: blur(5px); height: 100%; object-fit: contain; width: 100%;\" src=\"https:\/\/fast.wistia.com\/embed\/medias\/rfg317fbvk\/swatch\" alt=\"\" aria-hidden=\"true\" \/><\/div>\n<\/div>\n<\/div>\n<\/div>\n<p>&nbsp;<\/p>\n<p>June 3, 2021<\/p>\n<p>BELLEVUE, WA: Market Leader, a leading provider of sales and marketing solutions in the real estate industry, today announced the launch of Facebook Leads. Available exclusively to Market Leader customers, Facebook Leads allows real estate professionals to get in front of Facebook’s 258 million active monthly users across the U.S. and Canada without having to build or manage advertising campaigns.<\/p>\n<p>Facebook Leads leverages Market Leader’s team of advertising experts to build and optimize targeted Facebook campaigns and generate leads for customers, alleviating the challenges associated with Facebook’s complex Ads Manager platform. Market Leader’s advertising team has decades of experience running high volumes of ads across multiple platforms, generating powerful insights and optimization that benefits customers.<\/p>\n<p>Agents remain in complete control of their budget and target markets, and can adjust their spend monthly as needs change. No contract is required to sign up.<\/p>\n<p>Market Leader eliminates the largest barrier to advertising on Facebook today by allowing customers who do not have Facebook accounts to take advantage of Facebook Leads.<\/p>\n<p>“Getting real estate agents in front of consumers looking to buy or sell a home has been at the core of what we do for over 20 years,” said Robert Vickers, General Manager of Market Leader. “Facebook Leads is another way for us to help our customers grow their sphere and capture leads, while removing the challenges that traditionally accompany Facebook advertising. We’re excited to provide our customers the benefits of social media advertising, without having to navigate the complexities of managing an additional platform or optimizing campaigns.”<\/p>\n<p>“Facebook Leads by Market Leader automatically markets my listings as soon as they hit the MLS and gets me in front of home buyers and sellers in my area,” said Elizabeth Avery, RE\/MAX Northwest REALTORS®, “I love that it feeds leads directly into my CRM and has taken the pain of managing ads off my plate, but gives me complete control over my monthly budget.”<\/p>\n<p>With one of the largest IDX footprints across North America, Market Leader uses existing MLS integrations to automatically create and adjust ads for both active and recently sold listings as agents get a new listing or sale, generating high volumes of hyper-targeted impressions on Facebook’s network of 258 million users. Additionally, home buying and selling guides, developed in partnership with top-producing agents, are used to attract buyers and sellers in target areas, optimized based on consumer behavior to deliver customers the most impressions to grow their sphere.<\/p>\n<p>Market Leader customers simply select their budget and target cities for Facebook Leads directly from their Market Leader system to get started.<\/p>\n<p><strong>About Market Leader <\/strong><\/p>\n<p>A pioneer in lead generation, custom websites, CRM, and marketing software, Market Leader provides innovative cloud-based sales and marketing solutions for the real estate industry. Since 1999, Market Leader has helped real estate professionals succeed and grow their businesses and today powers hundreds of thousands of agents, teams, brokerages, and franchises across the United States and Canada. Market Leader is part of the Constellation Real Estate Group, a division of Constellation Software, Inc. The Constellation Real Estate Group acquires and invests in real estate software brands that are committed to providing long-term solutions and partnerships with franchises, brokers, agents, MLSs, and associations. Over 500,000 real estate agents, teams, and brokerages across North America rely on CREG’s products and services to power, manage, and grow their businesses.<\/p>\n<p>For more information on the Constellation Real Estate Group, visit: <a href=\"https:\/\/www.constellationreg.com\/\">https:\/\/www.constellationreg.com <\/a><\/p>\n<p><em>This press release originally appeared on <a href=\"https:\/\/bit.ly\/3pdMb2c\">PRWeb.com<\/a>.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>New Facebook Leads offering gets agents in front of consumers in their target markets, while removing barriers to entry and challenges of managing ads in complex Ads Manager. &nbsp; June 3, 2021 BELLEVUE, WA: Market Leader, a leading provider of sales and marketing solutions in the real estate industry, today announced the launch of Facebook [&hellip;]<\/p>\n","protected":false},"author":51,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[51],"tags":[],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/59670"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/51"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=59670"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/59670\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=59670"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=59670"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=59670"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}