{"id":604,"date":"2010-10-28T13:17:20","date_gmt":"2010-10-28T21:17:20","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=604"},"modified":"2021-12-02T14:11:28","modified_gmt":"2021-12-02T22:11:28","slug":"how-to-use-social-media-to-market-your-listings","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/how-to-use-social-media-to-market-your-listings\/","title":{"rendered":"How to Use Social Media to Market your Listings"},"content":{"rendered":"<p>When I was asked to write a post about using social media to market listings, my eyes lit up with all the wonderful ways that social media can benefit your real estate business—and specifically marketing for your listings. The list in my head could fill the memory of your computer, but for the purpose of holding short attention spans, I have decided to limit this to only a few things. I’ll share more in a future post.<\/p>\n<p><strong>Use social media to spread the word. <\/strong>Let&#8217;s start with one of the greatest marketing lessons since marketing began: Word of Mouth is the best type of marketing there is. Post your listing on a social media website and let it go viral. According to Facebook the average person has 130 friends, and Realtors are far above average. If you post a listing and have one person share it, your 130 friends now becomes 260 and if 2 more friends share it you are quickly at an average of 520 people seeing your listing. It grows quickly.<\/p>\n<p>As you get your listing to go viral it starts to be seen by clients that are not even in your state. Your listing crosses the country in the blink of an eye and relocation clients start seeing what is available and who they want to talk to about properties in your area.<br \/>\n <br \/>\n<strong>Get social with your colleagues, too.<\/strong> Not only will your marketing hit the eyes and screens of potential clients but it will also get in front of your fellow Realtors. Who knows the people moving into your area better than other Realtors? Remember to market to them as well.<\/p>\n<p><strong>Advertise in social media.<\/strong> Ever notice those ads on the right side of Facebook? Did you know that those ads are target marketing? Did you know that you see different ads then I see? Are you married? Single? Engaged? Are you a man? A woman? What is your age? What company do you work for? What are your likes and hobbies? All of these things help target your listings to the client that you are after.<\/p>\n<p>Make sure horse lovers see your horse property and that swimmers see that property with the beautiful Olympic-sized pool. If you’d like to learn more about target advertising, consider earning your Internet Marketing Specialist Designation to learn more about all of these topics.<\/p>\n<p><strong>Use video. <\/strong>If a picture is worth a thousand words, what is a video worth? YouTube is a powerful social media tool that many people overlook. Take a video of your property, put a voiceover on it with the benefits of the property and post it on YouTube.<\/p>\n<p><strong>Link up. <\/strong>Have you learned how to link your Twitter, Facebook and YouTube accounts? These are lessons that you need to make sure that you are exposing your properties to as many eyes and screens as possible.<\/p>\n<p><strong>Specialize.<\/strong> During a session provided by the Internet Marketing Specialist Designation course it was shared that you need to be likable before anyone will &#8220;like&#8221; you. This goes for your videos, your comments, and your photos of the listing you are marketing! <a href=\"https:\/\/retechnology.com\/product-list\/14084-internet-marketing-specialist-designation\">Learn more by registering to earn your IMSD.<\/a><\/p>\n<p><strong>Optimize.<\/strong> You may have heard the term, SEO and you may not even know that it stands for Search Engine Optimization but it is very important and controls where you rank on Google, Bing and Yahoo searches (and all other searches). Clients can search social media sites such as Twitter and Facebook right from Google. Another term being used is Social Media Optimization (aka SMO, or social SEO) and this controls where you come up on the ranking on the social media sites. How will the partnership with Bing and Facebook change things? The more your friends &#8220;like&#8221; something the higher it will come up in your search on Bing.<\/p>\n<p>So get those listings on Facebook, Twitter and any and all other social media sites and just watch and see how social media can help market your listings!<\/p>\n<p>Chad Hyams<br \/>\n<em>Team Leader, Keller Williams Western Realty – Bellingham WA<\/em><em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>When I was asked to write a post about using social media to market listings, my eyes lit up with all the wonderful ways that social media can benefit your real estate business—and specifically marketing for your listings. The list in my head could fill the memory of your computer, but for the purpose of [&hellip;]<\/p>\n","protected":false},"author":33,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[34,35,36],"tags":[],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/604"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/33"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=604"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/604\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=604"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=604"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=604"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}