{"id":60929,"date":"2022-03-04T12:24:31","date_gmt":"2022-03-04T20:24:31","guid":{"rendered":"https:\/\/www.marketleader.com\/?p=60929"},"modified":"2022-03-04T12:36:31","modified_gmt":"2022-03-04T20:36:31","slug":"market-leader-named-among-real-estates-most-innovative-tech-companies-in-housingwires-2022-tech100","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/market-leader-named-among-real-estates-most-innovative-tech-companies-in-housingwires-2022-tech100\/","title":{"rendered":"Market Leader Named Among Real Estate’s Most Innovative Tech Companies in HousingWire’s 2022 Tech100"},"content":{"rendered":"<h2>The recognition follows a year of significant innovation and industry recognition.<\/h2>\n<p><strong><img loading=\"lazy\" class=\"size-medium wp-image-60932 alignright\" src=\"http:\/\/www.marketleader.com\/wp-content\/uploads\/2022\/03\/2022-HWTech100-RealEstate-Black-01-300x84.png\" alt=\"\" width=\"300\" height=\"84\" \/><br \/>\nMARCH 3, 2022 BELLEVUE, WASH:<\/strong> HousingWire has announced the 2022 Tech100 honorees, recognizing the most innovative technology companies in the real estate industry.<\/p>\n<p>The Tech100 is the only program in the real estate industry that highlights technology innovation and recognizes companies that continuously raise the bar. Outlining the most innovative and impactful organizations that provide solutions to the challenges that real estate professionals face every day, the Tech100 grows more competitive every year as the demand for technology in the industry continues to progress.<\/p>\n<p>“This year’s list of Tech100 honorees proves once again that innovation within housing is vital in differentiating the organizations who will thrive and those who will be left behind,” said Clayton Collins, CEO of HW Media. “This list spotlights the innovators that are making the housing sector better and more sustainable by increasing efficiency, improving experiences and bringing elasticity and improvements to age-old processes.”<\/p>\n<p>“Residential real estate has seen massive change the past few years, from accelerated technology adoption and innovation to the forced digitization in a traditionally belly-to-belly business, and I’m proud of the remarkable amount of work the Market Leader team has done to bring value to our agents and the clients they serve,” said Robert Vickers, General Manager at Market Leader. “As true technology partners, we’ve made it our mission to internalize the voice of our customer to provide solutions that help them drive meaningful connections and deliver exceptional experiences, as demonstrated by the recognition here.”<\/p>\n<p>Vickers was also named a <a href=\"https:\/\/www.rismedia.com\/newsmaker\/robert-vickers-2022-2\/\">Futurist<\/a> in RISMedia’s 2022 Newsmakers, recognized for his contributions to the real estate industry as a leader of change and driver of innovation.<\/p>\n<p><strong>About Market Leader<br \/>\n<\/strong>A pioneer in lead generation, custom websites, CRM, and marketing software, Market Leader provides innovative cloud-based sales and marketing solutions for the real estate industry. Since 1999, Market Leader has helped hundreds of thousands of real estate professionals grow their businesses by delivering solutions that drive meaningful connections for agents, teams, brokerages, and franchises across the United States and Canada. Market Leader is part of the Constellation Real Estate Group, a portfolio within the Perseus division of Constellation Software, Inc. Visit <a href=\"https:\/\/marketleader.com\">https:\/\/marketleader.com<\/a> to learn more.<\/p>\n<p><strong>About HousingWire<br \/>\n<\/strong>HousingWire is the most influential source of news and information for the U.S. mortgage and housing markets. Built on a foundation of independent and original journalism, HousingWire reaches over 60,000 newsletter subscribers daily and over 1.0 million unique visitors each month. Our audience of mortgage, real estate and fintech professionals rely on us to Move Markets Forward. Visit <a href=\"https:\/\/housingwire.com\">https:\/\/housingwire.com <\/a><\/p>\n<p><em>This release originally appeared on PRWeb.com<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>The recognition follows a year of significant innovation and industry recognition. MARCH 3, 2022 BELLEVUE, WASH: HousingWire has announced the 2022 Tech100 honorees, recognizing the most innovative technology companies in the real estate industry. The Tech100 is the only program in the real estate industry that highlights technology innovation and recognizes companies that continuously raise [&hellip;]<\/p>\n","protected":false},"author":51,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[51],"tags":[],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/60929"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/51"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=60929"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/60929\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=60929"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=60929"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=60929"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}