{"id":61374,"date":"2022-07-27T10:00:27","date_gmt":"2022-07-27T17:00:27","guid":{"rendered":"https:\/\/www.marketleader.com\/?p=61374"},"modified":"2022-09-06T18:03:50","modified_gmt":"2022-09-07T01:03:50","slug":"best-fsbo-scripts-for-realtors","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/best-fsbo-scripts-for-realtors\/","title":{"rendered":"7 Best FSBO Scripts for Real Estate Agents"},"content":{"rendered":"<p>How do you turn <em>&#8220;for sale by owner&#8221;<\/em> into <em>&#8220;for sale by you&#8221;<\/em>? With the help of these free FSBO scripts, real estate agents can automate their &#8220;pitch&#8221; for convincing homeowners that it&#8217;s wise to work with you instead. Sellers will walk away from the conversation feeling like you&#8217;re competent, capable, and the obvious person to work with if they decide to list with an agent instead.<\/p>\n<p>The key to success here is that you&#8217;re using FSBO scripts that work. Take a look at seven of the best scripts which you can make your own.<\/p>\n<h2 class=\"BlogH2\">Script #1: The &#8220;Reminder&#8221; Approach<\/h2>\n<p>This script is useful when you&#8217;re approaching FSBOs with properties that have been lingering on the market. You&#8217;re crafting a &#8220;wakeup call.&#8221; While the approach is friendly, you&#8217;re sounding the alarm on the failure that is happening.<\/p>\n<div style=\"background-color: #f6f6f6; padding: 20px 40px 20px 40px;\">\n<strong>AGENT:<\/strong> Hi! I&#8217;m calling about the home that&#8217;s been for sale for eight months. Are you the owner?<br \/>\n<strong>FSBO:<\/strong> Yes.<br \/>\n<strong>AGENT:<\/strong> I just wanted to reach out because I noticed that the property has been sitting. Is there something going on with it?<br \/>\n<strong>FSBO:<\/strong> We just haven&#8217;t gotten interest from serious buyers.<br \/>\n<strong>AGENT:<\/strong> I see. I would love to meet with you about connecting you with some serious buyers. I actually have a few buyers looking on your street.\n<\/div>\n<h2 class=\"BlogH2\">Script #2: The Ninja Selling Technique<\/h2>\n<p>This is a stealth technique that relies on the agent using a mix of curiosity and passivity to schedule a meeting in a very casual manner. It works best on FSBOs who may not necessarily know what they&#8217;re doing. As you&#8217;ll see, it&#8217;s effective because it plays to the seller&#8217;s insecurities about how effectively they&#8217;re actually marketing their property.<\/p>\n<div style=\"background-color: #f6f6f6; padding: 20px 40px 20px 40px;\">\n<strong>AGENT:<\/strong> Hi, this is John Smith. I&#8217;m a local real estate agent. I just had to reach out to ask how selling the property 123 Forest Lane is going. That&#8217;s one of the hottest parts of town right now. Are you getting tons of offers?<br \/>\n<strong>FSBO:<\/strong> We&#8217;ve had some interest.<br \/>\n<strong>AGENT:<\/strong> Any offers yet?<br \/>\n<strong>FSBO:<\/strong> No, no offers have come in yet.<br \/>\n<strong>AGENT:<\/strong> That&#8217;s unfortunate. Like I said, that neighborhood is usually really hot for sellers. I&#8217;m surprised to hear you haven&#8217;t had offers yet. Do you think you&#8217;d want to talk with an agent about where there might be a &#8220;disconnect&#8221; with how the property is being marketed?<br \/>\n<strong>FSBO:<\/strong> That might be okay.<br \/>\n<strong>AGENT:<\/strong> Honestly, my listings in your area usually don&#8217;t last for more than a week before I&#8217;m getting anywhere from two to a dozen offers. I&#8217;d be really curious to see why this house isn&#8217;t clicking with buyers. Are weekdays good for you? I have an opening on Thursday at 4 p.m.<br \/>\n<strong>FSBO:<\/strong> That works for me.<br \/>\n<strong>AGENT:<\/strong> Great! I look forward to seeing the property.\n<\/div>\n<h2 class=\"BlogH2\">Script #3: The Workaround<\/h2>\n<p>Even if a seller doesn&#8217;t want to work with an agent to list their home, they probably won&#8217;t turn down the opportunity to work with a buyer&#8217;s agent. You can use the fact that you have potential buyers to soften them up to the idea of paying the conventional commission for the buyer&#8217;s side.<\/p>\n<div style=\"background-color: #f6f6f6; padding: 20px 40px 20px 40px;\">\n<strong>AGENT:<\/strong> Hi, this is John Smith. Are you the owner of 123 Hickory Road?<br \/>\n<strong>FSBO:<\/strong> Yes.<br \/>\n<strong>AGENT:<\/strong> Great! I saw that you&#8217;re doing for sale by owner on this. Are you open to cooperating with a buyer&#8217;s agent to get offers?<br \/>\n<strong>FSBO:<\/strong> I think so.<br \/>\n<strong>AGENT:<\/strong> Let me clarify really quickly. That means that you&#8217;re okay with covering the commission on the buyer&#8217;s side if I&#8217;m bringing in a buyer who makes an offer?<br \/>\n<strong>FSBO:<\/strong> I&#8217;d be okay with that.<br \/>\n<strong>AGENT:<\/strong> Sounds great. I would really like to come see the property before I bring buyers along. Let&#8217;s set up a time.\n<\/div>\n<h2 class=\"BlogH2\">Script #4: The &#8220;Tick Tick&#8221; Approach<\/h2>\n<p>This is a subtle way to remind sellers that the clock is ticking! Inquiring about why they&#8217;re moving from the jump helps you establish how much pressure is at play. Next, you&#8217;re pivoting the conversation toward that pressure point.<\/p>\n<div style=\"background-color: #f6f6f6; padding: 20px 40px 20px 40px;\">\n<strong>AGENT:<\/strong> Hello, this is John Smith. I&#8217;m calling about the home you have listed for sale.<br \/>\n<strong>FSBO:<\/strong> Hi! Yes, the home is still available.<br \/>\n<strong>AGENT:<\/strong> Great! I actually wanted to know why you&#8217;re selling the home. Are you headed somewhere new?<br \/>\n<strong>FSBO:<\/strong> I actually got a great job offer in Denver. Our new home is being built.<br \/>\n<strong>AGENT:<\/strong> Wow! Congratulations on that. I&#8217;m guessing you&#8217;re in a hurry to get this house sold before your new one is finished. I know that carrying two mortgages can be stressful for families. What approach are you using to try to get your house sold fast?<br \/>\n<strong>FSBO:<\/strong> We don&#8217;t really have a strategy. I know the market is pretty hot around here.<br \/>\n<strong>AGENT:<\/strong> How did you set the price?<br \/>\n<strong>FSBO:<\/strong> Honestly, we just used what we saw other homes on our street selling for on Zillow.<br \/>\n<strong>AGENT:<\/strong> What&#8217;s your plan for negotiating prices with buyers?<br \/>\n<strong>FSBO:<\/strong> I don&#8217;t really want to go much below our asking price. I don&#8217;t know.<br \/>\n<strong>AGENT:<\/strong> What made you want to sell on your own instead of getting an agent?<br \/>\n<strong>FSBO:<\/strong> We wanted to avoid hassles and fees.<br \/>\n<strong>AGENT:<\/strong> How much time were you willing to let the house sit before you considered working with an agent?<br \/>\n<strong>FSBO:<\/strong> I&#8217;m not sure. I actually thought we&#8217;d have a reasonable offer by now.<br \/>\n<strong>AGENT:<\/strong> Let&#8217;s meet. I think I know how to get your home sold.\n<\/div>\n<h2 class=\"BlogH2\">Script #5: The &#8220;Wish List&#8221; Approach<\/h2>\n<p>This FSBO script works because it draws out what a seller wants from an agent. You&#8217;re using some subtle questions to find out what it would take to get them to work with an agent. That puts you in position to be the &#8220;dream agent&#8221; that swoops in and helps them.<\/p>\n<div style=\"background-color: #f6f6f6; padding: 20px 40px 20px 40px;\">\n<strong>AGENT:<\/strong> Hello, this is John Smith. I wanted to talk to you about the home you&#8217;re selling.<br \/>\n<strong>FSBO:<\/strong> Hi.<br \/>\n<strong>AGENT:<\/strong> I noticed that you&#8217;re selling the home on your own. I&#8217;m just curious if you considered listing with an agent at one point.<br \/>\n<strong>FSBO:<\/strong> We thought about it.<br \/>\n<strong>AGENT:<\/strong> Can I just ask which agent you were considering working with?<br \/>\n<strong>FSBO:<\/strong> Hometown Realty was on our list. We thought about using Clive Perkins.<br \/>\n<strong>AGENT:<\/strong> What was it that made Clive appealing to you?<br \/>\n<strong>FSBO:<\/strong> He has ads everywhere. It seems like he knows marketing.<br \/>\n<strong>AGENT:<\/strong> Would you consider meeting with an agent to talk about some smart ways to market your home. This is actually one of my areas of expertise.<br \/>\n<strong>FSBO:<\/strong> Sure.\n<\/div>\n<h2 class=\"BlogH2\">Script #6: The Price Enticer<\/h2>\n<p>This strategy tugs at a seller&#8217;s desire to get more money for their home. It&#8217;s important to emphasize your expertise with getting offers above asking price without making specific promises. This can be accomplished by acting &#8220;puzzled&#8221; about the price chosen.<\/p>\n<div style=\"background-color: #f6f6f6; padding: 20px 40px 20px 40px;\">\n<strong>AGENT:<\/strong> Hi, this is John Smith. I&#8217;m an agent in your area. To stay up-to-date, I like to learn a bit about the homes for sale in my market. I&#8217;m actually especially interested in how you chose the listing price for your home. Could we have a quick chat?<br \/>\n<strong>FSBO:<\/strong> Hi. I have a minute. We looked at some other listings to decide how much to ask for.<br \/>\n<strong>AGENT:<\/strong> I see. How is the kitchen looking?<br \/>\n<strong>FSBO:<\/strong> It&#8217;s about 20 years old.<br \/>\n<strong>AGENT:<\/strong> And the bathrooms?<br \/>\n<strong>FSBO:<\/strong> Two bathrooms. Both are fairly updated.<br \/>\n<strong>AGENT:<\/strong> And you guys have enjoyed living in the neighborhood?<br \/>\n<strong>FSBO:<\/strong> Yea, we like it here. We are moving because it&#8217;s just too much space for the two of us now.<br \/>\n<strong>AGENT:<\/strong> Is there anything you&#8217;re doing to market your home to make it stand out?<br \/>\n<strong>FSBO:<\/strong> Not really.<br \/>\n<strong>AGENT:<\/strong> I&#8217;d love to talk to you about potentially getting more than what you&#8217;re asking right now. I have some market analysis tools for your area that you would find really interesting. Let&#8217;s set up a time.\n<\/div>\n<h2 class=\"BlogH2\">Script #7: Targeting the Penny-Pinching FSBO<\/h2>\n<p>One of the biggest motivators for FSBOs is cost savings. This is especially common in hot markets because they don&#8217;t see a need to cover real estate agents&#8217; fees when they feel confident they can get offers on their own. Knowing the pain points of sellers helps with this. For instance, a seller with shallow equity may feel that paying commission will stop them from breaking even. It&#8217;s the agent&#8217;s job to inform them that trying to sell alone can actually cost them <em><strong>more<\/strong><\/em>. Time is often the best angle for achieving this.<\/p>\n<div style=\"background-color: #f6f6f6; padding: 20px 40px 20px 40px;\">\n<strong>AGENT:<\/strong> Hi, this is John Smith. I&#8217;m a real estate agent in your area. I&#8217;m checking in because I noticed your house is for sale. Are you still trying to find a buyer?<br \/>\n<strong>FSBO:<\/strong> Hi. Yes, the house is currently for sale.<br \/>\n<strong>AGENT:<\/strong> I actually know the area very well. Can I ask how much you&#8217;re asking for the house?<br \/>\n<strong>FSBO:<\/strong> $325,000.<br \/>\n<strong>AGENT:<\/strong> I have to ask you something. Would you be up for a conversation if I told you that I actually have a buyer who&#8217;s a perfect fit?<br \/>\n<strong>FSBO:<\/strong> I might be interested in talking.<br \/>\n<strong>AGENT:<\/strong> Perfect! Can we schedule a time when I can come by to look at the house to make sure it fits what my buyer is looking for? I also have some information for you about how I can potentially help you speed up the process of getting this house sold. I help FSBOs bring in offers all the time.<br \/>\n<strong>FSBO:<\/strong> Okay. The thing is that I really only want to talk with you if there&#8217;s a buyer. I really don&#8217;t want to list my house with an agent. It&#8217;s just not what I&#8217;m looking for right now.<br \/>\n<strong>AGENT:<\/strong> I totally respect that. I just want to give you a chance to hear about how I may be able to help you actually make more from this home sale. I can tell you about some of my clients who have ended up getting a lot more than they expected. Is this something you&#8217;d be interested in talking about with me?<br \/>\n<strong>FSBO:<\/strong> Listen, I really don&#8217;t want to lose money by paying agent fees. I&#8217;m barely going to break even as it is while selling after just two years.<br \/>\n<strong>AGENT:<\/strong> What&#8217;s bringing you to sell so soon?<br \/>\n<strong>FSBO:<\/strong> We&#8217;re moving back to our hometown to help my wife&#8217;s parents. They are having some health struggles. Moving closer to them just makes sense now that my wife and I both work remotely.<br \/>\n<strong>AGENT:<\/strong> That&#8217;s great that you can be there to help family. I can see why you&#8217;re motivated to sell quickly. I&#8217;m just wondering what you would think if I told you that I have some pretty good ideas for how I can help you break even while also potentially getting your house sold quickly. I&#8217;m betting it will be nice to have one less thing hanging over your shoulders while you&#8217;re making this big move to help family. Can we schedule a quick time to talk about it?<br \/>\n<strong>FSBO:<\/strong> Sure, I guess it can&#8217;t hurt.<br \/>\n<strong>AGENT:<\/strong> Great! My schedule is clear this afternoon. Let&#8217;s set up a time.\n<\/div>\n<h2 class=\"BlogH2\">Five Points to Hit on During FSBO Cold Calls<\/h2>\n<p>You&#8217;ll always be tweaking your scripts slightly to keep up with FSBO replies. However, it&#8217;s important to return to the same key points time after time regardless of which direction a conversation takes. Try to hit these five points during every call:<\/p>\n<ol class=\"BlogOL\">\n<li class=\"BlogLI\"><strong>You have access to qualified buyers that they don&#8217;t have.<\/strong> Remind them that buyers come to you to help them locate homes.<\/li>\n<li class=\"BlogLI\"><strong>You can sell their home <em>faster<\/em> than they can.<\/strong> Focus on the pain point of covering mortgage payments, taxes, energy costs, and other bills for every additional day a home sits on the market.<\/li>\n<li class=\"BlogLI\"><strong>You can sell their home for <em>more<\/em> than they can.<\/strong> While many FSBOs are usually motivated by saving money, they can often have their minds changed once you get down to brass tacks regarding what they might lose monetarily by not leveraging an agent&#8217;s skills and resources.<\/li>\n<li class=\"BlogLI\"><strong>You&#8217;re there to help.<\/strong> Keep an inquisitive, neutral disposition during the conversation to avoid looking like a &#8220;shark.&#8221;<\/li>\n<li class=\"BlogLI\"><strong>You have professional expertise and resources they need.<\/strong> Remind them that you&#8217;re backed by an agency that has marketing tools, market analysis data, and connections that give you unique advantages when listing homes—advantages that people who aren&#8217;t real estate professionals simply can&#8217;t have.<\/li>\n<\/ol>\n<p>The goal of every script is to showcase your value. In many cases, FSBOs already have insecurities regarding their ability to take on the task. Even &#8220;cocky&#8221; sellers may be enticed by the idea that the monetary gain may be higher when going with an agent.<\/p>\n<h2 class=\"BlogH2\">Five Tips for Achieving Success With FSBO Scripts<\/h2>\n<p>Having good FSBO listing scripts will only get you partway there. To persuade reluctant homeowners, you also need to bear these important considerations in mind:<\/p>\n<ol class=\"BlogOL\">\n<li class=\"BlogLI\"><strong>Rehearse your scripts with friends, family members, or colleagues.<\/strong> A confident delivery is half the battle. You never want to look like you&#8217;re reading during a conversation.<\/li>\n<li class=\"BlogLI\"><strong>Personalize your content.<\/strong> Always add in details about the property&#8217;s address and location to ensure that you don&#8217;t sound like a &#8220;bot&#8221; come to life. Owners should feel like you were uniquely compelled to organically reach out about their properties.<\/li>\n<li class=\"BlogLI\"><strong>Call at the right time.<\/strong> Don&#8217;t be a dinner-time pest. Calling in the morning between 9 a.m. and 11 a.m. is actually the most effective approach because people have the freshness and alertness to make appointments instead of brushing you off out of sheer exhaustion after a long day.<\/li>\n<li class=\"BlogLI\"><strong>Consider an auto-dialer.<\/strong> While an auto-dialer won&#8217;t convince leads for you, it can save you time and energy to allow you to be &#8220;fresher&#8221; when a lead picks up. You&#8217;ll also save tons of time since you&#8217;ll only connect with leads who pick up!<\/li>\n<li class=\"BlogLI\"><strong>Put your email address or social media handle in your voicemail.<\/strong> If you get stuck playing phone tag, potential clients who don&#8217;t love talking on the phone may reach out using alternative channels.<\/li>\n<\/ol>\n<p>The bottom line is that you shouldn&#8217;t make delivering your scripts harder than it needs to be. Going in confident and prepared with them memorized will increase your persuasion factor. Added tools can save you time to avoid burnout while cold calling!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>How do you turn &#8220;for sale by owner&#8221; into &#8220;for sale by you&#8221;? With the help of these free FSBO scripts, real estate agents can automate their &#8220;pitch&#8221; for convincing homeowners that it&#8217;s wise to work with you instead. Sellers will walk away from the conversation feeling like you&#8217;re competent, capable, and the obvious person [&hellip;]<\/p>\n","protected":false},"author":33,"featured_media":61381,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[34],"tags":[849,847,848],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/61374"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/33"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=61374"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/61374\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media\/61381"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=61374"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=61374"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=61374"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}