{"id":61380,"date":"2022-08-24T18:21:46","date_gmt":"2022-08-25T01:21:46","guid":{"rendered":"https:\/\/www.marketleader.com\/?p=61380"},"modified":"2022-08-25T14:17:59","modified_gmt":"2022-08-25T21:17:59","slug":"expired-listing-scripts","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/expired-listing-scripts\/","title":{"rendered":"5 Expired Listing Scripts + Responses to Common Seller Objections"},"content":{"rendered":"<p>Of course, sellers never want to see their listing expire. It’s demoralizing.<\/p>\n<p>And this is where you come in as the hero of second chances. You can turn what feels like a dead end into a win-win, simply by preparing yourself with the best expired listing scripts. Get ready to sweep in and save the day.<\/p>\n<p>Wondering how to find expired listings? Most agents discover them on Zillow, Realtor.com, or other <a href=\"\/solutions\/customizable-websites\/\">websites with real estate listings<\/a>. Wherever you start the conversation, be sure to catch yourself up on all of the background information so you can help the owner get back in the game with their head held high.<\/p>\n<p>But in sensitive situations like this, it can be difficult to know what to say and how to say it. So here’s a collection of free expired listing scripts that are fully adaptable to the most common situations second chance real estate heroes find themselves in.<\/p>\n<h2 class=\"BlogH2\">Sample Expired Listing Scripts for Realtors<\/h2>\n<h3 class=\"BlogH3\">Script #1: For When They Plan to Re-List With the Same Agent<\/h3>\n<div style=\"background-color: #f6f6f6; padding: 20px 40px 20px 40px;\"><strong>Agent:<\/strong> I&#8217;m calling about the house that was for sale at 20 Pine Lane. I noticed it left the market without being sold.<br \/>\n<strong>Owner:<\/strong> That&#8217;s my house. We&#8217;re planning to re-list it again next month.<br \/>\n<strong>Agent:<\/strong> That&#8217;s great news. I&#8217;m actually calling because I routinely close sales on homes in your neighborhood. I would love to talk to you about getting some offers when the house gets back on the market.<br \/>\n<strong>Owner:<\/strong> I&#8217;m actually re-listing it with the same agent.<br \/>\n<strong>Agent:<\/strong> That&#8217;s interesting. Sometimes it can feel like maybe your agent didn&#8217;t give you 100% of their attention to get the job done&#8230; Do you feel confident that things will be different this time around?<br \/>\n<strong>Owner:<\/strong> I&#8217;m not sure.<br \/>\n<strong>Agent:<\/strong> I really respect your loyalty to your original agent. I would still love to talk to you about how we can get this home sold. My agency has a robust budget for leads and marketing that helps to get eyeballs on the properties we list. Can we set up a meeting this week? If there&#8217;s nothing new I can offer you, I&#8217;ll wish your agent the best of luck.<\/div>\n<h3 class=\"BlogH3\">Script #2: For When They Plan to Rent Instead<\/h3>\n<div style=\"background-color: #f6f6f6; padding: 20px 40px 20px 40px;\"><strong>Agent:<\/strong> I&#8217;m calling about the house at 522 Corey Road. Can you tell me if it&#8217;s still for sale?<br \/>\n<strong>Owner:<\/strong> It&#8217;s not for sale. We&#8217;re actually in the process of getting it ready to rent.<br \/>\n<strong>Agent:<\/strong> Can I ask what took away your desire to sell?<br \/>\n<strong>Owner:<\/strong> We were having a hard time finding a buyer. We decided that making some rental income would be smarter.<br \/>\n<strong>Agent:<\/strong> I can understand that. I know that there&#8217;s a lot of money to be lost from a home simply sitting unused. I do have a question for you. Would you be open to selling if I could bring you an offer at a price that&#8217;s acceptable to you? Is this something you&#8217;d be willing to look at?<br \/>\n<strong>Owner:<\/strong> It really depends on the offer.<br \/>\n<strong>Agent:<\/strong> Great! Can I set up a meeting with you before the end of this week?<\/div>\n<h3 class=\"BlogH3\">Script #3: For When They Plan to Work on the House Before Re-Listing It<\/h3>\n<div style=\"background-color: #f6f6f6; padding: 20px 40px 20px 40px;\"><strong>Agent:<\/strong> I&#8217;m reaching out about the house at 75 Bluebird Lane. I noticed that it&#8217;s no longer for sale. Are you currently looking for some support to get your asking price?<br \/>\n<strong>Owner:<\/strong> We had trouble getting offers. We decided to fix up the house a bit before trying to re-list it again in the fall.<br \/>\n<strong>Agent:<\/strong> I&#8217;m an agent with experience getting homes sold in your neighborhood. Based on what the market is doing, it would be a shame to let another six months pass before making it available to buyers again.<br \/>\n<strong>Owner:<\/strong> We just weren&#8217;t getting offers that made sense for us right now.<br \/>\n<strong>Agent:<\/strong> What if I told you I could help you get offers at or around asking price without needing to pour a big investment into your house to get it sold? I&#8217;d love to hear about the updates you&#8217;re planning because I have some market data that can help you determine if your return on investment would be positive. Let&#8217;s talk before you spend a dime on updates!<\/div>\n<h3 class=\"BlogH3\">Script #4: For When They&#8217;re Stuck on the Price Promised by Their Previous Agent<\/h3>\n<div style=\"background-color: #f6f6f6; padding: 20px 40px 20px 40px;\"><strong>Agent:<\/strong> I&#8217;m a real estate agent calling about the house at 78 Canary Lane. I noticed that it&#8217;s no longer on the market. I wanted to see if I could help you with a plan to move forward if your previous attempt to sell with an agent was unsuccessful.<br \/>\n<strong>Owner:<\/strong> We decided to wait things out because we didn&#8217;t get any offers at asking price.<br \/>\n<strong>Agent:<\/strong> I can understand your desire to get the best price possible. Hearing that your home didn&#8217;t sell at asking price in a neighborhood that many of my clients have been interested in leads me to wonder if your agent didn&#8217;t valuate your home properly. I know some agents will &#8220;promise the world&#8221; just to get you to list with them. Can I ask if your agent provided you with any market analysis information as part of the process for determining the selling price?<br \/>\n<strong>Owner:<\/strong> No, we didn&#8217;t get any information on a market analysis.<br \/>\n<strong>Agent:<\/strong> Interesting. It&#8217;s an important step. Pricing your home too high, for example, can actually cost you more in the long run because your home will sit on the market. It&#8217;s very common for sellers to cut out entire segments of buyers simply because the price is even slightly too high. I have tons of information I could share with you about pricing homes to sell quickly. Could we schedule a time to talk about how you can get better offers?<br \/>\n<strong>Owner:<\/strong> I wasn&#8217;t really planning to list until the spring.<br \/>\n<strong>Agent:<\/strong> Would you feel differently if I told you I had some potential buyers ready to bring offers?<\/div>\n<h3 class=\"BlogH3\">Script #5: For When You Want to Make a Positive Impression Over Voicemail<\/h3>\n<div style=\"background-color: #f6f6f6; padding: 20px 40px 20px 40px;\"><strong>Agent:<\/strong> Hi! I&#8217;m John Smith with Acme Realty. I&#8217;m calling about the home you were trying to sell on Crystal Lake Terrace. I wanted to reach out to talk about what went wrong with your listing. I&#8217;ve actually helped several sellers in your neighborhood get offers after bringing their houses back on the market using my three-step marketing program. It&#8217;ll take just a 15-minute walkthrough of your house to go over what I can do differently from your previous agent. My Friday afternoon is open. Please give me a call!<\/div>\n<h2 class=\"BlogH2\">Tips for Success: How to Maximize the Benefits of Using Expired Listing Scripts<\/h2>\n<p>It’s not enough to have a handful of scripts lying dormant in your back pocket. They’re tools. And like all tools, you have to know how to use them. So here are five tips that will ensure you&#8217;re cold calling expired listings like an expert.<\/p>\n<ul class=\"BlogUL\">\n<li class=\"BlogLI\"><strong>Rehearse.<\/strong> But remember, the point of rehearsing expired listing scripts isn’t to memorize them. They’re not meant to match real life situations perfectly anyway. Instead, the objective is to build your instincts so that when the time comes you can steer the conversation in a way that sounds natural, experienced, and confident.<\/li>\n<li class=\"BlogLI\"><strong>Keep in mind the best time to call expired listings.<\/strong> Timing is crucial. Nobody wants to be reminded of the house they couldn’t sell. Especially in the middle of the day when they’re juggling all of their to-dos. Warm up your cold call to expired listings by reaching out during the golden weekday hours of 4 p.m. and 6 p.m.<\/li>\n<li class=\"BlogLI\"><strong>Save time—automate your calls.<\/strong> Use an auto-dialer system that will connect only when someone picks up. You could increase your call load by up to 400% per hour! This is one of many examples of <a href=\"\/solutions\/marketing-automation\/\">marketing automation which agents shouldn&#8217;t go without.<\/a><\/li>\n<li class=\"BlogLI\"><strong>Be extra careful with your tone and approach.<\/strong> It’s always important to avoid sounding “sales-y.” But that’s especially true when you’re talking with the owner of an expired listing. So rather than rattling through a one-sided pitch, be quick to empathize. Be considerate. Be curious. And never come across as a shark circling the waters, just waiting to capitalize on the down-and-out.<\/li>\n<li class=\"BlogLI\"><strong>Get a dedicated number or email account.<\/strong> Secure a catchy number, call handle, or email address that you can use specifically for reaching out to owners of expired listings. Whatever it is, make it memorable. Aim toward being the agent that’s top-of-mind when they catch the next wave of hopefulness and decide to re-list.<\/li>\n<\/ul>\n<h2 class=\"BlogH2\">Top 5 Objections You&#8217;ll Hear From Expired Listings (And How to Respond)<\/h2>\n<p>Be prepared to encounter resistance as you&#8217;re calling expired listings. Understandably, would-be sellers tend to feel defensive and apprehensive in this kind of situation. They&#8217;re often put off by anyone who seems to be questioning their decision to take their home off the market. Again, that&#8217;s understandable. They&#8217;re demoralized. And now they might be feeling as if they can&#8217;t even trust their own decisions, as if their instincts were off.<\/p>\n<p>So before we jump into the five objections and consider how the wisest of agents might respond, here&#8217;s a crucial point: Be authentically friendly and genuinely helpful. Keep a light tone. It&#8217;s important to come across as an expert offering insight. Not a critic who&#8217;s pointing out their mistakes.<\/p>\n<p>Of course we can&#8217;t address every <a href=\"https:\/\/www.marketleader.com\/blog\/objection-handling-bootcamp-how-to-overcome-objections-and-win-more-clients\/\">objection that real estate agents hear<\/a>. But we can almost guarantee you&#8217;ll encounter these five very common objections from owners of expired listings. And by the end, you&#8217;ll be armed and ready to provide the kind help they&#8217;re looking for.<\/p>\n<h3 class=\"BlogH3\">1. &#8220;I Want to Stay With My Agent.&#8221;<\/h3>\n<p>Nobody wants to admit that their &#8220;picker&#8221; was wrong the first time. Oddly enough, that may be the reason a seller will re-list with the same agent that failed them.<\/p>\n<p>There&#8217;s no need here to point out all of the previous agent&#8217;s missteps. Chances are, that will only make matters worse. Instead, showcase your value. Show what you can bring to the table. For example, call out the tools and resources you have and show how they&#8217;ll refine the market analysis and pricing determinations this time around.<\/p>\n<h3 class=\"BlogH3\">2. &#8220;It&#8217;s a Bad Time to Sell.&#8221;<\/h3>\n<p>Preparation is the key here. Come equipped with data to support your reasons why it&#8217;s <em>not <\/em>a bad time to sell. Many would-be sellers respond to the sting of rejection by blaming the market. Emphasize a different point. Show them all of the opportunities they&#8217;re missing out on by &#8220;waiting it out.&#8221;<\/p>\n<h3 class=\"BlogH3\">3. &#8220;We&#8217;re Renting Instead.&#8221;<\/h3>\n<p>Make sure they&#8217;ve counted the cost, that they&#8217;re fully aware of how costly renting can be. Research and prep beforehand so you can show how much (or how little) is leftover after accounting for taxes, repairs, and other expenses. Ask questions that will help them think more deeply about what it would take to become a landlord. And compare all of that to the positive potentialities of getting an asking-price offer by working with you to sell instead.<\/p>\n<h3 class=\"BlogH3\">4. &#8220;I&#8217;m Waiting Until I Can Get a Higher Price.&#8221;<\/h3>\n<p>Start by chipping away at the misconceptions. Probe into how they settled on their previous asking price, for example. It may have been misguided. Then equip them with information they need to make the right choices.<\/p>\n<p>For example, show them that waiting isn&#8217;t always the solution because home values aren&#8217;t time-dependent. Or show them how they might be ousting segments of buyers because the listing isn&#8217;t showing up in the appropriate search brackets. Again, come prepared with a comparative market analysis to show them what similar homes are going for in their neighborhood.<\/p>\n<h3 class=\"BlogH3\">5. &#8220;I&#8217;ve Never Heard of Your Agency.&#8221;<\/h3>\n<p>This is actually the best objection because it&#8217;s basically an invitation for you to show off. Roll out some stats about the homes you&#8217;ve sold recently. Set up an appointment with them so you can go into greater detail about what you do, what you&#8217;ve accomplished, how you&#8217;ve done it, and how you can hit a home run together.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Of course, sellers never want to see their listing expire. It’s demoralizing. And this is where you come in as the hero of second chances. You can turn what feels like a dead end into a win-win, simply by preparing yourself with the best expired listing scripts. Get ready to sweep in and save the [&hellip;]<\/p>\n","protected":false},"author":33,"featured_media":61383,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[34],"tags":[],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/61380"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/33"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=61380"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/61380\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media\/61383"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=61380"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=61380"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=61380"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}