{"id":614,"date":"2010-11-05T09:37:22","date_gmt":"2010-11-05T17:37:22","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=614"},"modified":"2021-11-12T12:49:04","modified_gmt":"2021-11-12T20:49:04","slug":"four-days-of-free-marketing-training-at-nardigras","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/four-days-of-free-marketing-training-at-nardigras\/","title":{"rendered":"Four Days of FREE Marketing Training at #NARdiGras!!"},"content":{"rendered":"<p><strong>50 Sites That Will Save You Time &amp; Make You Money<\/strong><\/p>\n<p>Get your pencils ready!  We’ll power through dozens of the Web’s best-kept secrets – all focused on sites and tools that will help you get more done in less time.  If you want to feel more efficient, more effective and make more money starting tomorrow, don’t miss this session.<\/p>\n<p><em>Presenter: Ben Kinney, <a title=\"ActiveRain\" href=\"http:\/\/www.activerain.com\">ActiveRain<\/a><\/em><\/p>\n<p><strong>Ben Kinney’s “10 Days of Pain” Lead System<\/strong><\/p>\n<p>Got a new lead?  Then it’s time for the “pain!”  This proven system has helped make Ben Kinney one of the most successful real estate professionals in the country, with one of the highest lead conversion rates around.  You’ll see and hear exactly how to turn Web visitors into buyers and sellers.<\/p>\n<p><em>Presenter: Ben Kinney, ActiveRain<\/em><\/p>\n<p><strong>Blogging for Business<\/strong><\/p>\n<p>Your blog may be the single-most important marketing tool you have.  How do you use it?  What do you write about?  And where do you find the time?  Learn the best practices of today’s top real estate bloggers, who are creating market share and driving qualified leads from this FREE opportunity.<\/p>\n<p><em>Presenter: Ben Kinney, IMSD<\/em><\/p>\n<p><strong>Building a Winning Brokerage<\/strong><\/p>\n<p>Real estate brokers are inundated with offers to try the latest technology, but what really makes a difference to the bottom line? How do we separate the fads from the productive tools that drive profits? Hear what it takes to beat the competition from brokers who are succeeding right now.<\/p>\n<p><em>Presenter: Varies by day<\/em><\/p>\n<p><strong>Convert More Leads Into Paychecks!<\/strong><\/p>\n<p>Think those leads aren’t all qualified?  Think again.  Discover the industry’s biggest myth about how to work leads to increase your income. Hint: it takes the right approach, the right systems, and the right best practices. In this session, we’ll share the secrets of pros who have mastered these strategies.<\/p>\n<p><em>Presenter: Ben Kinney, ActiveRain<\/em><\/p>\n<p><strong>Double Your Transactions, Double Your Income<\/strong><\/p>\n<p>In one of the worst real estate markets ever, agents and brokers nationwide are still on pace to double their income this year.  How are they doing it?  What are their secrets?  Learn their most closely-held secrets here, and put them to work for YOU in 2011.<\/p>\n<p><em>Presenter: Chad Hyams, IMSD<\/em><\/p>\n<p><strong>From Clicks to Closings: 3 Secrets<\/strong><\/p>\n<p>Learn the three secrets to generating more closed transactions. In this session you will learn to a) define your strategy; b) uncover opportunities for virtual introductions; and c) understand the power of co-navigating the online buying and selling process with your customers.<\/p>\n<p><em>Presenters: Jack Markham, <a title=\"Market Leader\" href=\"http:\/\/www.marketleader.com\/products\">Market Leader<\/a>, and John Lockhart, <a title=\"Market Leader\" href=\"http:\/\/www.marketleader.com\/products\">Market Leader<\/a><\/em><\/p>\n<p><strong>Marketing &amp; Generating Leads Online<\/strong><\/p>\n<p>Launching a Web site and putting your listings online ain’t cutting it anymore. Today’s successful, Web-savvy real estate professionals are driving qualified leads from across the Internet.  Find out what they’re doing, and how easy it is for YOU to do it, too.<\/p>\n<p><em>Presenter: Ben Kinney, ActiveRain<\/em><\/p>\n<p><strong>Marketing Secrets of a Tech Savvy Agent<\/strong><\/p>\n<p>Powerhouse agent Sandra Rangel aggressively markets her business with roaring success. Find out Sandra’s best marketing secrets, and see exactly what works—and what doesn’t—when it comes to acquiring clients online<strong>.<\/strong><\/p>\n<p><em>Presenter: Sandra Rangel, RE\/MAX<\/em><\/p>\n<p><strong>Mastering Pay Per Click Advertising<\/strong><\/p>\n<p>Think paid search advertising is too competitive, too expensive, and too complicated?  Think again.  Learn how to <em>reduce<\/em> your marketing budget and <em>increase <\/em>the number of leads you generate from Google, Facebook, Yahoo and more.  Qualified, ready-to-buy-and-sell customers are out there waiting for you!<\/p>\n<p><em>Presenter: Ben Kinney, ActiveRain<\/em><\/p>\n<p><strong>Mastering Social Media<\/strong><\/p>\n<p>Confused by the options on the social Web?  Wondering which opportunities are right for you, and where the buyers and sellers are lurking?  We’ll help you successfully navigate the most important social media options, share how to find the most qualified buyers, and how to do it all in less time than you think.<\/p>\n<p><em>Presenter: Ben Kinney, IMSD<\/em><\/p>\n<p><strong>Mobile Mojo for Real Estate Professionals<\/strong><\/p>\n<p>Always there and always on: what are the tools and technologies that enable you to cut the cord with your desk and spend more time out in the field? How do you manage the shift into the mobile world? Discover how easy it can be in this blitz of mobile mojo.<\/p>\n<p><em>Presenter: Gahlord Dewald, Inman News<br \/>\n<\/em><strong><br \/>\nOnline Strategies that Make Sense<\/strong><\/p>\n<p>The word &#8220;strategy&#8221; gets tossed around a lot but is rarely used to make things clearer. Find out how to create an online strategy that makes sense for your business and learn from four example strategies that you can begin applying immediately.<\/p>\n<p><em>Presenter: Gahlord Dewald, Inman News<\/em><\/p>\n<p><strong>Reducing Expenses to Make More Money<\/strong><\/p>\n<p>You can do more with less…money that is!  You can increase the impact of your marketing, drive hundreds of leads, and do it all with a fraction of the budget you may have needed five years ago.  You’ll walk away from this session with specific ideas and practices to put into practice immediately.<\/p>\n<p><em>Presenter: Ben Kinney, ActiveRain<\/em><\/p>\n<p><strong>Search Engine Optimization Made Easy<\/strong><\/p>\n<p>The basics of ranking your website high on Google, Yahoo, Bing and more are easy.  You just need to know what to do, and how to do it.  This session will provide you with the practical, step-by-step advice you need to quickly super-charge your website to start receiving more FREE traffic from across the Web.<\/p>\n<p><em>Presenter: Chad Hyams, IMSD<\/em><\/p>\n<p><strong>Tools and Tips for Maximizing Your Marketing Dollar<br \/>\n<\/strong><br \/>\nAre you making the best use of tech tools in your marketing? These days, the right tools can make your photos, videos and print materials just as good as those produced by the pros. Kodak will show you how to market your business more cost effectively than ever.<\/p>\n<p><em>Presenter: Mark Walser, Kodak<\/em><\/p>\n<p><strong>Using Online Classifieds to Generate Free Leads<\/strong><\/p>\n<p>How do you generate hundreds of leads per month on CraigsList?  How do you make your classified listings stand out, get noticed, and get responses from more buyers and sellers? We’ll show you how, with specific examples of the most successful, response-generating classified listings on the Web today.<\/p>\n<p><em>Presenter: Chad Hyams, IMSD<\/em><\/p>\n<p><strong>Why Everything You Know About Your Clients Is WRONG<\/strong><\/p>\n<p>Do you think you know your clients? You don’t. From how they found you to what they really want, learn how technology can give you insight into what your clients are thinking—and how you can turn that into profits.<\/p>\n<p><em>Presenter: Alex Lange, Market Leader <\/em><\/p>\n<p><strong>Work Smarter with Electronic Signatures<\/strong><\/p>\n<p>Electronic signatures save you time, money, and help you close more business faster. Learn how the DocuSign Electronic Signature platform can separate your business form the competition.<\/p>\n<p><em>Presenter: Jim Custer, DocuSign<\/em><\/p>\n<p><strong><span style=\"text-decoration: underline;\">Speakers<\/span><\/strong><\/p>\n<p><em>Jim Custer, DocuSign<\/em><\/p>\n<p>With 11 years of technology and real estate experience, Jim Custer has a passion for proving how brokerages can save time and money with products like DocuSign. Jim is a well respected “go-to” authority in real estate technology.<\/p>\n<p><em>Gahlord Dewald, <a title=\"Inman News\" href=\"http:\/\/www.inman.com\">Inman News<\/a><\/em><\/p>\n<p>A frequent presenter on technology and marketing, Gahlord works with small businesses to understand—and focus on&#8211;customer preferences. Gahlord writes a weekly column for <em>Inman News<\/em> on technology and marketing in lead generation.<\/p>\n<p><em>Chad Hyams, <a title=\"IMSD\" href=\"http:\/\/www.imsd.net\">IMSD<\/a><\/em><\/p>\n<p>Chad is a 10-year real estate veteran and former Realtor Rookie of the Year who now runs a real estate office in Bellingham, Washington.  Chad has worked in both Bellingham and Las Vegas, and is a graduate of the Instructor Training Institute.<\/p>\n<p><em>Ben Kinney, ActiveRain and IMSD<\/em><\/p>\n<p>Ben is one of the nation’s most successful Internet real estate marketers, and has taught thousands of real estate professionals nationwide his proven methods.  Ben was named to <em>Realtor Magazine<\/em>’s 2008 “30 under 30” list, and is a previous winner of Washington Council of Realtors’ Realtor of the Year award.<\/p>\n<p><em>Alex Lange, Market Leader<\/em><\/p>\n<p>Alex Lange serves as the company’s Chief Technology Officer leading the technology, product management, and advertising teams for Market Leader. Lange brings 25 years of technology experience and over 10 years of executive leadership to Market Leader. Previously, Lange co-founded and was Chief Technology Officer of Roost.com.<\/p>\n<p><em>John Lockhart, Market Leader<\/em><\/p>\n<p>The son of a successful real estate broker, John has real estate in his veins. Today he helps real estate professionals grow their businesses by providing expert advice on online lead generation, branding, and staying connected with clients in the digital age.<\/p>\n<p><em>Jack Markham, Market Leader<\/em><\/p>\n<p>Jack Markham is an online strategist for Market Leader, and has 10 years’ experience using the Internet to generate profits for small businesses. At Market Leader, Jack works with hundreds of real estate professionals each month to set online strategy, build lead pipelines, and increase transactions.<\/p>\n<p><em>Sandra Rangel, RE\/MAX<\/em><\/p>\n<p>As a Million Dollar Producer and a Platinum Top 50 Realtor in San Antonio, Sandra Rangel understands the intersection of customer service and technology in real estate.<\/p>\n<p><em>Mark Walser, Kodak<\/em><\/p>\n<p>A veteran of real estate technology, Mark is an expert in broker and agent solutions for leading companies, and previously ran lead generation efforts for a leading industry firm.  As Kodak&#8217;s Real Estate Business Development Manager, Mark helps agents blend software, hardware, and Web techniques with internet marketing to grow their businesses.<\/p>\n<p><strong><em>For a detailed schedule of events, please visit the Market Leader booth #439 at NAR.<\/em><\/strong><\/p>\n","protected":false},"excerpt":{"rendered":"<p>50 Sites That Will Save You Time &amp; Make You Money Get your pencils ready!  We’ll power through dozens of the Web’s best-kept secrets – all focused on sites and tools that will help you get more done in less time.  If you want to feel more efficient, more effective and make more money starting [&hellip;]<\/p>\n","protected":false},"author":6,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[27],"tags":[],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/614"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=614"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/614\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=614"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=614"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=614"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}