{"id":61625,"date":"2022-09-16T13:42:52","date_gmt":"2022-09-16T20:42:52","guid":{"rendered":"https:\/\/www.marketleader.com\/?p=61625"},"modified":"2022-09-16T13:45:08","modified_gmt":"2022-09-16T20:45:08","slug":"real-estate-voicemail-scripts","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/real-estate-voicemail-scripts\/","title":{"rendered":"7 Real Estate Voicemail Scripts (Plus Best Practices) That Actually Get Callbacks"},"content":{"rendered":"<p>The best real estate agents don’t merely leave a message after the <em>beep<\/em>. They leave a <strong>benefit<\/strong>.<\/p>\n<p>Chances are, your leads’ voicemail inboxes are overflowing with robocall time-wasters and spam from scammers. You need to differentiate yourself by providing a strong reason to call back in order to have any chance of getting a response.<\/p>\n<p>That isn’t to say leaving a voicemail as a real estate agent is pointless. It’s still a highly-effective strategy. It’s just that standing out among the junk now requires a bit of technique and a dash of finesse. That’s where these scripts and best practices come in.<\/p>\n<h2 class=\"BlogH2\">Real Estate Voicemail Scripts<\/h2>\n<h3 class=\"BlogH3\">New Buyer Lead Who Requested Listing Information Via Your Website<\/h3>\n<div style=\"background-color: #f6f6f6; padding: 20px 40px 20px 40px;\">\nHi, <em>[name]<\/em>. This is <em>[your name]<\/em> from <em>[brokerage]<\/em>. I noticed you signed up on my website at <em>[your website]<\/em> and you’re looking at homes in <em>[city]<\/em>. Is this your ideal neighborhood or are you looking in other parts of town? Let me know. If you’d like to view any listings, I can set up a showing so you can view them in person. My number is <em>[number]<\/em>. Looking forward to hearing from you! Talk to you soon, <em>[name]<\/em>. Bye!\n<\/div>\n<h3 class=\"BlogH3\">New Seller Lead Who Requested Listing Information Via Your Website<\/h3>\n<div style=\"background-color: #f6f6f6; padding: 20px 40px 20px 40px;\">\nGood afternoon, <em>[name]<\/em>. My name is <em>[your name]<\/em>. I noticed through my website that you’re interested in selling your property at <em>[address]<\/em>, and I just wanted to follow up with you, get to know you, and find out how I can help. I’d be happy to walk you through the process and provide all of the information I have about the market in your area. Please call me back at <em>[number]<\/em>. Have a great day, <em>[name]<\/em>.\n<\/div>\n<h3 class=\"BlogH3\">New Buyer Lead from a Listing Portal<\/h3>\n<div style=\"background-color: #f6f6f6; padding: 20px 40px 20px 40px;\">\nHi, <em>[name]<\/em>. This is <em>[your name]<\/em> with <em>[brokerage]<\/em>. Thanks for reaching out to me through <em>[portal name]<\/em>! I’m very familiar with <em>[neighborhood\/area specified]<\/em> and I have a lot of insider knowledge about the market here that I’d be happy to send your way. Give me a call back so we can schedule a viewing. You can reach me at <em>[number]<\/em>. Thanks again. Have a great day, <em>[name]<\/em>. Bye.\n<\/div>\n<div style=\"background-color: #41464D; color: #ffffff; border-radius: 15px; padding: 30px; margin: 40px 0px; text-align: center; font-size: 18px;\">\n<strong>Want a free PDF of these voicemail scripts? <a href=\"#download\" style=\"color: #F95515;\">Download them now.<\/a><\/strong>\n<\/div>\n<h3 class=\"BlogH3\">FSBO Script<\/h3>\n<div style=\"background-color: #f6f6f6; padding: 20px 40px 20px 40px;\">\nHi, <em>[name]<\/em>. This is <em>[your name]<\/em> with <em>[brokerage]<\/em>. I just wanted to reach out to you to ask how selling the property at <em>[address]<\/em> is going. I noticed it’s been listed for a while now, which surprised me because my listings in that area usually don’t last long. I’d love to share some ideas with you that have worked well for me in the past. I’m free for a quick call on Thursday at 4 p.m. Let me know if that works for you. My number is <em>[number]<\/em>. Thanks, <em>[name]<\/em>. Have a good evening!\n<\/div>\n<h3 class=\"BlogH3\">Owner of an Expired Listing<\/h3>\n<div style=\"background-color: #f6f6f6; padding: 20px 40px 20px 40px;\">\nHi! I&#8217;m <em>[name]<\/em> with <em>[brokerage]<\/em>. I&#8217;m calling about the home you were trying to sell on <em>[address]<\/em>. I wanted to reach out to learn about what went wrong with your listing. I&#8217;ve actually helped several sellers in your neighborhood get offers after bringing their houses back on the market using my <em>[marketing strategy\/program]<\/em>. It&#8217;ll take just a quick walkthrough of your house to go over what I can do differently from your previous agent. My Friday afternoon is open. Give me a call at <em>[number]<\/em>.\n<\/div>\n<h3 class=\"BlogH3\">Warming up Old Buyer Lead<\/h3>\n<div style=\"background-color: #f6f6f6; padding: 20px 40px 20px 40px;\">\nHey, <em>[name]<\/em>! It’s <em>[your name]<\/em>. I just sold a <em>[type of home]<\/em> in <em>[area\/neighborhood]<\/em>, and it reminded me of when we were looking for homes in that area a while back. Are you still interested in moving? Just wanted to reconnect and check in to see if I can help you in any way at all. Hope you’re doing well. My number is <em>[number]<\/em>. Talk to you when you call back. Bye.\n<\/div>\n<h3 class=\"BlogH3\">Warming up Old Seller Lead<\/h3>\n<div style=\"background-color: #f6f6f6; padding: 20px 40px 20px 40px; margin-bottom: 40px;\">\nHi, <em>[name]<\/em>! It’s <em>[your name]<\/em>. I was looking over the recent home sale prices in your area recently, and you came to mind. And by the way, if you’re still interested in selling, I thought maybe you’d like to know the updated value of your home. I think it’ll surprise you in a good way. And hey, let’s reconnect! My number is <em>[number]<\/em>. Looking forward to hearing from you!\n<\/div>\n<h2 class=\"BlogH2\">Best Practices for Leaving Voicemails<\/h2>\n<p>Anyone can leave a voicemail. But to nail it like an expert agent and consistently get a response from your leads, there are many techniques you have to follow every time you leave a message.<\/p>\n<h3 class=\"BlogH3\">Prepare Like a Pro<\/h3>\n<ul class=\"BlogUL\">\n<li class=\"BlogLI\">Do your research. Calling a new or old lead can feel nerve-racking, but even just a little bit of preparation is all it takes to provide the confidence you need to succeed. Make sure you have all of the relevant details about your lead close at hand so you can be ready to bring your best, whether they pick up or not.<\/li>\n<li class=\"BlogLI\">Get ready. The best way to avoid sputtering a scattered, rambling message is simply to stop and center yourself. Pause for a moment to ensure you’re in the right headspace to leave an outstanding message that’s bursting with significance. And do what you need to do to feel energized so that you can convey enthusiasm.<\/li>\n<li class=\"BlogLI\">Clear your throat and prepare your voice so you don’t ruin a good script by performing it with that raspy, I-just-woke-up sound. How? Rattle off some <a href=\"https:\/\/www.voices.com\/blog\/vocal_warm_ups\/\">tricky tongue twisters<\/a> or run through some <a href=\"https:\/\/www.scienceofpeople.com\/vocal-warm-ups\/\">vocal warmups.<\/a><\/li>\n<\/ul>\n<h3 class=\"BlogH3\">Leave an Unignorable Voicemail<\/h3>\n<ul class=\"BlogUL\">\n<li class=\"BlogLI\"><em>Always<\/em> leave a voicemail. Why? Two main reasons. First, your prospect or lead needs to connect you with your number so they can call you back or know it’s you when you try again. Most of us ignore calls from numbers we don’t know. And second, reaching the inbox presents a golden opportunity for you to introduce yourself and establish your brand and personality. Every point of contact—even one as small as a voicemail message—is a chance to plant a seed that one day may result in a commission check.<\/li>\n<li class=\"BlogLI\">Follow a script. The goal isn’t to sound like a robot. A well-structured script is actually meant to do the opposite—it’s meant to help you sound like <em>you<\/em>. That’s why it’s important to adapt your scripts to match your brand voice. Memorize them. Record yourself or ask a friend to help you practice to ensure you sound natural while working through the script.<\/li>\n<li class=\"BlogLI\">Be relational, not salesy. No one wants to feel like they’re being used to boost your bottom line. So be friendly and provide value. Demonstrate that you actually care about them as a person.<\/li>\n<li class=\"BlogLI\">Sound confident, not desperate. This too is a turn-off for many prospects. Establish trust immediately and make sure they feel like you’re the service-oriented expert who can provide what they need.<\/li>\n<li class=\"BlogLI\">Express enthusiasm. (Without overdoing it.) Your prospect will often reciprocate your tone. So avoid speaking with a monotone, drab, and lifeless voice. If you’re cheerful, excited, and energetic, they’ll feel that and respond likewise. That alone is attractive. Make it easy for them to get excited <em>with<\/em> you.<\/li>\n<li class=\"BlogLI\">Speak slowly and clearly. Articulation is important. A muddled message is a useless message, and words spoken too quickly get lost. This is where nerves can really mess things up. So breathe. Slow down. And make your points shine with crystal clarity. What’s the right pace? According to research conducted by <a href=\"https:\/\/virtualspeech.com\/blog\/average-speaking-rate-words-per-minute\">VirtualSpeech<\/a>, a widely-recognized speech training organization, conversational speech falls between 120 to 150 words per minute. Have you ever tested yourself to see if you’re leaving a voicemail at an appropriately-conversational pace? Try it and find out!<\/li>\n<\/ul>\n<div style=\"background-color: #41464D; color: #ffffff; border-radius: 15px; padding: 20px 30px; margin: 20px 0px;\">\n<img src=\"https:\/\/storage.pardot.com\/42972\/1662602210vZ0lpJVy\/voicemail_scripts_cover_standalone_v1.png\" align=\"right\" height=\"100\" style=\"float: right;\" \/><\/p>\n<h2 id=\"download\" class=\"BlogH2\" style=\"color: #ffffff !important; margin-top: 0px !important;\">Download Our Realtor Voicemail Scripts Guide!<\/h2>\n<p>There is <em>much<\/em> more to mastering the art of leaving voicemails than we covered in this article. We’ve produced a guide all about it!<\/p>\n<p style=\"\">Download our free <span style=\"font-weight: 800;\">“Real Estate Voicemail Scripts”<\/span> guide to get access to five extra scripts, even more best practices, the winning formula for effective voicemails, and tips from real agents!<\/p>\n<p style=\"padding-bottom: 20px;\">Submit your email address below to have this free guide sent to your inbox!<\/p>\n<div style=\"margin: 0; padding: 0;\"><iframe loading=\"lazy\" style=\"border: 0; height: 90px !important;\" src=\"https:\/\/success.marketleader.com\/l\/42972\/2022-09-16\/8b8s92\" width=\"100%\" height=\"85\" frameborder=\"0\"><\/iframe><\/div>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>The best real estate agents don’t merely leave a message after the beep. They leave a benefit. Chances are, your leads’ voicemail inboxes are overflowing with robocall time-wasters and spam from scammers. You need to differentiate yourself by providing a strong reason to call back in order to have any chance of getting a response. [&hellip;]<\/p>\n","protected":false},"author":33,"featured_media":61626,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[34],"tags":[],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/61625"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/33"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=61625"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/61625\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media\/61626"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=61625"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=61625"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=61625"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}