{"id":61695,"date":"2022-10-17T12:35:14","date_gmt":"2022-10-17T19:35:14","guid":{"rendered":"https:\/\/www.marketleader.com\/?p=61695"},"modified":"2022-10-17T12:35:52","modified_gmt":"2022-10-17T19:35:52","slug":"referral-commission-for-real-estate-agents","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/referral-commission-for-real-estate-agents\/","title":{"rendered":"How Much Is Referral Commission for Real Estate Agents?"},"content":{"rendered":"<p>To put the bottom line at the top, referral commission for real estate agents is approximately 25% of the gross commission from the applicable side of the transaction.<\/p>\n<p>Why “approximately”? Because there isn’t a standard rate for referral fees (and therefore referral commissions), and they’re negotiable.<\/p>\n<p>You likely have many more questions related to referral fees in real estate. If so, you’re not alone. It can be a complicated topic.<\/p>\n<p>Let’s take a look at some of the most frequently asked questions about agent-to-agent referrals.<\/p>\n<h2 class=\"BlogH2\">Why Would I Ever Send Business to Someone Else?<\/h2>\n<p>It’s a fair question. If nothing else, the concept of giving a referral might seem somewhat counterproductive at first. But there are certainly times when a referral is the best option. Here are the most common reasons:<\/p>\n<ul>\n<li>The obvious one first: <strong>You can get a significant portion of the paycheck for doing a small portion of the work<\/strong>. Of course, you’d probably rather do all of the work and cash in on all of the commission. But there are a few reasons why that may not be possible, which would mean collecting a referral fee is your best option. Here are two examples…<\/li>\n<li><strong>It’s an out-of-market transaction.<\/strong> Let’s say, for example, a client of yours is looking to buy a home in another state, a state in which you aren’t licensed. You can’t be the one to complete the sale, but you can refer your client to another agent and receive a referral commission on that transaction. Many businesses, like <a href=\"https:\/\/www.referralexchange.com\/\">ReferralExchange.com<\/a>, can help you find out-of-state agents to make referrals to.<\/li>\n<li><strong>You’re not qualified to help.<\/strong> It’s good to have a wide range of expertise. But not every real estate agent is qualified to handle every type of transaction. Sometimes you’re just not a good fit for the job. For example, a residential real estate agent may not be able to work with commercial properties. Rather than stumbling beyond your purview, sometimes it’s best to hand it off to an agent who can provide the help your client needs.<\/li>\n<\/ul>\n<h2 class=\"BlogH2\">What Is a Fair Real Estate Referral Commission?<\/h2>\n<p>There are two pitfalls to avoid: asking too much and asking too little. If your referral fee is too high, you jeopardize the relationship you have with the other real estate agent. And that could come back to haunt you later when the tables are turned and they choose to refer business to someone else.<\/p>\n<p>On the other hand, if your referral fee is too low, you might be forfeiting the portion of the commission that’s rightfully yours.<\/p>\n<p>So where’s the middle ground?<\/p>\n<p>A good rule of thumb is to stick close to the standard referral fee for real estate agents, which is about <a href=\"https:\/\/www.referralexchange.com\/wp-content\/uploads\/2019\/01\/ReferralExchange-Report_2017.pdf\">25%<\/a>. Some agents go as high as 50% and some go as low as 20%.<\/p>\n<p>Where you set the rate for your referral fee is completely up to you. As long as you avoid both pitfalls, keep your network happy, and stay open to negotiation, you’ll be on the right track.<\/p>\n<h2 class=\"BlogH2\">Why Should I Seek To Get More Referrals From Agents?<\/h2>\n<p>First, because referral commission in real estate can be lucrative.<\/p>\n<p>How lucrative? It’s difficult to say. But using an example to break down some rough estimates will give you a good idea.<\/p>\n<ul>\n<li>The <a href=\"https:\/\/fred.stlouisfed.org\/series\/MSPUS\">current median home sale price<\/a> in the U.S. is reportedly around $440,300.<\/li>\n<li>Let’s say the total commission (for one side of the transaction) is 5%. Using $440,300 as our example, that would amount to $22,015.<\/li>\n<li>If the commission fee is 25% of $22,015, the referral agent would receive $5,503.75 (before taxes and fees, of course). Not bad for just a moment’s worth of work!<\/li>\n<\/ul>\n<p>According to <a href=\"https:\/\/www.nar.realtor\/blogs\/economists-outlook\/sources-of-income-for-real-estate-agents\">a recent study from the National Association of Realtors<\/a> (NAR), the typical Realtor receives approximately one quarter of their income from real estate referral commission (both from consumers and other agents).<\/p>\n<p><a href=\"https:\/\/www.referralexchange.com\/wp-content\/uploads\/2019\/01\/ReferralExchange-Report_2017.pdf\">Another study<\/a> indicated that outbound referrals “make up a median of 12.5% of total transactions per agent per year.” And if the commission fees are around 25%, that can really add up to a significant amount of income for all agents involved.<\/p>\n<p>Combining data points like these (<a href=\"https:\/\/listwithclever.com\/real-estate-blog\/realtor-referral-how-do-referral-agents-work-and-get-paid\/\">and others<\/a>), it’s not hard to see why agents often lean toward a favorable view of the income-generating power of referral commission.<\/p>\n<p>And another reason to pursue more referrals is because one referral often leads to many more, which can eventually become <a href=\"https:\/\/www.marketleader.com\/products\/real-estate-leads\/\">a steady (and passive!) lead generation source<\/a>. If that piques your interest, be sure to learn <a href=\"https:\/\/www.marketleader.com\/blog\/5-ways-to-build-a-referral-based-business\/\">these five ways to build a referral-based business<\/a>.<\/p>\n<h2 class=\"BlogH2\">Is It Possible To Miss Out on Real Estate Referral Commission?<\/h2>\n<p>Okay fine, this is not a frequently asked question. But maybe it should be. Because the answer is yes. There are two ways to mess up referrals.<\/p>\n<h3 class=\"BlogH3\">Don’t Put It in Writing<\/h3>\n<p>Real estate referral commission deals can get messy for all parties involved without a contract. Not only could it jeopardize the relationship you have with the client and the other agent and brokerage, but the transaction could even be illegal.<\/p>\n<p>Whether you’re giving or receiving referral commission, be sure you have a real estate referral contract written up that documents everything about the transaction. Check out this <a href=\"https:\/\/www.nar.realtor\/sites\/default\/files\/applications-and-forms\/2013\/REALTOR-REFERRAL-FORM-F-2013-11-18.pdf\">referral contract<\/a> from the NAR, for example.<\/p>\n<h3 class=\"BlogH3\">Ignore the Real Estate Settlement Procedures Act (RESPA)<\/h3>\n<p>If you’re an agent working in the U.S., you’ll need to abide by the statutes outlined in the RESPA, a law Congress passed in 1974 to protect consumers. It ensures that consumers are always aware of the costs associated with their lone, and it helps to prevent costs from rising for unethical and unnecessary reasons.<\/p>\n<p>Among other provisions, <a href=\"https:\/\/files.consumerfinance.gov\/f\/documents\/cfpb_respa_frequently_asked_questions.pdf\">RESPA<\/a> “prohibits certain actions related to federally related mortgage loans,” including kickbacks and “unearned fee arrangements.”<\/p>\n<p>To summarize the legalese, it means no portion of any real estate referral fees involved in a transaction can make their way to a third party or any person or entity that isn’t a licensed agent. For example, agents can’t abuse the right to add the cost of referral fees to a consumer’s loan so they can pay off insurance companies, appraisers, construction companies, home inspectors, or attorneys for more business.<\/p>\n<p>Want to learn more? Here’s a <a href=\"https:\/\/files.consumerfinance.gov\/f\/documents\/cfpb_respa_frequently_asked_questions.pdf\">helpful document that covers the details<\/a>, and here’s where you can check out the <a href=\"https:\/\/www.nar.realtor\/real-estate-settlement-procedures-act-respa\/respa-faq\">NAR’s RESPA FAQ<\/a> (wow, that’s a lot of acronyms).<\/p>\n","protected":false},"excerpt":{"rendered":"<p>To put the bottom line at the top, referral commission for real estate agents is approximately 25% of the gross commission from the applicable side of the transaction. Why “approximately”? Because there isn’t a standard rate for referral fees (and therefore referral commissions), and they’re negotiable. You likely have many more questions related to referral [&hellip;]<\/p>\n","protected":false},"author":33,"featured_media":61696,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[97,83],"tags":[],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/61695"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/33"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=61695"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/61695\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media\/61696"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=61695"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=61695"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=61695"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}