{"id":61728,"date":"2022-11-10T14:13:45","date_gmt":"2022-11-10T22:13:45","guid":{"rendered":"https:\/\/www.marketleader.com\/?p=61728"},"modified":"2022-11-10T14:14:53","modified_gmt":"2022-11-10T22:14:53","slug":"what-is-a-cma-in-real-estate","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/what-is-a-cma-in-real-estate\/","title":{"rendered":"What Is a CMA in Real Estate?"},"content":{"rendered":"<p><strong>What is a CMA in real estate?<\/strong><\/p>\n<p>“CMA” stands for comparative market analysis, and it refers to the process of estimating a property’s value, based on the listing prices and sold prices of similar homes nearby and other data related to the local market.<\/p>\n<p>Many agents either don’t know how to do a CMA (because they didn’t receive any training) or they don’t realize its importance. So it ends up being just another task on their long list of obligations.<\/p>\n<p>But it can be (should be!) much more than that. This kind of analysis is extremely valuable, especially in today’s fast-moving, ever-changing real estate market. It’s one of the most important things separating real estate agents from Zillow.<\/p>\n<p>Get ready to learn everything you need to know about performing comparative market analyses that benefit leads, clients, and agents alike, because this article walks you through how to do a CMA in four simple steps.<\/p>\n<p>But before we get into the nitty gritty, let’s take a step back to consider the purpose. Why is a CMA in real estate even necessary?<\/p>\n<p>Knowing how to create a CMA from start to finish is important. But having a clear understanding of the “why” is what will give you a significant boost over your competitors.<\/p>\n<h2 class=\"BlogH2\">How a CMA Benefits <span style=\"text-decoration: underline;\">Consumers<\/span><\/h2>\n<p>The benefit of a CMA for sellers (or potential sellers) is obvious. By comparing their home to similar homes that either just sold or are under contract, <strong>they can get a better idea of what their home is currently worth<\/strong>.<\/p>\n<p><strong>But a CMA can also be a valuable point of reference for <em>buyers<\/em>.<\/strong> They don’t want to make an offer that’s too low, and they don’t want to overpay. A CMA helps them avoid both risks. It helps them size up their competition (by showing them what other buyers may be willing to pay for the home they’re interested in) while also giving them a clear boundary that shows how high is too high.<\/p>\n<p>In any case, what consumers of all kinds are looking for is objectivity. They want to know without a doubt that a home’s value is derived from a valid, data-driven process. Why? Because it <strong>provides a sense of comfort<\/strong> during what is often a stressful time and it <strong>gives them confidence<\/strong> to make a move (pun intended).<\/p>\n<p>The upcoming four-step process for creating a CMA in real estate will offer all of the aforementioned consumer-facing benefits.<\/p>\n<p>But a CMA also benefits you as the agent. Here’s how.<\/p>\n<h2 class=\"BlogH2\">How a CMA Benefits <span style=\"text-decoration: underline;\">Real Estate Agents<\/span><\/h2>\n<p>Let’s start with the basics.<\/p>\n<p><strong>A CMA is a great way to prove your value and establish credibility.<\/strong> By showing not only facts and figures but also your interpretation, insights, and conclusions based on the data, you’re essentially saying, “I’m the local expert, I’ve put in the hard work to understand this market at a granular level, and I’m bringing a kind of value that no other agent can provide.”<\/p>\n<p><strong>A CMA gives you the confidence you need to negotiate like a top-producer.<\/strong> You can rest on the power of objectivity instead of the weakness of personal opinion. It’s difficult to dismiss an offer or counter a price that’s supported with good data.<\/p>\n<p>But did you know that a CMA can also be a powerful marketing tool?<\/p>\n<p><strong>For example, consider sending prospects a CMA as part of your <a href=\"https:\/\/www.marketleader.com\/blog\/real-estate-direct-mail\/\">direct mail marketing<\/a> strategy.<\/strong> Homeowners are rarely in touch with local market trends, despite what they might think. Few could tell you the current value of their home, and chances are, they’d be shocked to know how much the homes in their neighborhoods are currently selling for.<\/p>\n<p>Leveraging a real estate CMA (even a lightweight CMA in a postcard, brochure-style pamphlet, or an email) can help prospects think more seriously about taking the next step. It could be that simply presenting that kind of information to a prospect – at a time when no other agent would – is all it takes to turn them into a lead, and eventually into a client.<\/p>\n<p>By the way, <a href=\"https:\/\/www.marketleader.com\/products\/professional-for-agents\/\">you can easily create useful mini CMAs for your leads and clients with Market Leader Pro<\/a>.<\/p>\n<h2 class=\"BlogH2\">How To Do a CMA (for Sellers)<\/h2>\n<p>First, a caveat. There’s no such thing as a one-size-fits-all process for making a CMA in real estate. The exact procedures will differ each time, depending on where you are, who it’s for, and why you’re doing it.<\/p>\n<p>So while the four-step process outlined below is a kind of “how-to guide,” it can’t possibly take every situation into account. Too many factors and variables are involved, because all prospects, leads, clients, neighborhoods, homes, and listings are different.<\/p>\n<p>For example, how you do a CMA for a standard ranch-style home in rural America is going to look very different than what you’d do for a inner-city luxury property in Toronto. And the process you’d go through to create a generalized direct mail piece will look different than it would if you were putting a report together for a buyer.<\/p>\n<p>Regardless, it’s helpful to familiarize yourself with the basic methodology that this step-by-step guide outlines so you can tailor it to the needs at hand.<\/p>\n<h3 class=\"BlogH3\">The Checklist<\/h3>\n<p>Every standard CMA in real estate (for a seller) will include the following:<\/p>\n<ul>\n<li>Property details (Step 1)<\/li>\n<li>Comps (Step 2)<\/li>\n<li>Pricing recommendations (Step 3)<\/li>\n<\/ul>\n<h3 class=\"BlogH3\">Step 1: Learn About the Home<\/h3>\n<p>In the steps that follow, you’re going to find comparable listings (or “comps”). To do that, you first need to learn everything you can about the home so you’ll know how to draw accurate comparisons.<\/p>\n<p>Keep in mind that you’re doing more than just fact-collecting. You’re also learning about the home’s “story,” so to speak: the history of the home, the neighborhood, and the surrounding area.<\/p>\n<p>The more research you do here, the more accurate the CMA will be. But here are the essential pieces of information you’ll need to collect:<\/p>\n<ul>\n<li>Location<\/li>\n<li>Size (square footage)<\/li>\n<li>Year built<\/li>\n<li>Number of beds and baths<\/li>\n<li>Condition (e.g., Is it new-build? Have there been any significant renovations?)<\/li>\n<li>Amenities, customizations, and special features<\/li>\n<li>Property tax information<\/li>\n<\/ul>\n<p>You can draw from many different sources as you conduct your research, including the following:<\/p>\n<ul>\n<li>The homeowner, of course<\/li>\n<li>MLS data<\/li>\n<li>Previous listing data (i.e., list price, sold price, days on the market, etc.)<\/li>\n<li>The NAR’s <a href=\"https:\/\/www.nar.realtor\/realtors-property-resource-rpr\">Realtors Property Resource<\/a> (RPR)<\/li>\n<li>Tax records<\/li>\n<\/ul>\n<h3 class=\"BlogH3\">Step 2: Compile a List of Comps<\/h3>\n<p>Now that you know about the home, you know how to compare it to other homes in the area. Here are some best practices.<\/p>\n<ul>\n<li><strong>Be smart about how you choose your comps.<\/strong> Comparables (i.e., “comps”) are listings (both sold and active) that are very similar to the property you’re working with. Get as close as you can to finding identical matches, especially in terms of their location, square footage, lot size, layout, style, and condition.<\/li>\n<li><strong>Compile a strong list.<\/strong> Include enough properties on your list to determine an average and suggest a reasonable range of prices. But don’t make it so long that you and your client get bogged down with too much information.<\/li>\n<li><strong>Stick with the here-and-now.<\/strong> Remember, the key to making a successful CMA in real estate is to work with accurate, reliable, and relevant data. There’s no point in comparing the home in question to a listing that sold three years ago, or even one year ago, for that matter. You and your client need to know what similar homes are selling for now. So stay current, within, say, the past three months. And in this market, you definitely shouldn’t dig back farther than six months.<\/li>\n<li><strong>Look at sold prices and active listings.<\/strong> By looking at homes that have sold recently and listings that are currently active, you’ll get an even keener sense of the local market’s condition. Be sure to pay close attention to comparable listings that are currently under contract because that will give you insight into the difference between asking price and sold price. It’s those kinds of nuances that will both impress your clients and give you the competitive edge you need to become the local expert.<\/li>\n<\/ul>\n<h3 class=\"BlogH3\">Step 3: Set Your Pricing Recommendations<\/h3>\n<p>At this point you’ll be equipped with all of the information you need to provide sound guidance for your clients.<\/p>\n<p>Give them a range of three numbers to consider – one that’s on the conservative side, one that’s on the aggressive side, and one that’s in the middle.<\/p>\n<p>Base your pricing recommendations on three factors:<\/p>\n<ul>\n<li>Your list of comps<\/li>\n<li>The home’s condition and appeal (including any adjustments that need to be made to account for customizations, amenities, renovations, etc.)<\/li>\n<li>Anticipation of where the market seems to be headed<\/li>\n<\/ul>\n<h3 class=\"BlogH3\">Step 4: Create and Deliver Your CMA<\/h3>\n<p>There are many formatting options and ways you could present your CMA report to your clients. For you, that might look like a PowerPoint presentation, a simple set of tables and charts, or even a quick email with a bulleted outline.<\/p>\n<p>There’s no right or wrong here. But as we saw in the checklist above, be sure to include at least a summary of the property details, your list of comps, and your pricing recommendations. Make it easy for them to understand your process and how you arrived at your conclusions. Not only does this show the objectivity of your report, but it also puts your leads and clients at ease in case they’re disappointed by numbers they didn’t expect.<\/p>\n<p>However you go about delivering and presenting your CMA, keep in mind that you’re bringing value, proving your worth, and demonstrating your expertise.<\/p>\n<h2 class=\"BlogH2\">How to Send a Quick CMA With Market Leader Pro<\/h2>\n<p>When you get a new seller lead through Market Leader’s <a href=\"https:\/\/learn.marketleader.com\/display\/learning\/HouseValues+Lead+Experience\">HouseValues<\/a> leads product, you can send them a quick, mini CMA through our Marketing Center.<\/p>\n<ul>\n<li>It’s pre-formatted and pre-populated with customizable text.<\/li>\n<li>It can even include current active listings from the MLS and sold comparables to support the price range you determine.<\/li>\n<li>You can create your CMA as an email or printable document.<\/li>\n<\/ul>\n<p><a href=\"https:\/\/www.marketleader.com\/products\/professional-for-agents\/\">Learn more about Market Leader Pro, the single-solution product for generating more leads and turning them into lifelong clients.<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>What is a CMA in real estate? “CMA” stands for comparative market analysis, and it refers to the process of estimating a property’s value, based on the listing prices and sold prices of similar homes nearby and other data related to the local market. Many agents either don’t know how to do a CMA (because [&hellip;]<\/p>\n","protected":false},"author":33,"featured_media":61732,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[34,35,83],"tags":[],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/61728"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/33"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=61728"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/61728\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media\/61732"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=61728"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=61728"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=61728"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}