{"id":8161,"date":"2012-11-30T19:45:07","date_gmt":"2012-11-30T19:45:07","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=8161"},"modified":"2022-01-26T14:39:47","modified_gmt":"2022-01-26T22:39:47","slug":"does-having-a-real-estate-coach-give-you-an-advantage","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/does-having-a-real-estate-coach-give-you-an-advantage\/","title":{"rendered":"Does Having a Real Estate Coach Give Agents an Advantage?"},"content":{"rendered":"<p>If you type the term “real estate coach” in any search engine, you’re likely to see a long list of websites claiming they have the best coaches for you. It’s easy to see why some real estate agents are weary of finding a coach (hint: If they refer to themselves as a guru, you may want to run).  Despite all the charlatans, it’s worth investigating whether a coach can help you meet your goals before you chalk them up to being snake oil salesmen.<\/p>\n<h2>What Real Estate Coaches Offer<\/h2>\n<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-8191\" title=\"real estate coach\" src=\"\/wp-content\/uploads\/2012\/11\/Fotolia_40675936_XS-198x300.jpg\" alt=\"real estate coach\" width=\"198\" height=\"300\" \/>Just like a baseball, football or basketball coach, a real estate coach helps you come up with a game plan. According to Dave Harding, Chief Research Officer for iHave5Questions, real estate coaches offer four main advantages:<\/p>\n<ol>\n<li>Helping you set short-term goals to achieve long-term goals you set for yourself.<\/li>\n<li>Adding to your skills.<\/li>\n<li>Keeping you motivated (to use all your skills, including the ones added by the coach).<\/li>\n<li>Holding you accountable and on track, using 2 and 3 to accomplish 1.<\/li>\n<\/ol>\n<p>A good real estate coach excels at keeping you focused on your goals, coming up with workable strategies and having a way of measuring success. According to Bobby Casey, the Managing Director of Global Wealth Protection, “A coach is typically someone who has been through the process you are currently facing and has come through the battlefield victorious. They can help guide you and avoid some pitfalls you may otherwise miss. If nothing else this person can shoot down your stupid ideas when you think they are world changing.” They may not make you go to the gym, but they’ll help you build a strong company.<\/p>\n<h2>Who Needs Coaching?<\/h2>\n<p>If you are an active real estate agent, you need a coach. Surprised? Even veteran real estate agents employ coaches. The best time to get a coach is at the very start of your career. According to Dave Harding, “As a new practitioner, soak in all the coaching available from your brokerage for the first year, or first calendar year, whichever horizon you will use to benchmark yourself. <\/p>\n<p>Thereafter, you should be supplementing what you get from your broker with you-specific coaching. Accept anything provided by your broker (or franchise parent company, or professional association) but do not rely on that generic support to determine your personal success. Then measure the coach’s contribution. If it’s not working, do what your clients do: Find another professional, but don’t give up on the idea. “<\/p>\n<p>A real estate coach does more than just brainstorm with you about ways to improve your business. In fact, most people don’t suffer from lack of ideas. Most people suffer from disorganization, demotivation and the inability to measure results. For instance, how do you know that your <a href=\"\/blog\/real-estate-newsletter-marketing-tips\/\">newsletter marketing strategy<\/a> is working? Can you measure how many people saw your Sunday advertisement in the paper? A real estate coach can help you keep track of what is working and how it can be improved.<\/p>\n<h2>Finding a Coach<\/h2>\n<p>You most likely already know your coach. “Sometimes you can get a job working for someone whom you respect and admire. In many cases this leads to a mentor relationship where you can develop that relationship throughout your career. You may also seek out professionals that are successful in your chosen field and offer them something of value in exchange for time granted for educating and working with you in real estate investments. In my experience, this is almost never a financial transaction, but one of exchanging value for value. Maybe you are good at building websites or marketing, so you may offer those services to your targeted coach or mentor in exchange,” says Bobby Case.<\/p>\n<p>No one is an expert in every field. You may need more than one coach. It’s common in business for someone to have various experts they turn to for advice. Perhaps you need a coach for marketing and another one to help you with preparing contracts. A good place to start looking is in your network. Ask other real estate agents if they can recommend a coach. The desire for a real estate coach shows that you are willing to take your business to the next level. A coach can help you every step of the way and cheer for you on the sidelines.<\/p>\n<p><em>Have you used a real estate coach? How did the experience impact your business?<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>If you type the term “real estate coach” in any search engine, you’re likely to see a long list of websites claiming they have the best coaches for you. It’s easy to see why some real estate agents are weary of finding a coach (hint: If they refer to themselves as a guru, you may [&hellip;]<\/p>\n","protected":false},"author":25,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[97],"tags":[106,107,108,109,110,56],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/8161"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/25"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=8161"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/8161\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=8161"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=8161"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=8161"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}