{"id":8331,"date":"2012-12-05T23:48:46","date_gmt":"2012-12-05T23:48:46","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=8331"},"modified":"2022-10-24T10:27:53","modified_gmt":"2022-10-24T17:27:53","slug":"are-real-estate-postcards-still-worth-sending","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/are-real-estate-postcards-still-worth-sending\/","title":{"rendered":"Why Every Real Estate Agent Should Still Use Postcards"},"content":{"rendered":"<p>When I was a baby real estate agent my broker gave me a statistic. After almost 20 years, I’ve forgotten its specifics, but it went something like this: <strong>“For every home that goes on the market, another two homeowners on that same street will decide to sell.”<\/strong><\/p>\n<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-8361\" title=\"real estate postcards\" src=\"\/wp-content\/uploads\/2012\/12\/Fotolia_25940187_XS-300x200.jpg\" alt=\"real estate postcards\" width=\"300\" height=\"200\" \/>Ah, I thought, this is why homes for sale seem to come in clusters in neighborhoods. So, I started watching and darned if he wasn’t right.<\/p>\n<p>I chose to try to capture those eventual sellers with a postcard campaign, announcing “just listed” and “sold,” homes specifically. I used a Microsoft Publisher template, and printed the cards on perforated cardstock fed through my color laser printer. Hey, you laugh, but this was high-tech back when I sold real estate.<\/p>\n<p>So, here we are decades later with advanced technology and new and speedier ways of marketing. Are postcards still relevant? Are they worth the postage it costs to send them out? Do people even look at them?<\/p>\n<h2>Do Postcards Work?<\/h2>\n<p>They work for Franklin, Mass. agent Barbara Todaro. In fact, she knows without a doubt that when she does a mailing, business will flow in. She has good reason to be confident. Back in 2011, for instance, Todaro took a listing in a subdivision in her farm. <strong>That day she mailed 200 just listed postcards to all the residents in the community. From that one mailing she gained six new listings.<\/strong><\/p>\n<p>“Along with just listed postcards, we will also mail future postcards that reflect a pending sale and a closed transaction,” Todaro says on <a href=\"http:\/\/activerain.com\/\">ActiveRain<\/a>. The pending cards are something a lot of agents don’t consider, and they should. “This gets the neighbors talking to the homeowner and, hopefully, I get a referral out of it,” Todaro said.<\/p>\n<p>She gives a lot of credit to the integration of her postcards with her other marketing efforts, most specifically, her blog, which contains over 2,000 blog posts. “Before we are called to give a listing presentation, the homeowners have read my posts and know exactly what we do for marketing,” Todaro continues.<\/p>\n<p>Todaro begs to differ with agents who eschew postcard campaigns as an “old-timer” method of lead generation: “Never eliminate a method because it’s basic. Those are sometimes the best methods. Everyone reads their mail and not everyone goes online,” she says.<\/p>\n<hr \/>\n<p><em><strong>Watch this video<\/strong> to learn how to create a real estate postcard to market a specific listing using the tools in your Market Leader system&#8217;s Marketing Center.<\/em><\/p>\n<div class=\"wistia_responsive_padding\" style=\"padding:55.45% 0 0 0;position:relative;\">\n<div class=\"wistia_responsive_wrapper\" style=\"height:100%;left:0;position:absolute;top:0;width:100%;\"><iframe loading=\"lazy\" src=\"\/\/fast.wistia.net\/embed\/iframe\/2ee40af39a?videoFoam=true\" allowtransparency=\"true\" frameborder=\"0\" scrolling=\"no\" class=\"wistia_embed\" name=\"wistia_embed\" allowfullscreen mozallowfullscreen webkitallowfullscreen oallowfullscreen msallowfullscreen width=\"100%\" height=\"100%\"><\/iframe><\/div>\n<\/div>\n<p><script src=\"\/\/fast.wistia.net\/assets\/external\/E-v1.js\" async><\/script><\/p>\n<hr \/>\n<p>\n<a href=\"http:\/\/www.marketleader.com\/products\/professional-for-agents\/\"><img class=\"alignleft size-medium wp-image-44201\" src=\"https:\/\/www.marketleader.com\/wp-content\/uploads\/2016\/02\/Blog-CTA-arrows-2.png\" alt=\"Learn more about Market Leader Professional\"><\/a><strong><em>Market Leader Professional&#8217;s marketing center makes it easy to craft automated direct mail campaigns using thousands of customizable templates. <\/em><a href=\"http:\/\/www.marketleader.com\/products\/professional-for-agents\/\">LEARN MORE &gt;&gt;<\/a><\/strong><\/p>\n<hr \/>\n<h2>Costs of a Postcard Campaign<\/h2>\n<p>Setting up the postcard campaign is the costliest part of the project. From there, if it’s done right, it can pretty much run on autopilot. The cost of real estate postcards is also pretty negligible.<\/p>\n<h3>The Mailing List<\/h3>\n<p>The first thing you need when considering a postcard campaign is a mailing list. There are a number of places to get these. Many agents use the MLS. The U.S. Postal Service rolled out a new program last spring called “<a href=\"https:\/\/www.usps.com\/business\/every-door-direct-mail.htm\">Every Door Direct Mail<\/a>,” or EDDM for short. Instead of printing out an address list from the MLS, the Postal Service allows you to map out your target area according to address, right there on the website.<\/p>\n<p>Since Todaro now uses targeted marketing, she prefers <a href=\"http:\/\/www.accudata.com\/\">AccuData<\/a>. She sends them the parameters for her latest campaign and they send her a count and a price for a database matching her specifics. Regarding cost, Todaro said, “I don’t even know what I pay, but it’s in the hundreds, not the thousands.” AccuData updates each of her purchased databases once a year.<\/p>\n<h3>The Postcards<\/h3>\n<p>There are lots of companies that offer stock marketing postcard designs to the real estate professional. Some, such as <a href=\"http:\/\/www.marketleader.com\/marketing-center\">Sharper Agent<\/a>, offer added goodies, like an integrated contact management\/marketing platform. Imprev, another major player in the postcard marketing arena, offers the ability to send the project directly to one of their outside print vendors or directly to your office printer. Of course, both companies have a menu of options, and prices vary according to your needs.<\/p>\n<h3>Postage<\/h3>\n<p>Aside from the cards’ creation, postage is the next biggest outlay of marketing funds. If you don’t take advantage of bulk mail rates or the break in price offered by the U.S. Postal Service’s EDDM program, a standard postcard costs 32 cents to mail.<\/p>\n<p>Todaro tells me I’m a dinosaur (actually she was much kinder than that) and that the real estate market has changed so much that we can no longer count on my broker’s statistic. Still, if I were still selling real estate and I knew that I would get a minimum of five new listings for each 200 postcards I mailed, I’d like that statistic just as much.<\/p>\n<p><em>Have you had success using real estate postcards to market your business? Let us know whether you think postcards are still an important marketing tool for agents.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>When I was a baby real estate agent my broker gave me a statistic. After almost 20 years, I’ve forgotten its specifics, but it went something like this: “For every home that goes on the market, another two homeowners on that same street will decide to sell.” Ah, I thought, this is why homes for [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[35],"tags":[101,111,87,112,113,56],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/8331"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=8331"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/8331\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=8331"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=8331"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=8331"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}