{"id":8461,"date":"2012-12-08T01:47:47","date_gmt":"2012-12-08T01:47:47","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=8461"},"modified":"2022-01-26T18:23:16","modified_gmt":"2022-01-27T02:23:16","slug":"why-real-estate-conferences-conventions-are-important-for-business","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/why-real-estate-conferences-conventions-are-important-for-business\/","title":{"rendered":"Why Real Estate Conferences &#038; Conventions Are Important for Your Business"},"content":{"rendered":"<p>The cocktail parties, the dining and dancing, and the networking that goes on at the typical real estate convention or conference may all seem pretty frivolous, but the return on your investment for attending is higher than you may think.<\/p>\n<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-8501\" src=\"\/wp-content\/uploads\/2012\/12\/Fotolia_28476260_XS-300x230.jpg\" alt=\"real estate conferences and conventions\" width=\"300\" height=\"230\" \/>You’re forging bonds with other agents from around the world &#8211; agents you can refer clients to and obtain referrals from in return. You’re also getting access to hands-on training, top-notch thought leaders and business strategies that can make for smoother (and more frequent) transactions in the future.<\/p>\n<p>After a full year of managing hundreds of events, rubbing shoulders with the best of the best speakers and attending several of the real estate industry’s top events, I see three main benefits to attending conferences and conventions:<\/p>\n<h2>Education<\/h2>\n<p>On the more serious side of real estate conferences are the phenomenal educational opportunities offered through workshops and lectures. Trainers, nationally renowned speakers, thought leaders, and top industry experts offer timely information on topics and issues that are valuable to agents, brokers and team leads. If you were to obtain the same training outside industry sponsored conventions, you’d pay hundreds if not thousands to get access to this information. Not to mention that the trade exhibit halls are packed with new technology and vendors offering ways to make your business run smoother and smarter.<\/p>\n<p>Here at Market Leader, we offer weekly <a href=\"http:\/\/www.marketleader.com\/best-practices\">Power Hours<\/a> – webinars that attract thousands of agents every week. While the topics are timely and valuable (ideas to help you stand out in 2013 and business planning strategies, for instance), some people don’t learn well by listening – they need live training so they can pick up on body language and inflection. Live training forces you to focus on the speaker, so there are fewer distractions than when you’re listening to a webinar in your office.<\/p>\n<h2>Engagement<\/h2>\n<p>The trade expos at conferences and conventions offer a double bonus. Aside from what we can learn from the vendors, they offer engagement with these key partners to your business: sign companies, closing gift companies, photographers, office supply, insurance, mortgage lenders, coaches, email marketing, lead generation, contact management, transaction management, and technology solution-based companies galore. All of which most likely have great giveaways to encourage conversations (new iPad mini anyone?). How much is a conversation worth to your business?<\/p>\n<p>Then, there’s the engagement with your colleagues. It’s a lot easier to forge and build relationships when you’re given the opportunity to engage with other agents and vendors outside of work. The relationship blossoms when you meet these people face to face, exchange business cards, attend a breakout session, and spend time socializing with them. It’s a bit like a real estate transaction in that, at the end of the day, it’s a handshake.<\/p>\n<p>So, one of the most important benefits I took away from a recent conference is realizing that we all need human contact, we need validation, and we find both in the camaraderie at conventions and conferences.<\/p>\n<h2>Inspiration<\/h2>\n<p>We all like to be inspired, and a lot of what we hear at these events inspires us to excellence; it reminds us to stay ahead of the curve and to remain competitive.<\/p>\n<p>If I attend a lecture and a leader in the industry is talking about how she became wildly successful, you can bet I’m going to consider modeling her methods. At the very least, I’m inspired to be open to new ideas and new ways of doing things.<\/p>\n<p>At many of this year’s conferences, I was also able to better understand competitors, what they were doing and what they bring to the table. Competition is good and healthy in all aspects. From business to professional and personal growth, it encourages us to better our game and drill down our own UVPs (unique value propositions).<\/p>\n<p>We all know that we should always treat our businesses as a business, and every good business person understands the value of an annual review. Conventions and conferences offer an opportunity to review what’s working and what’s not in your real estate business. Sure, they can be pricey, but it’s important to invest the time and money to attend at least one conference or convention a year. You owe it to your business.<\/p>\n<p>If you attended any conferences, conventions, or trade shows this year, I’d love to hear which ones were your favorites and key takeaways.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The cocktail parties, the dining and dancing, and the networking that goes on at the typical real estate convention or conference may all seem pretty frivolous, but the return on your investment for attending is higher than you may think. You’re forging bonds with other agents from around the world &#8211; agents you can refer [&hellip;]<\/p>\n","protected":false},"author":26,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[27],"tags":[114,115,116,117],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/8461"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/26"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=8461"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/8461\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=8461"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=8461"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=8461"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}