{"id":8681,"date":"2012-12-12T18:03:34","date_gmt":"2012-12-12T18:03:34","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=8681"},"modified":"2016-02-01T18:57:42","modified_gmt":"2016-02-01T18:57:42","slug":"creating-actionable-social-media-strategies","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/creating-actionable-social-media-strategies\/","title":{"rendered":"Creating Actionable Social Media Strategies"},"content":{"rendered":"<p>The list of social media networking sites, including Twitter, Facebook, Linkedin, Active Rain, and YouTube, could make your head spin. If the thought of starting and maintaining an actionable social media strategy seems overwhelming, it’s time to come up with a game plan. In the world of social media, you are either a player or sitting the sidelines. Writing a blog from time to time, creating a Facebook page that you rarely visit or tweeting every couple of weeks doesn’t keep you in the game. In fact, it shows that you are inconsistent. Go beyond just creating a presence.<\/p>\n<h2>How to Get Started<\/h2>\n<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-8711\" title=\"social media strategies\" src=\"\/wp-content\/uploads\/2012\/12\/Fotolia_34233244_XS-300x198.jpg\" alt=\"social media strategies\" width=\"300\" height=\"198\" \/>Before you start creating accounts on every social media networking website under the sun, take some time to think about your target market. By focusing on a target market, you can create a consistent brand and focused social media strategy. “Determine your target market, because you will want to use the social media tool(s) where you will find your target market. … By establishing this, you will be more effective and efficient in your social media efforts,” says Sheryl Johnson, founder and CEO of BD-Pro Marketing Solutions.<\/p>\n<p>A target market is who you think will buy a property or service from you. Create a list of characteristics that you think your customer base has—age, marital status, geographic location, occupation and hobbies to name a few. This list is referred to as a demographic profile. Use this demographic profile when creating your online presence.<\/p>\n<h2>Following a Schedule<\/h2>\n<p>Consistency is the name of the game, so don’t overextend yourself right off the bat. In fact, you need a schedule to stay on point. According to John-Henry Scherck, Digital Marketer for SEER Interactive, “I generally call these content calendars and with them I like to be consistent. It&#8217;s not about volume; consequently, it&#8217;s all about quality and consistency. If you can figure out a schedule that adds value to your followers and keeps them engaged, it doesn&#8217;t matter if you make it a weekly event (like a new blog post), a daily event (like Facebook updates), or multiple updates a day (via Twitter). As long as it&#8217;s consistent and meaningful, you should be fine.”<\/p>\n<p>Choose one social media networking website to start. Spend time creating a profile that will attract your target market.  “Create a solid profile (or review your current profile) and include a picture, include information about what differentiates you from other Realtors®, add testimonials and\/or recommendations, be clear about how you add value to your buyers\/sellers,” says Sheryl Johnson. Set up a “content calendar” to help you stay focused. Once you have set an online presence, stay true to your own branding. Your branding is how you want to represent your real estate business. People are looking for a brand they can trust. That trust is created through consistency.<\/p>\n<h2>Short-Term Goals<\/h2>\n<p>Goals help you create actionable social media strategies because they keep you focused and help you measure your progress. “No campaign is the same, but a goal that&#8217;s good for early on is raising brand awareness &#8211; which can be measured through follower count. If you are providing value and interacting with others on social media, more people are going to learn about your business,” says John-Henry Scherck. A high follower count adds value to your brand and attracts customers. However, a high follower count doesn’t measure true engagement. Long-term goals help you keep your followers engaged. People don’t buy property every day, so you want them to remember you when it comes time for them to buy or sell a property.<\/p>\n<h2>Long-Term Goals<\/h2>\n<p>Maintain a relationship with your followers. “Engage with your followers. Social media is not about collecting contacts. It is also about interacting with them. This is what will set you apart from others and help you grow your connections,” says Sheryl Johnson. You keep your followers engaged by sharing information that your target market will find relevant to their lives. If your target market is the residential homebuyer, posting informative articles or blogs about commercial real estate will not keep their attention. Your follower numbers will be high, but they won’t translate into more sales. Interacting with your followers by asking questions or answering questions will help you get an accurate assessment of how many people are really following you. When it comes to creating actionable social media strategies, you must see the forest for the trees. This means don’t lose sight of your long-term goals.<\/p>\n<p><em>Do you follow a social media schedule for your real estate business? What strategies have or have not worked for you?<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>The list of social media networking sites, including Twitter, Facebook, Linkedin, Active Rain, and YouTube, could make your head spin. If the thought of starting and maintaining an actionable social media strategy seems overwhelming, it’s time to come up with a game plan. In the world of social media, you are either a player or [&hellip;]<\/p>\n","protected":false},"author":25,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[104],"tags":[87,102,103,105,118],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/8681"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/25"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=8681"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/8681\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=8681"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=8681"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=8681"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}