{"id":8881,"date":"2013-01-11T17:44:35","date_gmt":"2013-01-11T17:44:35","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=8881"},"modified":"2021-12-02T13:12:56","modified_gmt":"2021-12-02T21:12:56","slug":"real-estate-yard-signs-breathing-new-life-into-an-old-friend","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/real-estate-yard-signs-breathing-new-life-into-an-old-friend\/","title":{"rendered":"Real Estate Yard Signs &#8211; Breathing New Life Into an Old Friend"},"content":{"rendered":"<p>When one considers how much business we get from that thing sticking in the front lawn of our listings, it’s amazing how we take them for granted. One phone call and the sign is installed to our specifications. Another one and it’s taken down and stored. Most agents never touch their signs unless it’s to re-attach a wind-blown rider.<\/p>\n<p>Like most aspects of the real estate industry, real estate yard signage is changing.<\/p>\n<h2>History of Real Estate Signage<\/h2>\n<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-8901\" title=\"real estate yard signs\" src=\"\/wp-content\/uploads\/2012\/12\/Fotolia_32750180_XS-267x300.jpg\" alt=\"real estate yard signs\" width=\"267\" height=\"300\" \/>Historically, real estate signs served two purposes: They advertised a piece of property for sale and provided contact information to interested buyers.<\/p>\n<p>With the formation of real estate brokerages, real estate signs added another dimension: the opportunity to distinguish one company from another. It worked, too. Brokerages such as Century 21, Re\/Max and Coldwell Banker created signs that remained the same for decades, firmly branding their logo into the minds of consumers.<\/p>\n<p>This all started to shift about a decade ago, according to Monte Pratt of <a href=\"https:\/\/jackpratt.com\/\">Jack Pratt Signs<\/a>. “Agents no longer wanted to wrap their identity into the broker’s identity,” he recalls.<\/p>\n<p>“Back in 2002 we noticed that Keller Williams agents didn’t want the standard red and gray signs, they wanted to build their own signs – to break free of the corporate brand,” Pratt continues. “Gary Keller realized that prospective real estate clients choose an agent, not a brokerage, and decided that, with certain standards and guidelines put forward, agents should be allowed to brand their signs in whatever unique ways they choose.”<\/p>\n<p>This is when Pratt’s company seized the opportunity and began creating custom signs for agents. You can find photos of some of these signs at Pratt’s ActiveRain <a href=\"https:\/\/activerain.com\/blogs\/montepratt\/\">profile<\/a>.<\/p>\n<h2>Real Estate Signs Today<\/h2>\n<p>Fifty-three percent of today’s homebuyers list “yard signs” as the method they use to find a home, according to the <a href=\"https:\/\/www.nar.realtor\/news-releases\/2012\/10\/nar-survey-of-home-buyers-and-sellers-shows-dual-income-couples-fueling-market\">National Association of Realtors®<\/a>.<\/p>\n<p>So, while signs remain valuable as a way to grab people’s attention, today’s agents are expecting their yard signs to multi-task.<\/p>\n<p>Some agents use QR codes on their signs, according to Pratt. The way most agents use QR codes, however, renders them ineffective as a lead capture system, and are nothing more than “virtual flyer boxes,” according to Pratt.<\/p>\n<h2>Brochure Boxes and Riders<\/h2>\n<p>Are brochure boxes a thing of the past? From the neighbors complaining about flyers cluttering up the neighborhood, and neighborhood kids pilfering them, to the seemingly never-ending job of keeping the boxes full, many agents stopped using the boxes on their signs when QR codes began to get popular. Most of the agents we spoke with say that, unless their client specifically requests a box, they don’t use them.<\/p>\n<p>The lowly real estate sign rider, however, is figuring prominently in agent branding efforts. Canadian agent Jake Palmer, in fact, has a fan club of sorts – folks who drive by his listings on a regular basis to find out what wacky rider he decided to use that week. Some of his most popular include “Not Haunted,” “Indoor Plumbing” and “Love Shack, Baby.”<\/p>\n<p>Back when the housing market began to nosedive and price reductions were becoming the norm, Knoxville, Tenn. broker Bill McSpadden’s “Reduced” sign rider showed not only the industry’s frustration, but served as a warning to low-ballers. In smaller print, below the word Reduced, it said “but not stupid or desperate.”<\/p>\n<p>Riders are also great gadgets on which to advertise your website url or the property’s website. Social media riders, especially those that contain the agent’s Facebook address, are popular right now, according to Pratt.<\/p>\n<p>If you’re thinking of modifying your marketing campaign in 2013 and need a method that is inexpensive and effective, consider changing the way you use your real estate signage. If you’ve made the switch and are using your signs in innovative ways, we’d love to learn more.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>When one considers how much business we get from that thing sticking in the front lawn of our listings, it’s amazing how we take them for granted. One phone call and the sign is installed to our specifications. Another one and it’s taken down and stored. Most agents never touch their signs unless it’s to [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[35],"tags":[119,120,87,121,122,123],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/8881"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=8881"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/8881\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=8881"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=8881"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=8881"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}