{"id":8941,"date":"2013-02-21T18:03:03","date_gmt":"2013-02-21T18:03:03","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=8941"},"modified":"2022-10-03T15:09:49","modified_gmt":"2022-10-03T22:09:49","slug":"real-estate-client-follow-up-its-not-just-for-prospects","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/real-estate-client-follow-up-its-not-just-for-prospects\/","title":{"rendered":"Real Estate Client Follow-Up: It’s Not Just for Prospects"},"content":{"rendered":"<p>Anyone who has lost a referral from a past client or from a friend or family member because the person “forgot you are in real estate,” knows the sting inherent in the kicking of one’s own hiney.<\/p>\n<p>My first broker, bless his patient little heart, took on the training of newbies with enthusiasm and humor. He knew how critical it is to follow up with leads. His motto was: “Follow up with them until they list or die.”<\/p>\n<p>While that’s a great philosophy for generating new business, remaining in contact with past clients yields an even greater benefit: the opportunity to build a referral business and rid yourself of the drudgery of prospecting for new leads.<\/p>\n<p>The first step in building your client follow-up project is to create a system – using your real estate contact management software. Once it’s complete, you can get going on the business of cultivating clients for life.<\/p>\n<h2>Follow-Up Methods<\/h2>\n<p>Client follow-up methods range from the simple to the elaborate, with costs from free to the-sky-is-the-limit. Let’s take a look at some of the more common ways agents choose to reach out and touch past clients and their sphere of influence.<\/p>\n<h2>Closing Gifts<\/h2>\n<p><img loading=\"lazy\" class=\"alignright wp-image-9001 size-medium\" title=\"real estate client follow-up\" src=\"\/wp-content\/uploads\/2012\/12\/Fotolia_38040604_XS-224x300.jpg\" alt=\"Learn how to incorporate real estate follow up strategies to develop strong relationships with your clients\" width=\"224\" height=\"300\" \/>Not all agents agree with the practice of giving closing gifts. Active Rain Real Estate Network posts are full of folks who make it clear that they don’t agree with it. Several agents claim that “providing good service is my gift.”<\/p>\n<p>Another agent claims that once you close the deal, you’re done: “Move on. You are not friends.” I’m not much of a gambler, but I’d be willing to bet that these are agents who receive few, if any, referrals from past clients.<\/p>\n<p>Then there are the agents who understand that the client who just closed escrow could have chosen from dozens of other agents, yet chose them &#8211; agents who not only want these clients for life, but want their friends and family as clients as well. To these agents, a closing gift is a must.<\/p>\n<p>As a young, first-time homebuyer I received an outdoor George Foreman grill from my agent. The lid was open and on the grill was a basket full of barbecue goodies: sauce, rubs, a small bag of mesquite wood chips and other stuff. To this day I remember the gift and the agent like it happened yesterday. I was truly impressed.<\/p>\n<p>Home warranties are a popular closing gift and the first time the client has to use the warranty, they will no doubt be thanking their lucky stars that you were their agent. This gift also provides the perfect opportunity for follow-up down the line. Call the client six months after closing to find out if they used the warranty and what type of service they received. This call reminds them that you gave them a gift and it puts your name in their brain again. Don’t forget to ask for a referral before ending the call, even if it’s the standard: “By the way, do you know anyone who is thinking of buying or selling a home?”<\/p>\n<p>Some agents make a gift to either their own favorite charity or that of their client. Typically, this is a percentage of the commission, but even donating $100 to a dog lover’s favorite animal rescue is a lovely gesture and one the client will surely remember.<\/p>\n<p>From gifts as simple as address labels and gift baskets to those one might give a luxury homeowner, such as high-end crystal stemware or a gift card to the best restaurant in town, closing gifts should be memorable.<\/p>\n<h2>Stay in Touch Online<\/h2>\n<p>While adding clients as friends on Facebook and Twitter gives you the perfect opportunity to reach out to them frequently throughout the year, if all your posts are listings and open houses, you’ll soon get a reputation as a self-promoting spammer. It’s “social” media, so get social and save the marketing for your website. Every time you post, and every time you respond to their posts, is a “reach out and touch” moment.<\/p>\n<p>Email is a great way to keep in touch without being too “salesy.”  Send former clients a link to an article about their favorite sports team, vacation spot or hometown. Keep an eye out for daily deals and shoot off an email with a link to one for their favorite restaurant, nail salon or home accessories store.<\/p>\n<h2>Use Snail Mail<\/h2>\n<p>Think just-listed and just-sold <a href=\"\/blog\/are-real-estate-postcards-still-worth-sending\/\">postcards<\/a> are only for dinosaurs? Think again. Better yet, ask Barbara Todaro, an agent in Massachusetts, about the time she sent out 200 just-listed postcards and got six new listings for her effort.<\/p>\n<p>She is so confident in the power of postcard marketing that it is her primary marketing method.<\/p>\n<p>If we distill her method down and focus on client retention, even just-listed and just-sold cards make sense. When you notice a new listing or a new sale in a former client’s neighborhood, pop a card in the mail. Homeowners are always interested in what’s going on in their local real estate market and frequently keep tabs on values in the area. When you become their source of real estate news, you become memorable.<\/p>\n<h2>Client Appreciation Events<\/h2>\n<p>Spending face-to-face time with past clients is the ideal way to build a strong and lasting connection with them.<\/p>\n<p>Wes Freas with Zephyr Realty in San Francisco believes strongly in that fact. The only marketing he does is running small ads in a local newspaper and a bit of direct mail marketing to his farm. His clients typically come via referral from former clients.<\/p>\n<p>Freas holds an annual wreath decorating party that has become a holiday tradition for hundreds of former clients. He cleans out his oversized garage, decorates, and lays out a spread of yummy appetizers and bottles of wine, in addition to the baskets overloaded with various holiday items used to decorate the wreaths he purchases.<\/p>\n<p>“The annual crab feed is probably the most popular event we host,” claims a broker from Napa Valley. Mid-November is the opening of Dungeness crab season in the San Francisco Bay Area, so she rents out a hall, sets up long banquet tables and offers salad, sourdough bread, wine, beer and all the fresh crab you can eat. It’s a casual affair and one that grows in popularity every year. By the way, her agents do all the cooking right there in the hall’s kitchen.<\/p>\n<p>If these client appreciation events are a bit extravagant for your budget or your clients, consider something simpler. Here’s a list of ideas from other agents:<\/p>\n<ul>\n<li>An outdoor cookout at your home, serving hamburgers and hot dogs.<\/li>\n<li>Tickets to a sporting event where you host the pre-game tailgate party.<\/li>\n<li>Hosted happy hour at a local pub.<\/li>\n<li>Rent a small facility and throw a summer luau.<\/li>\n<li>Plan a series of small, intimate dinners in your home, inviting several clients at a time.<\/li>\n<\/ul>\n<p>These types of events require advance planning, so they aren’t for everyone. Denise Lones, real estate marketing and business development expert, says that you’ll have far better success with your event if you do the following:<\/p>\n<ul>\n<li>Send “save the date” postcards to each invitee about eight weeks prior to the event.<\/li>\n<li>Send the actual invitation five weeks in advance of the event.<\/li>\n<li>Three weeks out, send a countdown card that reminds them the event is only three weeks away.<\/li>\n<li>Make a final phone call to any who haven’t sent an RSVP, telling them you’re hoping they will come.<\/li>\n<\/ul>\n<p>Always have a designated photographer on hand at all client events. Sharing the photos offers yet another way to follow up later on.<\/p>\n<p>What follow-up tactics have or have not worked for your real estate business?<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Anyone who has lost a referral from a past client or from a friend or family member because the person “forgot you are in real estate,” knows the sting inherent in the kicking of one’s own hiney. My first broker, bless his patient little heart, took on the training of newbies with enthusiasm and humor. [&hellip;]<\/p>\n","protected":false},"author":27,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[34],"tags":[124,125,126,87,127],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/8941"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/27"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=8941"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/8941\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=8941"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=8941"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=8941"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}