{"id":9101,"date":"2013-01-04T23:48:35","date_gmt":"2013-01-04T23:48:35","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=9101"},"modified":"2021-11-17T08:50:39","modified_gmt":"2021-11-17T16:50:39","slug":"using-twitter-to-sell-homes-in-just-15-minutes-a-day","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/using-twitter-to-sell-homes-in-just-15-minutes-a-day\/","title":{"rendered":"Using Twitter to Sell Homes in Just 15 Minutes a Day"},"content":{"rendered":"<p>These days it seems like everyone has a Twitter account. Politicians, celebrities, sports figures and companies have recognized the numerous opportunities that this information network provides. Real estate businesses use Twitter to connect to potential leads, promote their brands and sell homes. Because Twitter doesn’t require hours spent writing pages of content, you can devote 15 minutes a day to promote your real estate business and services. Before you start “tweeting,” it’s best to come up with a plan.<\/p>\n<h2>What to Tweet<\/h2>\n<p><img loading=\"lazy\" class=\"alignright size-medium wp-image-9131\" title=\"using twitter to sell homes\" src=\"\/wp-content\/uploads\/2012\/12\/Fotolia_47620707_XS-300x300.jpg\" alt=\"using twitter to sell homes\" width=\"300\" height=\"300\" \/>Just as easily as you can engage your target market with interesting tweets, you can also annoy and alienate your audience. According to Pete Deininger, Realtor® at <a href=\"https:\/\/www.thebrecklife.com\/\">Breckenridge Real Estate<\/a>, “The golden rule for businesses on social media is to never be salesy.” You want to offer your followers substance. According to Tierra Wilson, founder and CEO of New Media 4 Agents, “We don&#8217;t just put the Tweets out there and hope for the best.  We use multiple strategies to tweet home listings. One of the most effective is just to have fun. People love to see the inside of homes, so we use their natural voyeuristic tendencies to get them to take a peak. We tweet specific home features with links to images. For example,<em>’Cold outside! Wish you had this fireplace? For $250k you could. #interiors #realestate’<\/em> and we include a link to a single property website or IDX listing with pictures of the home.”<\/p>\n<p>Come up with a strategy before sending out tweets. Are you selling specific types of properties such as commercial spaces? Are you just building up a following? What target market are you courting? Your answers to these questions will dictate what you tweet. It’s also important to keep in mind that not every tweet has to be about real estate.<\/p>\n<h2>Tweeting Subjects<\/h2>\n<p>People may not want to read a tweet about a home listing everyday. Change it up so they become more engaged. “Tweet creative, valuable content that provides entertainment or expertise about the area. This will bring people to your site. If they decide to purchase a home in the future, you will be top-of-mind for them to contact,” says Pete Deininger.<\/p>\n<p>Pete Deininger’s List of Popular Tweeting Subjects:<\/p>\n<ul>\n<li>Ask fun and engaging questions. &#8220;What&#8217;s your all-time favorite holiday movie? Why?<\/li>\n<\/ul>\n<ul>\n<li>Share local photos; &#8220;Who loves to play in powder!?&#8221; &#8211; a pic of the new snowfall from last night.<\/li>\n<\/ul>\n<ul>\n<li>Share information about local events.<\/li>\n<\/ul>\n<ul>\n<li>Tweet local insight (where to find inexpensive\/quality rental ski equipment, best happy hour in town, ski parking tips, local hero stories, etc.).<\/li>\n<\/ul>\n<p>By tweeting questions, you engage your audience or create a two-way engagement channel, which will help build relationships. You can ask people about what they are doing for the weekend, if they’ve seen a new movie that came out, how they are dealing with the weather or if they have any holiday plans. Give back to your audience by asking questions and responding to their tweets.<\/p>\n<h2>The Compose-Edit-Reply Schedule<\/h2>\n<p>Create a tweeting schedule that you follow every day. The best time to tweet is anytime between 1 p.m. and 3 p.m. Monday through Thursday, according to the data collected by the bookmarking service, Bitly. You can set an alarm on your phone that goes off every day to remind you. Compose a tweet to send out to your followers. Give yourself five minutes to write and five minutes to edit it down to fit the maximum allotment of 140 characters. Keep in mind that the length of your username will reduce the amount of characters you can use.  After you tweet, spend five minutes replying back to comments from past tweets. Take advantage of the dialogue your tweets are creating. Send thoughtful replies that designate you as a real thought leader in your field.<\/p>\n<h2>Tracking Success<\/h2>\n<p>Track your success by using a web analytic service. “If you have Google Analytics installed on your website, you will be able to measure how many visits you are acquiring from Twitter. You will also get a glimpse at what they are doing after they get to your site. You have the ability to set up &#8216;goals&#8217; in Google Analytics, and your goal could be to track the number of visits coming from Twitter that eventually land on a listing page or submit contact information,” says Pete Deininger. It’s important to be able to measure the success or failure of your social media campaigns in order to know what is working and what needs tweaking.<\/p>\n<h2>Twitter Burnout<\/h2>\n<p>Prevent Twitter burnout or writer’s block by making a list of all possible subjects that you can tweet about. Taking a look at other real estate agent’s tweets will also give you some ideas. You can also get creative. Some real estate businesses have experienced success by setting up Twitter profiles for properties. Experiment and see what works for you and your real estate business. Above everything else, commit to spending 15 minutes a day. Consistency is the name of the game in social media marketing.<\/p>\n<p>What are your favorite subjects to tweet about? Tell us what aspects of your tweeting plan have &#8211; or have not &#8211; worked for your real estate business.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>These days it seems like everyone has a Twitter account. Politicians, celebrities, sports figures and companies have recognized the numerous opportunities that this information network provides. Real estate businesses use Twitter to connect to potential leads, promote their brands and sell homes. Because Twitter doesn’t require hours spent writing pages of content, you can devote [&hellip;]<\/p>\n","protected":false},"author":25,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[104],"tags":[87,102,103,128,129,18],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/9101"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/25"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=9101"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/9101\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=9101"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=9101"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=9101"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}