{"id":9511,"date":"2013-02-06T19:35:23","date_gmt":"2013-02-06T19:35:23","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=9511"},"modified":"2016-02-04T00:42:41","modified_gmt":"2016-02-04T00:42:41","slug":"how-to-keep-customers-engaged-on-your-website","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/how-to-keep-customers-engaged-on-your-website\/","title":{"rendered":"How to Keep Customers Engaged on Your Website"},"content":{"rendered":"<p>While a website must express a company’s brand, services and products (properties), it should also entertain the visitor up to a certain point. Boring, unprofessional and confusing websites make for bad storefronts for real estate businesses. It’s like walking into a store littered with products or lacking any employees. Generally, people will walk out and never return. Ineffective websites alienate customers, so it’s absolutely critical for real estate businesses to take an objective approach when designing or redesigning their website to enhance their customers’ experience.<\/p>\n<h2>Who is Your Audience?<\/h2>\n<p><img loading=\"lazy\" class=\"alignright size-full wp-image-9581\" title=\"create an engaging real estate website\" src=\"\/wp-content\/uploads\/2013\/01\/Fotolia_47753777_XS.jpg\" alt=\"create an engaging real estate website\" width=\"288\" height=\"287\" \/>You must figure out your target market or audience before you can create an engaging website. According to Christian K. Nordtømme, Creative Director at <a href=\"http:\/\/nextpage.no.\">Next Page<\/a>, “Real estate brokers and agents have two audiences: sellers, who need to be convinced that they&#8217;ll get the best price possible for their treasured home, and buyers, who need to know they&#8217;re getting a great deal. The website needs to hit home with both audiences.”<\/p>\n<p>Not every design or layout works for every customer. Likewise, your website should appeal to your target market. For instance, those selling modern designed properties will have a greater chance of customer engagement by choosing a website design that incorporates a streamlined, contemporary look. Create a website that mirrors the types of properties that you sell or your customer base.<\/p>\n<h2>High Quality Photos<\/h2>\n<p>Poor quality photos will not attract customers or keep them engaged.  According to Justin Hughes, co-founder of <a href=\"http:\/\/www.realtymogul.com\">Reality Mogul<\/a>, “Quality photos will hook your visitors’ interest much more effectively than low-resolution or otherwise poor-quality photography. They will be much more likely to dive into the text when it is accompanied by high-quality imagery, and let&#8217;s face it, real estate metrics can be very bland.” Using high quality photos in some cases is easier said then done. Investing in a digital camera or hiring a photographer to shoot a home can make all the difference in the world when designing a visually pleasing website.<\/p>\n<h2>Reduce Friction<\/h2>\n<p>Requiring visitors to take a number of steps while going through your website is a good way to get them to leave. “Don&#8217;t require users to perform a bunch of actions in order to do the things they want. Each step or required action is a potential point where a user will drop off. If it is a pain to engage with your site, people will just move on because, at a certain point, it is no longer worth it to them. Allow them to do what they want with as little friction as possible and your engagement rates will soar.”<\/p>\n<p>You wouldn’t want to visit someone who had you perform chores, fill out paperwork or reveal personal information. Don’t make your visitor work for information. Everything on your website should be a click away. Likewise, give people the ability to go back to the home page from every page. Visitors will not return of they are easily lost on your website.<\/p>\n<h2>User Interface for Your Website<\/h2>\n<p>Good user interface allows customers to easily complete tasks like signing up for a newsletter, viewing listings, reading website content or making selections. People have certain expectations about navigating on a website. Clearly designed categories and secondary links allow the user to access information. “Don&#8217;t try and reinvent the wheel with your UI. Unless you really nail it, you run the risk of breaking people&#8217;s expectations, and they will feel frustrated when trying to perform common actions in their usual way. Also, try not to overload [users] with choices. Keep things simple and make the most common actions obvious with higher-priority ordering in your UI.”<\/p>\n<p>Design your website for the user and not for any aesthetic reasons. Navigate your own website from a user perspective to determine if any changes need to be made.<\/p>\n<h2>Rewards<\/h2>\n<p>Reward visitors for coming to your website. This doesn’t mean offering coupons or special offers. In fact, you can reward your customer with engaging content, high quality photos, easy access to pertinent information or gamification. “Gamification is a broad term used to describe any form of UX (user experience) where a user is rewarded for engagement. This can be as simple as profile badges for top contributors or giving points to users when they comment on posts,” says John Hughes.<\/p>\n<p>You can also increase visitor engagement by responding to comments or questions. As many real estate businesses find, customers feel engaged when the website has been tailored and thoughtfully created for them. While promoting your brand is essential, engaging your customer will establish a strong bond that can lead to a quality customer base.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>While a website must express a company’s brand, services and products (properties), it should also entertain the visitor up to a certain point. Boring, unprofessional and confusing websites make for bad storefronts for real estate businesses. It’s like walking into a store littered with products or lacking any employees. Generally, people will walk out and [&hellip;]<\/p>\n","protected":false},"author":25,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[50],"tags":[86,144,145,87,146,135,147,136],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/9511"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/25"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=9511"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/9511\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=9511"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=9511"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=9511"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}