{"id":9841,"date":"2022-08-28T19:58:17","date_gmt":"2022-08-29T02:58:17","guid":{"rendered":"http:\/\/www.marketleader.com\/blog\/?p=9841"},"modified":"2022-10-19T11:09:49","modified_gmt":"2022-10-19T18:09:49","slug":"real-estate-virtual-assistant","status":"publish","type":"post","link":"https:\/\/www.marketleader.com\/blog\/real-estate-virtual-assistant\/","title":{"rendered":"Should I Hire a Real Estate Virtual Assistant?"},"content":{"rendered":"<p>Are administrative tasks stealing your time away from clients or other important items on your ever-growing to-do list? Maybe it’s time to consider hiring a real estate virtual assistant.<\/p>\n<p>Most successful business executives, CEOs, and industry leaders get plenty of help. They have advertising agencies to handle ads, marketing companies to promote their services, and administrative assistants to handle the details.<br \/>\nBut interestingly, real estate agents are notorious for being the opposite. They’re often reluctant to delegate any tasks and seem to prefer to wear all of the hats in their business.<br \/>\nToo many agents wait to get help until they’re completely overwhelmed because they can no longer juggle all of the demands.<\/p>\n<p>The help you get from an assistant may be more than a mere mental health benefit (as good as that is). It can lead to greater levels of productivity overall.<\/p>\n<p>Mark Young (Stouffer Realty, Northeast Ohio), put it this way: “If you are truly running your business like a real business and you are still overwhelmed, you’re leaving too much money on the table by not adding to your team.”<\/p>\n<p>He’s speaking from personal experience. Young’s business saw a rise in income that he says is positively correlated to the number of staff members he adds to his team.<\/p>\n<p>Maybe for you, getting the help you need looks like hiring a virtual assistant. If so, here’s everything you need to know.<\/p>\n<p style=\"font-size: 24px; line-height: 1.8; font-weight: 800;\">If you’re too busy, you need help.<\/p>\n<p>For top-producing agents, that’s not a new concept.<\/p>\n<p>Las Vegas’s Jared Jones (Horizon Realty Group), who has been at the top of the list of the country’s most productive agents, credits his ability to handle the volume he does to hiring staff members.<\/p>\n<p>Jones says that too many agents have a “lone ranger” attitude, which prevents them from joining the ranks of the top producers.<\/p>\n<p>“If I had to touch every single piece in the system itself,” he said for the <a href=\"https:\/\/www.reviewjournal.com\/business\/housing\/two-valley-real-estate-brokers-land-on-top-10-u-s-sales-list\/\">Las Vegas Review Journal<\/a>, “I would never be able to produce multiple amounts of volume. You have to be efficient, and you have to leverage the system (by hiring).”<\/p>\n<p>Adding to your team can lead to higher volume. Noted. But does that mean you should get help from a virtual or on-site assistant?<\/p>\n<h2 class=\"BlogH2\">Advantages of Hiring a Real Estate Virtual Assistant<\/h2>\n<h3 class=\"BlogH3\">They Can Simultaneously Help You Save Money and Generate Growth<\/h3>\n<p>One of the biggest advantages of hiring a freelance real estate virtual assistant over hiring a full-time, in-house employee is the lower cost.<\/p>\n<p>Virtual real estate assistant pricing varies, but to give you an idea of what to expect, <a href=\"https:\/\/www.indeed.com\/career\/virtual-assistant\/salaries\/Bellevue--WA?from=top_sb\">the median pay for a virtual assistant<\/a> in the U.S. hovers around $20 per hour. The <a href=\"https:\/\/www.salary.com\/research\/salary\/posting\/licensed-real-estate-assistant-salary\/bellevue-wa\">median salary for an on-site licensed real estate assistant<\/a>, however, is around $49,000 per year (or about $24 per hour).<\/p>\n<p>That’s a significant difference, especially because going the freelancer route means you avoid having to provide all of the costly benefits that a full-time, on-site staff member would require, including Social Security, medicare, health insurance, retirement, and the rest.<\/p>\n<p>“You’re not paying for my taxes and my insurance, for one thing,” says Kim Hughes, who owns her own real estate virtual assistance firm (<a href=\"https:\/\/www.kimhughes.com\/\">Kim Hughes &amp; Company<\/a>). Plus, you won’t have the costs (and headaches) associated with unemployment insurance when it comes time to part ways.<\/p>\n<p>So meanwhile, as you’re saving money, your virtual assistant is enabling you to drive growth and generate a higher income, as both Young and Jones alluded to earlier.<\/p>\n<p>Ryan Schwartz agrees. Looking for ways to build his business, Schwartz (White Sands Realty, Naples, FL) hired a virtual assistant to make website lead callbacks and to manage his database. He quickly saw the advantages.<\/p>\n<p>Delegating some of the more time-consuming tasks of his business freed him up to build his pipeline and drum up new business. In his words: “A virtual assistant enhances my efficiency and effectiveness.”<\/p>\n<p>Combine the help you get from a real estate virtual assistant with a <a href=\"https:\/\/www.marketleader.com\/products\/professional-for-agents\/\">customizable website, robust CRM, and the best marketing automation tools<\/a>, and you’ll be virtually unstoppable (pun intended).<\/p>\n<h3 class=\"BlogH3\">A Real Estate Virtual Assistant Can Also Save You Time<\/h3>\n<p>Setting the monetary cost aside, there’s also a time cost associated with training and managing an on-site employee that you don’t have to spend on a virtual assistant in real estate.<\/p>\n<p>Most of the larger, established real estate virtual assistant firms provide fully trained staff members. So, rather than paying a staff member through the learning curve and taking time out of your schedule to train them, firms and freelancers are ready to roll right into your daily schedule.<\/p>\n<h3 class=\"BlogH3\">6 Common Tasks You Can Delegate to a Virtual Assistant in Real Estate<\/h3>\n<p>Think about how many tasks you currently perform that take you away from focusing your time and energy on more profitable activities.<\/p>\n<p>Getting them off your plate by delegating them to a virtual assistant can move you to the next level in your business and produce a sweet return on investment.<\/p>\n<p>For example, here are some of the kinds of tasks a real estate virtual assistant can take on for you:<\/p>\n<ol>\n<li>Administrative tasks, such as scheduling and transaction coordination<\/li>\n<li>Clear the less-complicated emails out of your inbox<\/li>\n<li>Design and manage your website<\/li>\n<li>Manage your social media accounts<\/li>\n<li>Write the copy for your emails, blog content, and marketing materials<\/li>\n<li>Manage your <a href=\"https:\/\/www.marketleader.com\/solutions\/crm\/\">CRM<\/a><\/li>\n<\/ol>\n<h2 class=\"BlogH2\">What If I Don’t Make Enough Money to Hire a Virtual Assistant?<\/h2>\n<p>Popular real estate coaches used to tell agents that they needed to reach a certain income threshold and remain there consistently before even thinking about hiring an assistant.<\/p>\n<p>But there’s a major flaw in that advice. It fails to take into account that all of the time agents spend doing the work an assistant could have been handling was time spent away from performing the very activities that would allow them to consistently reach the income threshold.<\/p>\n<p>Thankfully, the popularity of that advice has waned. Virtual staffing companies and virtual freelancers allow agents the flexibility to schedule as few or as many hours of assistance per week as needed.<\/p>\n<p>And that means you as the agent have to pay an assistant on a contract or per-task basis, rather than handing out paychecks on a regular, continuous schedule.<\/p>\n<p>That’s especially valuable for agents who are just starting out. They can get help when they need it and save money when they don’t.<\/p>\n<p>Rob Chevez (Keller Williams agent from Reston, VA) realized he needed administrative help. But he wasn’t sure if he could afford a full-time employee.<\/p>\n<p>“I needed simple things done,” he said, “like scanning business cards and putting that information into my database. I just needed someone maybe 20 hours a week, in a role that wasn’t client-facing. So I hired a virtual assistant to do that for me.”<\/p>\n<p>According to Chevez, that’s how many agents take their first baby step into the world of virtual workers. And like him, they quickly learn that production increases as they focus on their most important tasks.<\/p>\n<p>“I started getting a lot busier,” he said, which eventually led him to take the bigger step of hiring a full-time assistant – who, like his first one, works virtually from home.<\/p>\n<p>Feeling a little unsure about whether hiring a virtual assistant is the best next step for your business? Maybe start with an intern. <a href=\"https:\/\/www.marketleader.com\/blog\/real-estate-interns\/\">Here’s everything you need to know about real estate internships.<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Are administrative tasks stealing your time away from clients or other important items on your ever-growing to-do list? Maybe it’s time to consider hiring a real estate virtual assistant. Most successful business executives, CEOs, and industry leaders get plenty of help. They have advertising agencies to handle ads, marketing companies to promote their services, and [&hellip;]<\/p>\n","protected":false},"author":33,"featured_media":61686,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"","_et_pb_old_content":"","_et_gb_content_width":""},"categories":[97],"tags":[152,153,154,155,156,157,158,159,160,161,162],"_links":{"self":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/9841"}],"collection":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/users\/33"}],"replies":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/comments?post=9841"}],"version-history":[{"count":0,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/posts\/9841\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media\/61686"}],"wp:attachment":[{"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/media?parent=9841"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/categories?post=9841"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.marketleader.com\/wp-json\/wp\/v2\/tags?post=9841"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}